{
  "type": "application",
  "subtype": "mathml-content+xml",
  "full": "application/mathml-content+xml",
  "extensions": [],
  "sources": [
    {
      "source": "mime-db",
      "url": "https://www.npmjs.com/package/mime-db"
    },
    {
      "source": "iana",
      "url": "https://www.iana.org/assignments/media-types/media-types.xhtml"
    },
    {
      "source": "apache",
      "url": "https://svn.apache.org/repos/asf/httpd/httpd/trunk/docs/conf/mime.types"
    },
    {
      "source": "nginx",
      "url": "https://hg.nginx.org/nginx/raw-file/default/conf/mime.types"
    },
    {
      "source": "mime-db",
      "url": "https://www.npmjs.com/package/mime-db"
    }
  ],
  "iana": {
    "template_url": "https://www.iana.org/assignments/media-types/application/mathml-content+xml",
    "template_text": "Type name\napplication\n\nSubtype name\nmathml-content+xml\n\nRequired parameters\nNone\n\nOptional parameters\nSame as charset parameter of application/xml as specified in [RFC3023]\n\nEncoding considerations\nThe encoding considerations of application/xml as specified in [RFC3023] apply.\n\nSecurity considerations\nAs with other XML types and as noted in [RFC3023] section 10, repeated expansion of maliciously constructed XML entities can be used to consume large amounts of memory, which may cause XML processors in constrained environments to fail.\n\nSeveral MathML elements may cause arbitrary URIs to be referenced. In this case, the security issues of [RFC3986], section 7, should be considered.\n\nIn common with HTML, MathML documents may reference external media such as images, style sheets, and scripting languages. Scripting languages are executable content. In this case, the security considerations in the Media Type registrations for those formats shall apply. Similarly, MathML annotation elements may contain content intended for execution or processing. In the case where the processor recognizes and processes the additional content, or where further processing of that content is dispatched to other processors, additional security issues potentially arise. Since the normative semantics of this specification do not require processing of annotation elements, such issues fall outside the domain of this registration document.\n\nMathML may be used to describe mathematical expressions intended for evaluation in computing systems. Because of the nature of mathematics, a seemingly innocuous expression may lead to a computation which does not terminate or is impractically large. This introduces the risk that computational processors in constrained environments may fail.\n\nIn addition, because of the extensibility features for MathML and of XML in general, it is possible that \"application/mathml-content+xml\" may describe content that has security implications beyond those described here. However, if the processor follows only the normative semantics of this specification, this content will be outside the MathML namespace and shall be ignored.\n\nInteroperability considerations\nThis specification describes processing semantics that dictate behavior that must be followed when dealing with, among other things, unrecognized elements and attributes, both in the MathML namespace and in other namespaces.\n\nBecause MathML is extensible, conformant \"application/mathml-content+xml\" processors must expect that content received is well-formed XML, but it cannot be guaranteed that the content is valid to a particular DTD or Schema or that the processor will recognize all of the elements and attributes in the document.\n\nMathML instances do not contain version numbers, so processors and producers must follow the normative backward compatibility behavior described in this specification.\n\nIn computational contexts, the result of evaluating a MathML expression is system-specific, and is not guaranteed to be interoperable between systems.\n\nThis specification does not record a file extension for the media type \"application/mathml-content+xml\" because we expect tools processing files with MathML inside to have sufficient information with the generic media-type (application/mathml+xml) while other content negotiation forms will take advantage of specific media-types.\n\nPublished specification\nThis media type registration is extracted from Appendix B of the Mathematical Markup Language (MathML) Version 3. specification.\n\nApplications that use this media type\nFormula editors, search robots, computing systems.\n\nAdditional information\n\nMagic number(s): see [RFC3023]\n\nFile extension(s):\nNone\n\nWindows Clipboard Name:\nMathML Content\n\nMacintosh file type code(s)\nMMLc\nMacintosh Universal Type Identifier code\npublic.mathml.content conforming to public.mathml (described above) conforming to public.xml\n\nPerson & email address to contact for further information\nPaul Libbrecht (member-math&w3.org). See the W3C Math Working Group \nhome page for more information.\n\nIntended usage\nCOMMON\n\nRestrictions on usage\nNone\n\nAuthor and Change controller\nThe MathML specification is the product of the World Wide Web Consortium's Math Working Group. The W3C has change control over this specification."
  },
  "references": []
}