{
  "type": "application",
  "subtype": "postscript",
  "full": "application/postscript",
  "extensions": [
    "ai",
    "eps",
    "ps"
  ],
  "sources": [
    {
      "source": "mime-db",
      "url": "https://www.npmjs.com/package/mime-db"
    },
    {
      "source": "iana",
      "url": "https://www.iana.org/assignments/media-types/media-types.xhtml"
    },
    {
      "source": "apache",
      "url": "https://svn.apache.org/repos/asf/httpd/httpd/trunk/docs/conf/mime.types"
    },
    {
      "source": "nginx",
      "url": "https://hg.nginx.org/nginx/raw-file/default/conf/mime.types"
    },
    {
      "source": "mime-db",
      "url": "https://www.npmjs.com/package/mime-db"
    }
  ],
  "iana": {
    "template_url": "https://www.iana.org/assignments/media-types/application/postscript",
    "template_text": "(RFC 2045 and 2046 published November 1996, subtype last updated April November 1996)\n\nA media type of \"application/postscript\" indicates a PostScript\nprogram.  Currently two variants of the PostScript language are\nallowed; the original level 1 variant is described in [POSTSCRIPT]\nand the more recent level 2 variant is described in [POSTSCRIPT2].\n\nPostScript is a registered trademark of Adobe Systems, Inc.  Use of\nthe MIME media type \"application/postscript\" implies recognition of\nthat trademark and all the rights it entails.\n\nThe PostScript language definition provides facilities for internal\nlabelling of the specific language features a given program uses.\nThis labelling, called the PostScript document structuring\nconventions, or DSC, is very general and provides substantially more\ninformation than just the language level.  The use of document\nstructuring conventions, while not required, is strongly recommended\nas an aid to interoperability.  Documents which lack proper\nstructuring conventions cannot be tested to see whether or not they\nwill work in a given environment.  As such, some systems may assume\nthe worst and refuse to process unstructured documents.\n\nThe execution of general-purpose PostScript interpreters entails\nserious security risks, and implementors are discouraged from simply\nsending PostScript bodies to \"off- the-shelf\" interpreters.  While it\nis usually safe to send PostScript to a printer, where the potential\nfor harm is greatly constrained by typical printer environments,\nimplementors should consider all of the following before they add\ninteractive display of PostScript bodies to their MIME readers.\n\nThe remainder of this section outlines some, though probably not all,\nof the possible problems with the transport of PostScript entities.\n\n (1)   Dangerous operations in the PostScript language\n       include, but may not be limited to, the PostScript\n       operators \"deletefile\", \"renamefile\", \"filenameforall\",\n       and \"file\".  \"File\" is only dangerous when applied to\n       something other than standard input or output.\n       Implementations may also define additional nonstandard\n       file operators; these may also pose a threat to\n       security. \"Filenameforall\", the wildcard file search\n       operator, may appear at first glance to be harmless.\n       Note, however, that this operator has the potential to\n       reveal information about what files the recipient has\n       access to, and this information may itself be\n       sensitive.  Message senders should avoid the use of\n       potentially dangerous file operators, since these\n       operators are quite likely to be unavailable in secure\n       PostScript implementations.  Message receiving and\n       displaying software should either completely disable\n       all potentially dangerous file operators or take\n       special care not to delegate any special authority to\n       their operation.  These operators should be viewed as\n       being done by an outside agency when interpreting\n       PostScript documents.  Such disabling and/or checking\n       should be done completely outside of the reach of the\n       PostScript language itself; care should be taken to\n       insure that no method exists for re-enabling full-\n       function versions of these operators.\n\n (2)   The PostScript language provides facilities for exiting\n       the normal interpreter, or server, loop.  Changes made\n       in this \"outer\" environment are customarily retained\n       across documents, and may in some cases be retained\n       semipermanently in nonvolatile memory.  The operators\n       associated with exiting the interpreter loop have the\n       potential to interfere with subsequent document\n       processing.  As such, their unrestrained use\n       constitutes a threat of service denial.  PostScript\n       operators that exit the interpreter loop include, but\n       may not be limited to, the exitserver and startjob\n       operators.  Message sending software should not\n       generate PostScript that depends on exiting the\n       interpreter loop to operate, since the ability to exit\n       will probably be unavailable in secure PostScript\n       implementations.  Message receiving and displaying\n       software should completely disable the ability to make\n       retained changes to the PostScript environment by\n       eliminating or disabling the \"startjob\" and\n       \"exitserver\" operations.  If these operations cannot be\n       eliminated or completely disabled the password\n       associated with them should at least be set to a hard-\n       to-guess value.\n\n (3)   PostScript provides operators for setting system-wide\n       and device-specific parameters.  These parameter\n       settings may be retained across jobs and may\n       potentially pose a threat to the correct operation of\n       the interpreter.  The PostScript operators that set\n       system and device parameters include, but may not be\n       limited to, the \"setsystemparams\" and \"setdevparams\"\n       operators.  Message sending software should not\n       generate PostScript that depends on the setting of\n       system or device parameters to operate correctly.  The\n       ability to set these parameters will probably be\n       unavailable in secure PostScript implementations.\n       Message receiving and displaying software should\n       disable the ability to change system and device\n       parameters.  If these operators cannot be completely\n       disabled the password associated with them should at\n       least be set to a hard-to-guess value.\n\n (4)   Some PostScript implementations provide nonstandard\n       facilities for the direct loading and execution of\n       machine code.  Such facilities are quite obviously open\n       to substantial abuse.  Message sending software should\n       not make use of such features.  Besides being totally\n       hardware-specific, they are also likely to be\n       unavailable in secure implementations of PostScript.\n       Message receiving and displaying software should not\n       allow such operators to be used if they exist.\n\n (5)   PostScript is an extensible language, and many, if not\n       most, implementations of it provide a number of their\n       own extensions.  This document does not deal with such\n       extensions explicitly since they constitute an unknown\n       factor.  Message sending software should not make use\n       of nonstandard extensions; they are likely to be\n       missing from some implementations.  Message receiving\n       and displaying software should make sure that any\n       nonstandard PostScript operators are secure and don't\n       present any kind of threat.\n\n (6)   It is possible to write PostScript that consumes huge\n       amounts of various system resources.  It is also\n       possible to write PostScript programs that loop\n       indefinitely.  Both types of programs have the\n       potential to cause damage if sent to unsuspecting\n       recipients.  Message-sending software should avoid the\n       construction and dissemination of such programs, which\n       is antisocial.  Message receiving and displaying\n       software should provide appropriate mechanisms to abort\n       processing after a reasonable amount of time has\n       elapsed. In addition, PostScript interpreters should be\n       limited to the consumption of only a reasonable amount\n       of any given system resource.\n\n (7)   It is possible to include raw binary information inside\n       PostScript in various forms.  This is not recommended\n       for use in Internet mail, both because it is not\n       supported by all PostScript interpreters and because it\n       significantly complicates the use of a MIME Content-\n       Transfer-Encoding.  (Without such binary, PostScript\n       may typically be viewed as line-oriented data.  The\n       treatment of CRLF sequences becomes extremely\n       problematic if binary and line-oriented data are mixed\n       in a single Postscript data stream.)\n\n (8)   Finally, bugs may exist in some PostScript interpreters\n       which could possibly be exploited to gain unauthorized\n       access to a recipient's system.  Apart from noting this\n       possibility, there is no specific action to take to\n       prevent this, apart from the timely correction of such\n       bugs if any are found."
  },
  "references": []
}