{
  "type": "application",
  "subtype": "vnd.otps.ct-kip+xml",
  "full": "application/vnd.otps.ct-kip+xml",
  "extensions": [],
  "sources": [
    {
      "source": "mime-db",
      "url": "https://www.npmjs.com/package/mime-db"
    },
    {
      "source": "iana",
      "url": "https://www.iana.org/assignments/media-types/media-types.xhtml"
    },
    {
      "source": "apache",
      "url": "https://svn.apache.org/repos/asf/httpd/httpd/trunk/docs/conf/mime.types"
    },
    {
      "source": "nginx",
      "url": "https://hg.nginx.org/nginx/raw-file/default/conf/mime.types"
    },
    {
      "source": "mime-db",
      "url": "https://www.npmjs.com/package/mime-db"
    }
  ],
  "iana": {
    "template_url": "https://www.iana.org/assignments/media-types/application/vnd.otps.ct-kip+xml",
    "template_text": "(Last updated 23 March 2006)\r\n\r\nName : Magnus Nyström\r\n\r\nEmail : magnus&rsasecurity.com\r\n\r\nMIME media type name : Application\r\n\r\nMIME subtype name : Vendor Tree - vnd.otps.ct-kip+xml\r\n\r\nRequired parameters : None\r\n\r\nOptional parameters :\r\nSame as charset parameter of application/xml as defined by RFC 3023.\r\n\r\nEncoding considerations : 8bit\r\nThis media type may require encoding on transports not capable of\r\nhandling 8 bit text.\r\n\r\nSecurity considerations :\r\nCT-KIP is a protocol for generation (or distribution) of shared \r\ncryptographic keys. It does not carry executable content. The protocol \r\ncontains features that protects the privacy (and integrity) of generated \r\nkey material but does not protect certain other information, such as \r\nmeta-data about keys. When privacy, authenticity, or integrity of such \r\ninformation is required CT-KIP should be run over a transport offering \r\nthese services such as TLS.\r\n\r\nFor reference here is the Security Considerations section from the CT-KIP \r\nspecification (Copyright 2005 RSA Security Inc.):\r\n\r\n5. Security considerations\r\n\r\n5.1 General\r\n\r\nCT-KIP is designed to protect generated key material from exposure. No \r\nother entities than the CT-KIP server and the cryptographic token will \r\nhave access to a generated KTOKEN if the cryptographic algorithms used are \r\nof sufficient strength and, on the CT-KIP client side, generation and \r\nencryption of RC and generation of KTOKEN takes place as specified and in \r\nthe token. This applies even if malicious software is present in the \r\nCT-KIP client. As discussed in the following, CT-KIP does however not \r\nprotect against certain other threats resulting from man-in-the-middle \r\nattacks and other forms of attacks. CT-KIP should therefore be run over a \r\ntransport providing privacy and integrity, such as HTTP over TLS with a \r\nsuitable ciphersuite, when such threats are a concern.\r\n\r\n5.2 Active attacks\r\n\r\n5.2.1 Introduction\r\n\r\nAn active attacker may attempt to modify, delete, insert, replay or \r\nreorder messages for a variety of purposes including service denial and \r\ncompromise of generated key material. In the following these attack \r\nscenarios are analyzed.\r\n\r\n5.2.2 Message modifications\r\n\r\nModifications to a <CT-KIPTrigger> message will either cause \r\ndenial-of-service (modifications of any of the identifiers or the nonce) \r\nor the CT-KIP client to contact the wrong CT-KIP server. The latter is in \r\neffect a man-in-the-middle attack and is discussed further in Section \r\n5.2.7.\r\n\r\nAn attacker may modify a <ClientHello> message. This means that the \r\nattacker could indicate a different key or token than the one intended by \r\nthe CT-KIP client, and could also suggest other cryptographic algorithms \r\nthan the ones preferred by the CT-KIP client, e.g. cryptographically \r\nweaker ones. The attacker could also suggest earlier versions of the \r\nCT-KIP protocol, in case these versions have been shown to have \r\nvulnerabilities. These modifications could lead to an attacker succeeding \r\nin initializing or modifying another token than the one intended (i.e. the \r\nserver assigning the generated key to the wrong token), or gaining access \r\nto a generated key through the use of weak cryptographic algorithms or \r\nprotocol versions. CT-KIP implementations may protect against the latter \r\nby having strict policies about what versions and algorithms they support \r\nand accept. The former threat (assignment of a generated key to the wrong \r\ntoken) is not possible when the shared-key variant of CT-KIP is employed \r\n(assuming existing shared keys are unique per token) but is possible in \r\nthe public-key variant. CT-KIP servers must therefore not accept \r\nunilaterally provided token identifiers in the public-key variant. This is \r\nalso indicated in the protocol description. In the shared-key variant \r\nhowever, an attacker may be able to provide the wrong identifier (possibly \r\nalso leading to the incorrect user being associated with the generated \r\nkey) if the attacker has real-time access to the token with the identified \r\nkey. In other words, the generated key is associated with the correct \r\ntoken but the token is associated with the incorrect user. See further \r\nSection 5.5 for a discussion of this threat and possible countermeasures.\r\nAn attacker may also modify a <ServerHello> message. This means that the \r\nattacker could indicate different key types, algorithms, or protocol \r\nversions than the legitimate server would, e.g. cryptographically weaker \r\nones. The attacker could also provide a different nonce than the one sent \r\nby the legitimate server. Clients will protect against the former through \r\nstrict adherence to policies regarding permissible algorithms and protocol \r\nversions. The latter (wrong nonce) will not constitute a security problem \r\nas a generated key won't match the key generated on the legitimate server. \r\nAlso, whenever the CT-KIP run would result in the replacement of an \r\nexisting key, the <Mac> element protects against modifications of RS.\r\nModifications of <ClientNonce> messages are also possible. If an attacker \r\nmodifies the SessionID attribute then in effect a switch to another \r\nsession will occur at the server, assuming the new SessionID is valid at \r\nthat time on the server. It still will not allow the attacker to learn a \r\ngenerated KTOKEN since RC has been wrapped for the legitimate server. \r\nModifications of the <EncryptedNonce> element, e.g. replacing it with a \r\nvalue for which the attacker knows an underlying R'C, will not result in \r\nthe client changing its pre-CT-KIP state, since the server will be unable \r\nto provide a valid MAC in its final message to the client. The server may \r\nhowever end up storing K'TOKEN rather than KTOKEN. If the token has been \r\nassociated with a particular user, then this could constitute a seurity \r\nproblem. For a further discussion about this threat, and a possible \r\ncountermeasure, see Section 5.5 below. Note that use of SSL or TLS does \r\nnot protect against this attack if the attacker has access to the CT-KIP \r\nclient (e.g. through malicious software, \"trojans\").\r\nFinally, attackers may also modify the <ServerFinished> message. Replacing \r\nthe <Mac> element will only result in denial-of-service. Replacement of \r\nany other element may cause the CT-KIP client to associate, e.g., the \r\nwrong service with the generated key. CT-KIP should be run over a \r\ntransport providing privacy and integrity when this is a concern.\r\n\r\n5.2.3 Message deletion\r\n\r\nMessage deletion will not cause any other harm than denial-of-service, \r\nsince a token shall not change its state (i.e. \"commit\" to a generated \r\nkey) until it receives the final message from the CT-KIP server and \r\nsuccessfully has processed that message, including validation of its MAC. \r\nA deleted <ServerFinished> message will not cause the server to end up in \r\nan inconsistent state vis-à-vis the token if the server implements the \r\nsuggestions in Section 5.5.\r\n\r\n5.2.4 Message insertion\r\n\r\nAn active attacker may initiate a CT-KIP run at any time, and suggest any \r\ntoken identifier. CT-KIP server implementations may receive some \r\nprotection against inadvertently initializing a token or inadvertently \r\nreplacing an existing key or assigning a key to a token by initializing \r\nthe CT-KIP run by use of the <CT-KIPTrigger>. The <TriggerNonce> element \r\nallows the server to associate a CT-KIP protocol run with, e.g., an \r\nearlier user-authenticated session. The security of this method therefore \r\ndepends on the ability to protect the <TriggerNonce> element in the CT-KIP \r\ninitialization message. If an eavesdropper is able to capture this \r\nmessage he may race the legitimate user for a key initialization. CT-KIP \r\nover a transport providing privacy and integrity, coupled with the \r\nrecommendations in Section 5.5 is recommended when this is a concern.\r\nInsertion of other messages into an existing protocol run is seen as \r\nequivalent to modification of legitimately sent messages.\r\n\r\n5.2.5 Message replay\r\n\r\nAttempts to replay a previously recorded CT-KIP message will be detected \r\nas the use of nonces ensures that both parties are live.\r\n\r\n5.2.6 Message reordering\r\n\r\nAn attacker may attempt to re-order messages but this will be detected as \r\neach message is of a unique type.\r\n\r\n5.2.7 Man in the middle\r\n\r\nIn addition to other active attacks, an attacker posing as a man in the \r\nmiddle may be able to provide his own public key to the CT-KIP client. \r\nThis threat and countermeasures to it are discussed in Section 3.3. An \r\nattacker posing as a man-in-the-middle may also be acting as a proxy and \r\nhence not interfere with CT-KIP runs but still learn valuable information, \r\nsee Section 5.3.\r\n\r\n5.3 Passive attacks\r\n\r\nPassive attackers may eavesdrop on CT-KIP runs to learn information that \r\nlater on may be used to impersonate users, mount active attacks, etc.\r\nIf CT-KIP is not run over a transport providing privacy, a passive \r\nattacker may learn:\r\n- What tokens a particular user is in possession of;\r\n- The identifiers of keys on those tokens and other attributes \r\npertaining to those keys, e.g. the lifetime of the keys; and\r\n- CT-KIP versions and cryptographic algorithms supported by a \r\nparticular CT-KIP client or server.\r\nWhenever the above is a concern, CT-KIP should be run over a transport \r\nproviding privacy. If man-in-the-middle attacks for the purposes described \r\nabove are a concern, the transport should also offer server-side \r\nauthentication.\r\n\r\n5.4 Cryptographic attacks\r\n\r\nAn attacker with unlimited access to an initialized token may use the \r\ntoken as an \"oracle\" to pre-compute values that later on may be used to \r\nimpersonate the CT-KIP server. Sections 3.6 and 3.8 contain discussions of \r\nthis threat and steps recommended to protect against it.\r\n\r\n5.5 Attacks on the interaction between CT-KIP and user authentication\r\n\r\nIf keys generated in CT-KIP will be associated with a particular user at \r\nthe CT-KIP server (or a server trusted by, and communicating with the \r\nCT-KIP server), then in order to protect against threats where an attacker \r\nreplaces a client-provided encrypted RC with his own R'C (regardless of \r\nwhether the public-key variant or the shared-secret variant of CT-KIP is \r\nemployed to encrypt the client nonce) the server should not commit to \r\nassociate a generated KTOKEN with the given token (user) until the user \r\nsimultaneously has proven both possession of a token containing KTOKEN and \r\nsome out-of-band provided authenticating information (e.g. a temporary \r\npassword). For example, if the token is a one-time password token, the \r\nuser could be required to authenticate with both a one-time password \r\ngenerated by the token and an out-of-band provided temporary PIN in order \r\nto have the server \"commit\" to the generated token value for the given \r\nuser. Preferably, the user should perform this operation from another host \r\nthan the one used to initialize the token, in order to minimize the risk \r\nof malicious software on the client interfering with the process.\r\nAnother threat arises when an attacker is able to trick a user to \r\nauthenticate to the attacker rather than to the legitimate service before \r\nthe CT-KIP protocol run. If successful, the attacker will then be able to \r\nimpersonate the user towards the legitimate service, and subsequently \r\nreceive a valid CT-KIP trigger. If the public-key variant of CT-KIP is \r\nused, this may result in the attacker being able to (after a successful \r\nCT-KIP protocol run) impersonate the user. Ordinary precautions must \r\ntherefore be in place to ensure that users authenticate only to legitimate \r\nservices.\r\n\r\nInteroperability considerations : \r\nSee the CT-KIP specification at http://www.rsasecurity.com/rsalabs/otps/\r\n\r\nPublished specification :\r\nSee the CT-KIP specification at http://www.rsasecurity.com/rsalabs/otps/\r\n\r\nApplications which use this media :\r\nApplications that use the CT-KIP protocol to initialize\r\ncryptographic tokens.\r\n\r\nAdditional information :\r\n\r\n1. Magic number(s) : N/A\r\n2. File extension(s) : N/A\r\n3. Macintosh file type code : N/A\r\n4. Object Identifiers: N/A\r\n\r\nThis is the MIME type for use with the CT-KIP protocol defined\r\nin the CT-KIP OTPS specification (see\r\nhttp://www.rsasecurity.com/rsalabs/otps). The use of \".otps\"\r\nsignals that the MIME type is associated with the OTPS suite\r\nof documents, the \".ct-kip\" part that it is the CT-KIP\r\nspecification, and the \"+xml\" part is in conformance with RFC 3023.\r\n\r\nPerson to contact for further information :\r\n\r\n1. Name : Magnus Nyström\r\n2. Email : magnus&rsasecurity.com\r\n\r\nIntended usage : Common\r\nFor transport of PDUs in the CT-KIP protocol (see\r\nhttp://www.rsasecurity.com/rsalabs/otps/)\r\n\r\nAuthor/Change controller : Magnus Nyström, RSA Security Inc.\r\n\r\n(File created 23 March 2006)"
  },
  "references": []
}