{
  "type": "application",
  "subtype": "vnd.wolfram.mathematica",
  "full": "application/vnd.wolfram.mathematica",
  "extensions": [],
  "sources": [
    {
      "source": "mime-db",
      "url": "https://www.npmjs.com/package/mime-db"
    },
    {
      "source": "iana",
      "url": "https://www.iana.org/assignments/media-types/media-types.xhtml"
    },
    {
      "source": "apache",
      "url": "https://svn.apache.org/repos/asf/httpd/httpd/trunk/docs/conf/mime.types"
    },
    {
      "source": "nginx",
      "url": "https://hg.nginx.org/nginx/raw-file/default/conf/mime.types"
    },
    {
      "source": "mime-db",
      "url": "https://www.npmjs.com/package/mime-db"
    }
  ],
  "iana": {
    "template_url": "https://www.iana.org/assignments/media-types/application/vnd.wolfram.mathematica",
    "template_text": "(last updated 2009-10-13)\n\nName : John Fultz\n\nEmail : jfultz&wolfram.com\n\nMIME media type name : Application\n\nMIME subtype name : Vendor Tree - vnd.wolfram.mathematica\n\nRequired parameters : None\n\nOptional parameters :\nOne optional parameter, version, which will take a value of two integers (a\nmajor version number and a minor version number) separated by a decimal point.\nE.g., <major>.<minor>\n\nEncoding considerations : 8bit\nThis media type may require encoding on transports not capable of handling 8 bit\ntext.\n\nSecurity considerations :\nMathematica notebooks contain code which is executable in the Mathematica\nenvironment. This code is capable of making changes to the file system,\nlaunching other processes, and doing pretty much anything that might be possible\nwithin your user account.\n\nThis code may be present in four forms:\n\n1) It may be explicitly shown inside the document. In order for it\nto be executed, the user would have to explicitly cause an evaluation\nof the code to happen.\n\n2) It may be hidden behind a mechanism which triggers altering\ninterpretations to the visible input, or which adds code to\nbe run before and after a particular evaluation happens. This\ncode requires the user to explicitly evaluate it in order to\nbe executed.\n\n3) The file may contain user interfaces including buttons which,\nwhen pressed, will execute arbitrary code.\n\n4) There may be code wrapped in the Mathematica Dynamic mechanism.\nThis code evaluates automatically as the objects it generates are\nscrolled onscreen, or in some cases, simply by the very opening of\nthe notebook. All non-trivial user interfaces are implemented in\nthis way.\n\nMathematica may notify the user when executing Dynamic\ncode. System settings can classify a directory as trusted\n(typically including the system directory and a few Mathematica-\nspecific configuration directories) or as untrusted (typically\nincluding temporary and cache directories). If a file is opened\nfrom a trusted location, no warning is ever issued. If a file\nis opened from an untrusted location, a warning is immediately\nissued before the first attempt to evaluate a Dynamic expression.\nIf a file is opened from a location which is neither trusted nor\nuntrusted, then a warning is issued if any attempt is made to\nuse any blacklisted functionality. All functionality which can\nultimately lead to accessing the file system or launching external\nprocesses is blacklisted.\n\nAlso, Wolfram Research has the capability to sign a notebook in such a way as to\ndeclare it secure, bypassing this mechanism. The signature is implemented using\na secure, public-key mechanism.\n\nFinally, notebooks with Dynamic code will not execute in the Mathematica Player\nproduct unless they have been signed using a similar mechanism to the one\ndescribed above.\n\nNotebook files represent their content in the standard Mathematica language\nsyntax. This format is a highly structured, plain-text tree representation, not\nunlike XML but with a different syntax. The syntax exposes the contents of the\nnotebook in a form which is readable and editable in a text editor by anybody\nwho understands the Mathematica language syntax and, to a lesser degree, by\nthose even without that knowledge. Notebooks can also be loaded as expressions\ninto the Mathematica computational engine, be examined or manipulated\nprogrammatically, and be written out again in some modified form. Any\nmodification to a notebook file will invalidate the signature mechanism\ndescribed above, but is otherwise allowed and even encouraged.\n\nIn principle, the format could be simply extended to support user-level\nencryption of notebooks to protect confidentiality, or signing directly by\nauthors to ensure provenance or integrity. Those features do not exist in the\nformat as of this writing, but they may be added in future releases.\n\n\nInteroperability considerations :\nThe Mathematica notebook can include any of the standard newline conventions and\ncan be transported via binary or textual means across platforms. There are a\nsmall number of data types (generally, difficult-to-create ones) which are not\nfaithfully rendered on all platforms, but the files will be read without error\nnonetheless. All of the major data types, including text, mathematical\ntypesetting, 2D and 3D graphics, user interfaces, and sound are represented in a\ncompletely platform-neutral manner.\n\nThe basic format is completely transportable from the current version\n(Mathematica 7) all the way back to Mathematica 3, spanning a range of 13+\nyears. Additions continue to be made to the format, but those additions do not\nprevent the file from being opened and perused in earlier versions, although\nsome features may not work. Older versions of the files always work in newer\nversions.\n\nAll products in the Mathematica family of products can read notebook files.\n\nPublished specification :\nNo formal specification exists. A general description of the format is available\nat http://www.wolfram.com/nb, and some more specific details are in the product\ndocumentation. The syntax is a subset of the Mathematica language syntax.\n\nApplications which use this media :\nMathematica, Mathematica Player, Mathematica Player Pro\n\nAdditional information :\n\n1. Magic number(s) : None\n2. File extension(s) : .nb\n3. Macintosh file type code : Creator: OMEG, Type: TEXT\n4. Object Identifiers: none\n\nConventionally, notebook files which have Dynamic code and have been signed to\nrun inside of Mathematica Player are .nbp files with the\napplication/vnd.wolfram.player type, while all other notebooks are .nb files\nwith the applications/vnd.wolfram.mathematica type. However, aside from the\nsignature, there is no practical difference between the two formats and the\nWolfram Research family of applications will treat them equivalently if\nrequested to open them.\n\nMathematica notebook files up to at least 2009 have been exclusively 7-bit text,\nwith Unicode values represented in a custom 7-bit encoding used in Wolfram\nResearch products. Future versions may additionally support UTF-8 encoding.\n\nPerson to contact for further information :\n\n1. Name : Wolfram Research, Inc.\n2. Email : info&wolfram.com\n\nIntended usage : Common\n\n\nAuthor/Change controller : Wolfram Research, Inc.\n\n100 Trade Center Drive\n\nChampaign, IL 61820-7237\n\n(file created 2009-10-13)"
  },
  "references": []
}