{
  "type": "application",
  "subtype": "vnd.dpgraph",
  "full": "application/vnd.dpgraph",
  "extensions": [
    "dpg"
  ],
  "sources": [
    {
      "source": "mime-db",
      "url": "https://www.npmjs.com/package/mime-db"
    },
    {
      "source": "iana",
      "url": "https://www.iana.org/assignments/media-types/media-types.xhtml"
    },
    {
      "source": "apache",
      "url": "https://svn.apache.org/repos/asf/httpd/httpd/trunk/docs/conf/mime.types"
    },
    {
      "source": "nginx",
      "url": "https://hg.nginx.org/nginx/raw-file/default/conf/mime.types"
    },
    {
      "source": "mime-db",
      "url": "https://www.npmjs.com/package/mime-db"
    }
  ],
  "iana": {
    "template_url": "https://www.iana.org/assignments/media-types/application/vnd.dpgraph",
    "template_text": "\n\nFrom: David Parker [davidparker&davidparker.com]\nSent: Monday, August 23, 1999 9:29 AM\nTo: iana&iana.org\nSubject: Request for MIME media type Application/Vendor Tree - vnd.dpgraph\n\nName : David Parker\n\nE-mail : davidparker&davidparker.com\n\nMIME media type name : Application\n\nMIME subtype name : Vendor Tree - vnd.dpgraph\n\nRequired parameters : none\n\nOptional parameters :\ncharset.  A DPGraph file is essentially a US-ASCII file containing\nprogramming language commands that generate and display mathematical\ngraphs.  However, user comments can be embedded in the file, and those\ncomments can be in any character set that is a superset of US-ASCII.\nHence, the optional charset parameter is for the convenience of anyone\nreading the comments, and is not used by the program that interprets\nthe mathematical graphing commands.\n\nEncoding considerations :\nDPGraph files should be base64-encoded for transmission where\ntransport is not 8-bit clean.  Other encodings run the danger of\nintroducing or removing CR's and LF's from files as they are\ntransferred between users on different operating systems, which may\ncause programs which interpret DPGraph files to miscount the number of\nlines in the files.\n\nSecurity considerations :\nSecurity considerations specific to DPGraph files:\n\n1) \"File system\" threats: none.  The programming language commands in\nDPGraph files contain no constructs that allow the program to\nread/write/create/erase or otherwise modify the user's file system.\nThe programming constructs in a DPGraph file are only used to generate\nand display graphs on the user's screen.\n\n2) \"Peripheral device\" threats: the programming language commands in\nDPGraph files contain no constructs for sending data to any peripheral\ndevices (printers and modems, for examples), except for the screen.\nWith regard to possible screen threats, see the \"Denial of screen\" and\n\"Spoofing\" threats below.\n\n3) \"System command\" threats: none.  The programming language commands\nin DPGraph files contain no constructs for passing commands to the\noperating system, or for calling any external program.\n\n4) \"Persistent state\" threats: none.  The programming language\ncommands in DPGraph files contain no constructs for changing the\npersistent state of the user's machine.\n\n5) \"Viral\" threats: none.  DPGraph files contain no binary data except\nin user comments; all of the programming language commands are in\nUS-ASCII and are processed by an interpreter.  Any binary characters\nembedded in a DPGraph file should simply be flagged as syntax errors\nif they occur in programming language commands, or should be discarded\nif they occur in user comments.\n\n6) \"Denial of memory\" threats: like any other program, an interpreter\nfor DPGraph files requires system memory in order to execute.  Using\nthe program language commands in a DPGraph file, it is possible to\nrequest graphs that would require a large, approaching infinite,\namount of memory.  There is no specific defense against this type of\nthreat.  Programs that interpret DPGraph files should ensure that\nthere is a way for the user to \"kill\" the interpreter if it seems to\nbe taking too much memory.\n\n7) \"Denial of cycles\" threats: using the programming language commands\nin a DPGraph file, it is possible to request graphs that would require\na large, approaching infinite, amount of time to generate.  There is\nno specific defense against this type of threat.  Programs that\ninterpret DPGraph files should ensure that there is a way for the user\nto \"kill\" the interpreter if a graph seems to be taking too long to\ndisplay.  They should also ensure that their execution priority is\nsuch that the cycles consumed don't hamper more critical operating\nsystem tasks such as page swapping.\n\n8) \"Denial of screen\" threats: since DPGraph files are meant to\ngenerate graphs to display on the user's screen, it is conceivable\nthat someone might think of a malicious reason to fill someone else's\nscreen with graphs.  To help guard against this possibility, an\ninterpreter for displaying DPGraph files should be easy for the user\nto exit.  The programming language commands in a DPGraph file have no\nconstructs for displaying arbitrary data at any position on the\nscreen; DPGraph files can only request the display of graphs inside\nthe boundaries of the interpreter's window.\n\n9) \"Spoofing\" threats: since DPGraph files are meant to generate\ngraphs to display on the user's screen, it is conceivable that someone\nmight create a graph with the malicious intent of confusing the user\nabout what they are seeing on the screen.  To help guard against this\npossibility, interpreters for DPGraph files should make sure to\ndisplay the graph inside a window that clearly identifies the\ninterpreter.\n\nHere are just two of the many general security threats involved in\ntransmitting files, and running programs to view them, which are not\nspecific to DPGraph files:\n\n1) \"Bug\" threats: A bug in a program that interprets DPGraph files\ncould conceivably be exploited as a security threat.  No such bugs are\nknown.  The best way to guard against this type of security problem\nwould be to fix the bug as quickly as possible, and make the fixed\ncopies available to all current users.\n\n2) \"File system\" threats: someone could transmit a huge DPGraph file\nwith the intention of occupying large amounts of somebody else's\nstorage.\n\nInteroperability considerations :\nNone.  The format of DPGraph files is independent of the user's\ncomputer or operating system.\n\nPublished specification :\nThe format of DPGraph files is described in the help information\nsupplied with DPGraph 2000, available from www.davidparker.com.\n\nApplications which use this media :\nTwo known applications which use DPGraph files are DPGraph 2000,\navailable from www.davidparker.com, and MathWare Cyclone, available\nfrom www.mathware.com.  Both were programmed by David Parker.\n\nAdditional information :\n\n1. Magic number(s) :\n2. File extension(s) : .dpg .mwc .dpgraph\n3. Macintosh file type code : \n4. Object identifiers(s) or OID(s) :\n\nPerson to contact for further information :\n\n1. Name : David Parker\n2. E-mail : davidparker&davidparker.com\n\nIntended usage : Common\n\nAuthor/Change controller :  David Parker, www.davidparker.com,\ndavidparker&davidparker.com\n\n\n"
  },
  "references": []
}