{
  "slug": "001",
  "extension": "001",
  "name": "Split Archive Part 1",
  "summary": "Learn about .001 files and view a list of programs that open them.",
  "developer": "N/A",
  "programs": {
    "windows": [
      {
        "name": "7-Zip",
        "url": "https://fileinfo.com/software/igor_pavlov/7-zip"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=2565&b=1"
      },
      {
        "name": "Smith Micro StuffIt Deluxe",
        "url": "https://fileinfo.com/software/smith_micro/stuffit_deluxe"
      },
      {
        "name": "The Unarchiver",
        "url": "https://fileinfo.com/software/dag_agren/the_unarchiver"
      },
      {
        "name": "Smith Micro StuffIt Deluxe Mac 16",
        "url": "https://fileinfo.com/software/smith_micro/stuffit_deluxe_mac"
      },
      {
        "name": "Incredible Bee Archiver",
        "url": "https://fileinfo.com/software/incredible_bee/archiver"
      },
      {
        "name": "Snes9x",
        "url": "https://fileinfo.com/software/snes9x/snes9x"
      }
    ]
  },
  "technical_info": {
    "content": [
      "When an archive has a large file size (e.g. because it contains hundreds or thousands of files), users may choose to split that archive into several smaller pieces, to make it easier to store and share with others. For example, a user who cannot email a large .ZIP archive may split that archive into several smaller files that they can then email.",
      "These split archives are often saved as a set of files that use the .001, .002, .003, etc. extensions. A split archive's 001 file typically contains identifying metadata that file archiving and joining utilities use to extract files from or reconstitute the split archive. However, to successfully extract files from or stitch together a split archive, you usually must possess all of that split archive's constituent files, not just its 001 file.",
      "NOTE: Some archive utilities produce split archive files that use compound file extensions. For example, 7-Zip's split archives use the .7Z.001, .7Z.002, and so on extensions."
    ]
  },
  "more_information": {
    "description": [
      "A 001 file is the first part of a split archive. Several file archiving and splitting utilities can create 001 files, while dividing large archives into smaller pieces. A split archive's other pieces are usually saved in similarly-named files that use the .002, .003, .004, and so on extensions. You must possess all of a split archive's pieces to access the file(s) it contains."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Several archive utilities allow you to extract files from 001 files, provided you possess all the other pieces of the split archive. For example, in 7-Zip (Windows), you can right-click a 001 file and select 7-Zip → Extract Here to extract the files a split archive contains. Before doing so, be sure that:",
      "You have every part of the split archive.",
      "You've stored all the parts in the same directory as the 001 file.",
      "If you're having trouble extracting files from a split archive, it's possible that your archive utility does not support that split archive's format, or that you do not have every piece of the split archive. In these cases, you may want to try using a different archive utility and/or verify that you have all the pieces of your split archive."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/001",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.543Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.543Z"
}