{
  "slug": "004",
  "extension": "004",
  "name": "Split Archive Part 4",
  "summary": "Learn about .004 files and view a list of programs that open them.",
  "developer": "N/A",
  "programs": {
    "windows": [
      {
        "name": "7-Zip",
        "url": "https://fileinfo.com/software/igor_pavlov/7-zip"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13302&b=1"
      },
      {
        "name": "Smith Micro StuffIt Deluxe",
        "url": "https://fileinfo.com/software/smith_micro/stuffit_deluxe"
      },
      {
        "name": "The Unarchiver",
        "url": "https://fileinfo.com/software/dag_agren/the_unarchiver"
      },
      {
        "name": "Smith Micro StuffIt Deluxe Mac 16",
        "url": "https://fileinfo.com/software/smith_micro/stuffit_deluxe_mac"
      },
      {
        "name": "Incredible Bee Archiver",
        "url": "https://fileinfo.com/software/incredible_bee/archiver"
      }
    ]
  },
  "technical_info": {
    "content": [
      "While compressing files and combining them into an archive reduces their total file size, some archives can still end up having quite large file sizes. This makes uploading and sharing these archives via the internet difficult. For that reason, some archiving and file-splitting utilities allow users to split large archives into several pieces, comprised of files with sequential extensions (.001, .002, .003, .004, and so on). Users can then upload and share these pieces individually, allowing them to circumvent online file size limits and make downloads easier on other users.",
      "If you have happened upon a 004 file, the split archive of which it is a part likely contains at least three other files: a 001, 002, and 003 file. The archive may also include additional, successive pieces, such as a 005, 006, etc. file. You'll want to make sure you have all pieces of the split archive and have stored them all in the same directory before attempting to open the split archive."
    ]
  },
  "more_information": {
    "description": [
      "A 004 file is the fourth part of a split archive, which may have been created by one of several file archiving or splitting utilities. It should be accompanied by a .001, .002, .003, and possibly other .### files, which contain the split archive's other parts. To access the files a 004 file contains, you'll likely need all the pieces of the split archive from which it came."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Several archive utilities allow you to extract files from split archives. For example, in 7-Zip (Windows), you can right-click the 001 file of a split archive and select 7-Zip → Extract Here to extract the files a split archive contains. Before doing so, make sure you possess all pieces of the split archive and that they are all stored in the same directory as the 001 file.",
      "Note that, because several programs can create split archives, some split archives are formatted differently than others. If you're having trouble opening a split archive in an archive utility, it might be because the program you're using does not support that split archive format."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/004",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.295Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.295Z",
  "category": "other",
  "related": [],
  "containers": []
}