{
  "slug": "aae",
  "extension": "aae",
  "name": "Sidecar Image Edit File",
  "summary": "Learn about .AAE files and view a list of programs that open them.",
  "developer": "Apple",
  "category": "web",
  "category_slug": "web",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10137&b=1"
      },
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple Photos",
        "url": "https://fileinfo.com/software/apple/photos"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      }
    ]
  },
  "technical_info": {
    "content": [
      "AAE files are created by the Photos app in iOS 8 and later and macOS 10.10 and later. The files save edits made in Photos, so users' original images are not overwritten when edited.",
      "When you open an edited .JPG file in Photos, the app references the JPG's associated AAE file and applies any edits it contains. The AAE file's data is saved in the XML format, which means the files can be opened and viewed with a text editor, such as Apple TextEdit or Microsoft Notepad.",
      "If you import pictures edited using the Photos app to Windows or an older version of macOS, you will most likely notice AAE files accompanying your images. In Windows, the .aae extension may be hidden by default, but the AAE files bear the same name as the JPG files whose edits they contain. After you import your pictures into Windows, you can delete the pictures' AAE files without erasing the associated pictures."
    ]
  },
  "more_information": {
    "description": [
      "AAE is a file type found on iOS 8 and newer, macOS 10.10 or later systems. It stores information about any edits made to .jpg photos in the Photos app. AAE files are in addition to original files and let users revert photos to their original state if required. When images are imported from macOS to Windows, the accompanying AAE files also get transferred.",
      "JPG is a widely used image format for photos, known for its efficient compression. Apple’s AAE files, created by Apple, are XML-based records that store editing instructions applied to JPG images within the Photos app. This system enables non-destructive editing, preserving the original JPG while the AAE file maintains a record of the edits.\n\nIt’s important to note that AAE files are specifically designed for Apple devices and the Photos app. If you transfer edited photos to a non-Apple device or use a different photo editing application, the edits may not be visible. To preserve the changes, you might need to ’export’ the edited photo as a new JPG file.",
      "An AAE file is a record of the edits a user has made to an image in the iOS version of Apple Photos. It is used to non-destructively transfer edits from iOS to macOS, so a user can revert their image to its original form if needed. AAE files are stored alongside the images whose edits they contain."
    ]
  },
  "how_to_open": {
    "instructions": [
      "AAE files are not meant to be opened. While you can open an AAE file in any text editor, such as Microsoft Notepad (Windows) or Apple TextEdit (Mac), doing so will only show you the XML data the file contains."
    ]
  },
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/aae_10137.png",
      "alt": "Screenshot of a .aae file in Microsoft Notepad",
      "caption": "AAE file open in Microsoft Notepad"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/web/aae/",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-02T02:43:26.493Z"
    },
    {
      "url": "https://fileinfo.com/extension/aae",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.493Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.493Z"
}