{
  "slug": "aax",
  "extension": "aax",
  "name": "Audible Enhanced Audiobook File",
  "summary": "Learn about .AAX files and view a list of programs that open them.",
  "developer": "Audible",
  "category": "audio",
  "category_slug": "audio",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=3525&b=1"
      },
      {
        "name": "Apple iTunes",
        "url": "https://fileinfo.com/software/apple/itunes"
      }
    ]
  },
  "technical_info": {
    "content": [
      "The detail about AAX file format quality specs available at audible is shown below:\n\nBitrate: 32 - 128 kbit/sSample rate: 22.050 - 44.10 kHzBit Depth: Un­knownChannel: Mono or stereoMBytes/hour: 28.8Container: MPEG-4 Part 14Quality description: AAC sound",
      "An AAX file is a structured container, not just a long audio stream.\n\nChapter Markers: The file contains embedded chapter markers, allowing listeners to navigate through the book effortlessly, skipping forward or backward between chapters within any supported app.Metadata: Detailed information is embedded within the file, including the book title, author, narrator, publisher, copyright information, and cover art. This metadata is displayed by the playback software.",
      "Since AAX files support images, they are often used for kid's books. AudibleKids has two types of Enhanced Audiobooks: Picture Books and Graphic Novels. The images are automatically shown as the user listens to the story.",
      "AAX files can be played by iTunes and are also supported by the Apple iPod and the Amazon Kindle 2. However, before playing the files, users need an Audible.com account, which requires a subscription fee."
    ]
  },
  "more_information": {
    "description": [
      "The .aax file extension designates a specialized format for digital audiobooks, developed and pioneered by Audible—a leading American online audiobook and podcast service owned by Amazon.com Inc. As the enhanced successor to the older AA file format, AAX files offer a significantly richer, multimedia experience. These files are the standard distribution format for platforms like AAudible; Audible Kids, and the iTunes Store. Unlike basic audio files, AAX files are sophisticated digital multimedia containers that can integrate features such as embedded graphics, video clips, interactive bookmarks, and a precise video timeline. This robust functionality makes the AAX format a particularly engaging and suitable choice for children’s content, including interactive Picture Books and Graphic Novels, providing a more immersive and useful listening and viewing experience.",
      "Multimedia digital audiobook format developed by Audible; may be used by audiobooks available from Audible.com, AudibleKids, and the iTunes Store; similar to the standard .AA audiobook file type, but may include other features such as images and links."
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/audio/aax/index.html",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-01T22:32:42.248Z"
    },
    {
      "url": "https://fileinfo.com/extension/aax",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.248Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.248Z",
  "containers": []
}