{
  "slug": "accdt",
  "extension": "accdt",
  "name": "Microsoft Access Database Template",
  "summary": "Learn about .ACCDT files and view a list of programs that open them.",
  "developer": "Microsoft",
  "category": "database",
  "category_slug": "database",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=5216&b=1"
      },
      {
        "name": "Microsoft Access 365",
        "url": "https://fileinfo.com/software/microsoft/access"
      }
    ]
  },
  "technical_info": {
    "content": [
      "ACCDT files are packages that contain a collection of related parts. Each part stores information about the contents of a database application using XML, text and binary formats, that includes:\n\nDatabase objectsAssociated metadataStructure of the package\n\nPackage\n\nA Package is a ZIP archive that contains multiple parts and conforms to the Open Packaging Conventions specified in ISO/IEC-29500-2. ACCDT files must contain atleast one Template metadaa part which should be the target of a relationship. This Template Metadata is the starting part of an ACCDT file.\n\nPart\n\nA part is a stream of bytes that has an associated type for specifying the nature and type of content stored in it. Parts enumeration specify valid parts, valid content types, and required relationships between all parts in a package.\n\nRelationship\n\nPackage Relationship - where target is a part and the source is the package as a whole.\n\nPart-to-Part Relationship - where the target is a part and the source is a part in the package.\n\nExplicit Relationship - where a resource is referenced from the contents of a source part by referencing a relationship element by the value of its ID attribute.\n\nImplicit Relationship - a relationship that is not explicit.\n\nInternal relationship - where the target is a part in the package.\n\nExternal relationship - where the target is an external resource not in the package.",
      "ACCDT files are used for creating multiple .ACCDB databases from the same starting point. They also can be useful for partitioning information between applications that use similarly structured data."
    ]
  },
  "more_information": {
    "description": [
      "A file with .accdt extension is a Microsoft Access database template file that contains pre-defined database elements. These elements are a collection of structures that define a database applications such as database schemas for storing data, layout description for views of the data, and metadata describing the database. Being template files, ACCDT files can be used to create databases based on the template settings available in these. Resultant database files are saved as ACCDB files and populated with data in tables. Microsoft Access 2007 and onwards can open ACCDT files.",
      "Template database file created by Microsoft Access, a desktop relational database management system (RDMBS); contains pre-defined tables, data, reports, and other database elements; saved as a hierarchy of XML and text files and compressed with Zip compression."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Since ACCDT file is related Microsoft Access (version 2007 or newer), you must install it on your computer to open it.\n\nOpen Microsoft Access. Click on File > Open, navigate to the AACDT file, and select it. The file will load as a template, allowing you to create a new database based on its structure."
    ]
  },
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/database/accdt/",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-02T02:43:26.494Z"
    },
    {
      "url": "https://fileinfo.com/extension/accdt",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.494Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.494Z"
}