{
  "slug": "act",
  "extension": "act",
  "name": "ADPCM Compressed Audio",
  "summary": "Learn about .ACT files and view a list of programs that open them.",
  "developer": "Actions Semiconductor",
  "category": "audio",
  "category_slug": "audio",
  "programs": {
    "windows": [
      {
        "name": "File Viewer Plus",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1415"
      },
      {
        "name": "SoX",
        "url": "https://fileinfo.com/software/sox/sox"
      },
      {
        "name": "Adobe Photoshop 2025",
        "url": "https://fileinfo.com/software/adobe/photoshop"
      },
      {
        "name": "Adobe Illustrator 2025",
        "url": "https://fileinfo.com/software/adobe/illustrator"
      },
      {
        "name": "chUmbaLum sOft MilkShape 3D",
        "url": "https://fileinfo.com/software/chumbalum_soft/milkshape_3d"
      },
      {
        "name": "Autodesk 3ds Max 2023",
        "url": "https://fileinfo.com/software/autodesk/3ds_max"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Many recorders using the ACT system only are doing it for the smallest recording option; if the quality is upped, a separate format, usually WAV, is used, resulting in massively larger documents.\n\nThere are several generations of ACT; as of June 2009, tracks created by subsequent devices just can not be recognized by every free standard music player or converter application, leaving only the bundled MP3 tools.\n\nImage optimization for Web distribution is done with ACT files. Customers can test the picture quality against the generated image databases by increasing or decreasing the number of colors in the CLUT.\n\nBy tapping the Color Table option and picking Load Color Data from the Export for Web dialogue box, Adobe color tables can be uploaded. The /Presets/en_US/Save for Web Settings/Color Tables/ directory contains several preconfigured ACT files that came with the Photoshop system.\n\nAct scripts can be generated solely within Genesis 3D or by transforming other 3D models to the ACT standard using Genesis3D Actor Designer",
      "Various models of Chinese media players (often referred to as S1 MP3 players) and voice recorders can save audio recordings in the ACT format. This lossy format was developed by Actions Semiconductor and is usually a device's lowest-quality recording format. (Audio recorded at higher quality is typically saved as a .WAV file.)",
      "To create an ACT file, users record audio using either a device's built-in microphone or FM radio. They can then play the ACT file on their device or transfer it to their computer, where they can convert it to the WAV format using conversion software included with their device."
    ]
  },
  "more_information": {
    "description": [
      "The .act file extension represents several specialized and unrelated formats, making its identification crucial. Primarily, in the Adobe ecosystem, an ACT file is an Adobe Color Table (or Color Lookup Table), a database format used in Adobe Photoshop and Illustrator. This type of ACT stores a predefined set of colors, allowing designers to add or remove specific swatches when saving images for online use. This control is essential for optimizing the balance between visual quality and smaller file sizes for web publishing.\n\nHowever, it is critical to perform format identification, as the same extension can refer to an entirely different file type. For instance, an ACT file might not be a color table but an ADPCM (Adaptive Differential Pulse Code Modulation) Encrypted Audio file, a compression standard utilized by various voice recorders and music listening devices. Beyond multimedia, the ACT format is also integral to the Alma CAD/CAM system, where it contains guidelines that instruct 3D machine tools on how to cut materials. Other examples include actor files for the Genesis3D Player, action files for DS game development, and schematic files for the FoxPro Detailing Wizard.",
      "An ACT file is an audio file recorded by a Chinese MP3 player, MP4 player, or voice recorder. It typically contains a voice memo or a song recorded off the radio. ACT files are compressed using Adaptive Differential Pulse Code Modulation (ADPCM) and have a bitrate of 8 kbit/s."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open most ACT files with File Viewer Plus (Windows), Logipole Konverter (Windows), or SoX (Linux). However, these programs may not be able to open ACT files created by later devices, which are saved in a different format than previous devices' ACT files."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "You can use File Viewer Plus (Windows), Logipole Konverter (Windows), or SoX (Linux) to convert most ACT files to the .WAV format and other audio formats. However, you may not be able to open or convert ACT files saved in more recent versions of the ACT file format."
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/audio/act/index.html",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-01T22:32:42.249Z"
    },
    {
      "url": "https://fileinfo.com/extension/act",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.249Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.249Z",
  "containers": []
}