{
  "slug": "aix",
  "extension": "aix",
  "name": "MIT App Inventor Extension",
  "summary": "Learn about .AIX files and view a list of programs that open them.",
  "developer": "Google and MIT",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12251&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "MIT App Inventor is a block-based coding platform that allows students and other programming novices to learn how to create iOS and Android applications. The program was originally developed by Google, but it is now maintained by MIT's Computer Science and Media Lab departments.",
      "Those who want to add additional features to MIT App Inventor can do so by downloading and installing App Inventor extensions. Many extensions are available at MIT App Inventor's website, saved as AIX files. For example, the LookExtension allows MIT App Inventor to perform object recognition and classification using a neural network. The LookExtension is available from the MIT App Inventor Extension hub as LookExtension.aix."
    ]
  },
  "more_information": {
    "description": [
      "An AIX file is an extension used by MIT App Inventor, a web-based mobile app development platform. It contains an advanced feature that can be added to MIT App Inventor. Many AIX files are available for download on MIT App Inventor's website."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To install an AIX file as an MIT App Inventor (Web) extension:",
      "Open and log in to MIT App Inventor in your web browser.",
      "Open an App Inventor project.",
      "In App Inventor's left-hand sidebar, find and expand the Extension section.",
      "Select Import extension.",
      "When the Import an extension into project window appears, select Choose File.",
      "Browse to and select your AIX file.",
      "Select Import.",
      "The extension your AIX file contains will then appear in the Extension section."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/aix",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.573Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.573Z"
}