{
  "slug": "alpx",
  "extension": "alpx",
  "name": "ACDSee Luxea Video Editor Project",
  "summary": "Learn about .ALPX files and view a list of programs that open them.",
  "developer": "ACD Systems",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12091&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "ACDSee Luxea is a video-editing program that is available for Windows. It allows users to import videos, images, and audio files, edit and combine those files into a single video, add effects to their video projects, and publish videos directly to social media apps.",
      "When a user saves an in-progress Luxea video-editing project, the project is saved as an ALPX file. While ALPX files are used to open video-editing projects, they do not actually contain any video, image, or audio files. Instead, ALPX files contain text-based references to the media files included in a Luxea project, including the locations at which those files are stored. If you move a file referenced in an ALPX file, your video project will not load correctly in Luxea.",
      "ALPX files also contain a record of a video project's properties, length, tracks, effects, and edits. This list is used to load the project, its associated settings, and its associated edits in Luxea."
    ]
  },
  "more_information": {
    "description": [
      "An ALPX file is a video-editing project created by ACD Systems ACDSee Luxea. It is a JSON-formatted text file that contains references to the video, image, and audio files included in a Luxea project, as well as a record of the project's properties, timeline, effects, and edits. When opened in Luxea, ALPX files can be used to publish edited videos to YouTube and social media, or to export videos as .MP4, .MOV, .M4V, .WEBM, or .GIF files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open ALPX files in ACDSee Luxea (Windows). To do so, open Luxea, select File → Open Project..., and then navigate to and select your ALPX file.",
      "If you need to review the JSON-formatted text an ALPX file contains, you can open it in any text editor. For example, you might want to open an ALPX file in a text editor if you've misplaced a media file included in your Luxea project."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/alpx_12091.png",
      "alt": "Screenshot of a .alpx file in ACDSee Luxea 5.1",
      "caption": "ALPX file open in ACDSee Luxea 5.1"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/alpx",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.322Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.322Z",
  "category": "other",
  "related": [],
  "containers": []
}