{
  "slug": "anb",
  "extension": "anb",
  "name": "Analyst's Notebook Chart",
  "summary": "Learn about .ANB files and view a list of programs that open them.",
  "developer": "IBM",
  "category": "database",
  "category_slug": "database",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12155&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Data analysts and investigators use IBM i2 Analyst's Notebook to review data and help them find previously unnoticed patterns and connections. For example, an analyst at a government agency may use Analyst's Notebook to investigate a suspected case of tax fraud, in hopes of bringing a criminal to justice.",
      "In Analyst's Notebook, users conduct analyses by importing or entering relevant information and then either manually or programmatically finding connections between those pieces of information. Analyst's Notebook displays these networks of information to users as diagrams, referred to as analytical charts.",
      "When a user wants to save an in-progress chart, they can do so by saving the chart as an ANB file. The ANB file contains all data displayed on the chart, including entered information, links, properties, labels, and legends."
    ]
  },
  "more_information": {
    "description": [
      "A file with .anb extension is IBM i2 Analyst’s Notebook chart that contains relationship information between different data. As the name suggests, the Analyst’s Notebook software helps in linking the data, resulting in a more concise form of connectivity between difference pieces of information and providing intelligence output for analysis. This helps to identify and disrupt malicious activities such as criminal, cyber, and fraudulent threats. ANB files can be opened with IBM i2Analyst’s Notebook software.",
      "An ANB file is an analytical chart created by IBM i2 Analyst's Notebook, a data analysis program. It contains a diagram that explains how different pieces of information are connected to each other. ANB files are comprised of entities, which represent pieces of information, links, which show that entities are connected, and properties, which describe an entity or link in more detail."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an ANB file in IBM i2 Analyst's Notebook (Windows) or IMB i2 Chart Reader (Windows). Chart Reader is a free application that allows users to view the chart an ANB file contains. However, users must create an IBM account before they can download Chart Reader."
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/database/anb/index.html",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-01T22:32:42.251Z"
    },
    {
      "url": "https://fileinfo.com/extension/anb",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.251Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.251Z",
  "containers": []
}