{
  "slug": "anydesk",
  "extension": "anydesk",
  "name": "AnyDesk Remote Session Recording",
  "summary": "Learn about .ANYDESK files and view a list of programs that open them.",
  "developer": "AnyDesk Software GmbH",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12298&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "AnyDesk is a cross-platform remote desktop application that allows users to access another computer from their current computer. For example, a remote worker may use AnyDesk to access their work computer from their home computer, provided both machines have AnyDesk installed.",
      "While using AnyDesk to access a computer, users can record their remote desktop session. For example, a user might want to record themselves performing a certain task, so they can share the recording as a tutorial. AnyDesk saves session recordings as ANYDESK files.",
      "ANYDESK files contain a recording of everything that occurred on a user's screen while the recording was active. Users can configure AnyDesk to start a recording whenever they launch a remote desktop session, or users can manually start and stop recording their sessions.",
      "NOTE: AnyDesk typically saves ANYDESK files in the ~/​Videos/​AnyDesk directory."
    ]
  },
  "more_information": {
    "description": [
      "An ANYDESK file is a recording of a remote desktop session conducted using AnyDesk, a remote desktop application. It shows the contents of the user's screen during their AnyDesk session. ANYDESK files can be played only in AnyDesk Session Player."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can play an ANYDESK file in AnyDesk's Session Player. To do so, either double-click the file on a device that has AnyDesk installed, or select the file from the Session History icon that appears in AnyDesk's top-right corner."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/anydesk",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.325Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.325Z",
  "category": "other",
  "related": [],
  "containers": []
}