{
  "slug": "approj",
  "extension": "approj",
  "name": "ActivePresenter Project",
  "summary": "Learn about .APPROJ files and view a list of programs that open them.",
  "developer": "Atomi",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12696&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "ActivePresenter is a Windows and macOS program that allows educators and others to create eLearning presentations. These presentations can contain a combination of screen recordings, annotations, slides, images, and interactive content (such as quizzes).",
      "Each ActivePresenter project is saved as an APPROJ file. These files are SQLite databases that store all a presentation's content. After finalizing a presentation, users can export their APPPROJ file's contents as an .MP4, .PDF, or .HTML file, or as a series of .PNG images, to share the content with others. They can also publish the presentation to ActivePresenter's eLearning management system."
    ]
  },
  "more_information": {
    "description": [
      "An APPROJ file is a project file created by Atomi ActivePresenter, a screen recording and eLearning presentation program. It may contain slides, videos, images, and other content that comprises a presentation. APPROJ files are used to create tutorials, manuals, eLearning lessons, and other educational content."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an APPROJ file in Atomi ActivePresenter (Windows, Mac). To do so, select ActivePresenter → Open Project.... Then, navigate to and open your APPPROJ file."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "You can use ActivePresenter to convert an APPROJ file's contents to the .MP4, .PDF, .HTML, and .PNG formats. To do so, open the file in ActivePresenter, select the Export tab, and then select the appropriate format."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/approj_12696.png",
      "alt": "Screenshot of a .approj file in Atomi ActivePresenter",
      "caption": "APPROJ file open in Atomi ActivePresenter"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/approj",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.580Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.580Z"
}