{
  "slug": "apz",
  "extension": "apz",
  "name": "Autoplay Media Studio Exported Project",
  "summary": "Learn about .APZ files and view a list of programs that open them.",
  "developer": "Indigo Rose",
  "category": "compression",
  "category_slug": "compression",
  "programs": {
    "windows": [
      {
        "name": "Corel WinZip",
        "url": "https://fileinfo.com/software/corel/winzip"
      },
      {
        "name": "7-Zip",
        "url": "https://fileinfo.com/software/igor_pavlov/7-zip"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=3161&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "AutoPlay Media Studio enables users, such as developers and content creators, to visually design applications. While the primary file format for saving projects is the AUTOPLAY file, users can export projects as APZ archives when they want to share projects with others more easily, move them between computers, or save them as a backup.",
      "NOTE: Users can create APZ files by selecting File → Export."
    ]
  },
  "more_information": {
    "description": [
      "An APZ file is a project file created with AutoPlay Media Studio, a software tool that allows for efficient development of applications. It is exported and saved in a compressed archive format. This format is convenient for several reasons. First, it reduces the size of the project file, making it easier to transfer to other systems or share with others. Second, the compressed file serves as a backup of the project, protecting against data loss or corruption.",
      "An APZ file is a project file exported by AutoPlay Media Studio, a Windows application used to create multimedia software, such as CD/DVD menus, interactive tutorials, and simple utilities. It contains all the contents of an AutoPlay project, including the .AUTOPLAY project file, media assets (including images, videos, and .BTN buttons), scripts, and other related resources in a Zip-compressed archive format."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an APZ file with AutoPlay Media Studio in Windows by selecting File → Open. Once you import the file, the program extracts its contents and recreates the original project structure.",
      "While an APZ file has an .apz extension, you can manually rename it to .zip and open it with any ZIP utility (like Corel WinZip or 7-Zip) to view its contents. However, to properly use or edit the project, you should import the APZ file through AutoPlay Media Studio, which will automatically extract and restore the project in its correct structure."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "AutoPlay Media Studio can convert APZ files to Autoplay Media Studio Project (.AUTOPLAY) files. The program can also convert APZ files to Autoplay Media Studio Template (.APT) files and build them as Windows Executable (.EXE) files and Disk Image (.ISO) files."
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/apz_3161.png",
      "alt": "Screenshot of a .apz file in Indigo Rose Autoplay Media Studio 9",
      "caption": "APZ file open in Indigo Rose Autoplay Media Studio 9"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/compression/apz/index.html",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-01T22:32:42.252Z"
    },
    {
      "url": "https://fileinfo.com/extension/apz",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.252Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.252Z",
  "containers": []
}