{
  "slug": "aq",
  "extension": "aq",
  "name": "Ancestral Quest Database File",
  "summary": "Learn about .AQ files and view a list of programs that open them.",
  "developer": "Incline Software",
  "category": "database",
  "category_slug": "database",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11803&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Ancestral Quest allows you to record, organize, and visualize your family tree. When you save your information in the software by selecting File → New..., Ancestral Quest creates an AQ file, by default, to store the information. You can save, close, and re-open the AQ file to further edit your family tree.",
      "You can also back up your AQ database as an .AQZ file to save space by selecting File → Backup.... Or you can export the information in an AQ database to the .GED genealogical database format by selecting File → Export...."
    ]
  },
  "more_information": {
    "description": [
      "A file with .aq extension is a database file created with Ancestral Quest application by Incline Software, LC. It stores family tree information using the genealogical data entered by individuals using the free and premium version of the software. The database stores information such as the names, birthplaces, and relationships of family members. Ancestral Quest uses this information for linking and classifying information such as Pedigree, Descendants, Family and Timeline view. AQ files can be opened using the Incline Software Ancestral Quest.",
      "Ancestral Quest is a genealogy software used to create, manage and organize family trees and genealogical records. It allows users to store information like names, dates, relationships and historical notes. The software supports collaboration, data sharing and integration with online genealogy databases. It is popular for its user-friendly interface and compatibility with GEDCOM files.",
      "An AQ file is a database file created by Incline Software Ancestral Quest, a family tree genealogy application. It contains genealogical data that outlines a family tree, which includes the names, birthplaces, and descriptions of family members and their relationships with each other."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To open AQ file, you need to install Ancestral Quest. Download and install the latest version of Ancestral Quest from its official website.\n\nLaunch Ancestral Quest. Go to File > Open, and browse for the AQ file on your computer. Select the file, and it will load into the program.",
      "You can only open AQ files with Ancestral Quest. To open an AQ file with the software, select File → Open...."
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/aq_11803.png",
      "alt": "Screenshot of a .aq file in Incline Software Ancestral Quest 16",
      "caption": "AQ file open in Incline Software Ancestral Quest 16"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/database/aq/index.html",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-01T22:32:42.252Z"
    },
    {
      "url": "https://fileinfo.com/extension/aq",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.252Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.252Z",
  "containers": []
}