{
  "slug": "arfx",
  "extension": "arfx",
  "name": "Spark AR Effect",
  "summary": "Learn about .ARFX files and view a list of programs that open them.",
  "developer": "Facebook",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12165&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Spark AR Studio allows Facebook users to create AR effects that they can apply to Facebook and Instagram videos. For example, a Spark AR Studio user could create a \"money money money\" effect that adds a deluge of virtual dollar bills to their videos.",
      "After a user has finished creating their effect, they can publish it by clicking AR Studio's Publish icon. This produces an AREXPORT file. The AREXPORT file contains up to three ARFX files, each of which gives a user access to the effect they created on a different set of mobile devices. One ARFX file gives users access to the effect on iOS devices, one gives users access to the effect on newer Android devices, and one gives users access to the effect on old Android devices.",
      "NOTE: Typically, each ARFX file must be 4 MB or smaller to be used on Instagram and 10 MB or smaller to be used on Facebook."
    ]
  },
  "more_information": {
    "description": [
      "An ARFX file is an augmented reality (AR) effect created by Spark AR Studio, an application that Facebook users can use to create AR video effects. It contains an effect that is meant to be used on one of three sets of mobile devices. ARFX files are typically found within .AREXPORT files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "ARFX files are not meant to be opened. Instead, they are meant to be uploaded to Spark AR Hub (which is accessible in Facebook) as part of AREXPORT files. After being uploaded to Spark AR Hub, the effect an ARFX file contains can be used on Facebook and Instagram. You cannot upload ARFX files to Spark AR Hub individually."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/arfx",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.582Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.582Z"
}