{
  "slug": "arsc",
  "extension": "arsc",
  "name": "Android Package Resource Table",
  "summary": "Learn about .ARSC files and view a list of programs that open them.",
  "developer": "Google",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=6107&b=1"
      },
      {
        "name": "Google Android Studio",
        "url": "https://fileinfo.com/software/google/android_studio"
      }
    ]
  },
  "technical_info": {
    "content": [
      "When a developer compiles an Android program (using Android Studio or another development tool), the compiler transforms all the programs' resources, including images, layouts, styles, and strings, into binary files. It also assigns each resource a unique ID. The compiler then creates an ARSC file (typically named resources.arsc) that lists all the program's compiled resources and their IDs.",
      "At runtime, the program uses its ARSC file to quickly locate and access resources. In this way, Android programs can standardly access resources, no matter the resource's type or where it is stored or referenced in the program's source code."
    ]
  },
  "more_information": {
    "description": [
      "An ARSC file is an application resource table used by programs developed for the Android operating system. It is a binary file that contains a table-format list of the resources included in an Android program, including the resources' names, properties, and IDs. ARSC files are included in .APK (Android Package) files, which Android uses to install apps."
    ]
  },
  "how_to_open": {
    "instructions": [
      "For the most part, ARSC files are not meant to be opened. However, you can use Android Studio's APK Analyzer to examine an ARSC file's contents. To do so, you must:",
      "Locate the APK file your ARSC file is included in.",
      "Drag the APK file to Android Studio's Editor window.",
      "Switch to the Project perspective.",
      "Double-click your APK file in the default build/​output/​apks directory.",
      "Select Build → Analyze from APK Studio's menu bar and then select your APK file."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/arsc",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.584Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.584Z"
}