{
  "slug": "asi",
  "extension": "asi",
  "name": "ASI Mod Script",
  "summary": "Learn about .ASI files and view a list of programs that open them.",
  "developer": "N/A",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=8881&b=1"
      },
      {
        "name": "Alpha Software Alpha Anywhere",
        "url": "https://fileinfo.com/software/alpha_software/alpha_anywhere"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Grand Theft Auto (GTA) and Red Dead Redemption (RDR) are popular video game series published by Rockstar Games. These series enjoy a healthy modding community, which creates and shares mods that players can use to alter the games' gameplay.",
      "Mods for the Windows version of GTA IV, GTA V, and RDR 2 are often saved and distributed as ASI files. For example, GTA V players can find and download many ASI files from the website gta5-mods.com. To use these files, players must first add a related, player-created ScriptHook library to the associated game's installation directory."
    ]
  },
  "more_information": {
    "description": [
      "An ASI file is a mod for the Windows version of Grand Theft Auto IV, Grand Theft Auto V, or Red Dead Redemption 2. It contains a plug-in or script that adds features to or otherwise alters a game. To use ASI files, players must install them using an associated, game-specific ScriptHook."
    ]
  },
  "how_to_open": {
    "instructions": [
      "ASI files are not meant to be opened. To use an ASI file with Grand Theft Auto IV, Grand Theft Auto V, or Red Dead Redemption 2:",
      "Download a ScriptHook library for your game. ScriptHook libraries include GTA IV ASI Loader (for GTA IV), ScriptHookV (for GTA V), and ScriptHookRDR2 (for RDR 2).",
      "Place your ScriptHook's .DLL file(s) in your game's installation directory (alongside the game's .EXE file).",
      "Copy your ASI file to your game's installation directory.",
      "The next time you open the game you modified, the mod your ASI file contains will be applied."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/asi",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.333Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.333Z",
  "category": "other",
  "related": [],
  "containers": []
}