{
  "slug": "atomsvc",
  "extension": "atomsvc",
  "name": "Atom Service Document",
  "summary": "Learn about .ATOMSVC files and view a list of programs that open them.",
  "developer": "Microsoft",
  "programs": {
    "windows": [
      {
        "name": "Microsoft Office",
        "url": "https://file.org/free-download/microsoft-office"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10931&b=1"
      },
      {
        "name": "Microsoft Excel with Power Pivot",
        "url": "https://fileinfo.com/software/microsoft/excel"
      }
    ]
  },
  "technical_info": {
    "content": [
      "ATOMSVC files are used for integrating data feeds from SQL Server into compatible applications, such as Microsoft Power BI and Microsoft Excel with the Power Pivot add-in. The data feed integration allows users to access current data without the need to manually enter the data.",
      "The data is fed from SQL Server to a report in order to populate the different regions of the report, such as tables, lists, charts, graphs, matrices, and gauges. Each region of a report has its own data feed, but some regions may have multiple data feeds depending on their structure. These data feeds are stored in the ATOMSVC file.",
      "It is important to note that the ATOMSVC files do not store the actual data seen in each region. They store information for connecting to one or more data feeds, which may be the URL address of the web server or the address of a local or shared folder on a computer that points to the location of the data.",
      "To create an ATOMSVC file, select the \"Export to Data Feed\" icon next to a report in the \"Reporting Services\" web portal and save the document.",
      "To open the ATOMSVC file in Power Pivot in Excel:",
      "Select the \"Manage\" button on the Power Pivot tab.",
      "Click \"From Other Sources\", then choose \"Other Feeds\".",
      "Browse to the location of the ATOMSVC file, and click Test Connection.",
      "Select the tables and views that you want to import data from, name them, and click Finish.",
      "Power Pivot will begin importing the data, which may take several minutes, then notify you if the import was successful.",
      "Click Close.",
      "NOTE: Since ATOMSVC files are saved in XML format, they can also be opened by an XML editor or text editor."
    ]
  },
  "more_information": {
    "description": [
      "An ATOMSVC file is an Atom service document generated by SQL Server Reporting Services (SSRS), which is used to create, publish, and manage reports about SQL Server data. It contains connection information about one or more data feeds used to populate regions in a report with data from SQL Server. ATOMSVC files are saved in XML format."
    ]
  },
  "images": [
    {
      "url": "https://assets.file.org/images/fileorg-logo-440x90-4-8b.png",
      "alt": "File.org logo"
    },
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://file.org",
      "source": "file.org",
      "retrieved_at": "2025-11-01T22:32:42.126Z"
    },
    {
      "url": "https://fileinfo.com/extension/atomsvc",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.126Z"
    },
    {
      "source": "filext.com",
      "retrieved_at": "2025-11-01T22:32:42.126Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.126Z",
  "mime": [
    "application/atomsvc+xml"
  ],
  "category": "other",
  "related": [],
  "containers": []
}