{
  "slug": "attheme",
  "extension": "attheme",
  "name": "Telegram Theme",
  "summary": "Learn about .ATTHEME files and view a list of programs that open them.",
  "developer": "Telegram",
  "programs": {
    "windows": [
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13800&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Telegram is a cloud-based messaging app launched in 2013 by Pavel and Nikolai Durov and is especially popular among privacy-conscious users, tech communities, and people seeking alternatives to more mainstream messaging platforms. While the app is available on multiple platforms, including Android, iOS, Windows, macOS, Linux, and the web, only the Android version supports ATTHEME files. Users can save themes as ATTHEME files within the Telegram app using its built-in theme editor or download ATTHEME files from Telegram theme-sharing channels.",
      "ATTHEME files contain a list of key-value pairs that define visual elements of the Telegram Android interface, such as color codes for backgrounds, message bubbles, text, icons, and other UI components. For example, an ATTHEME file includes a list of various UI elements on separate lines, accompanied by values defining the appearance of the component (e.g., chat_muteIcon=-8487298)."
    ]
  },
  "more_information": {
    "description": [
      "An ATTHEME file contains a theme used by the Android version of the Telegram messaging app. It stores settings in a plain text format that define the visual appearance of the Telegram interface, such as colors for backgrounds, text, buttons, and other user interface (UI) elements. ATTHEME files allow users to customize how Telegram looks on their Android devices, giving the app a different aesthetic from the default appearance."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open ATTHEME files with the Android version of the Telegram app. Telegram's built-in theme editor on Android also allows you to adjust themes. There are also several online theme editors, including .attheme editor, that can open and modify your theme properties.",
      "Since ATTHEME files are saved in a plain text format, you can open and edit them with a basic text editor, such as Microsoft Notepad (Windows) or Apple TextEdit (Mac), or a source code editor. However, it's safer and more convenient to create and adjust themes in ATTHEME files with Telegram's built-in theme editor on Android."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/attheme_13800.png",
      "alt": "Screenshot of a .attheme file in Microsoft Visual Studio Code 1.98",
      "caption": "ATTHEME file open in Microsoft Visual Studio Code 1.98"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/attheme",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.590Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.590Z"
}