{
  "slug": "aup3",
  "extension": "aup3",
  "name": "Audacity 3 Project File",
  "summary": "Learn about .AUP3 files and view a list of programs that open them.",
  "developer": "Audacity",
  "programs": {
    "windows": [
      {
        "name": "Audacity 3",
        "url": "https://fileinfo.com/software/audacity/audacity"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11971&b=1"
      },
      {
        "name": "Audacity",
        "url": "https://fileinfo.com/software/audacity/audacity"
      }
    ]
  },
  "technical_info": {
    "content": [
      "In March 2021, Audacity released Audacity 3, which uses the new AUP3 file format to save audio editing projects. AUP3 replaces the .AUP format, used by previous versions of Audacity. You can still open AUP files in Audacity 3, but the program saves all projects, even those previously saved as AUP files, as AUP3 files.",
      "Unlike AUP files, which are XML files that contain references to audio files and other data, AUP3 files are database files that contain the audio and other data a project uses. Because AUP3 files include all of a project's data, you can no longer \"break\" a project by moving audio files or other data referenced by the project. However, because AUP3 files contain audio tracks, they can be very large (several gigabytes) and may load more slowly than AUP files."
    ]
  },
  "more_information": {
    "description": [
      "An AUP3 file is an audio project created by Audacity, a free audio recording and editing program. It contains project information saved in an SQLite 3 database, including project settings, metadata, and all audio files used by the project. AUP3 files are created by Audacity 3 and later."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an AUP3 file in Audacity 3 and higher versions. To do so, select File → Open... from the program's menu bar, then locate and select your AUP3 file. Note that you cannot open an AUP3 file in Audacity 2.4 or earlier versions."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/aup3_11971-2.png",
      "alt": "Screenshot of a .aup3 file in Audacity 3.2",
      "caption": "AUP3 file open in Audacity 3.2"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/aup3",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.590Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.590Z"
}