{
  "slug": "aurora",
  "extension": "aurora",
  "name": "Aurora Ransomware Encrypted File",
  "summary": "Learn about .AURORA files and view a list of programs that open them.",
  "developer": "N/A",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11004&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "The Aurora virus is highly dangerous malware. It is commonly referred to as ransomware, where the purpose of the virus is to take your files hostage and force you to pay the perpetrator (typically approximately $100 USD of bitcoin) to unlock your files. The virus is a trojan horse that is typically introduced through a personal .DOC file attached to an email. Once the virus affects your computer it begins scrambling your files, renaming them, and encrypting them. The virus then generates a .TXT ransom note named HOW_TO_DECRYPT_YOUR_FILES.txt, which informs you of the takeover and what you are meant to do to recover your files."
    ]
  },
  "more_information": {
    "description": [
      "An AURORA file is a file encrypted by the Aurora Virus, a trojan horse utilized by cybercriminals. It contains a user's file, such as a .WMV, .MP4, .XLSX, or .PDF file, encrypted with the 2048 bit RSA key. AURORA files became prevalent in 2018 and are similar to .LOCKY and .ODIN files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "No known program can restore AURORA files to their original state. The best way to recover your files is to retrieve them from a recent backup or perform a System Restore to a point before your computer was infected."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/aurora",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.591Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.591Z"
}