{
  "slug": "automaticdestinations-ms",
  "extension": "automaticdestinations-ms",
  "name": "Windows Jump List File",
  "summary": "Learn about .AUTOMATICDESTINATIONS-MS files and view a list of programs that open them.",
  "developer": "Microsoft",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=7216&b=1"
      },
      {
        "name": "Microsoft Windows",
        "url": "https://fileinfo.com/software/microsoft/windows"
      }
    ]
  },
  "technical_info": {
    "content": [
      "In Windows 7, Microsoft introduced the Jump List feature. The Jump List allows you to right-click an application icon pinned to your taskbar and quickly access recent, pinned, or frequently-accessed files. For example, if you have pinned Microsoft Word to your taskbar, and you recently used Word to edit some .DOCX files, those files will appear in the Recent section of Word's Jump List when you right-click its taskbar icon. Windows creates AUTOMATICDESTINATIONS-MS files when you use a program pinned to your taskbar. These files contain information, including a timestamp, application ID, and file path, that Windows uses to store items in and open items from an application's Jump List. For example, if you use Microsoft Word to create and save a new Word document, Windows may create an AUTOMATICDESTINATIONS-MS file that is used to show the new document in the Recent section of Word's Jump List.",
      "Because AUTOMATICDESTINATIONS-MS files are stored in a hidden folder and not meant to be opened, most Windows users will never encounter them. However, if you want to view your system's AUTOMATICDESTINATIONS-MS files, you can find them in the following directory (by updating the file path below to include your Windows username and entering the path in File Explorer's address bar):",
      "Users\\​%USERNAME%\\​AppData\\​Roaming\\​Microsoft\\​Windows\\​Recent\\​AutomaticDestinations"
    ]
  },
  "more_information": {
    "description": [
      "An AUTOMATICDESTINATIONS-MS file is a Jump List file used by Windows 7 and later versions. It contains a timestamp, application ID, and file path used to open a file or other item that appears in an application's Jump List. An application's Jump List appears when a user right-clicks its taskbar icon."
    ]
  },
  "how_to_open": {
    "instructions": [
      "AUTOMATICDESTINATIONS-MS files are not meant to be opened. If you want to access a file from a program's Jump List, you should instead right-click that program's taskbar icon and select the file from the Jump List."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/automaticdestinations-ms",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.591Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.591Z"
}