{
  "slug": "avifs",
  "extension": "avifs",
  "name": "AVIF Image Sequence",
  "summary": "Learn about .AVIFS files and view a list of programs that open them.",
  "developer": "Alliance for Open Media",
  "technical_info": {
    "content": [
      "In 2015, the Alliance for Open Media began developing several open-source media technologies and standards, aimed primarily at making it easier to share media over the Internet. As part of their work, the Alliance developed the AV1 video codec. The Alliance then applied the codec to .HEIF images to produce the AVIF image format.",
      "If a user wants to save an animation comprised of AVIF images, they can save that animation as an AVIFS, or AVIF Image Sequence, file. These files are MP4 files whose frames are comprised of AVIF images.",
      "In practice, AVIFS files are most similar to animated GIFs and .WEBP images. However, while GIF and WEBP files can contain either still or animated images, the Alliance for Open Media chose to use different extensions to distinguish between still (AVIF) and animated (AVIFS) images. This allows image creators and users to easily tell whether an image is still or animated."
    ]
  },
  "more_information": {
    "description": [
      "An AVIFS file is an AVIF Image Sequence. It contains a series of .AVIF images that comprise an animation. AVIFS files are similar to animated .GIFs and .MP4 files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "The image viewer qView (multiplatform) can open AVIFS files. You can also read AVIFS files using the libavif library (multiplatform).",
      "In the future, most programs that can open .AVIF files will likely also be able to open AVIF files."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/avifs",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.592Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.592Z"
}