{
  "slug": "babylon",
  "extension": "babylon",
  "name": "Babylon.js Scene",
  "summary": "Learn about .BABYLON files and view a list of programs that open them.",
  "developer": "Babylon.js",
  "programs": {
    "windows": [
      {
        "name": "Microsoft Visual Studio Code",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      },
      {
        "name": "GitHub Atom",
        "url": "https://fileinfo.com/software/github/atom"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12302&b=1"
      },
      {
        "name": "Vim",
        "url": "https://fileinfo.com/software/vim/vim"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Babylon.js is a rendering engine that developers can use to create 3D scenes and import them into webpages and web applications. To do so, developers code 3D scenes using JavaScript and imported Babylon.js assets. The scenes that developers create are most often saved as BABYLON files, though they may also be saved as .GLB files.",
      "BABYLON files can reference other BABYLON files, allowing developers to create and display complex scenes. After a developer finishes their scene(s), they can display the scene in their webpage or app by importing requisite babylon.js scripts into their webpage or app's HTML, generating the babylon.js engine, and then copying the code their BABYLON file contains into their page or app's HTML.",
      "NOTE: More information on how to create and use BABYLON files is available in babylon.js's documentation, located at doc.babylonjs.com."
    ]
  },
  "more_information": {
    "description": [
      "A BABYLON file is a 3D scene created for use with the babylon.js web rendering engine. It contains JavaScript code that defines the 3D objects and lighting that appear in the scene, as well as the camera used to show the scene. The code BABYLON files contain is meant to be used as part of webpages and web applications, by rendering it using HTML and babylon.js."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To see the 3D scene a BABYLON file describes, you can copy and paste the code your BABYLON file contains into the Babylon.js Playground, linked below. Assuming the scene is coded correctly, it will appear in your web browser when you press the playground's Run button.",
      "If you just want to view the JavaScript code your BABYLON file contains, you can open it any source code or text editor, such as Microsoft Visual Studio Code (cross-platform) or GitHub Atom (cross-platform)."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/babylon_12302.png",
      "alt": "Screenshot of a .babylon file in Babylon.js Playground",
      "caption": "BABYLON file open in Babylon.js Playground"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/babylon",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.598Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.598Z"
}