{
  "slug": "bacpac",
  "extension": "bacpac",
  "name": "Compressed Microsoft SQL Database",
  "summary": "Learn about .BACPAC files and view a list of programs that open them.",
  "developer": "Microsoft",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12361&b=1"
      },
      {
        "name": "Microsoft SQL Server 2019",
        "url": "https://fileinfo.com/software/microsoft/sql_server"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Database managers can use a variety of Microsoft SQL database management tools to export databases as BACPAC files. For example:",
      "Azure users can export a database as a BACPAC file from the Azure portal",
      "SQL Database users can export a database as a BACPAC file using the SqlPackage command-line utility",
      "SQL Server Management Studio users can export a database as a BACPAC file using a wizard included in that application",
      "While BACPAC files are similar to .DACPAC files, the files are used for different purposes. BACPAC files are used primarily to back up or move databases from one server to another. DACPAC files are focused on capturing and deploying schema. Sometimes, DACPAC files are applied to existing databases."
    ]
  },
  "more_information": {
    "description": [
      "A BACPAC file is a Zip-compressed archive that contains a Microsoft SQL database's schema and data. Users export BACPAC files from and import BACPAC files into Microsoft SQL database programs, such as Microsoft Azure SQL Database and Microsoft SQL Server. BACPAC files are used to transfer databases between servers."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can import the database a BACPAC file contains into Microsoft Azure SQL Database or Microsoft SQL Server. To do so, you must use either:",
      "The Import Data-tier Application menu item (found by opening Object Explorer, right-clicking on Databases, and then selecting Import Data-tier Application) available in Microsoft SQL Server (Windows)",
      "The Import database option available in the SQL server section of the Microsoft Azure portal",
      "The SqlPackage command-line utility"
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/bacpac",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.599Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.599Z"
}