{
  "slug": "bc3",
  "extension": "bc3",
  "name": "FIEBDC-3 Database File",
  "summary": "Learn about .BC3 files and view a list of programs that open them.",
  "developer": "FIEBDC",
  "category": "database",
  "category_slug": "database",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11740&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "BC3 files are typically utilized by construction professionals that plan and manage large-scale projects. These users can export, exchange, and import BC3 files between applications without losing data or converting the format.",
      "FIEBDC stands for Formato de Intercambio Estándar - Bases de Datos de Construcción, which translates to \"Standard Exchange Format - Construction Databases\" in English. It is an association that was established in July 1996 and oversees the FIEBDC construction database exchange format.",
      "NOTE: There are various versions of the FIEBDC-3 format that have been released throughout the years. Some versions include FIEBDC-3/2004, FIEBDC-3/2007, FIEBDC-3/2012, and FIEBDC-3/2016."
    ]
  },
  "more_information": {
    "description": [
      "A BC3 file is a database file for storing information related to construction database exchange format. It was developed based on the Spanish standard construction database exchange format. A BC3 file stores information that has data records including details construction materials, cost of materials, and price of labor. The data cna be exchanged between other applications without converting the data to other formats.",
      "A BC3 file is a database file saved in the FIEBDC-3 format, which is a Spanish standard construction database exchange format. It contains a collection of data records, which may include construction materials, cost of materials, and price of labor."
    ]
  },
  "how_to_open": {
    "instructions": [
      "If you want to open a BC3 file in your application, you can",
      "You can open BC3 database files with a variety of construction and financial budgeting applications, such as Arktec Gest, Arktec Constructo, PREOC PREMETI, and CYPE Arquimedes."
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/database/bc3/index.html",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-01T22:32:42.255Z"
    },
    {
      "url": "https://fileinfo.com/extension/bc3",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.255Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.255Z",
  "containers": []
}