{
  "slug": "bcbk",
  "extension": "bcbk",
  "name": "Book Catalogue Data Backup",
  "summary": "Learn about .BCBK files and view a list of programs that open them.",
  "developer": "Evan Leybourn",
  "programs": {
    "windows": [
      {
        "name": "Corel WinZip",
        "url": "https://fileinfo.com/software/corel/winzip"
      },
      {
        "name": "RARLAB WinRAR",
        "url": "https://fileinfo.com/software/rarlab/winrar"
      },
      {
        "name": "Apple Archive Utility",
        "url": "https://fileinfo.com/software/apple/archive_utility"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13870&b=1"
      },
      {
        "name": "Corel WinZip Mac",
        "url": "https://fileinfo.com/software/corel/winzip_mac"
      },
      {
        "name": "GNU Tar",
        "url": "https://www.gnu.org/software/tar/"
      },
      {
        "name": "PeaZip",
        "url": "https://fileinfo.com/software/peazip/peazip"
      }
    ]
  },
  "technical_info": {
    "content": [
      "The Book Catalogue app is an open-source tool that helps readers and collectors track and manage their personal book collections on Android devices, as well as organize their libraries. It allows people to add books by scanning barcodes, entering ISBNs, or filling in details manually.",
      "To protect their data, the app gives users the option to back up their catalog in different formats. While the CSV export option is helpful for sharing with or editing in spreadsheet applications, BCBK files serve as the app's dedicated backup format, intended for restoring collections directly with Book Catalogue. A typical BCBK file stores the following files:",
      ".JPG file(s) - Each file contains an image for the cover of a book in the collection",
      ".CSV file - Named books.csv and contains information about the books in the collection",
      ".XML file - Named INFO.xml and contains metadata about the app"
    ]
  },
  "more_information": {
    "description": [
      "A BCBK file is a backup archive created by Book Catalogue, a book organizing app developed by Evan Leybourn for Android. It stores a backup of a user's book collection, including information about the books they have entered, such as titles, authors, series, book cover images, and other details. BCBK files make it possible for a user to restore the collection later if they reinstall the app or move to a new device."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open BCBK files with Book Catalogue on an Android device. You can open a BCBK file with Book Catalogue by tapping Administration and Preferences and selecting Import from Archive.",
      "Since BCBK files are saved in a format similar to Tape archives (.TAR files), you can open them with utilities that also support TAR files, such as Corel WinZip, RARLAB WinRAR, and Apple Archive Utility. You may need to change the file extension from .bcbk to .tar for the utility to open the file."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/bcbk_13870.png",
      "alt": "Screenshot of a .bcbk file in Evan Leybourne Book Catalogue 6",
      "caption": "BCBK file open in Evan Leybourne Book Catalogue 6"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/bcbk",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.347Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.347Z",
  "category": "other",
  "related": [],
  "containers": []
}