{
  "slug": "bcup",
  "extension": "bcup",
  "name": "Buttercup Vault",
  "summary": "Learn about .BCUP files and view a list of programs that open them.",
  "developer": "Perry Mitchell",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13535&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Buttercup allows users to create password vaults in which they can store, organize, and retrieve login credentials (usernames and passwords), payment methods, and other data. For example, a user could add their Amazon, Gmail, and online banking credentials to a Buttercup vault, and then copy their credentials from their vault when logging in to those services.",
      "Each Buttercup vault is saved as an encrypted, password-protected BCUP file. (When a user creates a new BCUP file, Buttercup prompts the user to create a password for that file.) Typically, users save BCUP files to Dropbox, Google Drive, or another cloud storage service, so they can easily access their BCUP files from different devices. However, users can also save BCUP files locally, so they can access their vaults without an internet connection."
    ]
  },
  "more_information": {
    "description": [
      "A BCUP file is an encrypted password vault created by Buttercup, an open-source password manager. It contains login credentials, payment methods, and/or notes a user has added to their vault. Because BCUP files are encrypted, users can view the credentials and other data they contain only in Buttercup."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a BCUP file with all versions of Buttercup (multiplatform). For example, to open a local BCUP file with the desktop version of Buttercup:",
      "Open Buttercup and select Vaults → Add New.",
      "In the Add Vault window, select File.",
      "In the Add Vault File window, select Load Existing.",
      "Navigate to and open your BCUP file.",
      "Remember, however, that to open a BCUP file, you must know the file's password."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/bcup_13535.png",
      "alt": "Screenshot of a .bcup file in Buttercup",
      "caption": "BCUP file open in Buttercup"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/bcup",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.348Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.348Z",
  "category": "other",
  "related": [],
  "containers": []
}