{
  "slug": "bdmv",
  "extension": "bdmv",
  "name": "Blu-ray Disc Movie Information File",
  "summary": "Learn about .BDMV files and view a list of programs that open them.",
  "developer": "Blu-ray Disc Association",
  "category": "video",
  "category_slug": "video",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=4505&b=1"
      },
      {
        "name": "Roxio Creator NXT Pro 9",
        "url": "https://fileinfo.com/software/roxio/creator"
      },
      {
        "name": "CyberLink PowerDVD 21",
        "url": "https://fileinfo.com/software/cyberlink/powerdvd"
      },
      {
        "name": "VideoLAN VLC media player",
        "url": "https://fileinfo.com/software/videolan/vlc_media_player"
      },
      {
        "name": "JRiver Media Center",
        "url": "https://fileinfo.com/software/jriver/media_center"
      },
      {
        "name": "Nero 2022",
        "url": "https://fileinfo.com/software/nero/nero"
      }
    ]
  },
  "more_information": {
    "description": [
      "A BDMV file is a type of file format used in Blu-ray Disc (BD) video discs. BDMV stands for “Blu-ray Disc Movie” and is a container format used to store high-definition video, audio, and other related content on Blu-ray discs. BDMV files are part of the Blu-ray Disc’s directory structure and contain various components of a Blu-ray movie, including video streams, audio tracks, subtitles, and menu structures.",
      "File used by Blu-ray discs to describe the contents of a Blu-ray disc directory; uses a well-defined filename and directory location and is seen with one of the following file names on a Blu-ray disc:",
      "index.bdmv: describes the file contents in the BDMV directory; found in the BDMV and BDMV/​BACKUP directories.",
      "MovieObject.bdmv: describes one or more movie objects; located in the BDMV and BDMV/​BACKUP directories.",
      "sound.bdmv: optional file that relates one or more sounds associated with HDMV Interactive Graphic streams applications; located in the BDMV/​AUXDATA directory."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Programs that open BDMV files are\n\nVLC Media Player: VLC is a versatile media player that can handle a wide range of multimedia formats, including BDMV files. Simply open VLC, go to “Media” in the menu, select “Open Folder,” and browse to the BDMV directory. VLC should automatically detect and play the content.PowerDVD: PowerDVD is a commercial Blu-ray player software designed for high-quality playback of Blu-ray discs and BDMV files. It offers a premium experience with support for various Blu-ray features, including menus and special features.CyberLink PowerDirector: If you’re looking to edit BDMV files, CyberLink PowerDirector is a video editing software that can import and work with BDMV files. It is useful for video editing and authoring Blu-ray discs.Leawo Blu-ray Player: Leawo Blu-ray Player is a free Blu-ray player software that supports BDMV files. It provides a straightforward interface for playing Blu-ray content on your computer.AnyDVD HD: AnyDVD HD is not a player but rather a tool that removes copy protection from Blu-ray discs, including BDMV files. You can then use other player software to open and play the decrypted BDMV files.ArcSoft TotalMedia Theatre: This is another commercial Blu-ray player software that can handle BDMV files and provides a premium playback experience."
    ]
  },
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/video/bdmv/",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-02T02:43:26.500Z"
    },
    {
      "url": "https://fileinfo.com/extension/bdmv",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.500Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.500Z"
}