{
  "slug": "bik",
  "extension": "bik",
  "name": "Bink Video File",
  "summary": "Learn about .BIK files and view a list of programs that open them.",
  "developer": "RAD Game Tools",
  "category": "video",
  "category_slug": "video",
  "programs": {
    "windows": [
      {
        "name": "VideoLAN VLC media player",
        "url": "https://fileinfo.com/software/videolan/vlc_media_player"
      },
      {
        "name": "Windows Media Player",
        "url": "https://fileinfo.com/software/microsoft/windows_media_player"
      },
      {
        "name": "Open and view .BIK files with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1562&b=1"
      },
      {
        "name": "File Viewer Plus",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1562"
      },
      {
        "name": "Microsoft Windows Media Player with Windows 7 Codec Pack",
        "url": "https://fileinfo.com/software/microsoft/windows_media_player"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Game developers often convert videos from common formats like .AVI or .MOV into the Bink format using RAD’s compression tools. The format allows developers to adjust data rates for a wide range of resolutions, from 320x240 for handheld devices to high-definition resolutions for modern PCs and consoles. This flexibility made Bink one of the most common video formats in the gaming industry during the 2000s and 2010s.",
      "Examples of games that support BIK files include:",
      "Left 4 Dead and Left 4 Dead 2",
      "Portal and Portal 2",
      "Hitman: Blood Money",
      "Fallout: New Vegas",
      "The Elder Scrolls V: Skyrim",
      "XCOM: Enemy Unknown",
      "Saints Row: The Third",
      "Star Wars: Knights of the Old Republic II"
    ]
  },
  "more_information": {
    "description": [
      "The files with .bik extension are used for playing movie clips in video games on both PCs and gaming consoles. BIK file enables standard video to be compressed greatly while optimizing video quality for the target platform. BIK videos can be run on Windows Media Player (WMP) but you should have the Windows 7 Codec Pack installed on your computer. You may see a warning message while playing that WMP doesn’t recognize the file format but you can still play the video.",
      "A BIK file is a video file saved in the proprietary Bink Video format, a format developed by RAD Game Tools that is widely used in PC and console video games. It contains a cutscene, intro, or in-game movie. The Bink Video format compresses standard video files to reduce their size while preserving quality tailored to the target platform."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To open a BIK file, you need a media player that supports the BIK format. Some media players that support BIK include the following:\n\nRAD Video Tools: This is a package of tools created by RAD Game Tools, which includes a BIK player.VLC media player: A popular open-source media player that supports a wide range of video formats, including BIK.Media Player Classic: A popular media player that supports a wide range of video formats, including BIK.\n\nIt is also possible that the game you obtained the BIK file from has its own built-in video player, in which case you may be able to play the BIK file directly from within the game. Besides, if you don’t have a media player that supports BIK, you may need to download and install a codec pack that includes support for the BIK format, such as the K-Lite Codec Pack.",
      "BIK files are not meant to be opened. Instead, the game packaged with the BIK file references the video to play it. You will most likely encounter BIK files only as part of installed game data.",
      "However, you can open BIK files with various utilities, including RAD Video Tools, the official player released by RAD Game Tools. VideoLAN VLC media player can open BIK files and older sysytems with Windows Media Player may also play BIK files if the proper codec is installed."
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/video/bik/index.html",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-01T22:32:42.255Z"
    },
    {
      "url": "https://fileinfo.com/extension/bik",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.255Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.255Z",
  "containers": []
}