{
  "slug": "bms",
  "extension": "bms",
  "name": "QuickBMS Script",
  "summary": "Learn about .BMS files and view a list of programs that open them.",
  "developer": "Mike Zuurman",
  "programs": {
    "windows": [
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "GitHub Atom",
        "url": "https://fileinfo.com/software/github/atom"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12405&b=1"
      },
      {
        "name": "GNU Emacs",
        "url": "https://fileinfo.com/software/gnu/emacs"
      },
      {
        "name": "Vim",
        "url": "https://fileinfo.com/software/vim/vim"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Luigi Auriemma's QuickBMS allows gamers and other users to extract files from archives saved in proprietary file formats. To do so, users must first create or download a BMS script that can correctly read the archive format. The user then inputs the BMS script into QuickBMS alongside a relevant archive, allowing QuickBMS to extract all the files the archive contains.",
      "Gamers have created many BMS scripts that let themselves and others extract images, meshes, models, audio files, and more from popular games' asset archives. Each BMS script is written in the BMS language, which was originally developed for use with MultiEx Commander (MexCom), another file extraction tool. However, QuickBMS is now more popular than MultiEx Commander, so most gamers recognize BMS files as QuickBMS scripts."
    ]
  },
  "more_information": {
    "description": [
      "A BMS file is a plain text script used by QuickBMS, a file extraction tool used primarily to extract assets from video game asset archives. It contains directives written in the Binary MultiEx Script (BMS) language. You can open a BMS file in any text editor; you can run the script it contains in QuickBMS."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a BMS file in any text editor, such as Microsoft Notepad (Windows), Apple TextEdit (Mac), or GitHub Atom (cross-platform). Doing so allows you to edit the BMS directives the file contains.",
      "To use a BMS file with QuickBMS (Windows), open the program and, when the Select BMS script window appears, navigate to and select your BMS file. Then, when the Select input archives window appears, select an archive that your BMS script is meant to be used with. QuickBMS will use your BMS script to extract the files your archive contains."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/bms_12405.png",
      "alt": "Screenshot of a .bms file in Microsoft Visual Studio Code",
      "caption": "BMS file open in Microsoft Visual Studio Code"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/bms_3170.png",
      "alt": "Screenshot of a .bms file in Apple TextEdit 1",
      "caption": "BMS file open in Apple TextEdit 1"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/bms",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.357Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.357Z",
  "category": "other",
  "related": [],
  "containers": []
}