{
  "slug": "bmson",
  "extension": "bmson",
  "name": "Be-Music Source JSON Song File",
  "summary": "Learn about .BMSON files and view a list of programs that open them.",
  "developer": "Bmson Team",
  "programs": {
    "windows": [
      {
        "name": "Microsoft Visual Studio Code",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13511&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Be-Music Source, or BMS, is a song format used by Konami Beatmania and several derivative rhythm games, such as Bemuse. Each BMS song is saved as a directory that contains a plain text BMS file and several audio files (often .WAV or .OGG files). The BMS file defines the song's music, note positions, sound effects (such as the sounds played when a player succeeds or fails at hitting a note), and other information.",
      "To make creating, editing, and loading BMS songs easier, various rhythm game enthusiasts collaborated to create the BMSON format. BMSON files serve the same function as and are similar to BMS files, except that they use JSON formatting. Formatting data using JSON, rather than an arbitrary standard, makes it easier for song creators and rhythm game developers to parse the data that BMSON files contain."
    ]
  },
  "more_information": {
    "description": [
      "A BMSON file is a data file used to format and play a song in Bemusic Bemuse and other rhythm games. It is saved in a JSON-based variant of the standard .BMS format. BMSON files are typically found in Bemuse song folders, alongside accompanying audio files and other song assets."
    ]
  },
  "how_to_open": {
    "instructions": [
      "If you want to edit a BMSON file, it is best to open it with a dedicated BMSON editor, such as BmsONE (Windows, Mac). This will allow you to more easily view, understand, and edit the data your BMSON file contains. However, you can also open and edit a BMSON file with Microsoft Visual Studio Code or any other text editor.",
      "You can play BMSON format songs in Bemusic Bemuse (Web) and raindrop (Windows, Linux)."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/bmson",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.357Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.357Z",
  "category": "other",
  "related": [],
  "containers": []
}