{
  "slug": "bplist",
  "extension": "bplist",
  "name": "BeatSaber Playlist",
  "summary": "Learn about .BPLIST files and view a list of programs that open them.",
  "developer": "Beat Games",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13084&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "In Beat Saber, players slice blocks with sabers in time to music. The game is available for Windows and the Oculus Quest. It has a very active modding community, which creates mods that add features to the game.",
      "Various Beat Saber mods allow players to download, create, and install playlists saved as BPLIST files. To use BPLIST files with the Windows version of Beat Saber, players (or a playlist-related Beat Saber mod) must place the files in the following directory:",
      "~/​Beat Saber/​Playlists"
    ]
  },
  "more_information": {
    "description": [
      "A BPLIST file is a playlist used by Beat Games Beat Saber, a VR rhythm game. It contains a list of songs a player can play through in order. To use BPLIST files, players must also download the songs the BPLIST file references (if they do not possess them already)."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a BPLIST file with Beat Saber (Windows). The easiest way to use BPLIST files is to download and install a playlist-related Beat Saber mod, such as PlaylistManager, and use it to install your BPLIST files. PlaylistManager is available from Beat Saber Mod Assistant's Mods menu.",
      "Otherwise, you can use BPLIST files by placing them in the following directory and opening them in Beat Saber:",
      "~/​Beat Saber/​Playlists",
      "However, remember that you must also manually download any missing songs the playlist contains."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/bplist",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.617Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.617Z"
}