{
  "slug": "br",
  "extension": "br",
  "name": "Brotli Compressed File",
  "summary": "Learn about .BR files and view a list of programs that open them.",
  "developer": "Google",
  "category": "web",
  "category_slug": "web",
  "programs": {
    "windows": [
      {
        "name": "PeaZip",
        "url": "https://fileinfo.com/software/peazip/peazip"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10325&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "In 2013, Google developers created the Brotli compression algorithm. This algorithm is an improvement to the zopfli compression algorithm, also developed by Google. Brotli uses a variant of the LZ77 compression algorithm and Huffman coding to compress files roughly 20 percent more efficiently than zopfli.",
      "Initially, Brotli was meant to be used specifically to compress WOFF web font files. Google later generalized the compression algorithm so it can be used to compress other web assets. As the BR format became more useful and used, various web browsers introduced support for loading assets from BR files.",
      "NOTE: In the past, Brotli-compressed files were saved with the .bro extension."
    ]
  },
  "more_information": {
    "description": [
      "A BR file is a compressed web file generated by applying the open source data compression algorithm, Brotli. It is used to store webpage assets such as stylesheets (CSS), images (SVG), XML, and scripting files (JS). Modern day websites, such as Chrome and Firefox, use BR files to reduce the page loading time, resulting in better user experience.",
      "A BR file is a file compressed using Brotli, an open-source data compression algorithm. It likely contains compressed webpage assets, such as .WOFF, .CSS, .JS, or .SVG files. Compressing these assets with Brotli allows web browsers, such as Google Chrome, Safari, Microsoft Edge, and Mozilla Firefox, to load them more quickly."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can decompress a BR file and extract the asset(s) it contains with Brotli (multiplatform), PeaZip (Windows, Linux), or myl7 Brotli Encode/Decode Tool (Web)."
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/web/br/index.html",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-01T22:32:42.256Z"
    },
    {
      "url": "https://fileinfo.com/extension/br",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.256Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.256Z",
  "containers": []
}