{
  "slug": "bxt",
  "extension": "bxt",
  "name": "Balabolka Text Document",
  "summary": "Learn about .BXT files and view a list of programs that open them.",
  "developer": "Ilya Morozov",
  "programs": {
    "windows": [
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Vim",
        "url": "https://fileinfo.com/software/vim/vim"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12173&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "TTS programs allow users to convert text documents into audio versions of those documents. For example, a user could copy an essay's text into a TTS program, convert the text into a .WAV file, and then listen to the essay on their smartphone.",
      "Balabolka is a free TTS program. Users can type or paste text into Balabolka and then adjust the pitch, rate, voice, and volume with which Balabolka \"reads\" the text. They can then convert the text into an audio file, using the settings they specified.",
      "If a user wants to save the text they've entered into Balabolka, as well as their current audio settings, they can do so by saving their document as a BXT file. BXT files contain XML-formatted text that specifies a document's audio settings and content. They also contain a record of any pronunciation corrections the user has added to the document."
    ]
  },
  "more_information": {
    "description": [
      "A BXT file is a text document created by Balabolka, a free text-to-speech (TTS) program. It contains XML-formatted text that Balabolka uses to translate a text document into a \"spoken\" audio file. In addition to normal text content, BXT files contain settings that control the pitch, rate, voice, and volume Balabolka uses when converting the file's text to audio."
    ]
  },
  "how_to_open": {
    "instructions": [
      "BXT files are meant to be opened in Balabolka (Windows). To open a BXT file in Balabolka, select File → Open... from the program's menu bar. Then, navigate to and open your BXT file.",
      "If you do not have access to Balabolka, you can also open a BXT file in any text editor, such as Microsoft Notepad (Windows), Apple TextEdit (Mac), or Vim (Linux). This will allow you to view and edit the text your BXT file contains.",
      "To convert a BXT file to a WAV file in Balabolka, select File → Save Audio File.... You will then be able to create a WAV (or other audio format) version of your BXT file."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/bxt_12173.png",
      "alt": "Screenshot of a .bxt file in Balabolka",
      "caption": "BXT file open in Balabolka"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/bxt",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.628Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.628Z"
}