{
  "slug": "c3dp",
  "extension": "c3dp",
  "name": "Crocotile 3D Prefab File",
  "summary": "Learn about .C3DP files and view a list of programs that open them.",
  "developer": "Alex Hanson-White",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13881&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Users typically encounter C3DP files when saving custom objects for later use or when downloading shared prefabs from other creators. When a user imports a C3DP file into Crocotile 3D, the software reconstructs the prefab exactly as it was designed, including any associated layers or object properties. This functionality enables users to populate their scenes with complex or repetitive structures without having to manually build them each time.",
      "NOTE: You can create a C3DP file by selecting File → Export Scene and choosing .c3dp from the \"File Format\" dropdown menu. At least one object must be present in the current scene or the .c3dp format option will be greyed out."
    ]
  },
  "more_information": {
    "description": [
      "A C3DP file is a prefab file used by Crocotile 3D, a software application for creating 3D environments with a tile-based system. C3DP files store pre-built 3D objects, structures, or tile arrangements in the JSON standard that can be reused across multiple scenes. Crocotile 3D users, including game developers, hobbyists, and designers, often use C3DP files to speed up level creation and maintain consistency across projects."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open C3DP files with Crocotile 3D. To open a C3DP file, select Scene → Import Prefab Object.",
      "Since C3DP files store plain text information, you can also open them with a text editor. However, opening them with a text editor will not display the same results as opening them with Crocotile 3D."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/c3dp",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.371Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.371Z",
  "category": "other",
  "related": [],
  "containers": []
}