{
  "slug": "cbddlp",
  "extension": "cbddlp",
  "name": "Chitubox Sliced 3D Model",
  "summary": "Learn about .CBDDLP files and view a list of programs that open them.",
  "developer": "Chitubox",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11527&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Chitubox is a slicer program that allows 3D printer users to arrange, edit, and slice one or more 3D models for printing. Slicing a model converts that model into a set of instructions that a 3D printer uses to print the model (by printing \"slices\" of the model atop or alongside each other, until the whole model is printed).",
      "By default, Chitubox saves sliced 3D models in the CBDDLP format. Several 3D printers with which Chitubox is packaged (such as the original Elegoo Mars and Mars Pro) can print only models saved in the CBDDLP format. Others, however, can print only models saved in Chitubox's .CTB format. (You can use Chitubox to convert sliced models from one format to the other, by following the How to convert instructions detailed below.)"
    ]
  },
  "more_information": {
    "description": [
      "A CBDDLP is a sliced 3D model created by Chitubox, a program used to prepare 3D models for 3D printing. Using a CBDDLP file, various 3D printers can print the object the file describes. From within Chitubox, users can save 3D models as CBDDLP files and transfer the files to connected 3D printers."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a CBDDLP file with Chitubox Basic (available for free) or Chitubox Pro (available as a free trial). To do so:",
      "Select Chitubox's sandwich menu (located in the program's upper-left corner).",
      "Click Open....",
      "Navigate to and open your CBDDLP file.",
      "After opening your CBDDLP file in Chitubox, you can transfer the file to a connected 3D printer, edit the model(s) the file contains, or convert the file to another sliced 3D model format."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "To convert a CBDDLP file to another sliced 3D model format:",
      "Open the file with Chitubox.",
      "Click Back, then Slice, then Save.",
      "You'll then be able to save your CBDDLP file in any of the slicing formats listed here."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/cbddlp_11527.png",
      "alt": "Screenshot of a .cbddlp file in Chitubox",
      "caption": "CBDDLP file open in Chitubox"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/cbddlp",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.635Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.635Z"
}