{
  "slug": "ceol",
  "extension": "ceol",
  "name": "Bosca Ceoil Song",
  "summary": "Learn about .CEOL files and view a list of programs that open them.",
  "developer": "Terry Cavanagh",
  "programs": {
    "windows": [
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13369&b=1"
      },
      {
        "name": "Vim",
        "url": "https://fileinfo.com/software/vim/vim"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Bosca Ceoil is a novice-friendly music tracker that aspiring chiptune song creators can use to create and play music. To create music, users place notes within one or more musical patterns. They then arrange those patterns into a song. (Users can also adjust several other settings while creating music, including the instrument, chord, and scale used to play a pattern, the number of notes each pattern contains, and each song's beats per minute.)",
      "From Bosca Ceoil's main menu, users can save the songs they've created as CEOL files. Each CEOL file is a plain text file that consists of a comma-delimited list of numbers. This list of numbers specifies the notes and patterns a song contains, the order in which they're arranged, and all of a song's other settings."
    ]
  },
  "more_information": {
    "description": [
      "A CEOL file is a song created by Bosca Ceoil, a multiplatform music tracker. It contains plain text data that specifies the song's notes, patterns, instruments, beats per minute, and other data. When opened in Bosca Ceoil, CEOL files appear as a grid of editable musical notes."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a CEOL file with Bosca Ceoil. To do so:",
      "Go to the program's FILE menu.",
      "Select LOAD .ceol.",
      "Navigate to and open your CEOL file.",
      "The song your CEOL file describes will then appear in Bosca Ceoil.",
      "While you can also open a CEOL file with Microsoft Notepad, Apple TextEdit, or any other text editor, to view the plain text data it contains, doing so is not as useful as opening the file with Bosca Ceoil."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "You can use Bosca Ceoil to export the song a CEOL file describes as a .WAV (WAVE Audio) or .MID (MIDI Music Data) file. To do so, open your CEOL file and then select the EXPORT... button found on Bosca Ceoil's FILE menu."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/ceol_13369.png",
      "alt": "Screenshot of a .ceol file in Bosca Ceoil",
      "caption": "CEOL file open in Bosca Ceoil"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/ceol",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.380Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.380Z",
  "category": "other",
  "related": [],
  "containers": []
}