{
  "slug": "cfm",
  "extension": "cfm",
  "name": "ColdFusion Markup File",
  "summary": "Learn about .CFM files and view a list of programs that open them.",
  "developer": "Adobe Systems",
  "category": "web",
  "category_slug": "web",
  "programs": {
    "windows": [
      {
        "name": "Adobe ColdFusion Builder",
        "url": "https://fileinfo.com/software/adobe/coldfusion_builder"
      },
      {
        "name": "Microsoft Visual Studio Code",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      },
      {
        "name": "GitHub Atom",
        "url": "https://fileinfo.com/software/github/atom"
      },
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple Textedit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "File Viewer Plus",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=320"
      },
      {
        "name": "Adobe Dreamweaver 2021",
        "url": "https://fileinfo.com/software/adobe/dreamweaver"
      },
      {
        "name": "Sublime Text",
        "url": "https://fileinfo.com/software/sublime_hq/sublime_text"
      }
    ]
  },
  "technical_info": {
    "content": [
      "You will most likely encounter CFM files only if you are a web developer and integrating ColdFusion functionality into your webpages. Developers typically use Adobe ColdFusion Builder for creating applications in CFML. However, they may use a variety of other CFML IDEs and editors, such as Adobe Dreamweaver, CFEclipse (plug-in for Eclipse), and CFBrackets (extension for the Brackets source code editor).",
      "CFML is a tag-based language that features a syntax similar to HTML and XML. It includes unique tags and support for custom tags for creating dynamic web applications. All CFML tags begin with cf.",
      "NOTE: ColdFusion was originally developed by Allaire, then later bought by Macromedia, and is now distributed by Adobe Systems after acquiring Macromedia in 2005."
    ]
  },
  "more_information": {
    "description": [
      "The web pages and files used in Cold Fusion Markup Language contain extensions of CFM and are named CFM web pages. This web development scripting language runs on Google App Engine, .NET framework, and JVM. It can contain a programming language or code of the language. When any of its pages are accessed by the user, the webserver of ColdFusion executes it. CFScript (that is close to JavaScript) or tags can be used to write CFML. CFML can be used for generating other languages apart from HTML like CSS, JavaScript, XML, and more.\n\nThe use of this language and tags that it supports is mostly in developing dynamic web applications The files can be directly run in the browser online if any error occurs during offline usage of the platform of development of the application.\n\nCFML works in a way that specific server file extensions (.cfc, .cfm) are given for processing to the CFML engine. If the engines are based on Java, it is achieved using Java servlets. The engine of CFML only processes functions and tags and it returns functions and text outside the CFML tags to the webserver without any change.",
      "A CFM file is a webpage that contains ColdFusion code, or CFML (ColdFusion Markup Language). It is dynamically executed by a ColdFusion web server when the page is accessed by a user. CFM files can run ColdFusion applications and scripts written in CFScript and may reference database information, generate forms, and create PDF reports on the fly."
    ]
  },
  "how_to_open": {
    "instructions": [
      "ColdFusion developers typically open and edit CFM files with Adobe ColdFusion Builder. You can also open and edit CFM files with source code editors, such as Microsoft Visual Studio Code or GitHub Atom, and plain text editors, such as Microsoft Notepad or Apple Textedit. Source code editors included helpful tools that make reading and editing ColdFusion code easier."
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/cfm_320.png",
      "alt": "Screenshot of a .cfm file in Adobe ColdFusion Builder 2018",
      "caption": "CFM file open in Adobe ColdFusion Builder 2018"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/cfm_13561.png",
      "alt": "Screenshot of a .cfm file in dBASE 2019",
      "caption": "CFM file open in dBASE 2019"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/web/cfm/index.html",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-01T22:32:42.257Z"
    },
    {
      "url": "https://fileinfo.com/extension/cfm",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.257Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.257Z",
  "containers": []
}