{
  "slug": "cheat",
  "extension": "cheat",
  "name": "Navi Cheatsheet",
  "summary": "Learn about .CHEAT files and view a list of programs that open them.",
  "developer": "denisdoro",
  "programs": {
    "windows": [
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "GitHub Atom",
        "url": "https://fileinfo.com/software/github/atom"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12278&b=1"
      },
      {
        "name": "Vim",
        "url": "https://fileinfo.com/software/vim/vim"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Navi is a cross-platform terminal application that allows users to load, browse, and execute many simple terminal commands. Using navi saves users the trouble of remembering and correctly typing commands. Instead, the user can enter navi in their terminal, browse the list of commands navi contains, and press Enter to execute the command they need.",
      "Navi retrieves commands from cheatsheets, which are plain text files saved with the .cheat extension. Typically, a CHEAT file contains a set of related commands, as well as descriptions of what those commands do. Each CHEAT file starts with the % character and one or more tags used to categorize the commands the file contains. Each individual command's description begins with the # character.",
      "While the majority of CHEAT files are available from navi's GitHub page (linked below), other GitHub repositories contain additional CHEAT files. You can import these CHEAT files into navi using the instructions in the Cheatsheet repositories section of navi's documentation."
    ]
  },
  "more_information": {
    "description": [
      "A CHEAT file is a terminal command list used by navi, an application that lets users quickly execute one-line terminal commands. It contains plain text used to load and execute one or more commands. Navi imports default CHEAT files the first time you run it; additional CHEAT files are available online."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Because CHEAT files are plain text files, you can open and edit them in any text editor, such as Microsoft Notepad (Windows), Apple TextEdit (Mac), or GitHub Atom (cross-platform).",
      "If you want to use a CHEAT file with navi (cross-platform), you must import the file from a GitHub repository or place the file in navi's navi directory. Then, the commands your CHEAT file contains will appear in navi."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/cheat_12278.png",
      "alt": "Screenshot of a .cheat file in GitHub Atom",
      "caption": "CHEAT file open in GitHub Atom"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/cheat",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.382Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.382Z",
  "category": "other",
  "related": [],
  "containers": []
}