{
  "slug": "clipchamp",
  "extension": "clipchamp",
  "name": "Microsoft Clipchamp Project",
  "summary": "Learn about .CLIPCHAMP files and view a list of programs that open them.",
  "developer": "Microsoft",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13791&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "The Australian company Clipchamp Pty Ltd initially developed Clipchamp, and Microsoft acquired it in 2021 to integrate it into its suite of productivity tools. It is a video editing application used by content creators, educators, businesses, and casual users looking to create social media videos, presentations, and marketing content.",
      "The software is available for Windows and as an online tool in personal and work versions. While each version saves projects as CLIPCHAMP files, only the Work version allows users to share CLIPCHAMP files for collaborative editing by selecting the Share button in the upper-right corner of the program. Users can then choose recipients to invite to modify the project via OneDrive or SharePoint (recipients can click the link to download the CLIPCHAMP project and open it with Clipchamp)."
    ]
  },
  "more_information": {
    "description": [
      "A CLIPCHAMP file is a project created by Microsoft Clipchamp, a video editor for casual and professional users. It contains information about a project, including the placement of elements on the timeline, edits, the location of imported media assets, and settings. Clipchamp creates CLIPCHAMP files when users save their projects to preserve their progress, which users eventually export to an .MP4 or .GIF file to share after editing."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open CLIPCHAMP files with the Windows desktop and web versions of Microsoft Clipchamp. While Clipchamp is available for iOS devices, this version does not support CLIPCHAMP files."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "Microsoft Clipchamp can convert CLIPCHAMP files to .MP4 video and .GIF image files. To do so, select the Export button in the upper-right corner of the program."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/clipchamp_13791.png",
      "alt": "Screenshot of a .clipchamp file in Microsoft Clipchamp 3",
      "caption": "CLIPCHAMP file open in Microsoft Clipchamp 3"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/clipchamp",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.651Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.651Z"
}