{
  "slug": "cmrec",
  "extension": "cmrec",
  "name": "Camtasia Recording",
  "summary": "Learn about .CMREC files and view a list of programs that open them.",
  "developer": "TechSmith",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=5625&b=1"
      },
      {
        "name": "TechSmith Camtasia",
        "url": "https://fileinfo.com/software/techsmith/camtasia"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Camtasia is a screen recording and video editing program available for Windows and Mac PCs. Typically, professionals use Camtasia to create software demos and tutorials or record presentations.",
      "Previous versions of Camtasia for Mac saved users' screen recordings and accompanying audio as CMREC files. These files were stored in and could be played as part of CMPROJ files.",
      "In version 2.8.0, Camtasia for Mac began saving screen recordings as .TREC files. In version 2020, Camtasia for Mac stopped supporting the CMREC format."
    ]
  },
  "more_information": {
    "description": [
      "A CMREC file is a screen recording created by the Mac version of TechSmith Camtasia. It contains audio and video captured during a screen recording session. CMREC files are typically saved as part of .CMPROJ screen recording project files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a CMREC file in previous versions of Camtasia for Mac (by selecting File → Import → Media). Camtasia 2019 is the last version that supports CMREC files."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "You can use the Mac versions of Camtasia 2019 and earlier versions to convert a CMREC file to the .MP4 format. (If you own a newer version of Camtasia, you can download these previous versions for free from TechSmith's website.) To do so, open the file in Camtasia, and then export it as an MP4 file."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/cmrec",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.390Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.390Z",
  "category": "other",
  "related": [],
  "containers": []
}