{
  "slug": "cms",
  "extension": "cms",
  "name": "Connection Manager Service Profile",
  "summary": "Learn about .CMS files and view a list of programs that open them.",
  "developer": "Microsoft",
  "category": "web",
  "category_slug": "web",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=6625&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "You most likely will only encounter CMS profile files if you are a network administrator that sets up a Connection Manager for the purpose of remotely connecting to a network, such as an organizational network protected by a VPN server or an Internet Service Provider (ISP). For example, a network administrator at a company may set up an employee with Connection Manager to allow him to access the company network from a remote location.",
      "The network administrator creates a profile with the CMAK application and packages it with other configuration files, such as .CMP and .INF files in an .EXE file. The administrator then distributes the package to a remote user, which allows him to connect to the network."
    ]
  },
  "more_information": {
    "description": [
      "A CMS file is a web page published by content management systems (CMS) that is used to generate documents for publishing over the internet. It is generated at run time and published to the web server for getting LIVE on the internet. A website generated with a CMS is most oftenly based on a theme based template that is used to create the CMS files. Since the same template is used for generating all the pages, all the pages are same in look and feel. CMS files can be stored in draft mode on the system in which case they are not published to the internet.\n\nCMS files can be opened with CMS applications such as JOOMLA and Web Browser.",
      "A CMS file contains a profile used by Windows Connection Manager, a software package that allows system administrators to set up remote connections for users. It stores configuration information about a user's operating system and permissions that enable a connection between a remote user and a network. CMS files are generated by the Connection Manager Administrator Kit (CMAK) program."
    ]
  },
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/web/cms/",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-02T02:43:26.504Z"
    },
    {
      "url": "https://fileinfo.com/extension/cms",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.504Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.504Z"
}