{
  "slug": "cp9",
  "extension": "cp9",
  "name": "ChoicePoint Encrypted File",
  "summary": "Learn about .CP9 files and view a list of programs that open them.",
  "developer": "ChoicePoint",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1525&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "ChoicePoint was a data aggregation company that provided background checks, identity verification, and risk management services. It served clients in law enforcement, insurance, and corporate security before being acquired by LexisNexis in 2008. One of its offerings was CP Email Reporting Security, a software tool that protects sensitive information transmitted via email.",
      "CP Email Reporting Security encrypted reports and attachments as CP9 files, ensuring only authorized recipients could access the contents. Users who encountered CP9 files were usually HR professionals, legal teams, compliance officers, or insurance agents working with sensitive personal or organizational data."
    ]
  },
  "more_information": {
    "description": [
      "A CP9 file is an email attachment encrypted using software developed by ChoicePoint in partnership with the National Safety Alliance (NSA). It contains encrypted confidential data, such as employee background checks, compliance reports, or risk assessments. CP9 files protect sensitive information by making their contents unreadable without the correct decryption software."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open CP9 files with ChoicePoint’s CP Email Reporting Security. However, the software is no longer developed."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/cp9",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.660Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.660Z"
}