{
  "slug": "crypt15",
  "extension": "crypt15",
  "name": "WhatsApp Encrypted Database File",
  "summary": "Learn about .CRYPT15 files and view a list of programs that open them.",
  "developer": "WhatsApp",
  "category": "database",
  "category_slug": "database",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12454&b=1"
      },
      {
        "name": "WhatsApp Messenger",
        "url": "https://fileinfo.com/software/whatsapp_inc/whatsapp_messenger"
      }
    ]
  },
  "technical_info": {
    "content": [
      "WhatsApp is a multiplatform messaging app used by people in many countries to communicate with each other. The app provides encryption options to secure users' messages, including encrypting backups of messages it periodically generates.",
      "Throughout the years, WhatsApp has utilized various algorithms to encrypt backup databases, with each one signified by the file extension appended onto the database (.DB file). For example, WhatsApp utilizing CRYPT15 encryption creates a .db.crypt15 file.",
      "Examples of other file extensions include .CRYPT14, .CRYPT12, and .CRYPT10. WhatsApp began saving message history backups as CRYPT15 files in late 2021.",
      "WhatsApp stores CRYPT15 files in the following directory:",
      "/​sdcard/​WhatsApp/​Databases",
      "If your data is not stored on an SD card, you may see \"internal storage\" or \"main storage\" instead of \"sdcard.\"",
      "Also, you may find multiple CRYPT15 database files in your Databases folder, with YYYY-MM-DD dates included in their filenames. WhatsApp employs this naming convention because it creates new backup files periodically (the dates in these files' filenames represent when the app created them).",
      "If you need to reclaim storage space on your SD card, you can delete dated CRYPT15 files without affecting WhatsApp or your message history. However, you should always keep the most recent one or two CRYPT15 files in the event you need to restore your message history."
    ]
  },
  "more_information": {
    "description": [
      "The .crypt15 file format is associated with WhatsApp’s encrypted backup files stored on Google Drive or local storage. It is part of the WhatsApp Crypt series (e.g., .crypt14, .crypt12, etc.), which encrypts chat backups for security.",
      "A CRYPT15 file is an encrypted database backup created by the Android version of WhatsApp Messenger. It contains messages a user has sent and received through WhatsApp and is encrypted with 256-bit AES encryption for security purposes."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To open or decrypt .crypt15 files, you need:\n\nA backup file (msgstore.db.crypt15).The decryption key (from internal storage).A decryption tool like WhatsApp Viewer or custom scripts that use the key.",
      "You can decrypt a CRYPT15 database with WhatsApp Crypt Tools (Windows), but you must provide the key file or 64-digit key. You can find your WhatsApp key file, which stores your CRYPT15 file's encryption key, in the following location:",
      "/data/data/com.whatsapp/files/key",
      "You can also migrate or restore your WhatsApp message history on an Android device with a CRYPT15 file. To do so, you must rename your most recent CRYPT15 file to msgstore.db.crypt15, uninstall and reinstall WhatsApp, and then tap RESTORE in the app when prompted."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "If you have the decryption key:Use third-party tools like WhatsApp Viewer (for older versions).Use a Python script (if you understand cryptography and Android forensics)."
    ]
  },
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/database/crypt15/",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-02T02:43:26.505Z"
    },
    {
      "url": "https://fileinfo.com/extension/crypt15",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.505Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.505Z"
}