{
  "slug": "csworld",
  "extension": "csworld",
  "name": "Terraria for Android 1.2 World",
  "summary": "Learn about .CSWORLD files and view a list of programs that open them.",
  "developer": "Re-Logic",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13458&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Re-Logic Terraria is a 2D action-adventure and sandbox construction game, in which players explore, battle, and build within an open game world. Players create and load Terraria worlds from the game's Select World screen.",
      "In versions 1.2 and below of Terraria for Android, players can save the worlds they create to their Google Drive account, as CSWORLD files. This allows them to easily save and transfer worlds between Android devices.",
      "However, in version 1.3 of Terraria for Android, the game began saving worlds as WLD files, to be consistent with the desktop versions of Terraria. When a player upgrades from version 1.2 to version 1.3 or above, Terraria for Android typically automatically converts their CSWORLD files to WLD files. However, players can also convert CSWORLD files to WLD files themselves, by following the steps below."
    ]
  },
  "more_information": {
    "description": [
      "A CSWORLD file is a game world created by versions 1.2 and below of Terraria for Android. It defines the world's terrain, monsters, items, and other objects. In versions 1.3 and above of Terraria for Android, CSWORLD files have been replaced by .WLD files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "If you are using version 1.3 or above of Terraria for Android, place your CSWORLD file in the following directory:",
      "~/​Android/​data/​com.and.games505.TerrariaPaid/​OldSaves/​Worlds",
      "The next time you open Terraria, the game will convert your CSWORLD file to a WLD file, and allow you to select the world your CSWORLD file contains.",
      "If you are using version 1.2 or below of Terraria for Android, you can open your CSWORLD file by placing it in your Google Drive, connecting your Google Drive account to Terraria, and then selecting your CSWORLD file from Terraria's Select World screen."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/csworld",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.665Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.665Z"
}