{
  "slug": "csz",
  "extension": "csz",
  "name": "Cornerstone Document Template",
  "summary": "Learn about .CSZ files and view a list of programs that open them.",
  "developer": "IDEXX",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11738&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Cornerstone is an application that assists veterinary clinics in various administrative tasks, such as scheduling appointments, tracking inventory, reporting, invoicing, and diagnostic integration. Document templates allow users to create reusable documents for saving data entry time and maintaining consistent content among staff members.",
      "To create a CSZ document template with Cornerstone follow these steps:",
      "Select Documents → Templates in the Lists menu.",
      "Click New, select Document template or Text only template.",
      "Select Edit Properties to set the properties of the template.",
      "When you are finished setting the properties, click OK to save the template and leave the Cornerstone Editor. You can also select Save or Save As to save the template but remain in the Cornerstone Editor."
    ]
  },
  "more_information": {
    "description": [
      "A CSZ file is a document template created by IDEXX Cornerstone, a veterinary administrative management application. It contains a default document layout that includes various elements, such as text input fields, checkboxes, tables, images, and bookmarks. CSZ files are primarily used to create medical notes and client correspondence with similar formatting."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can only open CSZ files with IDEXX Cornerstone. To open the CSZ file with Cornerstone, select Import Document Templates in the Tools menu, navigate to the location of the CSZ file, then click Import Template."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/csz",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.666Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.666Z"
}