{
  "slug": "cuid",
  "extension": "cuid",
  "name": "Baidu SDK File",
  "summary": "Learn about .CUID files and view a list of programs that open them.",
  "developer": "Baidu",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11710&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Baidu is a Chinese technology company that is, essentially, China's answer to Google. In 2013 and 2014, some Android-based smartphone users began discovering new baidu folders on their phones, even though they had not installed any apps created by Baidu. Collaboratively, these users discovered that the baidu folder and the baidu.cuid file contained within it were created by apps that used Baidu's software development kit to interact with Baidu services, in much the same way that apps use Facebook or Google's SDKs to interact with those services.",
      "However, because Baidu is a Chinese-owned company that has ties to China's government, many non-Chinese users felt uncomfortable using apps that could, at least theoretically, send their device and location data to Baidu. This led many users to delete the apps that created the baidu folder and baidu.cuid file from their phones.",
      "NOTE: Apps that use the Baidu SDK also often create .CUID2 files on users' devices."
    ]
  },
  "more_information": {
    "description": [
      "A CUID file is a potential spyware file created by ES File Explorer, WeChat, or another app that uses the Baidu software development kit (SDK). It is encrypted, and its contents are unknown. CUID files always appear in a folder named baidu."
    ]
  },
  "how_to_open": {
    "instructions": [
      "At this time, there is no known program that opens Baidu CUID files. According to users' reports, you can delete the baidu folder and baidu.cuid file it contains from your smartphone without affecting your phone or its installed apps."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/cuid",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.402Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.402Z",
  "category": "other",
  "related": [],
  "containers": []
}