{
  "slug": "cur",
  "extension": "cur",
  "name": "Windows Cursor Image",
  "summary": "Learn about .CUR files and view a list of programs that open them.",
  "developer": "N/A",
  "category": "image",
  "category_slug": "image",
  "programs": {
    "windows": [
      {
        "name": "Inkscape",
        "url": "https://fileinfo.com/software/inkscape/inkscape"
      },
      {
        "name": "File Viewer Plus",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=360"
      },
      {
        "name": "Microsoft Windows",
        "url": "https://fileinfo.com/software/microsoft/windows"
      },
      {
        "name": "Snap Converter",
        "url": "https://sharpened.com/software/mac/snap_converter/"
      }
    ]
  },
  "technical_info": {
    "content": [
      "CUR files are binary system files that can be found on devices functioning on Microsoft Windows operating system. CUR pointer images come in different standard sizes like 16×16, 32×32, etc. CUR files are very similar to the ICO files; both of them consist of small stationary images. Only the extension of CUR and ICO files are different. Furthermore, the explanation of a hotspot in the header of the CUR file is distinct from the ICO file. The hotspot interprets the pixel offset from the top left corner to the place where you are pointing the mouse. Windows systems are still using the CUR files, but now the animated cursors usually have the file extension ANI instead of CUR.",
      "Windows includes several default CUR files that determine your cursor's appearance in various scenarios, such as when the system is busy, you are resizing a window, or you are editing text. These CUR files are stored in the following location:",
      "C:/​Windows/​Cursors",
      "You can also install custom CUR files, which you may have created yourself or downloaded online. Custom Windows themes (.THEME files) often contain custom CUR files.",
      "To use a CUR file as a Windows cursor image:",
      "Open the Windows Control Panel and search for \"mouse.\"",
      "Select Change how the mouse pointer looks.",
      "In the Mouse Properties window's Pointers menu, select the cursor image you'd like to modify.",
      "Click Browse... and then navigate to and select your CUR file.",
      "Click Apply to apply your changes.",
      "NOTE: CUR files always contain static cursor images. Animated cursor images are saved as .ANI files."
    ]
  },
  "more_information": {
    "description": [
      "A CUR file is a static Microsoft Windows cursor file format. Basically, they are stationary images identical to ICO (icon) files in every way except the extension. Both CUR and ICO are established on the basis of the Device-Independent Bitmap DIB (Device-Independent Bitmap) specification. Default, as well as custom cursor such as Windows mouse pointer for Windows operating system, are stored in CUR files. It can be an arrow for normal use, a spinning hourglass to demonstrate waiting periods, or an I-bar for text editing. CUR files come along with the installation pack of the custom desktop themes to ensure that the Windows cursor matches the custom desktop theme.",
      "A CUR file is a Microsoft Windows cursor image. It is used to change the appearance of the Windows mouse pointer. Typical CUR images include arrows (for general use), hourglasses (to represent when a file or program is loading), and I-bars (for text editing)."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a CUR file with Axialis CursorWorkshop (Windows), RealWorld Cursor Editor (Windows), or Inkscape (multiplatform), to view and edit the image it contains."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "You can use Inkscape, RealWorld Cursor Editor, or Axialis CursorWorkshop to convert CUR images to other formats. For example, Axialis CursorWorkshop can convert CUR images to the following formats:",
      ".BMP - Bitmap Image",
      ".PSD - Adobe Photoshop Document",
      ".PNG - Portable Network Graphic",
      ".GIF - Graphical Interchange Format",
      ".JP2 - JPEG 2000 Core Image"
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ],
  "images": [
    {
      "url": "https://docs.fileformat.com/image/cur.png",
      "alt": "CUR File Format"
    },
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/cur_360.png",
      "alt": "Screenshot of a .cur file in Microsoft Windows Control Panel",
      "caption": "CUR file open in Microsoft Windows Control Panel"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/image/cur/index.html",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-01T22:32:42.260Z"
    },
    {
      "url": "https://fileinfo.com/extension/cur",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.260Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.260Z",
  "containers": []
}