{
  "slug": "cw",
  "extension": "cw",
  "name": "ClassiCube Map",
  "summary": "Learn about .CW files and view a list of programs that open them.",
  "developer": "ClassiCube Team",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13554&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "ClassiCube is a nostalgic Minecraft clone that includes only the game's original features. It is available for all major platforms, including PC and mobile platforms.",
      "When a player begins playing ClassiCube, the game creates a fresh game world. If a player wants to save their progress in a game world, they can open ClassiCube's game menu (by pressing Esc) and select Save level.... This allows the player to save their world's current state as a CW file.",
      "If a player wants to resume playing in a saved world, they can do so by loading the corresponding CW file from ClassiCube's game menu. Players also sometimes share their CW files online, to allow others to adventure within those game worlds."
    ]
  },
  "more_information": {
    "description": [
      "A CW file is a game world created and used by ClassiCube, a Minecraft-like sandbox game. While playing ClassiCube, players can save their current world as a CW file. This allows them to resume playing in that world in the future, and to share the world with other players."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a CW file in ClassiCube to play in the game world it contains. For example, to load a CW file in ClassiCube's single-player mode:",
      "Start a single-player game.",
      "Open the game menu (by pressing Esc).",
      "Click Load level....",
      "Navigate to and open your CW file.",
      "ClassiCube will then load the world your CW file contains."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/cw_13554.png",
      "alt": "Screenshot of a .cw file in ClassiCube",
      "caption": "CW file open in ClassiCube"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/cw",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.671Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.671Z"
}