{
  "slug": "cxi",
  "extension": "cxi",
  "name": "Nintendo 3DS Executable Image",
  "summary": "Learn about .CXI files and view a list of programs that open them.",
  "developer": "N/A",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11684&b=1"
      },
      {
        "name": "Applied Biosystems FMAT 8100 HTS System",
        "url": "https://fileinfo.com/software/applied_biosystems/fmat_8100_hts_system"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Gamers who want to play Nintendo 3DS games on their computer or other non-3DS devices use emulators to simulate the 3DS on those devices. Before they can load games into an emulator, players must either create emulator-compatible game files themselves, by \"dumping\" data from their game cartridges into packaged game files, or download pre-packaged game files from the Internet. Game files packaged for 3DS emulators can be saved using a number of file formats and extensions, including .3ds, .CIA, and .cxi.",
      "Notably, the programs Braindump and GodMode9 allow 3DS players to create CXI files from games installed on their Nintendo 3DS. Players then use these files to play 3DS games using the Lime3DS (replaced Citra) Nintendo 3DS emulator.",
      "NOTE: While either 3DS or CXI files can be used to play games in Lime3DS, the files' contents are not the same. Most importantly, some 3DS files may contain multiple CXI files, only one of which is used to install and play a game. The others contain non-essential game data, such as the game's manual and updates."
    ]
  },
  "more_information": {
    "description": [
      "A CXI file is an executable file used to play a Nintendo 3DS game in a 3DS emulator. It contains a disk image that is a copy of a Nintendo 3DS game. CXI files are similar to, though not the same as, .3DS files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To play the Nintendo 3DS game contained within a CXI file, first download and open Lime3DS. Then, from the emulator's menu bar, select File → Load File. Navigate to and select your CXI file; the game it contains will open in Lime3DS."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/cxi",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.405Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.405Z",
  "category": "other",
  "related": [],
  "containers": []
}