{
  "slug": "d64",
  "extension": "d64",
  "name": "Commodore 64 1541 Disk Image",
  "summary": "Learn about .D64 files and view a list of programs that open them.",
  "developer": "N/A",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1630&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Computing enthusiasts utilize emulation software to run games or other programs from old, discontinued computers on their modern computers. For example, nostalgic computing enthusiasts who enjoyed Commodore 64 programs use emulation software, such as Vice, WinVICE, and CCS64, to emulate Commodore 64 disk images and run those programs.",
      "To get the disk images from Commodore 64 games and programs into a format they can play on their modern computer, enthusiasts dump disk image data from cartridges or floppy disks onto their computer and save the disk image in individual files, such as D64 or .PRG files to load with an emulator. While some computing enthusiasts may acquire actual Commodore 64 disk images and dump them, most acquire D64 files by downloading them from websites.",
      "NOTE: The D64 format is one of several formats utilized to store Commodore 64 disk images. Some others include .G41 and .X64."
    ]
  },
  "more_information": {
    "description": [
      "A D64 file contains a disk image dumped from a Commodore 64 1541 floppy disk. It stores information about a Commodore 64 game or program in D64 format, which consists of 256-byte sectors organized in multiple tracks. D64 files are supported by emulators of Commodore 64 (C64), a popular personal computer from the 1980s."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open D64 files with various emulators, including Vice (multiplatform), WinVICE (Windows), and CCS64 (Windows). You can also upload D64 files to C64 online emulator or run them with Joerg Jahnke Mobile C64 in Android."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/d64_1630.png",
      "alt": "Screenshot of a .d64 file in VICE 3",
      "caption": "D64 file open in VICE 3"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/d64",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.407Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.407Z",
  "category": "other",
  "related": [],
  "containers": []
}