{
  "slug": "dcb",
  "extension": "dcb",
  "name": "Concordance Database File",
  "summary": "Learn about .DCB files and view a list of programs that open them.",
  "developer": "LexisNexis",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=6651&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Concordance databases can store various kinds of digital documents, including email messages, Word documents, PDFs, and scanned paper documents. The software can also index the documents so that they are searchable. This helps in the litigation process when having to research and recall hundreds or thousands of documents.",
      "A Concordance database is actually made up of several different files. The DCB file stores the structure of the data while other files store the data records, indexes, and other database information. When a DCB file is opened, Concordance locates the other database files and loads them automatically.",
      "NOTE: DCB stands for \"data control block,\" which describes the function of the file type, namely, that the structure of the data is controlled in the DCB file."
    ]
  },
  "more_information": {
    "description": [
      "Database file created by Concordance, a litigation document management program; saves the database structure but does not save the actual data records; acts as the database \"project file\" because the database loads when it is opened."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/dcb",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.680Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.680Z"
}