{
  "slug": "ddoc",
  "extension": "ddoc",
  "name": "DigiDoc Signature File",
  "summary": "Learn about .DDOC files and view a list of programs that open them.",
  "developer": "RIA",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10453&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "The DDOC format is based on the ETSI TS 101 903 standard called XML Advanced Electronic Signatures (XAdES). It is developed by Riigi Infosüsteemi Amet (RIA), which is the Information System Authority of Estonia. DDOC is one of three digital signature and cryptographic file formats in the DigiDoc family, along with the .CDOC and .BDOC files.",
      "Several versions (1.1, 1.2, and 1.3) of the DDOC format have been developed since its initial release. These versions are necessary in order to remain compatible with other digital signature systems and international standards. The DDOC format was the first generation DigiDoc format and was succeeded by the BDOC format.",
      "NOTE: The qDigiDoc software can be used to digitally sign documents using an employee's ID card or mobile ID and can open, save, and verify documents with digital signatures. The software is open source and can be downloaded for free through the links below."
    ]
  },
  "more_information": {
    "description": [
      "A DDOC file is a digital document (DigiDoc) created with qDigiDoc, an open source software used to authenticate Estonian and Finnish government issued ID cards and signed documents. It contains files that have been signed by a government employee, along with the signatures related to each file, which includes the certificate, validity confirmation, and the validity confirmation service certificate."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/ddoc",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.681Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.681Z"
}