{
  "slug": "dfont",
  "extension": "dfont",
  "name": "Mac OS X Data Fork Font",
  "summary": "Learn about .DFONT files and view a list of programs that open them.",
  "developer": "Apple",
  "programs": {
    "windows": [
      {
        "name": "FontForge",
        "url": "https://fileinfo.com/software/fontforge/fontforge"
      },
      {
        "name": "File Viewer Plus",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=384"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Previous Macintosh operating systems allowed files to store data in two entities: the resource fork and the data fork. In Mac OS X, files can store data in only the data entity. To allow TrueType fonts that used the two-entity structure to continue working in OS X, Apple reformatted them to use the one-entity structure. These reformatted fonts are referred to as data fork TrueType fonts, or DFONT files.",
      "In the past, OS X's Courier, Helvetica, Monaco, Symbol, Times, and ZapfDingbats fonts were all saved as DFONT files. These fonts have all since been deprecated, with some being replaced by typical TrueType font (.TTF) or OpenType font (.OTF) files.",
      "NOTE: Because DFONT files are saved in a Mac-specific file format, you cannot install them in Windows or Linux."
    ]
  },
  "more_information": {
    "description": [
      "A DFONT file is a font used by Mac OS X (now macOS). It is a TrueType font saved in an OS X-specific format. In the past, some OS X system fonts were saved as DFONT files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a DFONT file with Apple Font Book (Mac) or FontForge (multiplatform). To install the font a DFONT file contains, open it in Apple Font Book and select the Install Font button."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "You can use FontForge or DfontSplitter to convert DFONT files to other font formats. FontForge can convert DFONT files to the .TTF (TrueType font) or .OTF (OpenType font) format. DfontSplitter can convert DFONT files to the TTF format."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/dfont_384.png",
      "alt": "Screenshot of a .dfont file in Apple Font Book",
      "caption": "DFONT file open in Apple Font Book"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/dfont",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.686Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.686Z"
}