{
  "slug": "dharma",
  "extension": "dharma",
  "name": "Dharma Ransomware Encrypted File",
  "summary": "Learn about .DHARMA files and view a list of programs that open them.",
  "developer": "N/A",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11557&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Dharma ransomware is a type of malware utilized by cybercriminals that encrypts a user's files. After the ransomware takes the files hostage, it forces the victim to pay the perpetrator to unlock the files. It may be introduced to a victim's computer through spam emails with malicious links or file attachments, free file hosting websites, and Peer to Peer (P2P) networks.",
      "When the ransomware runs on a user's computer, it encrypts files on the computer and adds the .dharma extension onto the names of the files. It also appends an [[email protected]] or [[email protected]] email address with the extension. The types of files typically targeted include spreadsheets, documents, images, videos, and backup files, such as .DOCX, .PDF, .JPG, .AVI, and .DB files. For example, a spreadsheet.xlsx file becomes spreadsheet.xlsx.[[email protected]].dharma or spreadsheet.xlsx.[[email protected]].dharma.",
      "The virus then generates a README.txt file in each folder that stores an encrypted file on the user's computer. The README.txt file contains brief instructions explaining the hostile takeover of the user's files and how the user can is meant to recover their files by paying a ransom payment."
    ]
  },
  "more_information": {
    "description": [
      "A file with a .dharma extension is a file that has been encrypted by the Dharma virus, which is a variant of Crysis ransomware. It is encrypted so it is not possible to open the file by simply changing the .dharma file extension."
    ]
  },
  "how_to_open": {
    "instructions": [
      "No known program can restore DHARMA files to their original state. The best way to recover your files is to retrieve them from a recent backup or perform a System Restore to a point before your computer was infected."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/dharma",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.417Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.417Z",
  "category": "other",
  "related": [],
  "containers": []
}