{
  "slug": "dhv",
  "extension": "dhv",
  "name": "Husqvarna Viking Embroidery Design File",
  "summary": "Learn about .DHV files and view a list of programs that open them.",
  "developer": "SGSB Co. Ltd.",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12042&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "The DHV format is one of several embroidery formats developed by Husqvarna, along with .HUS .SHV, .VIP, .VP3 and .VP4. DHV is supported by several embroidery machine models, which include Husqvarna Viking Designer SE, Husqvarna Viking Designer Topaz 50, and Husqvarna Viking Designer Epic. Since the DHV format is older, it comes with several limitations including a 5\" high x 7\" wide embroidery area.",
      "To transfer a DHV file to a sewing machine, insert a USB storage device in your computer. Then, copy the DHV file from your computer and move it to the connected storage device via File Explorer in Windows or Finder in macOS. After transferring the file, eject the storage device from your computer and insert it into the Husqvarna Viking sewing machine to transfer the design to embroider it onto the material.",
      "NOTE: Husqvarna Viking sewing machines and software developed by SGSB Co. Ltd."
    ]
  },
  "more_information": {
    "description": [
      "A DHV file is an embroidery design file used by various Husqvarna Viking sewing machines. It contains a stitch pattern that directs a sewing machine how to embroider a design on a piece of fabric. DHV files are often used to save monograms, alphabets, and other custom patterns."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open DHV files with various applications, including software included with the Husqvarna sewing machine, BALARAD Embird Studio (Windows), and PREMIER+ Embroidery (multiplatform). You can also convert DHV files with PREMIER+ Embroidery to other embroidery and image formats, such as .PES, .JEF, .JPG, and .PNG."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/dhv",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.417Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.417Z",
  "category": "other",
  "related": [],
  "containers": []
}