{
  "slug": "dictionary",
  "extension": "dictionary",
  "name": "Apple Dictionary",
  "summary": "Learn about .DICTIONARY files and view a list of programs that open them.",
  "developer": "Apple",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12864&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Apple Dictionary is a tool for macOS users to look up definitions for words and phrases quickly. The app comes with multiple dictionaries, such as New Oxford American Dictionary and Wikipedia, that you can enable, disable, or order based on your preference.",
      "The Dictionary app comes packaged with many dictionaries, each with a DICTIONARY file named after the dictionary. For example, the name of the Apple Dictionary DICTIONARY file is Apple Dictionary.dictionary.",
      "While the Dictionary app comes bundled with many dictionaries, developers can build custom dictionaries with the Dictionary Development Kit. To create a DICTIONARY file, developers need to create a dictionary source file, prepare a style sheet, edit the property list file (.PLIST), and add any resources required by their dictionary.",
      "Different Mac operating systems store DICTIONARY files in different locations. For example, macOS Monterrey stores DICTIONARY files in the following location:",
      "/​System/​Library/​AssetsV2/​com_apple_MobileAsset_DictionaryServices_dictionaryOSX",
      "However, earlier versions of macOS store DICTIONARY files in the /​System/​Library/​Dictionary location."
    ]
  },
  "more_information": {
    "description": [
      "A DICTIONARY file is a dictionary used by Apple Dictionary, an app bundled with macOS. It is a macOS package that contains multiple files, which store dictionary information, such as words and phrases and their definitions and images."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You should not attempt to open DICTIONARY files manually. Instead, the Apple Dictionary app automatically loads the information in the DICTIONARY file.",
      "In macOS, you can right-click a DICTIONARY file and select Show Package Contents to view the package's directories and files with Apple Finder. For example, each DICTIONARY file contains a binary Body.data file in the Dictionary Contents/​Resources/​ directory that stores the list of words in the dictionary.",
      "NOTE: Modifying the contents in a DICTIONARY file may break the dictionary."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/dictionary_12864.jpg",
      "alt": "Screenshot of a .dictionary file in Apple Dictionary 2",
      "caption": "DICTIONARY file open in Apple Dictionary 2"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/dictionary_12864-2.jpg",
      "alt": "DICTIONARY file open in Apple Finder",
      "caption": "DICTIONARY file open in Apple Finder"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/dictionary",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.418Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.418Z",
  "category": "other",
  "related": [],
  "containers": []
}