{
  "slug": "dino",
  "extension": "dino",
  "name": "Dinopixel Drawing",
  "summary": "Learn about .DINO files and view a list of programs that open them.",
  "developer": "Dinopixel",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13711&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Dinopixel is a free browser-based app that allows you to create pixel artwork you can upload to the Dinopixel gallery to share with other users. For example, you can create a rhinoceros artwork, save it as a DINO file to preserve your progress, and then convert it to a PNG image to share with others.",
      "To create a DINO file to save your artwork, select OPEN/SAVE FILE and then choose SAVE AS .dino. The app then downloads the DINO file to your downloads folder."
    ]
  },
  "more_information": {
    "description": [
      "A DINO file is a drawing created by Dinopixel, an online pixel art maker. It contains information about the drawing, such as the canvas dimensions, pencil strokes, and colors, in the Dinopixel (DINO) format. Users save drawings as DINO files to preserve their progress (downloading them to their computer), then upload them back into the Dinopixel program in the web browser to continue editing them."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a DINO file with Dinopixel in a web browser. To open a DINO file with Dinopixel, select OPEN/SAVE FILE and then choose LOAD .dino. You will then be prompted to choose the DINO file you would like to upload from your computer to the website."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "Dinopixel can convert DINO files to the Portable Network Graphic (.PNG) format. To convert a DINO file with Dinopixel, select DOWNLOAD."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/dino_13711.png",
      "alt": "Screenshot of a .dino file in Dinopixel",
      "caption": "DINO file open in Dinopixel"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/dino",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.689Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.689Z"
}