{
  "slug": "disc",
  "extension": "disc",
  "name": "Roxio Toast Document",
  "summary": "Learn about .DISC files and view a list of programs that open them.",
  "developer": "Roxio",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=6199&b=1"
      },
      {
        "name": "Roxio Toast 20",
        "url": "https://fileinfo.com/software/roxio/toast"
      }
    ]
  },
  "technical_info": {
    "content": [
      "DISC files are the native format for Toast projects. These project files can be used for burning optical discs as well as disc image files. The native extension used for Toast disc images is .TOAST.",
      "To save a project as a DISC file with Toast, select File → Save. To open a project saved in a DISC file, select File → Open.",
      "The following are the different types of projects DISC files may store:",
      "Data - Burn any file or folder on a disc for archiving, transferring, backing up purposes.",
      "Audio - Burn audio to a CD, music DVD or MP3 disc to be played in a computer, home or car stereo, or DVD player.",
      "Video - Create VCDs, SVCDs, DVD-Video discs, Blu-ray or HighDef DVDs to be used in a computer or DVD player.",
      "Copy - Copy a CD, DVD, BD, or disc image file.",
      "Conversion - Convert a video file to another video format."
    ]
  },
  "more_information": {
    "description": [
      "A DISC file is a project file created by Roxio Toast, a multimedia disc authoring and burning application. It contains the saved settings for a data, audio, video, or, copy, or conversion disc project. DISC files also include references to the locations of data or multimedia files included in the project and burning settings."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/disc_6199.png",
      "alt": "Screenshot of a .disc file in Roxio Toast 18 Titanium",
      "caption": "DISC file open in Roxio Toast 18 Titanium"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/disc",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.690Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.690Z"
}