{
  "slug": "discordbot",
  "extension": "discordbot",
  "name": "Discord Bot Maker Project",
  "summary": "Learn about .DISCORDBOT files and view a list of programs that open them.",
  "developer": "Robert Borghese",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11586&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Discord is a text, voice, and video chat program that provides gamers and other social communities with a place to hang out online. Discord contains a series of public and private servers, organized by topic, that users can join to chat with their friends, express their undying love for Taylor Swift, or gather for a socially-distanced paint night, among other activities.",
      "Advanced users can create and add bots to their Discord servers. These bots perform various functions, such as automatically welcoming new members to a server, moderating content, and rewarding a server's most active members. Discord Bot Maker allows developers to create these types of bots, and they open their bot creation projects by selecting the bot's project.discordbot file."
    ]
  },
  "more_information": {
    "description": [
      "A DISCORDBOT file is a project file created by Discord Bot Maker, a bot development tool for Discord. It does not contain any data, but is a shortcut used to open a project in Discord Bot Maker. DISCORDBOT files are always named project.discordbot and are located in the main directory of a bot project, along with other folders and files used by the project."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To open a DISCORDBOT file in Discord Bot Maker, click the File button located in the program's menu bar. Then, select Open Existing Project, navigate to your bot's main directory, and open your project.discordbot file."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/discordbot",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.419Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.419Z",
  "category": "other",
  "related": [],
  "containers": []
}