{
  "slug": "dltemp",
  "extension": "dltemp",
  "name": "UC Browser Temporary Download File",
  "summary": "Learn about .DLTEMP files and view a list of programs that open them.",
  "developer": "UCWeb",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10438&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "DLTEMP files are used by UC Browser to resume a file download in case the download is interrupted. When a download begins, the DLTEMP file appears in the UC Browser download folder (\"UCDownloads\") along with the file being downloaded.",
      "If your file download is interrupted and you may be unable to resume the download. If this is the case, you can copy the DLTEMP file and the file being downloaded and place them in another location using a file manager. Then delete the two files in \"UCDownloads\" folder and place the DLTEMP file and the file being downloaded that you copied back into the \"UCDownloads\" folder. You should then be able to resume the download from the point it was interrupted.",
      "NOTE: The UC Browser was originally developed by UCWeb, a Chinese company, but is owned by Alibaba Group."
    ]
  },
  "more_information": {
    "description": [
      "A DLTEMP file is a temporary download created by UC Browser, a mobile web browser for Android, iOS, and Chrome OS. It contains information about an incomplete download of a file. DLTEMP files can be clicked in order to resume a paused download of a file."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/dltemp",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.422Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.422Z",
  "category": "other",
  "related": [],
  "containers": []
}