{
  "slug": "dmg",
  "extension": "dmg",
  "name": "Apple Disk Image",
  "summary": "Learn about .DMG files and view a list of programs that open them.",
  "developer": "Apple",
  "category": "compression",
  "category_slug": "compression",
  "programs": {
    "windows": [
      {
        "name": "Bitberry File Opener",
        "url": "https://www.bitberry.com/file-opener/"
      },
      {
        "name": "PowerArchiver",
        "url": "https://file.org/free-download/powerarchiver"
      },
      {
        "name": "PowerISO",
        "url": "https://file.org/free-download/poweriso"
      },
      {
        "name": "HFSExplorer",
        "url": "https://file.org/free-download/hfsexplorer-a-tool-for-accessing-hfs-hfs-hfsx-hard-drives-and-disk-images"
      },
      {
        "name": "IsoBuster",
        "url": "https://file.org/free-download/isobuster"
      },
      {
        "name": "PeaZip",
        "url": "https://file.org/free-download/peazip"
      },
      {
        "name": "7-Zip",
        "url": "https://file.org/free-download/7-zip"
      },
      {
        "name": "iTunes",
        "url": "https://file.org/free-download/itunes"
      },
      {
        "name": "UltraISO",
        "url": "https://file.org/free-download/ultraiso-premium-edition"
      },
      {
        "name": "DMG Extractor",
        "url": "https://file.org/free-download/dmg-extractor"
      },
      {
        "name": "TransMac",
        "url": "https://file.org/free-download/transmac"
      },
      {
        "name": "Adobe Acrobat",
        "url": "https://file.org/free-download/adobe-acrobat"
      },
      {
        "name": "Open and view .DMG files with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=24&b=1"
      },
      {
        "name": "File Viewer Plus",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=24"
      },
      {
        "name": "Apple Disk Utility",
        "url": "https://fileinfo.com/software/apple/disk_utility"
      },
      {
        "name": "Roxio Toast 20",
        "url": "https://fileinfo.com/software/roxio/toast"
      },
      {
        "name": "Incredible Bee Archiver",
        "url": "https://fileinfo.com/software/incredible_bee/archiver"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Specially generated for Macintosh computersDeveloped by AppleFile format is BinaryFile Category is Disk Image FileSupported Program is MacOSCan contain a partition tableMay contain any kind of filesystem like HFS+Functionality to compress the images",
      "The DMG format is one of several file types software developers utilize to distribute macOS applications outside of Apple's App Store. Other options include .APP files compressed in a .ZIP archive, .PKG files, and .IMG files (more common in Mac OS Classic and replaced by DMG files).",
      "DMG is a prevalent distribution format because it maintains the disk image's integrity via checksums. When opening a DMG file to begin the installation process, the DiskImageMounter utility bundled with macOS verifies the checksum to ensure the disk image has not been modified or corrupted during the distribution. This process is valuable for developers and end-users to make sure they install an untampered application.",
      "NOTE: In rare cases, Mac users may package files instead of macOS apps in a DMG file for transfer purposes. In these cases, the DMG file functions as a virtual flash drive recipients can mount to retrieve the stored files."
    ]
  },
  "more_information": {
    "description": [
      "A file with a .dmg extension is an Apple Disk Image file and known as a Mac OS X Disk Image file. DMG file format is the most widely used disk image file intended to allocate applications and files among the Apple PCs. It’s very convenient to mount DMG files into a virtual drive or can use Apple Disk Utility software to open and view the content of DMG file format. The old version of IMG files used in Mac OS Classic is substituted by the DMG file format. DMG files are generated for Mac users and are not supported by Windows OS but users can access the DMG content in the Windows Operating system by using compression and decompression tools like 7-Zip, Pea Zip, etc. The DMG file extension is also used by the Oracle Export and Ingress tool for scrapheap files kept in the binary format of the Oracle database.",
      "A DMG file is a mountable disk image primarily used to distribute software to the macOS operating system. Mac users typically download the file from the Internet and then double-click it to install an application on their computer."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a DMG file by double-clicking the file. After clicking the file, the DiskImageMounter utility bundled with macOS verifies the disk image's integrity. After confirming the disk image, the utility mounts the virtual disk and places it on your desktop and in an Apple Finder window as if it was a CD or a USB flash drive inserted into the computer.",
      "You can double-click the program icon (actually an APP file) in the Finder window to run the app. Or, you can drag the program icon to the Applications folder icon in that same window to move it to the Applications directory on your computer, then double-click the app directly from the Applications directory to run it.",
      "You no longer need the DMG file after installing the software stored in the DMG file. Therefore, you can delete the DMG file after installing the software.",
      "DMG files are Mac-specific and not intended for use in Windows. Therefore, if you download a DMG file from a website, check the site for a Windows version of the software (most likely distributed as an .EXE or .MSI file).",
      "Although you cannot install software distributed via DMG files in Windows, several Windows applications can extract their contents, including 7-Zip and PeaZip. You can also attempt to convert the DMG file to an .IMG file with the DMG2IMG utility."
    ]
  },
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ],
  "images": [
    {
      "url": "https://assets.file.org/images/fileorg-logo-440x90-4-8b.png",
      "alt": "File.org logo"
    },
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/dmg_24.png",
      "alt": "Screenshot of a .dmg file in macOS Big Sur (11.5.2)",
      "caption": "DMG file open in macOS Big Sur (11.5.2)"
    }
  ],
  "sources": [
    {
      "url": "https://file.org",
      "source": "file.org",
      "retrieved_at": "2025-11-02T02:43:26.377Z"
    },
    {
      "url": "https://docs.fileformat.com/compression/dmg/",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-02T02:43:26.377Z"
    },
    {
      "url": "https://fileinfo.com/extension/dmg",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.377Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.377Z"
}