{
  "slug": "dmo",
  "extension": "dmo",
  "name": "Cube 2 Demo File",
  "summary": "Learn about .DMO files and view a list of programs that open them.",
  "developer": "Wouter van Oortmerssen",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=5922&b=1"
      },
      {
        "name": "Cube 2: Sauerbraten",
        "url": "https://fileinfo.com/software/cube_2_sauerbraten/cube_2_sauerbraten"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Cube 2: Sauerbraten is a free first-person shooter game running the Cube 2 game engine that is most commonly associated with the DMO file type. When you load the game, you can enable \"/recorddemo 1\" before playing a match or deathmatch so the game records it to a DMO file.",
      "After the match, game clients can download the DMO file from the host server that recorded it. Once downloaded, the game can play the files in local mode, allowing you to view the demo from any angle in the game.",
      "NOTE: DMO files do not contain video data. If you would like to record a video session, choose an alternate recording function (e.g., Cube 2: Sauerbraten's movie recording functionality allows you to record a match as an .AVI file)."
    ]
  },
  "more_information": {
    "description": [
      "A DMO file is a game demo file created by various games using the Cube 2 game engine, such as Red Eclipse, Blood Frontier, and Cube 2: Sauerbraten. It contains a recording of a single or multiplayer session, including player movements, game events, and a chat log, in the Cube 2 Demo (DMO) format. DMO files enable games running the Cube 2 engine to replicate an exact replay of the match."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open DMO files with the Cube 2 game engine games that created them. For example, Cube 2: Sauerbraten can play DMO files the game created to store a game demo."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/dmo",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.423Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.423Z",
  "category": "other",
  "related": [],
  "containers": []
}