{
  "slug": "dnl",
  "extension": "dnl",
  "name": "DNAML eBook",
  "summary": "Learn about .DNL files and view a list of programs that open them.",
  "developer": "DNAML",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=4315&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "In the past, authors and publishers used DNAML DeskTop Author to create copy-protected eBooks (and other digital publications), which could be opened only by authorized users with DNL Reader. These eBooks were saved as DNL files.",
      "While most DNL files contain eBooks, some instead contain digital catalogs, presentations, cards, brochures, or photo albums. In some cases, authors and publishers packaged DNL files with DNL Reader in standalone Windows executable (.EXE) files, which users could simply double-click to read the publication the DNL file contained."
    ]
  },
  "more_information": {
    "description": [
      "A DNL file is an eBook created and used by DNAML desktop publishing and eReader software. It contains text, images, and navigation information saved in a bundled, compact format. DNL files are copy-protected using Digital Rights Management (DRM), so only authorized users and programs can open them."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Unfortunately, DNAML DNL Reader and DeskTop Author are both discontinued and no longer available for purchase or download. If you still have access to these programs, you can use them to open your DNL file and view the publication it contains. Otherwise, you likely will not be able to open your DNL file."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/dnl",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.425Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.425Z",
  "category": "other",
  "related": [],
  "containers": []
}