{
  "slug": "dsn",
  "extension": "dsn",
  "name": "Database Source Name File",
  "summary": "Learn about .DSN files and view a list of programs that open them.",
  "developer": "N/A",
  "category": "database",
  "category_slug": "database",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=4314&b=1"
      },
      {
        "name": "Altium Designer",
        "url": "https://fileinfo.com/software/altium/designer"
      }
    ]
  },
  "technical_info": {
    "content": [
      "DSN files are typically stored in a plain text files. However, some client database programs use entries in the Windows registry instead of DSN files.",
      "The ODBC Data Source Administrator included in Windows can be used to create DSN files. It can be found within the Windows Control Panel under Administrative Tools, or in the Start Menu by selecting Programs → Administrative Tools → Data Sources (ODBC)."
    ]
  },
  "more_information": {
    "description": [
      "DSN stands for “Data Source Name” and it is a file format used to store database connection information. DSN files are typically used in conjunction with ODBC (Open Database Connectivity) and allow for easy access to a specific database by providing the necessary information to connect to it, such as the server name, username, and password. The file is usually in plain text and can be created and edited using a text editor. It can be used on various operating systems like Windows, Linux and Mac.",
      "A DSN file is a data file used by various database client programs to connect to a database. It describes properties, such as the data source name and directory, the connection driver, the server address, user ID, and password. DSN files are used by ODBC drivers to connect to a specified database, such as a SQL Server or Microsoft Access database."
    ]
  },
  "how_to_open": {
    "instructions": [
      "A DSN file is a plain text file that stores information used to connect to a database, such as the server name, username, and password. It is typically used in conjunction with ODBC (Open Database Connectivity) to provide easy access to a specific database.\n\nTo open and view the contents of a DSN file, you can use any text editor such as Notepad, Sublime Text, Atom, etc. These programs will allow you to open the DSN file and view the connection information stored within it.\n\nHowever, to use the DSN file to connect to a database and execute operations like SELECT, INSERT, UPDATE, DELETE etc, a program with ODBC support, such as a programming language like Python, Java, C# or a database management tool like Microsoft Access, SQL Server Management Studio is required. These programs can use the information in the DSN file to connect to the database and perform the desired operation."
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/database/dsn/index.html",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-01T22:32:42.264Z"
    },
    {
      "url": "https://fileinfo.com/extension/dsn",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.264Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.264Z",
  "containers": []
}