{
  "slug": "dv2",
  "extension": "dv2",
  "name": "Divinity 2 Data File",
  "summary": "Learn about .DV2 files and view a list of programs that open them.",
  "developer": "Larian Studios",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=5941&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Most Divinity II players will never encounter or need to open the game's DV2 files. However, players looking to localize Divinity II to a different language may want to extract the embedded game data that DV2 files contain.",
      "For example, the DV2 file Dialogs.dv2 contains game dialog saved in embedded .dialog files. Players localizing Divinity II will want to access and modify the game's .dialog files, which they can do only after extracting them from Dialogs.dv2.",
      "NOTE: DV2 files are located in Divinity II's /​Data/​Win32/​Packed/​ directory."
    ]
  },
  "more_information": {
    "description": [
      "A DV2 file is a game data file used by Divinity II: Ego Draconis, a fantasy role-playing game, as well as other versions of Divinity II. It contains text, speech, and lip-sync settings for in-game dialog. DV2 files may also store other game data, such as textures."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Divinity II players have created utilities that allow them to extract files from and repack DV2 files. The utilities are named dv2_u.exe and dv2_pak.exe.",
      "Those looking to download the utilities are most likely to be able to find them on the XeNTax Game Research Forum. However, users often share the utilities using file-sharing websites that periodically delete hosted files. So, it may be difficult to find a current download link."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/dv2",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.705Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.705Z"
}