{
  "slug": "dwi",
  "extension": "dwi",
  "name": "Dance With Intensity Step File",
  "summary": "Learn about .DWI files and view a list of programs that open them.",
  "developer": "SimWolf",
  "programs": {
    "windows": [
      {
        "name": "StepMania",
        "url": "https://fileinfo.com/software/stepmania/stepmania"
      },
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=3078&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Dance With Intensity (DWI) is a Dance Dance Revolution (DDR) clone available for Windows. Just like in DDR, DWI players complete levels by pressing buttons or performing dance steps in time to music.",
      "Each DWI level is comprised of multiple files: an .MP3 or other audio file containing the level's song, .PNG images specifying the level's background and artist image, and a DWI file specifying the level's steps. When DWI loads a level, it uses that level's DWI file to show arrow prompts on-screen and judge whether a player successfully responded to the prompts.",
      "Players often share and download DWI levels online. These levels are usually packaged as .ZIP files, which contain all the level files detailed above. To use one of these levels with DWI, players must expand the ZIP file and place the resulting directory in DWI's Songs → Default directory. Players can also import DWI levels, and thus DWI files, into some other DDR clones.",
      "NOTE: Some DWI files also contain animations shown in place of a level's typical PNG background."
    ]
  },
  "more_information": {
    "description": [
      "A DWI file is a step file used by Dance With Intensity and other rhythm games. It specifies the step prompts to be shown in a Dance With Intensity level. DWI files are typically stored in a level directory, alongside the song, background image, and artist image with which they are used."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a DWI file with Dance With Intensity (Windows), StepMania (multiplatform), or BeatX (Android). For example, to use a DWI file with Dance With Intensity, place the directory that contains your DWI file (and its accompanying song) in Dance With Intensity's Songs → Default directory.",
      "You can also open a DWI file with Microsoft Notepad (Windows), Apple TextEdit (Mac), or any other text editor, to view the level data and metadata the file contains."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/dwi_3078.png",
      "alt": "Screenshot of a .dwi file in Dance With Intensity",
      "caption": "DWI file open in Dance With Intensity"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/dwi_3078-2.png",
      "alt": "DWI file open with Microsoft Notepad",
      "caption": "DWI file open with Microsoft Notepad"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/dwi",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.706Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.706Z"
}