{
  "slug": "e64",
  "extension": "e64",
  "name": "Linux Bootloader Support Module",
  "summary": "Learn about .E64 files and view a list of programs that open them.",
  "developer": "N/A",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13859&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "System administrators and developers working with custom Linux distributions are the primary users who may encounter E64 files. In most cases, everyday users will not interact with them, since the operating system manages these files automatically. You can find E64 files in the following directory:",
      "/​slax/​boot/​EFI/​boot/​"
    ]
  },
  "more_information": {
    "description": [
      "An E64 file is a binary data file that contains configuration data that various Linux-based operating systems reference to start up and load essential components. It is part of the bootloader system, which prepares the operating system to run when a computer powers on. In Linux, bootloaders such as SYSLINUX and its derivatives use files like E64 to execute low-level startup instructions."
    ]
  },
  "how_to_open": {
    "instructions": [
      "E64 files are not meant to be opened or edited directly by users. Because these files are in binary format, they are not human-readable and are processed directly by the system firmware or operating system kernel. Modifying or deleting an E64 file can prevent the system from booting properly."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/e64",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.709Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.709Z"
}