{
  "slug": "eappx",
  "extension": "eappx",
  "name": "Encrypted Windows App Package",
  "summary": "Learn about .EAPPX files and view a list of programs that open them.",
  "developer": "Microsoft",
  "programs": {
    "windows": [
      {
        "name": "Microsoft Visual Studio",
        "url": "https://fileinfo.com/software/microsoft/visual_studio"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12868&b=1"
      },
      {
        "name": "Microsoft Visual Studio 2022",
        "url": "https://fileinfo.com/software/microsoft/visual_studio"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Before submitting Windows applications to the Microsoft Store, developers package all the files and information needed to install the app in an APPX or .MSIX file. Optionally, developers can choose to encrypt APPX packages they create, using a custom key file that contains a hexadecimal encryption key. For example, video game developers often encrypt their APPX packages, so players cannot access the packages' contents or easily install pirated versions of games.",
      "Encrypted APPX packages are saved as EAPPX files. Unlike APPX files, users cannot install the app an EAPPX file contains by double-clicking the file. Instead, users must use Windows PowerShell to install the app an EAPPX file contains."
    ]
  },
  "more_information": {
    "description": [
      "An EAPPX is an encrypted Windows app package (.APPX file). It contains all the metadata, files, and credentials needed to install a Windows program, stored in an encrypted, Zip-compressed package. EAPPX files are encrypted so users cannot extract and view their contents."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To install the app an EAPPX file contains, run Microsoft Windows PowerShell as an administrator, navigate to the directory that contains your EAPPX file, and enter the following command:",
      "add-appxpackage YourFileName.eappx",
      "If you have access to the encryption key used to create your EAPPX file, you can decrypt the file and convert it to a normal .APPX file. To decrypt an EAPPX file, install Microsoft Visual Studio if you do not have it already. Then, open a Command Prompt window and enter the following command:",
      "MakeAppx.exe decrypt /p YourFileName.appx /ep YourFileName.eappx /kf YourEncryptionKey.txt"
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/eappx",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.709Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.709Z"
}