{
  "slug": "eddx",
  "extension": "eddx",
  "name": "Edraw XML FIle",
  "summary": "Learn about .EDDX files and view a list of programs that open them.",
  "developer": "EdrawSoft",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10515&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "When you create a new diagram and save it in Edraw Max, the program saves it in the EDDX format by default. You can also choose to save it as an .HTML, .PDF, .DOCX, .PPTX, .XLSX, .VSDX, .PNG, .JPG, or .GIF file. If you choose to save it as an EDDX file, the diagram is saved in an XML format. To create an EDDX file, File → New, add your information, and select File → Save or Save As.",
      "When you create a new diagram you can begin with a blank drawing or you can start from one of the many templates included with Edraw Max. Some of the template categories include Business Diagram, Engineering, Database, Fashion Designer, Industrial Automation, Software, Science, and Project Management.",
      "NOTE: The EDDX format was introduced in 2013 with the release of version 7.3 of Edraw Max. It features a better compression ratio, which leads to a smaller file size than .EDX files."
    ]
  },
  "more_information": {
    "description": [
      "An EDDX file is a file created by Edraw Max and Network Diagram Maker, professional diagram applications. It contains a diagram, which may include text, shapes, arrows, connectors, or images. EDDX files are used to create various types of diagrams, such as flowcharts, mind maps, floor plans, infographics, and organizational charts."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/eddx_10515.jpg",
      "alt": "Screenshot of a .eddx file in EdrawSoft Edraw Max 8.6",
      "caption": "EDDX file open in EdrawSoft Edraw Max 8.6"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/eddx",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.712Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.712Z"
}