{
  "slug": "edge",
  "extension": "edge",
  "name": "Adobe Edge Project File",
  "summary": "Learn about .EDGE files and view a list of programs that open them.",
  "developer": "Adobe Systems",
  "category": "web",
  "category_slug": "web",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=6715&b=1"
      },
      {
        "name": "Adobe Edge Animate CC",
        "url": "https://fileinfo.com/software/adobe/edge_animate"
      }
    ]
  },
  "technical_info": {
    "content": [
      "When you save an Edge project, you actually save an HTML file. The EDGE file is created during the save process along with HTML, JavaScript, and CSS files, as well as a directory named edge_includes that contains JavaScript libraries for the Web animation. When you open an EDGE file, it opens the Web page (.HTML file) and the animation timeline for editing.",
      "Edge differs from other Adobe products since it does not create animated Web content using Adobe's Flash technology. Instead, it uses standard Web technologies such as HTML5, CSS3, and JavaScript.",
      "NOTE: Edge Animate, the successor to Edge, uses the .AN extension for projects instead of the \".edge\" extension. As of November 2015, Edge Animate is no longer being actively developed."
    ]
  },
  "more_information": {
    "description": [
      "A file with .edge extension is Adobe Edge Project file that is created when a project is created and saved with Adobe Edge. Adobe Edge lets web designers to create interactive HTML animators for web, digital publishing, and rich media advertising for both desktop and mobile browsers. This is achieved using HTML/HTML5, JavaScript, and CSS3. Edge files are generated as plain text files and can be opened with several different applications such as Microsoft Notepad, Apple TextEdit, and Notepad++.",
      "HTML project created by Adobe Edge, a program used for developing Web animations with HTML/HTML5, JavaScript, and CSS; saved in a plain text format and stores a multitrack timeline for animating webpage elements; uses jQuery (a JavaScript library) for enabling the animation; can be used as an alternative to creating webpages with Flash."
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/web/edge/index.html",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-01T22:32:42.265Z"
    },
    {
      "url": "https://fileinfo.com/extension/edge",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.265Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.265Z",
  "containers": []
}