{
  "slug": "edoc",
  "extension": "edoc",
  "name": "Electronically Certified Document",
  "summary": "Learn about .EDOC files and view a list of programs that open them.",
  "developer": "N/A",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11166&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "You can attach a variety of files to an EDOC file, such as documents, spreadsheets, images, and videos. However, users typically attach office documents, like .PDF, .DOC, .DOCX, .XLS, and .XLSX files, to an EDOC file.",
      "To add a signature to an EDOC file, you must have an eParaksts electronic signature smartcard from the Latvia State Radio and Television Center (LVRTC) or an eID identity card from the Office of Citizenship and Migration Affairs (OCMA). There are varying levels of signatures you can add to an EDOC file:",
      "Basic signature - A signature without a timestamp and no verification information.",
      "Signature with a timestamp - A signature with a timestamp but no verification information.",
      "Fully verified signature - A signature with a timestamp and verification information.",
      "Once you add a signature to the EDOC file, you can no longer attach files to or remove files from the EDOC file. However, you can still view or export the attached files.",
      "NOTE: EUSO SignAnywhere Free supports EDOC files but has been discontinued."
    ]
  },
  "more_information": {
    "description": [
      "An EDOC file is an electronically certified document saved in the EDOC format, which is a popular format in Latvia used to protect and verify the identity of sensitive files. It contains a document, which may include one or more attached files and one or more digital signatures. EDOC files also store metadata describing the properties of the document, such as the creator, the creation time, the last modification time, and the EDOC format version."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/edoc_11166.jpg",
      "alt": "Screenshot of a .edoc file in eParakst카t훮js 3",
      "caption": "EDOC file open in eParakst카t훮js 3"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/edoc",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.441Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.441Z",
  "category": "other",
  "related": [],
  "containers": []
}