{
  "slug": "eet",
  "extension": "eet",
  "name": "ESP/ESM Translator Database",
  "summary": "Learn about .EET files and view a list of programs that open them.",
  "developer": "Epervier 666",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12044&b=1"
      },
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "GitHub Atom",
        "url": "https://fileinfo.com/software/github/atom"
      },
      {
        "name": "GNU Emacs",
        "url": "https://fileinfo.com/software/gnu/emacs"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Vim",
        "url": "https://fileinfo.com/software/vim/vim"
      }
    ]
  },
  "technical_info": {
    "content": [
      ".ESP and .ESM files are game data and plug-in files often used to mod Skyrim, Fallout, and other Bethesda video games. Many of these files contain only English text, which can make them difficult for non-English readers to use.",
      "ESP/ESM Translator allows gamers to translate ESP and ESM mods' text into other languages. To do so, the gamer must first acquire or create an EET file, which is a translation database that contains multiple languages' versions of game-related text. For example, an EET file might contain multiple copies of a game's dialog and menu text written in different languages.",
      "After a gamer acquires an EET file for a game, they can attempt to automatically translate ESP and ESM mods using the EET file and ESP/ESM Translator. Gamers can also manually write translations and store them in an EET file. Then, they can apply those translations to a mod's text."
    ]
  },
  "more_information": {
    "description": [
      "An EET file is a text file used by ESP/ESM Translator, a tool used to translate mods for The Elder Scrolls V: Skyrim, Fallout, and other Bethesda video games. It contains a database that allows players to translate a mod's text into other languages. EET files are primarily plain text files, so they can be opened and edited in any text editor."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an EET file and use it to translate game mods in ESP/ESM Translator (Windows). To use an EET file with ESP/ESM Translator, you should place the file in the Esp Esm Translator/​BDD directory. When you open ESP/ESM Translator, the program will prompt you to choose a default EET database. You can also change the program's main database from the Options → Databases screen.",
      "If you need to edit the text an EET file contains, you can do so by opening and editing the file in any text editor."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/eet",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.442Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.442Z",
  "category": "other",
  "related": [],
  "containers": []
}