{
  "slug": "ehil",
  "extension": "ehil",
  "name": "HTTP Injector Lite Configuration File",
  "summary": "Learn about .EHIL files and view a list of programs that open them.",
  "developer": "Evozi",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12538&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Evozi HTTP Injector Lite allows you to create an encrypted link between your Android device and an outside network. You can then browse the Internet while connected to the outside network, so your browsing history is linked to the network's IP address instead of their own.",
      "Using HTTP Injector Lite also allows you to access websites that have been blocked by your ISP's firewall. As such, the app and its EHIL files are popular in countries that restrict or monitor their populace's Internet access."
    ]
  },
  "more_information": {
    "description": [
      "An EHIL file is a configuration file used by Evozi HTTP Injector Lite, an Android app that allows users to connect to the Internet using a Virtual Private Network (VPN). It contains server login credentials, security/locking information, and other VPN settings. Users can import and export EHIL files in HTTP Injector Lite."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To import an EHI config file into Evozi HTTP Injector Lite:",
      "Open the app and tap the file icon that appears near the app's upper right-hand corner.",
      "Select Import Config.",
      "Navigate to the folder containing your EHIL file and select it."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/ehil",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.445Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.445Z",
  "category": "other",
  "related": [],
  "containers": []
}