{
  "slug": "eld",
  "extension": "eld",
  "name": "Eulumdat Formatted Luminaire Data File",
  "summary": "Learn about .ELD files and view a list of programs that open them.",
  "developer": "DIAL",
  "programs": {
    "windows": [
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=9333&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "DIALux allows lighting designers to model how the light installations included in a house, office building, neighborhood, or other environment will behave. To simulate a light source, designers import an Elumudat-format data file that describes the light source's characteristics and behavior. Lighting installation manufacturers often create these data files and provide them to lighting designers, for use in DIALux.",
      "On rare occasions, Elumudat data files may be saved with the .eld extension. More commonly, these files are saved with the .LDT extension. Most programs that use Elumudat-format files do not recognize the .eld extension. Therefore, you should likely rename your ELD file to use the .ldt extension, so you can open it more easily."
    ]
  },
  "more_information": {
    "description": [
      "An ELD file contains plain text luminaire (light fixture) data formatted for use with DIAL DIALux, a professional lighting planning application. It defines a light fixture's intensity, light distribution curve, size, and number of lamps. The data ELD files contain is saved in DIAL's proprietary Elumudat format."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Before attempting to open an ELD file, you should rename it to use the .ldt extension. This will allow you to open the file in programs that support the Elumudat format, such as DIAL LDT Editor (Windows), Meduza Photometric Toolset (Windows), and DIAL DIALux Evo (Windows).",
      "Alternatively, you can open an ELD file in Microsoft Notepad, Apple TextEdit, or any other text editor, to view the plain text data it contains. However, it's far better to open an ELD file in LDT Editor or another program that shows the file's data in an understandable format."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "After renaming your ELD file to use the .ldt extension, you can convert it to other formats using either the PhotoView module included in OxyTech LITESTAR 4D Open or the online Eulumdat Tools ELUMDAT to IES Converter tool. LITESTAR 4D Open can convert LDT files to the following formats:",
      ".IES - IES Photometric Data",
      ".LTL - Luminaire Data",
      "CIE - International Commission on Illumination Data",
      "Eulumdat Tools ELUMDAT to IES Converter can convert LDT files to the IES format."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/eld_9333.png",
      "alt": "Screenshot of a .eld file in Microsoft Visual Studio Code",
      "caption": "ELD file open in Microsoft Visual Studio Code"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/eld",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.718Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.718Z"
}