{
  "slug": "emc",
  "extension": "emc",
  "name": "Striata Reader Encrypted Document",
  "summary": "Learn about .EMC files and view a list of programs that open them.",
  "developer": "Striata",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=5109&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "When creating EMC files, Striata software incorporates a triple DES encryption algorithm to ensure the integrity and confidentiality of information. EMC files are often decrypted using a shared secret, such as an answer to a question or a password.",
      "EMC files are commonly sent in bulk via email to customers all at once. This is useful for companies that want to batch process and deliver electronic statements together. When receiving an EMC file attachment in an email, you can be open it with the Striata Reader application."
    ]
  },
  "more_information": {
    "description": [
      "An EMC file is an encrypted document used by Striata Reader, a program that allows users to view documents that are encrypted by Striata software. It contains an encrypted document such as a bill, letter, invoice, or a collection notice. EMC files are commonly used by banks and credit card companies for sending high-volume, system generated statements to customers and are also used by businesses for eBilling."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/emc",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.719Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.719Z"
}