{
  "slug": "encrypted",
  "extension": "encrypted",
  "name": "Crypren Ransomware Encrypted File",
  "summary": "Learn about .ENCRYPTED files and view a list of programs that open them.",
  "developer": "N/A",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11711&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Crypren ransomware is a type of malware utilized by cybercriminals that encrypts a user's files. After the ransomware takes the files hostage, it forces the victim to pay the perpetrator through Bitcoin to unlock the files. It is typically introduced to a victim's computer through spam emails with malicious links or file attachments. When an unsuspecting user downloads and opens the file attachment or clicks the embedded link in the email, the virus runs on the computer.",
      "When the ransomware runs on a user's computer, it encrypts files on the computer and adds the .encrypted extension onto the names of the files. The types of files typically targeted include personal documents, images, videos, and backup files, such as .DOCX, .PDF, .PNG, .JPG, .MP4, and .DB files. For example, a document.docx file becomes document.docx.encrypted.",
      "The virus then generates a READ_THIS_TO_DECRYPT.html READ_THIS_TO_DECRYPT.txt file in each folder on the user's computer that contains infected ENCRYPTED files. The .HTML or .TXT file contains information explaining the hostile takeover of the user's files and how the user can recover their files by paying a ransom payment."
    ]
  },
  "more_information": {
    "description": [
      "A file with an .encrypted extension is a file that has been encrypted by Crypren ransomware. It is encrypted so it is not possible to open the file by simply changing the .encrypted file extension."
    ]
  },
  "how_to_open": {
    "instructions": [
      "No known program can restore files infected by Crypen ransomware to their original state. The best way to recover your files is to retrieve them from a recent backup or perform a System Restore to a point before your computer was infected."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/encrypted",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.720Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.720Z"
}