{
  "slug": "esm",
  "extension": "esm",
  "name": "Elder Scrolls or Fallout 4 Master File",
  "summary": "Learn about .ESM files and view a list of programs that open them.",
  "developer": "Bethesda Softworks",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=5838&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Bethesda introduced the ESM file type as part of 2002's The Elder Scrolls III: Morrowind. Various Bethesda games contain ESM files, as do official expansion packs and unofficial plug-ins created and distributed by game modders. (Modders also use .ESP files to modify Elder Scrolls IV, Elder Scrolls V, and Fallout 4.)",
      "You can find ESM files in the Data sub-directory of a game's parent directory (the directory in which the game's .EXE file is located). For example, Elder Scrolls IV: Oblivion's primary ESM file, which is named Oblivion.esm, is located in the game's /​Oblivion/​Data folder.",
      "NOTE: The .ESL file type is a \"lighter\" version of the ESM file type. It was introduced with the Fallout 4 patch 1.10 in August 2017 and is limited to 4096 records."
    ]
  },
  "more_information": {
    "description": [
      "An ESM file is a game data file used by select Bethesda Softworks video games, such as The Elder Scrolls IV: Oblivion, The Elder Scrolls V: Skyrim, or Fallout 4. It contains multiple records that describe various kinds of game data, such as characters, in-game items, world environments, and settings."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Bethesda Softworks games that use ESM files automatically load and use the files when you play the games.",
      "You can also view and edit custom ESM files with the Creation Kit or The Elder Scrolls Construction Set (TESCS) in Windows."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/esm",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.725Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.725Z"
}