{
  "slug": "eu4",
  "extension": "eu4",
  "name": "Europa Universalis IV Saved Game",
  "summary": "Learn about .EU4 files and view a list of programs that open them.",
  "developer": "Paradox Interactive",
  "programs": {
    "windows": [
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12634&b=1"
      },
      {
        "name": "Vim",
        "url": "https://fileinfo.com/software/vim/vim"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Europa Universalis IV is a strategy game in which players control a nation-state and attempt to conquer the world. The game is available for Windows, macOS, and Linux.",
      "When a player saves their game in Europa Univeralis IV, that game's current state is recorded in an EU4 file. Each EU4 file details the date at which the game was saved, the saved game's name, the player's country, the game version, DLCs, and mods used in the game, statistics about the game, and every other piece of data needed to resume the game at a later time.",
      "Because they contain so much data, EU4 files' contents can be quite long, and the files' size can be quite large. To reduce EU4 files' size, Europa Universalis IV often compresses them. Autosaves and quick saves are never compressed.",
      "Europa Univeralis IV stores its EU4 files in the following locations:",
      "Windows: C:/​Users/​YourUserName/​Documents/​Paradox Interactive/​Europa Universalis IV/​save games",
      "Mac: ~/​Documents/​Paradox Interactive/​Europa Universalis IV/​save games",
      "Linux: ~/​.local/​share/​Paradox Interactive/​Europa Universalis IV/​save games"
    ]
  },
  "more_information": {
    "description": [
      "An EU4 file is a saved game created by Europa Universalis IV. It contains plain text data used to specify the saved game's state, as well as the date at which the game was saved. Some EU4 files are Zip-compressed to decrease their file size."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To open an EU4 file in Europa Universalis IV, place the file in the ~/​Paradox Interactive/​Europa Universalis IV/​save games folder. You can then select the saved game your EU4 file contains in-game.",
      "If you want to edit the text an EU4 file contains, you can open it in Microsoft Notepad, Apple TextEdit, or any other text editor. Note that, because EU4 files are typically quite large, the file may take several minutes to load. If your EU4 file is compressed, you must first change its extension to .ZIP and decompress it, before you can edit the data it contains."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/eu4",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.726Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.726Z"
}