{
  "slug": "euc",
  "extension": "euc",
  "name": "Extended Unix Code File",
  "summary": "Learn about .EUC files and view a list of programs that open them.",
  "developer": "ISO/IEC",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=570&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "EUC was developed in the 1980s to extend the capabilities of Unix Code as computing technology expanded globally. It is based on the ISO/IEC 2022 standard produced by the International Organization for Standardization (ISO) and the International Electrotechnical Commission (IEC).",
      "The EUC format supports multiple character sets within a single text string, enabling the use of both Kanji (or Korean or simplified Chinese) and other characters without conflict. This capability made EUC a widely adopted encoding standard for handling multilingual text in Unix and Linux operating systems for text editors, databases, programming environments, and more."
    ]
  },
  "more_information": {
    "description": [
      "An EUC file is a text file format (Extended Unix Code) used for encoding Japanese Kanji characters along with other East Asian scripts, such as Korean and simplified Chinese. EUC encoding allows computers and software systems to correctly display and process Japanese, Korean, and simplified Chinese text, making it especially useful for applications that handle multilingual text data in Unix-based systems."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/euc",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.726Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.726Z"
}