{
  "slug": "ewc2",
  "extension": "ewc2",
  "name": "EDIUS Waveform Cache",
  "summary": "Learn about .EWC2 files and view a list of programs that open them.",
  "developer": "Grass Valley",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11588&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "When an editor adds an audio clip to an EDIUS video project, EDIUS creates an EWC2 file to represent that clip visually within the video editing timeline. Editors use this visual representation to make edits to the clip, such as trimming the clip or adjusting its volume. These edits are then saved within EDIUS.",
      "Because generating EWC2 files can be performance-intensive, some video editors prefer to stop EDIUS from generating EWC2 files automatically when they add an audio clip. To stop EDIUS from automatically creating EWC2 files, you can open the program's User Settings menu, select Application → Other, and clear the Create Waveform cache when registering clip checkbox. EDIUS will then create an EWC2 file only when you expand an audio track for editing within the program."
    ]
  },
  "more_information": {
    "description": [
      "An EWC2 file is a waveform cache file created by Grass Valley EDIUS, a non-linear video editing software. It contains a visual representation of an audio track included in an EDIUS video editing project. EWC2 files are often created in the same directory as the audio file they represent."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You cannot open an EWC2 file by itself in EDIUS. Instead, you should open the audio file associated with your EWC2 file. When you import the audio file into an EDIUS project, your EWC2 file will appear in EDIUS's video editing timeline."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/ewc2",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.728Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.728Z"
}