{
  "slug": "ewem",
  "extension": "ewem",
  "name": "Rocket League Music",
  "summary": "Learn about .EWEM files and view a list of programs that open them.",
  "developer": "Psyonix",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13361&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "In Psyonix Rocket League, players play soccer using rocket-powered cars. By default, the game plays a variety of music while players navigate its in-game menus. Optionally, players can also choose to play music during matches.",
      "The audio files that Rocket League uses to play music are saved as .WEM and EWEM files. EWEM files are WEM files that have been encrypted to prevent players from using them outside Rocket League.",
      "The Windows version of Rocket League stores EWEM files in the following directory:",
      "~/​Program Files/​Epic Games/​Rocket League/​TAGame/​CookedPCConsole",
      "Each EWEM file's filename consists of a series of numbers (e.g. 641432000.ewem).",
      "If you dislike a specific Rocket League song that is saved as an EWEM file, you can stop Rocket League from playing that song by:",
      "Determining which EWEM file contains that song. A good way to do this is to wait until Rocket League is playing the song, attempt to move all your EWEM files to a different directory, and then note which file cannot be moved. (Remember to replace all your EWEM files after doing this.)",
      "Deleting the file you noted in step 1."
    ]
  },
  "more_information": {
    "description": [
      "An EWEM file contains music played in the video game Rocket League. It is saved in a proprietary, nonstandard format. Thus, you cannot play the songs EWEM files contain outside Rocket League."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Because EWEM files are saved in a proprietary, encrypted format, you cannot open or play them outside Rocket League."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/ewem",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.728Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.728Z"
}