{
  "slug": "exo",
  "extension": "exo",
  "name": "YouTube Video Chunk",
  "summary": "Learn about .EXO files and view a list of programs that open them.",
  "developer": "Google",
  "category": "video",
  "category_slug": "video",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=9838&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "In select countries, including India, the Philippines, and Indonesia, YouTube for Android users can download certain videos for playback offline. Those videos, which are available to be played back for up to 48 hours, are saved locally as a set of EXO files.",
      "Each EXO file contains a compressed, encrypted segment of the downloaded video. For example, a 10-minute video may be saved as a set of 30 EXO files. YouTube for Android encrypts EXO files to prevent users from sharing them with others. When you play a downloaded video in YouTube for Android, the app automatically pieces together the related EXO files and plays them in the correct order."
    ]
  },
  "more_information": {
    "description": [
      "An EXO file is a video chunk file, downloaded by Android version of YouTube in the EXO format. When a user wants to download a video for offline playback, the video is divided into small chunks and each chunk is downloaded and saved to user’s device as an EXO file. These multiple EXO files are joined together for offline playback by YouTube app.",
      "An EXO file is a video segment created by YouTube for Android. It contains a portion of a video that a user downloaded for offline playback. EXO files are encrypted, and they can be played only in certain versions of YouTube for Android."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can play an EXO file in versions of YouTube for Android that allow you to download and watch videos offline. When you open your EXO file, YouTube for Android will begin playing the downloaded video the EXO file is a part of.",
      "You can also access downloaded videos from within the YouTube for Android app, by selecting Library → Downloads."
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/video/exo/index.html",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-01T22:32:42.266Z"
    },
    {
      "url": "https://fileinfo.com/extension/exo",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.266Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.266Z",
  "containers": []
}