{
  "slug": "exportedui",
  "extension": "exportedui",
  "name": "Microsoft Office Exported UI Customization File",
  "summary": "Learn about .EXPORTEDUI files and view a list of programs that open them.",
  "developer": "Microsoft",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=9251&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "When you make changes to the ribbon in Microsoft Word, it will not change the ribbons in the other applications of the Microsoft Office Suite. You must change the UI in each, individual program to make changes.",
      "To make changes to the ribbon, select File → Options → Customize Ribbon and make your changes. Continue to the next paragraph to create the EXPORTEDUI file.",
      "To create the EXPORTEDUI file (resuming from the paragraph above), select Import/Export, choose Export all customizations, name the file, choose a save location, and click Save.",
      "To import the EXPORTEDUI file (in the same window as described above), click the Import/Export button, choose Import customization file, select the file, and click Open.",
      "NOTE: The EXPORTEDUI file was introduced with Microsoft Office 2010 but is compatible with later versions of Office. Be aware that some of your customizations may be deleted if they're no longer supported by the Office version they're being imported into."
    ]
  },
  "more_information": {
    "description": [
      "Customization file used by Microsoft Office, a work document production suite; contains XML code that customizes ribbons in Microsoft Office; exported format to easily share custom tabs, commands, groups, etc. that make up the Microsoft Office UI with other users."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/exportedui",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.459Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.459Z",
  "category": "other",
  "related": [],
  "containers": []
}