{
  "slug": "eyb",
  "extension": "eyb",
  "name": "Microsoft Encarta Yearbook Update",
  "summary": "Learn about .EYB files and view a list of programs that open them.",
  "developer": "Microsoft",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=303&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Microsoft Encarta was a multimedia encyclopedia available primarily for Microsoft Windows (before moving to being hosted online). Prior to Encarta 2000, users could download monthly Encarta content updates, called Yearbook Updates, from the internet. Primarily, users downloaded updates from within Encarta's Yearbook Builder or from The Microsoft Network (MSN).",
      "After downloading an EYB file, Encarta users installed it via the Yearbook Builder. Doing so integrated the content the EYB file contained with the user's version of Encarta. After integrating an EYB file with Encarta, the Yearbook Builder deleted the EYB file and replaced it with a .YBK file (which contains the EYB file's contents saved in a different format)."
    ]
  },
  "more_information": {
    "description": [
      "An EYB file is an update file used by Microsoft Encarta, a CD- and DVD-based encyclopedia for Windows. It contains article updates, new feature articles, and a new Month in Review summary. Microsoft released new EYB files each month, which users could download and integrate into Encarta."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can use Microsoft Encarta's Yearbook Builder to install the Yearbook Update an EYB file contains. To do so, you must place the file in your version of Encarta's update folder:",
      "Encarta 98: ~/​Program Files/​Microsoft Reference/​Encarta Encyclopedia/​Update98",
      "Encarta 99: ~/​Program Files/​Microsoft Reference/​Encarta Encyclopedia 99/​Update99",
      "Then, use the Integrate button found on the Yearbook Builder's Add New Months screen to integrate the content your EYB files contain with Encarta. (In different versions of Encarta, the Integrate button may be found on different screens.)"
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/eyb",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.730Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.730Z"
}