{
  "slug": "f64",
  "extension": "f64",
  "name": "Raw 64-Bit Audio File",
  "summary": "Learn about .F64 files and view a list of programs that open them.",
  "developer": "N/A",
  "programs": {
    "windows": [
      {
        "name": "FMJ-Software Awave Studio",
        "url": "https://fileinfo.com/software/fmj-software/awave_studio"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1746&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Since F64 files are raw, they only contain sound data and no additional header information or metadata typically included with common audio formats, such as .MP3 or .OGG. Additionally, F64 files are similar to .F32 files but store more raw data, allowing for a wider dynamic range of sound and greater accuracy. Because they contain more data, F64 files are significantly larger in size than F32 files"
    ]
  },
  "more_information": {
    "description": [
      "An F64 file is an audio file that stores raw sound data as 64-bit floating point values where a 64-bit number represents each sample of the sound wave. It is typically large in size, containing uncompressed audio information, allowing for a highly accurate representation of soft and loud sounds. Most casual users will not encounter F64 files since they are typically used in professional audio editing, mixing, and mastering tasks where maximum quality is vital."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open F64 files with FMJ-Software Awave Studio and Awave Audio in Windows. To open an F32 file with either program, select File → Open. You will likely need to specify details like the sample rate, bit depth, and number of channels in the file to play it since it only stores raw data."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/f64",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.733Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.733Z"
}