{
  "slug": "fba",
  "extension": "fba",
  "name": "Fitbit OS App Package",
  "summary": "Learn about .FBA files and view a list of programs that open them.",
  "developer": "Fitbit",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12826&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Fitbit smartwatches use a proprietary operating system called Fitbit OS. Fitbit Studio is an integrated development environment (IDE) that allows developers to create Fitbit OS apps. Developers who prefer to develop from their own source code editor or the command line can use Fitbit's command-line interface instead of Fitbit Studio.",
      "After a developer finishes developing their Fitbit OS app, they can package that app as an installable FBA file. They can then either install the app on their own Fitbit for testing or publish the app to the Fitbit App Gallery. Developers can publish apps to the gallery either publicly or privately. Private apps can be installed only using a direct installation hyperlink provided by the developer.",
      "NOTE: FBA files can also contain Fitbit clockfaces, instead of Fitbit apps."
    ]
  },
  "more_information": {
    "description": [
      "An FBA file is a Fitbit app developed using Fitbit Studio or Fitbit's command-line interface. It contains the app's source code, manifest, and assets, stored in zipped folders. Developers publish FBA files to the Fitbit App Gallery, so other users can install the apps they contain."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can use Fitbit Studio (multiplatform) or the Fitbit command-line interface (multiplatform) to install an FBA file on a Fitbit smartwatch or the programs' built-in Fitbit simulator. For complete instructions, refer to Fitbit's developer documentation."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/fba",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.464Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.464Z",
  "category": "other",
  "related": [],
  "containers": []
}