{
  "slug": "fdb",
  "extension": "fdb",
  "name": "Portfolio Catalog",
  "summary": "Learn about .FDB files and view a list of programs that open them.",
  "developer": "Extensis",
  "category": "database",
  "category_slug": "database",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1874&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Portfolio provides various features for organizing files, securely sharing assets, and automating tasks. Additionally, the app provides catalogs to organize assets, and the FDB file type stores information about the assets in the catalog."
    ]
  },
  "more_information": {
    "description": [
      "A .fdb file is a file extension used for the database files in Microsoft Dynamics NAV. The .fdb file extension stands for “Firebird Database File” and it is the file format used by the Firebird Database Management System, which is the underlying database engine used by Microsoft Dynamics NAV. The .fdb file contains all the data, tables, and structures of the NAV system, including financial data, inventory data, customer data, and more. It is important to keep a backup of the .fdb file to ensure data integrity and to be able to recover data in case of any issue. The .fdb file can be exported, imported and also be used in replication.",
      "An FDB file is a database of images created by Extensis Portfolio, a digital asset management application. It contains a thumbnail image and metadata for each file stored in the catalog. Examples of metadata stored include file name, created and modified date, and keywords."
    ]
  },
  "how_to_open": {
    "instructions": [
      "FDB file is typically opened and managed using the Microsoft Dynamics NAV development environment or the Microsoft Dynamics NAV client.\n\nHere are the steps to open a .fdb file in Microsoft Dynamics NAV:\n\nOpen the Microsoft Dynamics NAV development environment.Click on the “File” menu and select “Open” or press “Ctrl+O”Navigate to the location where the .fdb file is saved.Select the .fdb file and click on the “Open” button.\n\nYou can also open the .fdb file by connecting to the database using the NAV client.\n\nOpen the NAV client.Click on the “File” menu and select “Connect”In the “Server” field, enter the name or IP address of the server where the .fdb file is located.Enter the appropriate “Database Name” and “Credentials”Click on the “Connect” button.\n\nIt is also possible to open .fdb files with Firebird database management system management software, as it is the underlying database engine used by Microsoft Dynamics NAV.",
      "FDB files are not meant to be opened. Instead, Extensis Portfolio references the information in the FDB file to load thumbnail images and metadata for the assets upon startup."
    ]
  },
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/fdb_12963.png",
      "alt": "Screenshot of a .fdb file in Legacy Family Tree",
      "caption": "FDB file open in Legacy Family Tree"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/database/fdb/",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-02T02:43:26.513Z"
    },
    {
      "url": "https://fileinfo.com/extension/fdb",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.513Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.513Z"
}