{
  "slug": "fdp",
  "extension": "fdp",
  "name": "MySafe Encrypted Data",
  "summary": "Learn about .FDP files and view a list of programs that open them.",
  "developer": "UPEK",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1446&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "UPEK developed Protector Suite QL in the 2000s and commonly bundled it with laptops and devices with UPEK fingerprint scanners. The fingerprint technology authenticated users seeking to access files and folders encrypted as FDP files via the MySafe feature in the software. Without fingerprint authentication, the encrypted contents of FDP files are inaccessible.",
      "NOTE: In 2010, AuthenTec acquired UPEK, which ceased the development of Protector Suite QL. Apple Inc. then acquired AuthenTec in 2012."
    ]
  },
  "more_information": {
    "description": [
      "An FDP file stores an encrypted file or folder created by the now-discontinued UPEK Protector Suite QL, a program designed to securely protect sensitive information. It is encrypted to prevent unauthorized access, ensuring the data it contains can only be opened by verified users. Individuals and organizations commonly used the FDP format to protect confidential documents, financial records, and other important files."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/fdp",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.739Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.739Z"
}