{
  "slug": "fe_tmp",
  "extension": "fe_tmp",
  "name": "Mi File Explorer Temporary File",
  "summary": "Learn about .FE_TMP files and view a list of programs that open them.",
  "developer": "Xiaomi",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13562&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Mi File Explorer (also called Mi File Manager) is a file manager designed for Xiaomi MIUI smartphones. It allows users to browse, open, copy, delete, and share their files.",
      "In some cases, when a user moves, copies, or deletes a file with Mi File Explorer, the program creates and does not delete an FE_TMP file. This issue can cause Mi File Explorer and the MIUI operating system to believe the user's SD card has become corrupted.",
      "To resolve this issue, use a different file manager or a file recovery program (such as TeamWin Recovery Project) to delete any FE_TMP files stored on your SD card. (Often, Mi File Explorer places FE_TMP files in SD cards' root directory.) To avoid this issue recurring, you may want to use a different file manager to move, copy, delete, or share files in the future.",
      "NOTE: If you use Mi File Explorer to move a file to another storage device (such as a USB flash drive), Mi File Explorer may also create an FE_TMP file on that device."
    ]
  },
  "more_information": {
    "description": [
      "An FE_TMP file is a temporary file created by Mi File Explorer, a file manager for Xiaomi smartphones. Mi File Explorer creates a new FE_TMP file whenever a user moves, copies, or deletes a file. In most cases, Mi File Explorer automatically deletes FE_TMP files after completing the related file operation. If Mi File Explorer fails to delete an FE_TMP file, it can cause the user's phone to believe their SD card is invalid."
    ]
  },
  "how_to_open": {
    "instructions": [
      "FE_TMP files are not meant to be opened. If you find FE_TMP files on your Xioami smartphone, you can (and likely should) delete them."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/fe_tmp",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.739Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.739Z"
}