{
  "slug": "fgsf",
  "extension": "fgsf",
  "name": "Files by Google Safe Folder Encrypted File",
  "summary": "Learn about .FGSF files and view a list of programs that open them.",
  "developer": "Google",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12741&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Files by Google is Google's recommended Android and ChromeOS file management app. It allows users to search for, view, share, and back up their files. Files by Google also includes a file protection feature, called the Safe folder, that allows users to encrypt and password-protect sensitive files stored on their devices.",
      "To protect a file, users must first set up their Safe folder, including establishing a password PIN or pattern. Then, users can move any file to their Safe folder by:",
      "Selecting the file in Files by Google.",
      "Selecting the three-dot menu and choosing Move to Safe folder.",
      "Entering their PIN or pattern.",
      "Files by Google then moves the file to the Safe folder, encrypts it, and renames it to use the .fgsf extension."
    ]
  },
  "more_information": {
    "description": [
      "An FGSF file is a file that has been encrypted and renamed by Files by Google, a file management app for Android and ChromeOS devices. It was encrypted and renamed when moved to Files by Google's Safe folder. Typically, an FGSF file contains a sensitive document, photo, or video that a user wanted to protect from others who might use their device."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an FGSF file only if it is stored in the Files by Google Safe folder to which it was originally moved.",
      "To view the contents of your Safe folder, open Files by Google and select Safe folder. After entering your password, you can view and open all the files your Safe folder contains.",
      "If you no longer need to protect a file stored in your Safe folder, you can move that file back to its original location:",
      "Open your Safe folder as described above.",
      "Select the file you want to move out of the Safe folder.",
      "Select the three-dot menu and select Move out of Safe folder.",
      "The file you selected will be decrypted and restored to its original location."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/fgsf",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.470Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.470Z",
  "category": "other",
  "related": [],
  "containers": []
}