{
  "slug": "fil",
  "extension": "fil",
  "name": "ACL Database Table",
  "summary": "Learn about .FIL files and view a list of programs that open them.",
  "developer": "Diligent",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=3316&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "ACL for Windows, which has previously been known as ACL Analytics and ACL Desktop, is a data analysis and reporting application. It allows users to, among other things, identify trends and exceptions among data, track compliance with organizational or governmental standards, and perform automated analytic testing.",
      "Data analysts using ACL create one or more projects to import, analyze, and report on data. These project files contain many constituent files, including FIL files. Each FIL file contains the data associated with a specific database table. FIL files do not, however, contain table layout information, which ACL uses to show data to users. Therefore, you must either import an associated table layout file before you import a FIL file into ACL, or you must create a new table layout as you import your FIL file."
    ]
  },
  "more_information": {
    "description": [
      "A FIL file is a database table created by ACL for Windows. It contains a data set used in an ACL project. FIL files are flat files that contain raw data, and they must be linked to an ACL table layout to be used in ACL for Windows."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can import a FIL file into ACL for Windows to view the data it contains. Note that you must also import or create an associated table layout to view the data your FIL file contains.",
      "If your FIL file is stored within an ACL project you have access to, it may be easier to import the FIL file's data using the Copy from another Project → Table... option available in ACL. To access this option, right-click your current project's name in the ACL navigation bar."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/fil",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.743Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.743Z"
}