{
  "slug": "flatpakref",
  "extension": "flatpakref",
  "name": "Linux Flatpak Application Package Reference File",
  "summary": "Learn about .FLATPAKREF files and view a list of programs that open them.",
  "developer": "Flatpak",
  "programs": {
    "windows": [
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11547&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Flatpak developed the Flatpak (.FLATPAK) format to simplify app distribution for the many variants of the Linux operating system. By providing a consistent distribution format, app developers can better deploy updates to their apps and more easily reproduce bugs reported by their users.",
      "The Flatpak Ref format is particularly tailored to the distribution of Linux apps on online app stores like Flathub since they contain additional app and installation information. Most users who encounter FLATPAKREF files do so when downloading an application from Flathub. Developers can submit their apps to the Flathub online service, and once their app is approved, users can find the apps and download them as FLATPAKREF files."
    ]
  },
  "more_information": {
    "description": [
      "A FLATPAKREF file is an application package reference file used to distribute and install an app on a Linux-based platform. It contains plain text information about an app that the App Store or Package Manager references to know the package to install and the repository from where to download it. FLATPAKREF files include the application's ID, a base64-encoded version of a GnuPG Key (GPG Key) for securing data transmissions, and metadata to be displayed in the app store it is published on to describe the app to a user."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can install an app packaged in a FLATPAKREF file by double-clicking the file, which opens the Software Center, then gives you the option to install the app. You can also right-click the FLATPAKREF file and select Open With Software Install. Both of these methods require Gnome software and Flatpak to be installed on your system.",
      "From the command line, you can install a package from a FLATPAKREF file by typing the following:",
      "flatpak install --from [app_name].flatpakref",
      "Since FLATPAKREF files store information in plain text you can also open them with a text editor, such as Microsoft Notepad (Windows) or Apple TextEdit (macOS). Keep in mind that opening a FLATPAKREF file with a text editor will not install the app, and incorrectly modifying it will cause it to become corrupt."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/flatpakref_11547.png",
      "alt": "Screenshot of a .flatpakref file in Apple TextEdit 1.18",
      "caption": "FLATPAKREF file open in Apple TextEdit 1.18"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/flatpakref",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.473Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.473Z",
  "category": "other",
  "related": [],
  "containers": []
}