{
  "slug": "flatpak",
  "extension": "flatpak",
  "name": "Linux Flatpak Application Bundle",
  "summary": "Learn about .FLATPAK files and view a list of programs that open them.",
  "developer": "N/A",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11546&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "The Flatpak format is designed to simplify the process of Linux app distribution. It also allows the app developers to more easily reproduce bugs experienced by users and be more in control of updates to keep users current with the latest version of the app.",
      "FLATPAK files are typically used to distribute single-file bundles for users who are looking to directly download the application or share it via email. In these cases, developers can use the build-bundle or build-import-bundle commands in the Linux terminal (with Flatpak installed) to create the Flatpak bundle file.",
      "Users can install FLATPAK files on their Linux-based system (with Flatpak installed) by typing the following command in the Linux terminal:",
      "$ flatpak install [filename].flatpak ([filename] should be replaced by the actual name of the file)",
      "NOTE: Linux app developers may also distribute their apps as .FLATPAKREF files. This file type is commonly used when developers publish their apps to Flathub, which is an online app store and build service for Linux."
    ]
  },
  "more_information": {
    "description": [
      "A FLATPAK file is an application bundle used to distribute and install an app on a Linux-based platform. It stores the build of an app in the Flatpak container format, which allows it to be distributed to and installed on various distributions of the Linux operating system."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/flatpak",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.473Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.473Z",
  "category": "other",
  "related": [],
  "containers": []
}