{
  "slug": "folio",
  "extension": "folio",
  "name": "Adobe Folio File",
  "summary": "Learn about .FOLIO files and view a list of programs that open them.",
  "developer": "Adobe Systems",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=9681&b=1"
      },
      {
        "name": "Adobe InDesign 2023",
        "url": "https://fileinfo.com/software/adobe/indesign"
      }
    ]
  },
  "technical_info": {
    "content": [
      "A folio is similar to an InDesign book, as you can add separate .INDD documents, such as articles, cover, table of contents, to your folio. Folios can be created by InDesign CS5 and later.",
      "The folio format enables you to deliver dynamic content to your readers with features such as small purchase windows displayed on top of a free article or folio reset to a reader's starting position . You can also create folios that allow content to be scaled to fit the appropriate target device, such as an iPad or iPhone.",
      "You can create a folio, add articles to a folio, change folio properties, share folios, and more using the Folio Builder. To open the Folio Builder panel, select Window → Folio Builder.",
      "Adobe's Digital Publishing Service (DPS) allows you to share and publish folios through its DPS Folio Producer tool. If you are signed in with your verified Adobe ID, a workspace is automatically created on the acrobat.com web server when you create a folio.",
      "NOTE: After the release of DPS v32 in 2014, InDesign CS5 and CS5.5 users can no longer upload folios to the DPS Folio Producer Service."
    ]
  },
  "more_information": {
    "description": [
      "Digital publishing format developed by Adobe and created by InDesign, a page layout designing application; contains one or more digital articles along with metadata and a set of directories that contains data for each article; used to distribute interactive content, such as magazines or brochures."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/folio",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.749Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.749Z"
}