{
  "slug": "fpr",
  "extension": "fpr",
  "name": "Audit Workbench Project",
  "summary": "Learn about .FPR files and view a list of programs that open them.",
  "developer": "HP",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10398&b=1"
      },
      {
        "name": "Image-Line FL Studio",
        "url": "https://fileinfo.com/software/image-line/fl_studio"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Audit Workbench is a graphical user interface that complements the Static Code Analyzer program. It is used by developers for analyzing source code of software projects such as a Java project or Visual Studio Build Integration, and uncovering any security vulnerabilities. When you run a source code scan in Audit Workbench, the Static Code Analyzer program scans and analyzes code and produces results, which are then saved in the FPR project file by Audit Workbench.",
      "Audit Workbench comes with a basic project template you can use to alter to fit your needs or you can create a new template from scratch. The program also comes with a guide wizard to refine scan results and filter issues to prepare for an audit.",
      "NOTE: Audit Workbench was originally developed by Fortify Software, now known as Fortify, before being integrated into HP Enterprise Security Products."
    ]
  },
  "more_information": {
    "description": [
      "An FPR file is a project used by HPE Security Fortify Static Code Analyzer (SCA), a suite of tools used by security professionals to scan enterprise software for security issues. It contains a project, which includes analysis results and settings such as the source code path and the build ID. FPR files are primarily created by the Audit Workbench tool available within the SCA suite."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/fpr",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.480Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.480Z",
  "category": "other",
  "related": [],
  "containers": []
}