{
  "slug": "fprg",
  "extension": "fprg",
  "name": "Flowgorithm Program",
  "summary": "Learn about .FPRG files and view a list of programs that open them.",
  "developer": "Devin Cook",
  "programs": {
    "windows": [
      {
        "name": "Microsoft Visual Studio Code",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13166&b=1"
      },
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Vim",
        "url": "https://fileinfo.com/software/vim/vim"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Flowgorithm allows developers to create programs using a graphical, flowchart-based interface. To do this, developers add functions, declarations, inputs, outputs, and other program components, each of which appears as a colored shape. They then connect these colored shapes together to form a flowchart.",
      "Each Flowgorithm program is saved as an FPRG file. These files consist of XML-formatted text that define a program's overall function, as well as the function of its individual components. For example, if a program includes both a main function and several sub-functions, the FPRG file defines all those functions."
    ]
  },
  "more_information": {
    "description": [
      "An FPRG file is a program created using Flowgorithm, a flowchart-based programming tool. It contains XML-formatted text that defines the program's function. When opened in Flowgorithm, FPRG files appear as flowcharts."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an FPRG file with Flowgorithm (Windows). To do so, select File → Open... from the program's menu bar. Then, navigate to and open your FPRG file.",
      "You can also open an FPRG file with Microsoft Visual Studio Code (multiplatform) or any other text editor, to view the XML data it contains."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "You can use Flowgorithm to convert the program an FPRG file contains to many other programming languages, including C++, C#, JavaScript, Python, Swift, and Visual Basic. To do so:",
      "Select Tools → Source Code Viewer....",
      "In the Source Code Viewer's upper-left corner, use the drop-down arrow to select your desired programming language.",
      "Click the Save icon to save your program in your desired language.",
      "You can also use Flowgorithm to save an image of your program's flowchart as a .PNG, .SVG, or .EMF file. To do so, select Tools → Export to an Image File... (PNG) or Tools → Export to a Vector Graphics File... (SVG, EMF)."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/fprg_13166.png",
      "alt": "Screenshot of a .fprg file in Flowgorithm",
      "caption": "FPRG file open in Flowgorithm"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/fprg",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.480Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.480Z",
  "category": "other",
  "related": [],
  "containers": []
}