{
  "slug": "fs2",
  "extension": "fs2",
  "name": "FreeSpace 2 Mission Definition",
  "summary": "Learn about .FS2 files and view a list of programs that open them.",
  "developer": "Volition",
  "programs": {
    "windows": [
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=2968&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "FreeSpace 2 is a sequel to Descent: FreeSpace - The Great War. It was developed by Volition and published by Interplay Entertainment in 1999. In the game, players play as a pilot who engages in a series of space combat missions.",
      "The settings that define these missions are saved in FS2 files. Volition provided FreeSpace 2 players with an FS2 editor, named FRED2, that could be used to create custom missions. In 2002, Volition released FreeSpace 2's source code, which allowed players to create an updated version of the game named FreeSpace Open (FSO). FSO also includes an FS2 editor, named FRED2_Open."
    ]
  },
  "more_information": {
    "description": [
      "An FS2 file is a mission definition file used by FreeSpace 2, a space combat simulation game. It is used to load the data associated with a FreeSpace 2 mission, including the mission's cutscenes, briefings, goals, and events. FS2 files can contain a standalone mission or a mission that is part of a campaign."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open and edit an FS2 file with FRED2 or FRED2_Open (Windows), which are included with FreeSpace 2 and FreeSpace Open, respectively. You must own a copy of FreeSpace 2 to use FreeSpace Open.",
      "Because FS2 files are plain text files, you can also open them with Microsoft Notepad (Windows), Apple TextEdit (Mac), or any other text editor, to view the data they contain."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/fs2",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.482Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.482Z",
  "category": "other",
  "related": [],
  "containers": []
}