{
  "slug": "fsa",
  "extension": "fsa",
  "name": "Fragment Analysis Data File",
  "summary": "Learn about .FSA files and view a list of programs that open them.",
  "developer": "Applied Biosystems",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10483&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "FSA files are created to store fragment data acquired by data collection software during an electrophoresis run (laboratory technique used to separate and analyze macromolecules based on size). The data is used to determine DNA sequence genotypes. If you don't work or study in a DNA-related scientific field you most likely will never come across an FSA file.",
      "If you do find an FSA file and need to open it you can choose from several fragment analysis programs, such as Peak Scanner Software. These programs can be used to size, display, edit, and print FSA files. The applications process the raw data in the FSA file with algorithms and displays the data according to user-specified analysis settings. If you want to convert the FSA file to a more common image format you can use the FSA2PS program to convert the data to PostScript images.",
      "FSA files collected by Applied Biosystems applications will most likely be located in the following directory:",
      "E:\\AppliedBiosystems\\UDC\\Data Collection\\Data\\[instrument type]\\[instrument name]\\"
    ]
  },
  "more_information": {
    "description": [
      "An FSA file is a fragment analysis data file created by DNA sequencers and analyzers, such as the 3500 and 3130 Genetic Analyzers. It contains electropherogram records of amplified fragments along with the model and machine used to collect the data and the start and stop time of the run. FSA files are saved in the proprietary ABIF file format where each element of data is associated with a tag similar to key-value pairs."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/fsa",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.754Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.754Z"
}