{
  "slug": "fsave",
  "extension": "fsave",
  "name": "Fruit Playground Save",
  "summary": "Learn about .FSAVE files and view a list of programs that open them.",
  "developer": "Ruslan Asanov",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13835&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "FSAVE files are created when a player manually saves a scene within the Fruit Playground editor. Each file captures the specific arrangement and properties of in-game elements at the time of saving. Players can load FSAVE files to continue working on existing builds, share them with others, or use them as part of custom mods.",
      "These files are usually stored in the following directory on Android devices: Android/​Data/​com.ONRIStudio.JustPlayground/​Files/​Saves",
      "NOTE: FSAVE files are also commonly included with .FMOD mod files shared in online communities."
    ]
  },
  "more_information": {
    "description": [
      "An FSAVE file is a game save created by Fruit Playground, a sandbox game available for Android and iOS devices. It stores saved game data, including the layout of objects, structures, characters, and other elements placed in the game’s editor mode. Players use FSAVE files to preserve their custom builds or experiments and reload them later for editing or gameplay."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open FSAVE files with Fruit Playground on an Android or iOS device. To open an FSAVE files, open the in-game editor, select the Load save option, and choose the FSAVE file."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/fsave",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.482Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.482Z",
  "category": "other",
  "related": [],
  "containers": []
}