{
  "slug": "fsm",
  "extension": "fsm",
  "name": "FreeSpace Mission Definition",
  "summary": "Learn about .FSM files and view a list of programs that open them.",
  "developer": "Volition",
  "programs": {
    "windows": [
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=2992&b=1"
      },
      {
        "name": "FMJ-Software Awave Studio",
        "url": "https://fileinfo.com/software/fmj-software/awave_studio"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Descent: FreeSpace is a spin-off of the Descent series of video games. In FreeSpace, players play as a human pilot who must undertake a series of missions to protect humanity from an alien threat. The game was developed by Volition and published by Interplay Entertainment in 1998.",
      "The settings that define FreeSpace's missions are saved in FSM files. The game includes an FSM editor named FRED, which players can use to edit the game's existing FSM files and create their own. FRED allows players to edit FSM files in a 3D environment, which shows all the objects included in a mission. It also allows players to add custom voice tracks and text to mission briefings and messages.",
      "In 1999, Volition and Interplay Entertainment released a sequel to FreeSpace, titled FreeSpace 2. FreeSpace 2's mission editor, FRED2, can also open FSM files, and players can use FSM files to play missions in FreeSpace 2. The same is true for FreeSpace Open, an open-source add-on for FreeSpace 2, and its mission editor, FRED2_Open."
    ]
  },
  "more_information": {
    "description": [
      "An FSM file is a mission definition file used by Descent: FreeSpace - The Great War, a space combat video game. It contains a list of plain text settings used to load a mission's cutscenes, briefings, objects, goals, and other data. FSM files can also be loaded in FreeSpace 2 and FreeSpace Open."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open and edit an FSM file with FRED, FRED2, or FRED2_Open, which are included with Descent: FreeSpace, FreeSpace 2, and FreeSpace Open, respectively. You must own a copy of FreeSpace 2 to use FreeSpace Open.",
      "Because FSM files are plain text files, you can also open them with Microsoft Notepad (Windows), Apple TextEdit (Mac), or any other text editor, to view the data they contain."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/fsm",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.483Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.483Z",
  "category": "other",
  "related": [],
  "containers": []
}