{
  "slug": "fspro",
  "extension": "fspro",
  "name": "FMOD Studio Project",
  "summary": "Learn about .FSPRO files and view a list of programs that open them.",
  "developer": "Firelight Technologies",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13317&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "FMOD Studio is a sound design tool that video game developers use to create adaptive sound effects and music. They can then integrate these audio files with a video game, using event-based metadata specified in FMOD Studio and exported alongside the audio files.",
      "Each FMOD Studio project (comprised of a project directory and various project assets) contains an FSPRO file. This file is a pointer file used to open the project in FMOD Studio.",
      "After a user finishes editing their FMOD Studio project, they can export the sounds and metadata it contains as a .BANK file. They can then import the BANK file into Unity, CryEngine, Valve Source, Unreal Engine, and other game development engines, to integrate the sounds they've created with their in-development video game.",
      "NOTE: If a user has integrated FMOD Studio with Unity, their FMOD Studio project and FSPRO file may be stored within a Unity project directory."
    ]
  },
  "more_information": {
    "description": [
      "An FSPRO file is an FMOD Studio project file. It points to and allows FMOD Studio to open a sound design project from a project directory. The FSPRO file does not itself contain any of the project's audio or event data."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an FSPRO file, and the project to which it points, with FMOD Studio. To do so, select File → Open... from FMOD Studio's menu bar. Then, navigate to and open your FSPRO file. Note that, in order for FMOD Studio to open your project correctly, the project's FSPRO file must be stored within the project's top-level directory."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/fspro",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.755Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.755Z"
}