{
  "slug": "ftmx",
  "extension": "ftmx",
  "name": "Finale 2014 Score Template",
  "summary": "Learn about .FTMX files and view a list of programs that open them.",
  "developer": "MakeMusic",
  "programs": {
    "windows": [
      {
        "name": "MakeMusic Finale",
        "url": "https://fileinfo.com/software/makemusic/finale"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=9071&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "MakeMusic Finale is a music notation program that allows composers to create, edit, and play back musical scores. If a composer does not want to begin creating a score from scratch, they can open one of Finale's many included score templates. These templates contain default notation, text, and other settings that make it easier for a composer to create particular types of scores.",
      "Finale 2014 to 26 save templates as FTMX files. These files are located in the following directory:",
      "~/​MakeMusic/​Finale ##/​Music Files/​Templates",
      "Composers can also create their own FTMX files, by using File → Save As... to save a score they've created as an FTMX file. It is recommended that composers save the templates they create in the Templates directory, to make managing templates easier.",
      "NOTE: Finale 2012 and earlier versions save templates as .FTM files. Finale 27 saves templates as .MUSX files.",
      "To create a new score from an FTMX file:",
      "Select File → New → Document From Template...",
      "Navigate to and open your FTMX file.",
      "Finale's Document Setup Wizard will then open, in which you can specify information about your new score."
    ]
  },
  "more_information": {
    "description": [
      "An FTMX file is a musical score template created by MakeMusic Finale, a popular score creation program. It contains a pre-set layout that a composer can use to quickly create a new .MUSX file. Starting from an FTMX file saves composers the time of manually specifying a new score's settings."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an FTMX file with MakeMusic Finale (Windows, Mac). In versions 2014 to 26, you can select File → Open..., navigate to your FTMX file, and select Open to open it. In version 27, you must right-click your FTMX file, select Open with..., and then manually open the file with Finale. (Or, you can change the file's extension to .musx and open it as you would a MUSX file.)"
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/ftmx_9071.png",
      "alt": "Screenshot of a .ftmx file in MakeMusic Finale",
      "caption": "FTMX file open in MakeMusic Finale"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/ftmx",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.757Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.757Z"
}