{
  "slug": "fts",
  "extension": "fts",
  "name": "Windows Help Full Text Search Index",
  "summary": "Learn about .FTS files and view a list of programs that open them.",
  "developer": "Microsoft",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=554&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Windows Help is an online help program that was included with previous versions of Windows (starting with Windows 3.1 and ending with Windows XP). It allowed users to navigate through and search help documentation saved as .HLP files.",
      "From Windows Help's Find tab, users could type in and search for specific keywords or phrases in documentation. If the user had keyword indexing enabled, Windows Help would create an FTS file that indexed the user's search results, to make subsequent searches for the same word or phrase show results more quickly."
    ]
  },
  "more_information": {
    "description": [
      "An FTS file is an index file created by Windows Help. Windows Help creates an FTS file when a user uses the Find function to search for text, with keyword indexing enabled. The FTS file stores an index of all instances at which WinHelp found the searched-for text, making subsequent searches for that text faster."
    ]
  },
  "how_to_open": {
    "instructions": [
      "FTS files are not meant to be opened. Windows Help references FTS files when users perform an associated full text search, using the Find tab."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/fts",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.485Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.485Z",
  "category": "other",
  "related": [],
  "containers": []
}