{
  "slug": "fur",
  "extension": "fur",
  "name": "Furnace Module",
  "summary": "Learn about .FUR files and view a list of programs that open them.",
  "developer": "tildearrow",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13313&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Old-school gaming and audio enthusiasts use Furnace to create 8-bit music for old sound chips and video game consoles. Notably, the songs users create with Furnace can be played on over 50 sound chips, all of which Furnace can emulate as users create songs. (Furnace can even emulate multiple chips at the same time.)",
      "By default, the songs users create in Furnace are saved as FUR files. These files define the song's channels and included notes, as well as the instruments and audio effects applied to those notes. After finalizing a song in Furnace, users can export that song in several other formats, to play it with an audio player or sound chip (as well as open it in other chiptune trackers)."
    ]
  },
  "more_information": {
    "description": [
      "A FUR file is an audio module created by tildearrow Furnace, a multiplatform chiptune tracker. It contains a song that is meant to be played with a retro sound chip or video game console. These songs are typically comprised of multiple audio channels, which contain a series of notes and effects applied to those notes."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a FUR file with tildearrow Furnace. To do so, select file → open... from Furnace's menu bar. Then, navigate to and open your FUR file. After you do, the song your FUR file contains will appear in Furnace."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "You can use tildearrow Furnace to convert the song a FUR file contains to the following formats:",
      ".WAV - WAVE Audio",
      ".VGM - Video Game Music",
      ".DMF - DefleMask Module",
      ".TXT - Plain Text File",
      "To do so, select file → export... and then choose the format from the \"Export\" window."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/fur_13313.png",
      "alt": "Screenshot of a .fur file in Furnace",
      "caption": "FUR file open in Furnace"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/fur",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.486Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.486Z",
  "category": "other",
  "related": [],
  "containers": []
}