{
  "slug": "fuse",
  "extension": "fuse",
  "name": "Adobe Fuse 3D Model",
  "summary": "Learn about .FUSE files and view a list of programs that open them.",
  "developer": "Adobe Systems",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11209&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "The FUSE file includes references to model assets instead of actually storing the assets, which would increase the size of the FUSE file. The references to the locations of the asset files, which are read by Fuse to load the assets when opening the FUSE file. Therefore, you should not move the FUSE file or its assets. If you do, the model may not appear correctly in Fuse.",
      "If you need to move the FUSE file, export it as an .OBJ file in Fuse. To export the file, select File → Export → Export Model as OBJ.",
      "To open a FUSE file in Fuse, select File → Open from the menu. To create a FUSE file in Fuse, select File → New Model or the \"Begin a New Model\" icon in the toolbar.",
      "To save the FUSE file, select File → Save or click the \"Save\" icon in the toolbar. You can also save Fuse 3D models directly to Creative Cloud Libraries, then drag them into Adobe Photoshop.",
      "NOTE: Fuse is often used by video game developers or modders to create or modify characters in games."
    ]
  },
  "more_information": {
    "description": [
      "A FUSE file is a 3D model created by Adobe Fuse, a program used to create 3D human characters. It is the native format used to save 3D human models in Fuse and includes information about the face, body, clothing, and textures of the model. FUSE files can be saved, closed, and reopened for further editing."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/fuse_11209.jpg",
      "alt": "Screenshot of a .fuse file in Adobe Fuse CC",
      "caption": "FUSE file open in Adobe Fuse CC"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/fuse",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.486Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.486Z",
  "category": "other",
  "related": [],
  "containers": []
}