{
  "slug": "fwd",
  "extension": "fwd",
  "name": "RollerCoaster Tycoon 3 Fireworks Display",
  "summary": "Learn about .FWD files and view a list of programs that open them.",
  "developer": "Atari",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=9731&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "In RollerCoaster Tycoon 3, players build and manage theme parks. In these theme parks, players can add fireworks displays that consist of various fireworks launched in time to music (as well as fountains and lasers). To do so, players use RollerCoaster Tycoon 3's MixMaster tool.",
      "While using the MixMaster tool, players can load any of RollerCoaster Tycoon 3's default FWD files or save a fireworks display they've created as an FWD file. By default, the Windows version of RollerCoaster Tycoon 3 stores FWD files in the following directories:",
      "~/​My Documents/​RCT3/​Fireworks",
      "~/​RCT3/​FireworksDisplays",
      "Players may also encounter FWD files online, on RollerCoaster Tycoon 3-related websites. These FWD files contain fireworks displays created by other players, and they can also be loaded in RollerCoaster Tycoon 3."
    ]
  },
  "more_information": {
    "description": [
      "An FWD file contains a RollerCoaster Tycoon 3 fireworks display. It specifies the fireworks (and other effects) used in the display, those fireworks' timing, and any music included in the display. RollerCoaster Tycoon 3 includes several default FWD files, and players can create their own FWD files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To use an FWD file with the Windows version of RollerCoaster Tycoon 3, place it in the following directory:",
      "~/​My Documents/​RCT3/​Fireworks",
      "Then, open the MixMaster Display tool in RollerCoaster Tycoon 3, select the Open button (which uses a Folder icon), and navigate to and open your FWD file."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/fwd",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.759Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.759Z"
}