{
  "slug": "fzp",
  "extension": "fzp",
  "name": "Fritzing XML Part Description",
  "summary": "Learn about .FZP files and view a list of programs that open them.",
  "developer": "Fritzing",
  "programs": {
    "windows": [
      {
        "name": "Microsoft Visual Studio Code",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      },
      {
        "name": "GitHub Atom",
        "url": "https://fileinfo.com/software/github/atom"
      },
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=7383&b=1"
      },
      {
        "name": "Fritzing",
        "url": "https://fileinfo.com/software/fritzing/fritzing"
      },
      {
        "name": "GNU Emacs",
        "url": "https://fileinfo.com/software/gnu/emacs"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Fritzing is a printed circuit board (PCB) design application that allows Arduino and PCB enthusiasts to create PCB layouts. The circuits these layouts describe contain a variety of parts, which are represented by images.",
      "However, Fritzing parts, or FZPZ files, are made up of five constituent files, only four of which are images. The other file is an FZP file, which uses XML text to describe a part's properties, connectors, and buses. When a user exports a Fritzing part, the app creates an FZPZ file, which contains an FZP file and four .SVG images (which serve as the part's breadboard, schematic, PCB, and icon images).",
      "Because an FZP file is only one-fifth of the files that make up a Fritzing part, it cannot be used to import a part into Fritzing. Instead, you must package the FZP file and its associated SVG images (which are listed in the FZP file) into an FZPZ file. You can do this by using any archiving utility to package your FZP and SVG files into a .ZIP archive and then renaming the archive to use the .fzpz extension."
    ]
  },
  "more_information": {
    "description": [
      "An FZP file is an XML file created and used by Fritzing, an electronic circuit prototyping and design application. It contains XML-formatted text that describes a part used in a circuit. FZP files cannot be imported into Fritzing by themselves; they must be imported as part of .FZPZ files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Because FZP files are XML files, you can open them in any text or source code editor, such as Microsoft Visual Studio Code (cross-platform), GitHub Atom (cross-platform), Microsoft Notepad (Windows), or Apple TextEdit (Mac)."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/fzp_7383.png",
      "alt": "Screenshot of a .fzp file in Microsoft Visual Studio Code",
      "caption": "FZP file open in Microsoft Visual Studio Code"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/fzp",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.761Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.761Z"
}