{
  "slug": "g722",
  "extension": "g722",
  "name": "G.722 ADPCM Audio",
  "summary": "Learn about .G722 files and view a list of programs that open them.",
  "developer": "International Telegraph Union",
  "programs": {
    "windows": [
      {
        "name": "FFmpeg",
        "url": "https://fileinfo.com/software/ffmpeg/ffmpeg"
      },
      {
        "name": "VLC media player",
        "url": "https://fileinfo.com/software/videolan/vlc_media_player"
      },
      {
        "name": "File Viewer Plus",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11594"
      }
    ]
  },
  "technical_info": {
    "content": [
      "The G.722 standard was created and is maintained by the International Telegraph Union (ITU), a division of the United Nations that coordinates the world's response to information and communication technology issues. The standard was created and released in 1988 and last updated in 2012. It allowed VoIP application providers and radio broadcasters to incorporate compressed, high-definition audio into their applications and broadcasts.",
      "G.722 has since been improved upon and replaced by new standards, including G.722.1 and G.722.2. While these standards are named similarly to G.722 and are also used to provide high-definition audio, they are not actually based on the G.722 standard. Instead, they were created using entirely different compression technologies."
    ]
  },
  "more_information": {
    "description": [
      "A G722 file is an audio file saved using the G.722 codec, a standard codec that provides 7 kHz wideband audio at 48, 56, and 64 kbit/s. It typically contains high-quality spoken audio. G722 files were used and created by Voice over Internet Protocol (VoIP) applications such as Asterisk and Incredible PBX, before being superseded by files saved using newer codecs."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Because G722 files are uncommon, most popular media players cannot play them. However, you can convert G722 files to a more usable audio format using FFmpeg (multiplatform) and then play the converted file using a media player such as VLC media player (multiplatform."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "You can use FFmpeg (multiplatform) to convert the audio a G722 file contains to many common audio formats, including .MP3, .WAV, .FLAC, and .AAC."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/g722",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.762Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.762Z"
}