{
  "slug": "gameproj",
  "extension": "gameproj",
  "name": "GameSalad Project File",
  "summary": "Learn about .GAMEPROJ files and view a list of programs that open them.",
  "developer": "GameSalad",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=7868&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "GameSalad projects can be published to the Apple iTunes Store, the Mac App Store, the Google Play (Android) store, or to the Web. Note that Google Play publishing is only supported in the Pro version of GameSalad. Choose the Publish button in the window title bar to publish the game.",
      "Before publishing games, you can preview them using GameSalad's iOS Viewer or Android Viewer. The iOS Viewer can either be run on an actual iPhone or with the iOS Simulator that is provided with Xcode.",
      "NOTE: The Windows version of GameSalad uses the .GSPROJ extension. You can transfer projects between the Mac and Windows versions of the software."
    ]
  },
  "more_information": {
    "description": [
      "Game development project created by the Mac version of GameSalad Creator, a program used for making Android, iOS, Kindle, Nook, HTML5, and Mac OS X games; saves a series of \"scenes,\" \"actors,\" and \"tables,\" as well as behaviors that define how the actors interact in each scene; also saves all assets, including sounds and images."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/gameproj",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.763Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.763Z"
}