{
  "slug": "gedcom",
  "extension": "gedcom",
  "name": "GEDCOM Genealogy File",
  "summary": "Learn about .GEDCOM files and view a list of programs that open them.",
  "developer": "The LDS Church",
  "programs": {
    "windows": [
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=2981&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "In the 1980s, The Church of Jesus Christ of Latter-day Saints (The LDS Church) developed and released the GEDCOM format. GEDCOM was designed to be a universal format that genealogical researchers could use to save and exchange data across genealogy databases and programs.",
      "Since its initial release, the format has undergone several revisions, the most notable being 5.5.1. This version of the format was released in 1999 and is the most widely-used version. In 2021, FamilySearch, a software company affiliated with The LDS Church, released version 7.0 of GEDCOM, which included support for .GDZ files.",
      "Both professional and amateur genealogists save their records in the GEDCOM format. Professionals typically create and save data used for academic purposes, while amateurs typically document their own family history.",
      "NOTE: GEDCOM files may also be saved as .GED files."
    ]
  },
  "more_information": {
    "description": [
      "A GEDCOM file is a genealogical record saved in the GEnealogical Data COMmunications (GEDCOM) format. It contains records of family history and genealogical event data, along with metadata linking the records. GEDCOM files often include information about births, deaths, marriages, children, and family members' physical attributes."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open GEDCOM files in a variety of genealogy applications, including RootsMagic (Windows, Mac), Ancestral Author (Windows, Mac), MyHeritage Family Tree Builder (Windows, Mac), and GeneWeb (cross-platform). You can also upload GEDCOM files to Ancestry.com and FamilySearch.org (Web).",
      "Since GEDCOM files are saved in a plain text format, you can also open the files in any text editor, such as Microsoft Notepad (Windows) or Apple TextEdit (macOS). Note that opening GED files in a text editor will not show genealogical information in the same way it would appear in a genealogy application."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/gedcom",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.497Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.497Z",
  "category": "other",
  "related": [],
  "containers": []
}