{
  "slug": "gform",
  "extension": "gform",
  "name": "Google Forms Shortcut",
  "summary": "Learn about .GFORM files and view a list of programs that open them.",
  "developer": "Google",
  "programs": {
    "windows": [
      {
        "name": "Google Drive",
        "url": "https://file.org/free-download/google-drive"
      },
      {
        "name": "Google Slides",
        "url": "https://file.org/free-download/google-slides"
      },
      {
        "name": "Backup and Sync",
        "url": "https://file.org/free-download/backup-and-sync"
      },
      {
        "name": "Google Drive for PC is now Backup and Sync from Google",
        "url": "https://file.org/free-download/google-drive-for-pc-is-now-backup-and-sync-from-google"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=7632&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Google Drive for Desktop is a program that allows Google Drive users to back up and open their Google Drive files on Windows and Mac PCs. While Drive for Desktop stores actual backups of some types of files (such as .JPG and .DOCX files) on users' computers, it does not store copies of files created using Google Forms, Docs, Sheets, and other Google Workspace applications. Instead, Drive for Desktop stores shortcut files that, when double-clicked, open the associated file in the web version of the correct Google Workspace application.",
      "GFORM files are Drive for Desktop shortcuts that open forms created in Google Forms. When a Drive for Desktop user double-clicks a GFORM file, the related form opens in Google Forms, provided the user is signed in to a Gmail account allowed to access the form. Each GFORM file is a JSON file that contains a form's URL and document ID, as well as the name of the Gmail account used to create the form.",
      "NOTE: GFORM files were previously created by Backup and Sync from Google. Google replaced Backup and Sync with Drive for Desktop in October 2021."
    ]
  },
  "more_information": {
    "description": [
      "A GFORM file is a shortcut used to open a Google Forms document stored within Google Drive. The file contains a reference to the form it opens, as well as the Gmail account used to create the form. GFORM files are created by Google Drive for Desktop."
    ]
  },
  "how_to_open": {
    "instructions": [
      "If you have Google Drive for Desktop installed on your PC, or you are using a Chrome OS device, you can double-click a GFORM file to open the form it references in Google Forms. You may have to sign in to your Gmail account or request access to the form to open it.",
      "If necessary, you can also open a GFORM file in any text editor to view the URL, document ID, and Gmail account information it contains. You may want to do this, for example, if you are having trouble using your GFORM file to open a form. If double-clicking your GFORM file does not open a form, you can try copying and pasting your file's URL into your web browser to access your form."
    ]
  },
  "images": [
    {
      "url": "https://assets.file.org/images/fileorg-logo-440x90-4-8b.png",
      "alt": "File.org logo"
    },
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/gform_7632.png",
      "alt": "Screenshot of a .gform file in GitHub Atom",
      "caption": "GFORM file open in GitHub Atom"
    }
  ],
  "sources": [
    {
      "url": "https://file.org",
      "source": "file.org",
      "retrieved_at": "2025-11-01T22:32:42.153Z"
    },
    {
      "url": "https://fileinfo.com/extension/gform",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.153Z"
    },
    {
      "source": "filext.com",
      "retrieved_at": "2025-11-01T22:32:42.153Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.153Z",
  "mime": [
    "application/vnd.google-apps.form"
  ],
  "category": "other",
  "related": [],
  "containers": []
}