{
  "slug": "glb",
  "extension": "glb",
  "name": "Binary GL Transmission Format File",
  "summary": "Learn about .GLB files and view a list of programs that open them.",
  "developer": "The Khronos Group",
  "category": "3d",
  "category_slug": "3d",
  "programs": {
    "windows": [
      {
        "name": "Gargoyle",
        "url": "https://file.org/free-download/gargoyle"
      },
      {
        "name": "Graphic Editor",
        "url": "https://file.org/free-download/graphic-editor"
      },
      {
        "name": "gINT",
        "url": "https://file.org/free-download/gint"
      },
      {
        "name": "Dimension",
        "url": "https://file.org/free-download/dimension"
      },
      {
        "name": "Adobe Substance 3D Stager",
        "url": "https://file.org/free-download/adobe-substance-3d-stager"
      },
      {
        "name": "Ultimaker Cura",
        "url": "https://file.org/free-download/ultimaker-cura"
      },
      {
        "name": "Spin3D Mesh Converter",
        "url": "https://file.org/free-download/spin3d-mesh-converter"
      },
      {
        "name": "Adobe Dimension",
        "url": "https://file.org/free-download/adobe-dimension-0"
      },
      {
        "name": "Creality Slicer",
        "url": "https://file.org/free-download/creality-slicer"
      },
      {
        "name": "Spin 3D Mesh Converter",
        "url": "https://file.org/free-download/spin-3d-mesh-converter"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10859&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "GLB file format is based on little endian and its structure shows that it contains:\n\nA 12-byte preamble, entitled the header.One or more chunks that contains JSON content and binary data.\n\nGLB Header\n\nThe GLB file format header consists of three 4-byte entries:\n\nuint32 magic - magic equals 0x46546C67. It is ASCII string glTF, and can be used to identify data as Binary glTFuint32 version - indicates the version of Binary glTF container formatuin32 length - the total length of the Binary glTF, including Header and all chunks in bytes\n\nChunks\n\nEach chunk in a GLB file has the following structure:\n\nuint32uint32ubyte[]chunkLengthchunkTypechunkData\n\nchunkLength - length of chunkData in byteschunkType - indicates indicates the type of chunkchunkData - binary payload of chunk\n\nwhere the chunk types are:\n\n#Chunk TypeASCIIDescriptionOccurrences1.0x4E4F534AJSONStructured JSON content12.0x004E4942BINBinary buffer0 or 1\n\nThe start and end of each chunk must be aligned to 4-byte boundary and padding should be used for this purpose.\n\nStructured JSON Content\n\nThis should be the very first chunk of Binary glTF asset and enables the implementation to progressively retrieve resources from subsequent chunks. This also provides the capability to read only a selected subset of resources from a Binary glTF asset such as the coarsest LOD of a mesh. In order to meet the alignment requirements, this chunk must be padded with trailing Space chars (0x20).\n\nBinary Buffer\n\nThis chunk contains the binary payload for geometry, animation key frames, skins, and images. It should be the second chunk of the Binary glTF asset and must be padded with trailing zeros (0x00) to satisfy the alignment requirements.",
      "GLB files can be used to save and share digital assets between different 3D modeling tools, similarly to .DAE files. However, they are also optimized for download speed and load time at runtime, which makes them easier to use in mobile- and web- based 3D modeling programs. They are also a more streamlined format for uploading and downloading from online digital asset databases, such as 3D Warehouse and Remix 3D.",
      "GLB files are similar to GLTF files in that they may include embedded resources or may reference external resources. If a GLB file comes with separate resources, they most likely will be the following files:",
      "Binary (.BIN) files - One or more BIN files that contain animation, geometry, and other data.",
      "Shader (GLSL) files - One or more GLSL files that contain shaders.",
      "Image (.JPG, .PNG, etc.) files - One or more files that contain textures for the 3D model.",
      "The glTF is developed to be an efficient, extensible, interoperable format for the transmission and loading of 3D content. The goals of the format include, compact file sizes, fast loading, complete 3D scene representation, runtime independence, and extensibility to accompany further development. For more information about glTF, click here."
    ]
  },
  "more_information": {
    "description": [
      "GLB is the binary file format representation of 3D models saved in the GL Transmission Format (glTF). Information about 3D models such as node hierarchy, cameras, materials, animations and meshes in binary format. This binary format stores the glTF asset (JSON, .bin and images) in a binary blob. It also avoids the issue of increase in file size which happens in case of glTF. GLB file format results in compact file sizes, fast loading, complete 3D scene representation, and extensibility for further development. The format uses model/gltf-binary as MIME type.",
      "A GLB file contains a 3D model saved in the GL Transmission Format (glTF). It stores information about a 3D model, such as node hierarchy, cameras, and materials, animations, and meshes in binary format. GLB files are the binary version of .GLTF files."
    ]
  },
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ],
  "images": [
    {
      "url": "https://assets.file.org/images/fileorg-logo-440x90-4-8b.png",
      "alt": "File.org logo"
    },
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://file.org",
      "source": "file.org",
      "retrieved_at": "2025-11-02T02:43:26.392Z"
    },
    {
      "url": "https://docs.fileformat.com/3d/glb/",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-02T02:43:26.392Z"
    },
    {
      "url": "https://fileinfo.com/extension/glb",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.392Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.392Z"
}