{
  "slug": "glx",
  "extension": "glx",
  "name": "Xplorer GLX Graph",
  "summary": "Learn about .GLX files and view a list of programs that open them.",
  "developer": "PASCO",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12273&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "PASCO Xplorer GLX is a discontinued datalogger that students can use to record data while performing scientific experiments. For example, a student can plug an external temperature sensor into their Xplorer GLX and use it to record and graph an item's temperature during an experiment.",
      "Students can view the data they record on an Xplorer GLX either in the device itself or on a computer. To view the data on a computer, students must connect their Xplorer GLX to a computer and open or download their GLX files using GLX File Manager. GLX File Manager opens students' GLX files in PASCO DataStudio (also discontinued) or PASCO Capstone."
    ]
  },
  "more_information": {
    "description": [
      "A GLX file is graph data recorded using the PASCO Xplorer GLX datalogger. It contains the results of a scientific experiment, recorded using one or more external sensors and the Xplorer GLX. You can download and save GLX files while the Xplorer GLX is connected to a computer, and you can open GLX files in PASCO DataStudio or Capstone."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a GLX file in PASCO Capstone (Windows, Mac). To do so, select, File → Open Experiment... from Capstone's menu bar. Then, navigate to and open your GLX file."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/glx",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.502Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.502Z",
  "category": "other",
  "related": [],
  "containers": []
}