{
  "slug": "goat",
  "extension": "goat",
  "name": "Goat Simulator Map",
  "summary": "Learn about .GOAT files and view a list of programs that open them.",
  "developer": "Coffee Stain Studios",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12586&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Goat Simulator is a video game in which players control a goat and explore a game world. Players can also perform stunts, destroy objects, drag objects around with their tongues, and perform other actions to earn points.",
      "Players who purchase Goat Simulator via Steam can create custom game maps using the included Goat Simulator Development Kit. The Development Kit gives players access to Unreal Editor game development tools.",
      "After a player finishes creating a custom map, they can save it as a GOAT file. By default, Goat Simulator Development Kit saves GOAT files in the ~/​GoatSimulator/​GoatGame/​Content/​Maps directory."
    ]
  },
  "more_information": {
    "description": [
      "A GOAT file is a custom map created for use in Goat Simulator, a game in which players wander around as a goat. Players can create GOAT files using the Goat Simulator Development Kit, which is included with the Steam version of Goat Simulator."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a GOAT file in Goat Simulator Development Kit. To do so, select File → Open... from the program's toolbar. Then, navigate to and open your GOAT file.",
      "To use a GOAT file with Goat Simulator:",
      "Place the file in the ~GoatSimulator/​GoatGame/​Mods/​MyMods/​YourModName folder.",
      "Create a GoatMod.ini file as specified in Goat Simulator Development Kit's documentation (linked below). Place the file in the same directory as your GOAT file.",
      "The next time you start Goat Simulator, your GOAT file will appear as a playable map."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/goat",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.505Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.505Z",
  "category": "other",
  "related": [],
  "containers": []
}