{
  "slug": "gp",
  "extension": "gp",
  "name": "Guitar Pro 7 Document",
  "summary": "Learn about .GP files and view a list of programs that open them.",
  "developer": "Arobas Music",
  "category": "audio",
  "category_slug": "audio",
  "programs": {
    "windows": [
      {
        "name": "Arobas Music Guitar Pro",
        "url": "https://fileinfo.com/software/arobas_music/guitar_pro"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12547&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Guitar Pro is a music score application that enables you to create and modify stringed instrument tablatures and scores for other instruments. Arobas Music originally developed Guitar Pro to be a guitar and bass tablature editor but added features since its release to make it a comprehensive music sheet editor.",
      "The Guitar Pro 7 Document (GP) format debuted in version 7 of Guitar Pro when Arobas Music released the software in April 2017. The format replaced the Guitar Pro 6 Document (.GPX) format introduced in April 2010.",
      "To create a GP file with Guitar Pro 7:",
      "Select File → New or New from Template",
      "Modify the score sheet",
      "Select File → Save or Save As...",
      "To export a GP file to other file formats with Guitar Pro 7, select File → Export, then choose the export format. Options include:",
      "GPX - Guitar Pro 6 Format",
      "GP5 - Guitar Pro 5 Format",
      "MIDI - Musical Instrument Digital Interface Format",
      "WAV - WAVE Audio Format",
      "MP3 - MP3 Audio Format",
      "PNG - Portable Network Graphic Format",
      "XML - MusicXML Format",
      "PDF - Portable Document Format",
      "NOTE: GP files do not contain actual audio data. Instead, they store instruments and musical notes simulated as music by the Guitar Pro engine in the software."
    ]
  },
  "more_information": {
    "description": [
      "A file with “.gp” extension typically refers to a Guitar Pro file. Guitar Pro is a software application developed by Arobas Music that allows musicians to create, edit and play back guitar tablature and musical scores. The “.gp” file format is specific to Guitar Pro and contains musical notation, tablature and other information related to a musical composition.\n\nGuitar Pro files store musical scores for multiple instruments. The content includes notations for guitar, bass, drums and various other instruments. It may also include information about tempo, key signature, time signature, and other musical elements.\n\nUsers can create and edit musical scores using the Guitar Pro software. The software also allows users to play back the musical composition, providing a virtual playback of the notations.",
      "A GP file is a document that stores a musical score created by Arobas Music Guitar Pro 7. It is saved in a proprietary format and contains a composition for an instrument, such as a guitar, bass, piano, or percussion. GP files also store metadata, including the music score's title, artist, musical notation, and playing style."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open open a Guitar Pro file with a “.gp” extension using Guitar Pro software.",
      "You can open a GP file with Arobas Music Guitar Pro (version 7 and later).",
      "Guitar Pro 7 and later supports previous versions of Guitar Pro documents, such as GPX, .GP5, and .GP4 files. However, previous versions of Guitar Pro do not support later versions of Gitar Pro documents. For example, Guitar Pro 5 does not support GP files."
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/gp_12547.png",
      "alt": "Screenshot of a .gp file in Arobas Music Guitar Pro 7.6",
      "caption": "GP file open in Arobas Music Guitar Pro 7.6"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/audio/gp/index.html",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-01T22:32:42.271Z"
    },
    {
      "url": "https://fileinfo.com/extension/gp",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.271Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.271Z",
  "containers": []
}