{
  "slug": "gpg",
  "extension": "gpg",
  "name": "GNU Privacy Guard Encrypted File",
  "summary": "Learn about .GPG files and view a list of programs that open them.",
  "developer": "Free Software Foundation",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1229&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "GNU Privacy Guard is an encryption program that uses the OpenPGP encryption standard defined by RFC4880. It allows you to encrypt and digitally sign files and email communications, using private cryptographic keys, and decrypt those files and communications using accompanying public keys.",
      "Typically, files encrypted using GnuPG are saved with the .gpg extension. This denotes they were encrypted and can be decrypted with GnuPG. However, to decrypt a GPG file, you must possess the necessary GnuPG key (typically another user's public key).",
      "NOTE: On occasion, some GPG files may instead contain a GnuPG key."
    ]
  },
  "more_information": {
    "description": [
      "A GPG file is a file that has been encrypted by GNU Privacy Guard, also known as GnuPG or gpg. It contains a document, image, video, or other file a user encrypted. To decrypt a GPG file, you must have access to the appropriate GnuPG cryptographic key."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can use GNU Privacy Guard to decrypt a GPG file, provided you have access to the necessary security key. After importing the necessary key, use the following command to decrypt your GPG file:",
      "gpg -d YourFilename.gpg"
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/gpg",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.777Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.777Z"
}