{
  "slug": "grs",
  "extension": "grs",
  "name": "Gravity Sketch Sketch File",
  "summary": "Learn about .GRS files and view a list of programs that open them.",
  "developer": "Gravity Sketch",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12172&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Gravity Sketch is a 3D drawing and model creation tool that allows users to create loose sketches, detailed models, and fully-realized scenes. Most users access Gravity Sketch using a VR headset and controllers, which allow the user to draw, place, and edit objects as though they were standing among them.",
      "Users can save finished or in-progress Gravity Sketch models as GRS files. In addition to being able to open GRS files from Gravity Sketch's main menu, users can import GRS files into another Gravity Sketch project. This allows a user to add a previously-completed model to a new project. Users can also export GRS files as .OBJ, .IGES, or .FBX files, to view and edit the models they contain in more typical desktop 3D modeling programs."
    ]
  },
  "more_information": {
    "description": [
      "A GRS file is a 3D drawing created by Gravity Sketch, a 3D design platform available primarily for VR devices. It contains a 3D model or models that a user created in Gravity Sketch. GRS files can be viewed in the VR and iOS (iPad) versions of Gravity Sketch, and they can be exported from Gravity Sketch in several common 3D model formats (for use with other 3D modeling programs)."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a GRS file in Gravity Sketch (Windows, iOS). For example, you can place a GRS file in Gravity Sketch's Saved Sketches folder to be able to select it from the program's main menu.",
      "If you want to import a GRS file into a new Gravity Sketch scene, you can do so by adding the file to Gravity Sketch's Import Library folder. You can then select the GRS file in Gravity Sketch's Import Models tool.",
      "To export a GRS file as an OBJ, IGES, or FBX file, select the Export icon that appears in Gravity Sketch. You'll then be able to save your GRS file as an OBJ, IGES, or FBX file. By default, Gravity Sketch stores exported sketches in its Exported Sketches folder."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/grs",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.510Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.510Z",
  "category": "other",
  "related": [],
  "containers": []
}