{
  "slug": "gtable",
  "extension": "gtable",
  "name": "Google Fusion Table Shortcut",
  "summary": "Learn about .GTABLE files and view a list of programs that open them.",
  "developer": "Google",
  "programs": {
    "windows": [
      {
        "name": "Google Drive",
        "url": "https://fileinfo.com/software/google/drive"
      },
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=7631&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Google Fusion Tables was a Google web service that allowed users to gather, visualize, and share data. Fusion Tables users created pie charts, bar charts, lineplots, timelines, and geographical maps, which they then shared with others.",
      "Google Fusion Tables users who also used the desktop Google Drive or Backup and Sync from Google apps may have encountered GTABLE files. These files were shortcuts that allowed users to quickly open fusion tables in Google Fusion Tables. GTABLE files were JSON files that contained a fusion table's URL and document ID, as well as the name of the Gmail account used to create the fusion table.",
      "In late 2019, Google announced it was discontinuing Google Fusion Tables and the Fusion Tables API. In March 2020, Google deleted all Fusion Tables data. As a result, most users' GTABLE files (which were stored in Google Drive) were also deleted. Any remaining GTABLE files can no longer open the fusion tables they were previously associated with, as those tables no longer exist."
    ]
  },
  "more_information": {
    "description": [
      "A GTABLE file is a shortcut that was previously used to open a fusion table created in Google Fusion Tables and stored in Google Drive. It contains a reference to the table it opened, as well as the Gmail account used to create the table. GTABLE files are now obsolete, as Google has discontinued Google Fusion Tables."
    ]
  },
  "how_to_open": {
    "instructions": [
      "While you can no longer use a GTABLE file to open a Google fusion table, you can still open it in any text editor, such as Microsoft Notepad or Apple TextEdit. This will allow you to view the URL, document ID, and Gmail account information your GTABLE file contains."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/gtable",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.784Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.784Z"
}