{
  "slug": "gvsp",
  "extension": "gvsp",
  "name": "Geocortex Viewer for Silverlight Project",
  "summary": "Learn about .GVSP files and view a list of programs that open them.",
  "developer": "Latitude Graphics",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10649&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Geocortex Viewer for Silverlight projects allow a user to customize a map to be displayed in a certain way, whether it be different enabled layers or a view zoomed into a specific location. When you save your map as a project, the GVSP file is created, which allows you to share with other users. When the GVSP file is opened, the save view will be displayed.",
      "To save a GVSP file in Geocortex Viewer for Silverlight, click the \"Save Project\" disk icon, choose a save location, and click Save.",
      "To open a GVSP file in Geocortex Viewer for Silverlight, click the \"Open Project\" folder icon, navigate to the GVSP file location, and click Open. You need to log in to the web-GIS to verify your credentials.",
      "Geocortex Viewer for Silverlight is one of several Geocortex programs included with Geocortex Essentials used to enhance the ArcGIS platform on the web. It was released in 2011 with Geocortex Essentials 3.3.",
      "NOTE: Geocortex Viewer for Silverlight has been discontinued."
    ]
  },
  "more_information": {
    "description": [
      "A GVSP file contains a project created by Geocortex Viewer for Silverlight, a GIS program used to enhance ArcGIS software for web-GIS users. It stores a project, which includes a map with plotted coordinates and drawn lines, areas, points, and text. GVSP files also contain the layer symbolization and layer drawing order of the map."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/gvsp",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.513Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.513Z",
  "category": "other",
  "related": [],
  "containers": []
}