{
  "slug": "gwb",
  "extension": "gwb",
  "name": "Interwrite Presentation File",
  "summary": "Learn about .GWB files and view a list of programs that open them.",
  "developer": "Interwrite Learning",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10508&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "In Interwrite Workspace, you can create pages with the \"Page Creation\" and \"Capture\" tools then can annotate them with the \"Annotation\" tools. The GWB file is automatically created as an untitled presentation when you go into \"Annotation\" mode and is automatically saved whenever any changes are made to the presentation. GWB files can be used for printing a presentation or emailing a presentation to other InterWrite users.",
      "Interwrite Workspace is a software package that connects with Interwrite Board (an electronic whiteboard) and is used to write and record digital lessons, use virtual simulations, and access other digital content. Interwrite Learning products were absorbed into electronic whiteboard technology developed by Turning Technologies."
    ]
  },
  "more_information": {
    "description": [
      "A GWB file is a presentation file created by Interwrite Workspace, a program used to enhance classroom lessons. It contains one or more pages that may include annotations such as notes, highlights, drawings, screenshots, and graphs. GWB files can be opened by InterWrite Reader."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/gwb",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.514Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.514Z",
  "category": "other",
  "related": [],
  "containers": []
}