{
  "slug": "h265",
  "extension": "h265",
  "name": "H.265 Video",
  "summary": "Learn about .H265 files and view a list of programs that open them.",
  "developer": "JCT-VC",
  "category": "video",
  "category_slug": "video",
  "programs": {
    "windows": [
      {
        "name": "VLC media player",
        "url": "https://fileinfo.com/software/videolan/vlc_media_player"
      },
      {
        "name": "FFmpeg",
        "url": "https://fileinfo.com/software/ffmpeg/ffmpeg"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11791&b=1"
      },
      {
        "name": "VideoLAN VLC media player",
        "url": "https://fileinfo.com/software/videolan/vlc_media_player"
      }
    ]
  },
  "technical_info": {
    "content": [
      "High quality and better compression ratioCan easily be utilized in high-resolution movies like 2K or 4K.Having better adaptivity having extra coding modesHEVC contains an in-loop deblocking filter, where the blocking items around the transform edges within the rebuilt picture are smoothed to enhance the picture quality and compression proficiency.HEVC introduces a new filtering stage called the sample-adaptive offset (SAO) filter, which can offer both an impartial and development and enhancement in video quality.Useful in reducing the bandwidth with larger resolutionsPotential to back resolutions of 8192 x 4320 pixelsDesigned mainly for top resolution formatsIntra coding in H265 allows 35 prediction modes",
      "In 2013, the Joint Collaborative Team on Video Coding (JCT-VC) established the H.265 video codec. The H.265 codec offers up to 50 percent better data compression than its predecessor, the H.264 codec. This means the same video, saved at the same level of quality can take up 50 percent less hard drive space when saved using the H.265 codec, instead of the H.264 codec.",
      "The H.265 codec's superior video compression has also allowed video creators to create, save, and transmit higher-quality videos. For example, the H.265 codec made transmitting 8K video more feasible, since those high-resolution videos could now be compressed into manageably-sized files.",
      "Most times, videos saved using the H.265 codec are saved using common video file types, such as .MOV and .MP4. Those files may use H.265 compression, but are not .h265 files. On rare occasions, however, you may encounter an H.265 video saved as an .HEVC or H265 file."
    ]
  },
  "more_information": {
    "description": [
      "H.265 is also known as HEVC (High-Efficiency Video Coding) is a successor to H.264. It is the newest video compression standard that is said to double the data compression proportion as compare to H.264 with the same video quality. Video encoded with HEVC will uphold the high visual quality but at a smaller file size. It was developed in response to the increasing need for higher compression of moving pictures for different applications such as:\n\nStreamingVideoconferencingDigital storage mediaTelecasting\n\nThe main purpose behind developing H.265 was to enable the use of the coded video depiction in a flexible way for a wide variety of networks and with a high compression ability for an anticipated image or video quality.",
      "An H265 file is a video saved using the H.265 video compression standard. It contains a video with a resolution of up to 8192x4320 pixels, including 8K UHD. H265 files are the successors to .H264 files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Because H265 files are so uncommon, most popular media players cannot play them. However, you can open and play H265 videos in VLC media player, and you can convert them to a more usable video format using FFmpeg."
    ]
  },
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/video/h265/",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-02T02:43:26.519Z"
    },
    {
      "url": "https://fileinfo.com/extension/h265",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.519Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.519Z"
}