{
  "slug": "h4m",
  "extension": "h4m",
  "name": "GameCube Movie",
  "summary": "Learn about .H4M files and view a list of programs that open them.",
  "developer": "Hudson",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13685&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Hudson, a Japanese technology company, developed the H4M file type for Nintendo video games. There are several notable versions of the file type, including HVQM3 (prevalent in Nintendo 64 Mario Party games) and HVQM4 (prevalent in Nintendo GameCube Resident Evil games).",
      "Modders and other GameCube enthusiasts may find H4M files while exploring a game's contents. For example, a modder attempting to replace or modify movies in a Resident Evil game might encounter several H4M files in the game's directory for data files."
    ]
  },
  "more_information": {
    "description": [
      "An H4M file is a movie played in several Nintendo GameCube video games, most notably games in the Resident Evil series. It contains a text header with metadata followed by video data encoded with the Adaptive Orthogonalized Transform (AOT) compression scheme and audio data in the IMA ADPCM, DPCM, or PCM formats. Most GameCube gamers will only encounter H4M files if they are attempting to modify game data files that comprise gameplay."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an H4M file with HVQM4 video decoder. You can also decode audio in an H4M file with H4M Audio Decode."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/h4m",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.517Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.517Z",
  "category": "other",
  "related": [],
  "containers": []
}