{
  "slug": "har",
  "extension": "har",
  "name": "HTTP Archive FIle",
  "summary": "Learn about .HAR files and view a list of programs that open them.",
  "developer": "World Wide Web Consortium",
  "category": "web",
  "category_slug": "web",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11344&b=1"
      },
      {
        "name": "Microsoft Visual Studio Code",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      }
    ]
  },
  "technical_info": {
    "content": [
      "The purpose of the HAR format is to log the performance of web browsers, which allows developers to analyze how well the browsers are loading webpages. HAR files may be exported by various HTTP-related tools, such as Electron HAR, HttpWatch, HTTP Toolkit, but are typically exported by web browsers. Most browsers support the format, including Google Chrome, Mozilla Firefox, Apple Safari, and Microsoft Edge and Internet Explorer.",
      "You can open HAR files with various programs, including the online HAR Viewer tool and the open source, cross-platform HTTP Toolkit. Since HAR files are saved in JSON format, you can also open them using a JSON editor or a plain text editor, such as Microsoft Notepad or Apple TextEdit.",
      "If you open a HAR file in a text editor, you will see the contents in the JSON format organized into the following object types:",
      "log - Includes information about the HAR format version, log creator, browser version, and list of tracked webpages.",
      "creator - Includes information about the creator of the log.",
      "browser - Includes information about the browser.",
      "pages - Includes information about the list of exported webpages.",
      "pageTimings - Includes information about the events fired during the page load in milliseconds.",
      "entries - Includes information about all the HTTP requests.",
      "request - Includes information about performed requests, including the request method, cookie and header objects, and query parameter objects.",
      "response - Includes information about the response status, status description, HTTP version, and cookie and header objects.",
      "cookies - Includes information about all the cookies in the request and response objects.",
      "headers - Includes information about all the headers in the request and response objects.",
      "queryString - Includes information about the parameters and values parsed from a query string.",
      "postData - Includes information about any posted data in the request object.",
      "params - Includes information about any posted parameters in the postData object.",
      "content - Includes information about response content in the response object.",
      "cache - Includes information about a request from the browser cache.",
      "timings - Includes information about the request and response timings in milliseconds.",
      "NOTE: The HAR format is developed by the Web Performance Working Group of the World Wide Web Consortium (W3C)."
    ]
  },
  "more_information": {
    "description": [
      "A file with .har (HTTP Archive) file is an HTTP archive file that stores session data transferring over many browsers (such as Chrome, Safari, IE, Firefox, etc.) in JSON file format. The data transferred over the internet between the server and the client (in this case user’s browser) contains HTTP request and response headers that are stored in HAR file. It further contains detailed information about performance data about web pages loaded in the browser. HAR files can be opened in any text editor such as Notepad on Microsoft Windows OS and TextEdit on Apple MacOS.",
      "A HAR file is an archive saved in the HTTP Archive (HAR) format, which is a JSON-formatted format used to save collected HTTP performance data. It contains information about webpages a web browser has loaded, which includes the tracked webpages, response times, and web browser version. HAR files also store metadata, such as the HAR format version and the creator of the file."
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/har_11344.png",
      "alt": "Screenshot of a .har file in Microsoft Visual Studio Code 1",
      "caption": "HAR file open in Microsoft Visual Studio Code 1"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/web/har/index.html",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-01T22:32:42.272Z"
    },
    {
      "url": "https://fileinfo.com/extension/har",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.272Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.272Z",
  "containers": []
}