{
  "slug": "hc",
  "extension": "hc",
  "name": "Holy C Source Code File",
  "summary": "Learn about .HC files and view a list of programs that open them.",
  "developer": "Terry A. Davis",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11846&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "In the early 2000s, programmer Terry A. Davis began creating an operating system that came to be known as TempleOS. Davis, who was a schizophrenic, claimed that God commanded him to create TempleOS. While the operating system is most useful for creating simple video games, it includes a number of biblical references, including a game named After Egypt. Davis claimed that a number of the OS's specifications were set down by God, and after publishing TempleOS in 2013, Davis announced that \"God's temple is finished.\"",
      "As part of developing TempleOS, Davis also developed the Holy C programming language. Holy C is a variant of the C programming language that is used only by TempleOS. Those who create TempleOS programs write those programs in Holy C, and they save and distribute their work in HC files."
    ]
  },
  "more_information": {
    "description": [
      "An HC file is a Holy C source code file, which is used with the TempleOS operating system. It contains code that is meant to be compiled within TempleOS. HC files can be opened and edited in any text editor, but can be compiled and run only in TempleOS."
    ]
  },
  "how_to_open": {
    "instructions": [
      "While you can open and edit a Holy C source code file in any text editor, HC files are meant to be edited, compiled, and run within the TempleOS operating system. TempleOS includes its own source code editor that allows developers to open, edit, and create HC files."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/hc_10584.png",
      "alt": "Screenshot of a .hc file in IDRIX VeraCrypt",
      "caption": "HC file open in IDRIX VeraCrypt"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/hc",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.791Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.791Z"
}