{
  "slug": "hi",
  "extension": "hi",
  "name": "MAME High Scores File",
  "summary": "Learn about .HI files and view a list of programs that open them.",
  "developer": "The MAME Team",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=5573&b=1"
      },
      {
        "name": "MAME",
        "url": "https://fileinfo.com/software/mame/mame"
      },
      {
        "name": "MacMAME",
        "url": "https://fileinfo.com/software/macmame/macmame"
      },
      {
        "name": "MAME OS X",
        "url": "https://fileinfo.com/software/dave_dribin/mame_os_x"
      }
    ]
  },
  "technical_info": {
    "content": [
      "MAME stands for \"Multiple Arcade Machine Emulator,\" and is a free and open-source emulator (along with MacMAME) designed to recreate the hardware of arcade game systems on modern computers and devices. The emulator allows users to play classic arcade games by running copies of the original game, preserving gaming history and preventing older games from becoming lost.",
      "When users play games with MAME and MacMAME, the emulators save information to HI files to preserve score records. For example, if a player sets a new record in the arcade game Galaga while using MAME, the emulator saves that score to a HI file. The next time the player or someone else loads Galaga in the emulator, the high scores will appear the same as during the last session."
    ]
  },
  "more_information": {
    "description": [
      "A HI file is a high score file created by MAME arcade game emulators, such as MAME for Windows and MacMAME for macOS. It stores the highest scores achieved in a specific arcade game, including player names or initials and their corresponding scores. HI files allow emulators to preserve score records across gaming sessions, maintaining a history of player achievements."
    ]
  },
  "how_to_open": {
    "instructions": [
      "HI files are not meant to be opened. Instead, the MAME emulator automatically references the HI file in its expected folder (typically alongside the ROMs or in a dedicated hi directory) to load their saved high scores."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/hi",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.525Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.525Z",
  "category": "other",
  "related": [],
  "containers": []
}