{
  "slug": "hip",
  "extension": "hip",
  "name": "Heavy Iron Studios Package",
  "summary": "Learn about .HIP files and view a list of programs that open them.",
  "developer": "Heavy Iron Studios",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13385&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Evil Engine is a game development engine that Heavy Iron Studios used to develop several video games released between 2002 and 2005. These games include:",
      "Scooby-Doo: Night of 100 Frights (GameCube, Xbox, PS2)",
      "SpongeBob SquarePants: Battle for Bikini Bottom (GameCube, Xbox, PS2)",
      "The SpongeBob SquarePants Movie (GameCube, Xbox, PS2)",
      "The Incredibles (GameCube, Xbox, PS2, PC)",
      "The Incredibles: Rise of the Underminer (GameCube, Xbox, PS2, PC)",
      "Scooby-Doo: Night of 100 Frights stores all its game assets in HIP archives. SpongeBob SquarePants: Battle for Bikini Bottom and later Evil Engine games store some of their assets in HIP files and some of their assets in .HOP files. (HOP files are formatted the same way as HIP files, but store only level-related assets.)"
    ]
  },
  "more_information": {
    "description": [
      "A HIP file is an asset archive used by Scooby-Doo: Night of 100 Frights, The SpongeBob SquarePants Movie, or another Heavy Iron Studios Evil Engine video game. It contains game resources, such as 3D models, textures, audio files, and/or animations. These assets are used to display levels, characters, and in-game menus."
    ]
  },
  "how_to_open": {
    "instructions": [
      "HIP files are not meant to be opened by players. However, modders who want to examine or extract the assets a HIP file contains can do so using Industrial Park (Windows) or Watto Studios Game Extractor."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/hip",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.796Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.796Z"
}