{
  "slug": "hog",
  "extension": "hog",
  "name": "Descent or Descent 2 Mission File",
  "summary": "Learn about .HOG files and view a list of programs that open them.",
  "developer": "Interplay Productions",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=590&b=1"
      },
      {
        "name": "Interplay Productions Descent 2",
        "url": "https://fileinfo.com/software/interplay/descent_2"
      }
    ]
  },
  "technical_info": {
    "content": [
      "In the Descent series of games, players pilot a spaceship on a series of missions to destroy mines infected by an alien computer virus. Interplay Productions and Parallax Software released the first Descent in 1995 for MS-DOS and Mac; they released Descent 2 in 1996.",
      "Both Descent and Descent 2 store their mission data in a single HOG file. In Descent, this file is named descent.hog. In Descent 2, this file is named descent2.hog. Descent and Descent 2 modders often extract the constituent files HOG files contain, to modify the games' gameplay. After modifying the games' files, modders repackage them in their associated HOG file.",
      "NOTE: Modders using custom Descent level creators can create custom HOG files, which may have names other than descent.hog or descent2.hog."
    ]
  },
  "more_information": {
    "description": [
      "A HOG file is a game data file used by Descent or Descent 2, first-person shooter games in which players pilot a spaceship through underground mines. It contains all the assets and other game data used to load the game's missions. For example, HOG files contain .PIG and .HAM files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "HOG files are not meant to be opened or edited by players. However, Descent modders have created utilities, such as the HOG Packer and Unpacker (Windows), that allow them to extract files from and add files to HOG files."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/hog",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.799Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.799Z"
}