{
  "slug": "hop",
  "extension": "hop",
  "name": "Evil Engine Asset Package",
  "summary": "Learn about .HOP files and view a list of programs that open them.",
  "developer": "Heavy Iron Studios",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12638&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Heavy Iron Studios is a former subsidiary of THQ. While part of THQ, Heavy Iron Studios published a handful of games that store level data in HOP archives. These games include:",
      "SpongeBob SquarePants: Battle for Bikini Bottom (GameCube, Xbox, PS2)",
      "The SpongeBob SquarePants Movie (GameCube, Xbox, PS2)",
      "The Incredibles (GameCube, Xbox, PS2, PC)",
      "The Incredibles: Rise of the Underminer (GameCube, Xbox, PS2, PC)",
      "All of these games were developed using the Evil Engine game engine and published between 2002 and 2005.",
      "Each HOP file contains all the assets needed to load a specific game level. Some of the constituent files that HOP files contain include .WAV audio files and .ANIM animation files."
    ]
  },
  "more_information": {
    "description": [
      "A HOP file is a game asset package used by a Heavy Iron Studios video game, such as The SpongeBob SquarePants Movie or The Incredibles. It contains all of a game level's resources, including the level's map, sound, and 3D model files. HOP files are sometimes referred to as Heavy Iron Package (HIP) files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "HOP files are not meant to be opened by players. However, modders who want to examine or extract the assets a HOP file contains can do so using Industrial Park (Windows), a fan-made HOP and HIP archive utility. Modders can also use Watto Studios Game Extractor or QuickBMS (Windows) to extract the assets a HOP file contains."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/hop",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.799Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.799Z"
}