{
  "slug": "hprj",
  "extension": "hprj",
  "name": "ZOOM H6 Recording Metadata",
  "summary": "Learn about .HPRJ files and view a list of programs that open them.",
  "developer": "ZOOM",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13066&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Musicians, podcasters, and others use the ZOOM H6 portable audio recorder to record spoken or musical audio. The H6 can record and save up to six channels of audio. It stores recordings on its SD card.",
      "To allow users to play back recordings, the ZOOM H6 stores information about each recording session in an HPRJ file. For example, a recording's HPRJ file details how many channels of audio the recording includes and where each channel's corresponding WAV file is located. Notably, HPRJ files are not audio files. They are also saved in a proprietary binary file format, so you cannot open them to view the metadata they contain."
    ]
  },
  "more_information": {
    "description": [
      "An HPRJ file is a recording project file created by a ZOOM H6 audio recorder. It contains metadata about the recording, such as its created on date and the list of .WAV files the recording includes. The ZOOM H6 uses HPRJ files to retrieve and play back recorded audio."
    ]
  },
  "how_to_open": {
    "instructions": [
      "HPRJ files are not meant to be opened outside the ZOOM H6 recorder on which they were created. To use audio you recorded on a ZOOM H6 recorder on a different device, export the recording's WAV files from your recorder. You do not have to export the corresponding HPRJ file."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/hprj",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.801Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.801Z"
}