{
  "slug": "ibp",
  "extension": "ibp",
  "name": "IsoBuster Managed Image Information",
  "summary": "Learn about .IBP files and view a list of programs that open them.",
  "developer": "Smart Projects",
  "programs": {
    "windows": [
      {
        "name": "Smart Projects IsoBuster",
        "url": "https://fileinfo.com/software/smart_projects/isobuster"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1662&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "With IsoBuster, Windows users can recover data from damaged or corrupted discs and file systems. The program's managed disk image creation feature, added in version 1.9, allows users to combine multiple disk image extractions together into a single disk image.",
      "For example, if a user has a damaged DVD, they can use the managed disk image feature to extract data from that DVD using multiple DVD drives. Then, they can piece the resulting extractions (which may contain different data) together into a single disk image.",
      "IsoBuster managed disk images are saved as an IBP file and one or more IBQ files. The IBP file contains metadata used to manage the IBQ file(s). If you do not possess both a disk image's IBP and IBQ file(s), you will not be able to open that disk image in IsoBuster."
    ]
  },
  "more_information": {
    "description": [
      "An IBP file is a metadata file that is part of a Smart Projects IsoBuster managed disk image. It is always paired with one or more .IBQ files, which use the same filename. It contains information about those IBQ files and their contents."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can load the disk image with which an IBP file is associated with Smart Projects IsoBuster (Windows). After you do, you can attempt to complete that disk image (if it is not already complete). You can also explore the disk image's contents."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/ibp",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.809Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.809Z"
}