{
  "slug": "ibq",
  "extension": "ibq",
  "name": "IsoBuster Managed Image",
  "summary": "Learn about .IBQ files and view a list of programs that open them.",
  "developer": "Smart Projects",
  "programs": {
    "windows": [
      {
        "name": "Smart Projects IsoBuster",
        "url": "https://fileinfo.com/software/smart_projects/isobuster"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1663&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "IsoBuster allows users to recover data from damaged discs and file systems. In version 1.9 of IsoBuster, Smart Projects added the ability to create managed disk images. Primarily, users create managed disk images when attempting to piece together all of a disc's data using either multiple CD/DVD drives (which can read different portions of the disc's data) or multiple copies of the disc.",
      "These managed disk images are saved as one or more IBQ files and an accompanying IBP metadata file. After creating an initial managed disk image, users can load and attempt to complete that image by opening it with IsoBuster."
    ]
  },
  "more_information": {
    "description": [
      "An IBQ file is a portion of a managed disk image created by Smart Projects IsoBuster. It contains data extracted from a CD or DVD. IBQ files are always paired with accompanying .IBP files, which use the same filename (except their extension)."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an IBQ file with Smart Projects IsoBuster (Windows). After you do, you can attempt to complete the disk image the IBQ file contains (if it is not already complete). To do so, right-click the top-most CD/DVD or Device icon in the TreeView pane. Then, select the option to complete your managed disk image. IsoBuster will prompt you to insert a disc from which to extract data."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/ibq",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.537Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.537Z",
  "category": "other",
  "related": [],
  "containers": []
}