{
  "slug": "id",
  "extension": "id",
  "name": "Lotus Notes User ID File",
  "summary": "Learn about .ID files and view a list of programs that open them.",
  "developer": "IBM",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=2780&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "User IDs are required to login to IBM Lotus Notes. A Notes ID may be required to access a Domino server. They typically expire after one year and therefore must be renewed on an annual basis.",
      "You can view the information stored in your ID file by selecting File → Security → User Security in the Lotus Notes program. Since ID files store sensitive information, they should be stored in a safe place and locked.",
      "If your ID is lost or you forget your password, you may be able to recover your ID but only if your administrator set up recovery information for your ID. You can verify this by selecting Mail Recovery ID in the \"Security Basics\" panel of the \"User Security\" dialog box. If the button is not present, your administrator did not set up recovery information for your ID and you will not be able to recover your ID."
    ]
  },
  "more_information": {
    "description": [
      "An ID file contains identifying information for a Domino Server and Lotus Notes user. It is created by the Domino administrator and includes the user's name, Notes license number, secure certificate, public and private key, and a password."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/id",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.812Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.812Z"
}