{
  "slug": "igq",
  "extension": "igq",
  "name": "Indigo Queue File",
  "summary": "Learn about .IGQ files and view a list of programs that open them.",
  "developer": "Glare Technologies",
  "programs": {
    "windows": [
      {
        "name": "Glare Technologies Indigo Renderer",
        "url": "https://fileinfo.com/software/glare_technologies/indigo_renderer"
      },
      {
        "name": "Indigo RT",
        "url": "https://fileinfo.com/software/glare_technologies/indigo_rt"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=9899&b=1"
      },
      {
        "name": "Glare Technologies Indigo RT",
        "url": "https://fileinfo.com/software/glare_technologies/indigo_rt"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Indigo Renderer and Indigo RT are multiplatform 3D rendering applications primarily used by professional artists to create photorealistic images, such as building mockups or fantastical scenes for a science fiction film. Indigo Renderer offers more features than Indigo RT and is more expensive, as well. Indigo Renderer is also available as a standalone application or as a plugin for other 3D CAD programs.",
      "You can create an IGQ file with Indigo Renderer to save a queue to share with another Indigo Renderer user or save it for later use. The IGQ file also allows you to render scenes from projects created in other applications, such as 3DS Max or iClone, where the Indigo Renderer plugin is installed. You can export the project frame by frame into the IGQ file, and Indigo will individually render each frame. Then, you can combine the rendered images into an animation.",
      "You can view the render queue for your scenes by selecting \"Render Queue\" from the dropdown menu in the \"Render Settings\" pane. In the Render Queue, you can add and remove scenes and adjust other settings, such as the scene and output paths and halt settings.",
      "To create an IGQ file with Indigo Renderer or Indigo RT, select File → Save Queue.",
      "The scene path in an IGQ file points to the .IGS file location from which the scenes are being rendered, whereas the output path points to the location where the files (most likely .PNG) will be created. The output path can be relative to the scene path or absolute."
    ]
  },
  "more_information": {
    "description": [
      "An IGQ file is a queue file created by Indigo Renderer and Indigo RT, apps used to generate photorealistic images. It stores a list of one or more scenes in Indigo Queue (IGQ) format that determines how the app renders multiple scenes. IGQ files also contain settings for the rendering process, including the output paths and halt settings for frames."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an IGQ file with Glare Technologies Indigo Renderer (multiplatform) and Indigo RT (multiplatform). To open the file with Indigo Renderer, select File → Open.",
      "After opening the IGQ file, you can view the render queue for your scenes by selecting \"Render Queue\" from the dropdown menu in the \"Render Settings\" pane."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/igq_9899.jpg",
      "alt": "Screenshot of a .igq file in Glare Technologies Indigo RT 4",
      "caption": "IGQ file open in Glare Technologies Indigo RT 4"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/igq",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.816Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.816Z"
}