{
  "slug": "ilo",
  "extension": "ilo",
  "name": "I-LIVE-ON StoryTeller",
  "summary": "Learn about .ILO files and view a list of programs that open them.",
  "developer": "I-LIVE-ON CORPORATION",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12639&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "I-LIVE-ON is a multiplatform software suite that allows users to create and watch stories. While users can create stories on any topic, I-LIVE-ON is designed to be used to record a person's life history as a story, which can be shared with friends and loved ones.",
      "Users create I-LIVE-ON stories in I-LIVE-ON.Creator, a Windows and macOS application. These stories are saved as ILO files. All I-LIVE-ON applications, including the free I-LIVE-ON.NowStory Player App (available for Windows and macOS) and the paid I-LIVE-ON.VR-Theater player (available for Meta Quest VR Headset), can open ILO files and play the story they contain."
    ]
  },
  "more_information": {
    "description": [
      "An ILO file is a story created and used by the I-LIVE-ON application suite, including I-LIVE-ON.Creator, I-LIVE-ON.NowStory, and I-LIVE-ON.VR-Theater. Typically, ILO stories are a record of a person's life and are Zip-compressed, containing audio, video, text, image, and GEnealogical Data COMmunications (GEDCOM) data."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an ILO file with the I-LIVE-ON suite of applications, most of which are available for Windows and macOS. For example, I-LIVE-ON.Creator allows you to open and edit ILO files; I-LIVE-ON.NowStory allows you to watch the story an ILO file contains."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/ilo",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.544Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.544Z",
  "category": "other",
  "related": [],
  "containers": []
}