{
  "slug": "ipj",
  "extension": "ipj",
  "name": "Inventor Project",
  "summary": "Learn about .IPJ files and view a list of programs that open them.",
  "developer": "Autodesk",
  "programs": {
    "windows": [
      {
        "name": "Autodesk Inventor",
        "url": "https://fileinfo.com/software/autodesk/inventor"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=6111&b=1"
      },
      {
        "name": "Autodesk Inventor 2022",
        "url": "https://fileinfo.com/software/autodesk/inventor"
      },
      {
        "name": "Okino Computer Graphics PolyTrans",
        "url": "https://fileinfo.com/software/okino_computer_graphics/polytrans"
      }
    ]
  },
  "technical_info": {
    "content": [
      "In Autodesk Inventor, engineers and product designers create 3D models that represent mechanical parts and assemblies. Assemblies can be comprised of many part files and other assembly files. Additionally, users can create drawings and presentations that show details of their assemblies. These drawings and presentations contain references to the assembly and part files used to create them.",
      "To ensure that links between dependent files remain valid, users save related files as part of a single Inventor project, which is loaded using an IPJ file. The IPJ file contains a record of the folder(s) in which a project's constituent files are stored, as well as other project-related settings. The IPJ file is often stored in a folder one level up from the folder containing a project's content.",
      "If you need to switch between Inventor projects, close all your currently open Inventor files and then select File → Open from the program's menu bar. When the Open window appears, select the Projects... button located next to the Project File field. This will open the Projects window, allowing you to browse to and select a different IPJ file."
    ]
  },
  "more_information": {
    "description": [
      "An IPJ file is a project file created by Autodesk Inventor, a CAD application used to create 3D prototypes of mechanical products. It contains XML data, including a reference to the location at which an Inventor project's files are stored. IPJ files help Inventor users organize, keep track of, and create links between other Inventor files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an IPJ file in Autodesk Inventor (Windows). To do so, first close any currently open Inventor files. Then, from Inventor's toolbar, select Get Started → Projects. The Projects window will appear, allowing you to browse to and open your IPJ file.",
      "If you want to view the XML data your IPJ file contains, you can also open it in any text or source code editor. However, you should never edit an IPJ file's text, as doing so might cause your project to load incorrectly in Inventor."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/ipj_6111.png",
      "alt": "Screenshot of a .ipj file in Microsoft Visual Studio Code",
      "caption": "IPJ file open in Microsoft Visual Studio Code"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/ipj",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.550Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.550Z",
  "category": "other",
  "related": [],
  "containers": []
}