{
  "slug": "ipv",
  "extension": "ipv",
  "name": "ibis Paint Artwork",
  "summary": "Learn about .IPV files and view a list of programs that open them.",
  "developer": "ibis inc.",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12407&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "ibis Paint and ibis Paint X are layer-based drawing apps available for mobile devices and Microsoft Windows. ibis Paint X and the Windows version of ibis Paint are free applications, while the Android and iOS versions of ibis Paint are paid applications.",
      "When a user saves an ibis Paint or Paint X drawing, it is saved as an IPV file. The file then appears in the user's My Gallery. In addition to being able to open and edit IPV files in ibis Paint or Paint X, users can upload their IPV files to ibisPaint's online gallery. Users can browse the ibisPaint online gallery to view, vote on, and download other users' drawings."
    ]
  },
  "more_information": {
    "description": [
      "An IPV file is a drawing created in ibis Paint or ibis Paint X, which are drawing apps available primarily for iOS and Android devices. In addition to a drawing, IPV files may contain metadata about that drawing, such as the drawing's name, artist's name, a description, and keywords. IPV files can be used to share drawings across devices and upload files to the online ibisPaint gallery."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an IPV file with ibis Paint (Windows, Android, iOS) or ibis Paint X (Android, iOS). On Android and iOS devices, tap the file, select Open with... or Share, and then select either ibis Paint or ibis Paint X."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/ipv",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.825Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.825Z"
}