{
  "slug": "iso",
  "extension": "iso",
  "name": "Disk Image File",
  "summary": "Learn about .ISO files and view a list of programs that open them.",
  "developer": "International Organization for Standardization",
  "category": "compression",
  "category_slug": "compression",
  "programs": {
    "windows": [
      {
        "name": "Bitberry File Opener",
        "url": "https://www.bitberry.com/file-opener/"
      },
      {
        "name": "WinZip",
        "url": "https://file.org/free-download/winzip"
      },
      {
        "name": "WinRAR",
        "url": "https://file.org/free-download/winrar"
      },
      {
        "name": "CDBurnerXP",
        "url": "https://file.org/free-download/cdburnerxp"
      },
      {
        "name": "IsoBuster",
        "url": "https://file.org/free-download/isobuster"
      },
      {
        "name": "7-Zip",
        "url": "https://file.org/free-download/7-zip"
      },
      {
        "name": "Any Video Converter",
        "url": "https://file.org/free-download/any-video-converter"
      },
      {
        "name": "PowerISO",
        "url": "https://file.org/free-download/poweriso"
      },
      {
        "name": "PowerDVD",
        "url": "https://file.org/free-download/powerdvd"
      },
      {
        "name": "Arbortext IsoDraw",
        "url": "https://file.org/free-download/arbortext-isodraw"
      },
      {
        "name": "Corel WinZip",
        "url": "https://fileinfo.com/software/corel/winzip"
      },
      {
        "name": "RARLAB WinRAR",
        "url": "https://fileinfo.com/software/rarlab/winrar"
      },
      {
        "name": "Roxio Toast",
        "url": "https://fileinfo.com/software/roxio/toast"
      },
      {
        "name": "Open and view .ISO files with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=266&b=1"
      },
      {
        "name": "File Viewer Plus",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=266"
      },
      {
        "name": "Nero 2022",
        "url": "https://fileinfo.com/software/nero/nero"
      },
      {
        "name": "Alcohol 120%",
        "url": "https://fileinfo.com/software/alcohol_soft/alcohol_120"
      },
      {
        "name": "DT Soft DAEMON Tools",
        "url": "https://fileinfo.com/software/dt_soft/daemon_tools"
      },
      {
        "name": "Lightning UK! ImgBurn",
        "url": "https://fileinfo.com/software/lightning_uk/imgburn"
      }
    ]
  },
  "technical_info": {
    "content": [
      "The overall structure of the file consists of:\n\nSystem Area - 32,768 bytes and is unused by ISO_9660Data Area - consists of Volume descriptor set and Path tables, directories and files",
      "ISO files are saved in an uncompressed format based on the ISO-9660 file system standard for optical disc media (hence the .iso file extension and \"Disc Image\" file type). The files are archives that store all the data from a disk image, including the filesystem information, such as directory structures, file attributes, and boot code. Additionally, ISO files are typically large since they store a lot of data.",
      "Before streaming media, many computer users extracted, copied, and burned ISO files from and to optical discs, such as CDs and DVDs, to copy, share, or back up their contents. ISO files store a sector-by-sector copy of every bit of data exactly from the disc, which is different than copying all files from a disc because the disc header information is lost in the copy process.",
      "Users may also download ISO files from the Internet when installing new software or operating systems since an ISO file contains all the necessary information for installation. For example, you can download an ISO file from Microsoft.com to create a bootable installation media, such as a USB flash drive, or to create a virtual machine running Windows 11."
    ]
  },
  "more_information": {
    "description": [
      "A file with .iso extension is an uncompressed archive disk image file that represents the contents of entire data on an optical disc such as CD or DVD. Based on the ISO-9660 standard, the ISO image file format contains the disc data along with the filesystem information that is stored in it. The capability of ISO files to contain an exact replica of the content makes it the perfect file type for creating copies of CDs/DVDs and are mostly used to store bootable data for installation. Most of the times, ISO files are burnt to USB/CD/DVD as bootable content for booting the machine for installation. ISO files have MIME type application/x-iso9660-image.",
      "An ISO file is a disk image that contains an exact duplicate of data from a source disk, such as an optical disc or hard drive. Computer users typically use ISO files to duplicate CD, DVD, or Blu-ray discs for sharing or backup purposes or download ISO files from a website to install software on a computer (e.g., downloading and installing the Windows 11 operating system). Additionally, users can mount ISO files, extract files from ISO files, and burn ISO files to optical discs."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open ISO files in various ways, including mounting an ISO file and extracting files from an ISO file.",
      "Mounting an ISO file is a software process that makes the folders and files in the ISO file readable by the computer (as if you inserted an actual CD or USB flash drive in the computer). In Windows 8 and later, you can mount an ISO file without third-party software by choosing the file and then selecting Manage → Mount in File Explorer.",
      "In macOS, you can mount an ISO file by double-clicking the file. After clicking the file, the DiskImageMounter utility bundled with macOS verifies the disk image's integrity and mounts it after confirming the disk image.",
      "You can extract files from an ISO archive to access individual files, such as .BIN or .CFG files. You can use various archive utilities, including Corel WinZip, 7-Zip, and RARLAB WinRAR to extract files from an ISO file.",
      "While burning ISO files to discs is no longer as common as it once was, you may still want to burn an ISO file to a disc to create a physical backup or share data or media. In Windows 7 and later, you can right-click an ISO file and select Burn Disk Image. You can also burn ISO files to discs with third-party software, such as Roxio Toast and PowerISO."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "While converting an ISO file to another format is challenging because information like the disc header gets lost, you can extract the files in an ISO file with an archive utility, then compress it in a new format. For example, you can extract files from an ISO archive with Corel WinZip, then compress them in the following formats:",
      ".DMG - Apple Disk Image",
      ".BIN - Binary Disc Image",
      ".IMG - Disc Image Data File"
    ]
  },
  "mime": [
    "application/x-iso9660-image."
  ],
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ],
  "images": [
    {
      "url": "https://assets.file.org/images/fileorg-logo-440x90-4-8b.png",
      "alt": "File.org logo"
    },
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://file.org",
      "source": "file.org",
      "retrieved_at": "2025-11-01T22:32:42.164Z"
    },
    {
      "url": "https://docs.fileformat.com/compression/iso/index.html",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-01T22:32:42.164Z"
    },
    {
      "url": "https://fileinfo.com/extension/iso",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.164Z"
    },
    {
      "source": "filext.com",
      "retrieved_at": "2025-11-01T22:32:42.164Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.164Z",
  "containers": []
}