{
  "slug": "itx",
  "extension": "itx",
  "name": "FileNet eForms Designer Template",
  "summary": "Learn about .ITX files and view a list of programs that open them.",
  "developer": "IBM",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=2786&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "FileNet is a content management and distribution system developed by IBM. It allows organizations to create, store, and share various types of documents and other content, including fillable forms referred to as eForms.",
      "To create eForms, FileNet users use eForms Designer and ITX files. Each ITX file defines the labels, fields, and other elements that an eForm template includes. After customizing a template's elements to their liking, users can save and distribute the form they've created as a fillable eForm.",
      "NOTE: ITX files may also be referred to as Informed XML Templates."
    ]
  },
  "more_information": {
    "description": [
      "An ITX file is a template created and used by IBM FileNet eForms Designer, a form design application. It contains preset form layout elements, which may include form fields, automatic calculations, data validations, and formatting. Using ITX files, FileNet eForms Designer users can quickly create multiple similar fillable forms."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open ITX files with IBM FileNet eForms Designer. To do so, select File → Open... from eForms Designer's menu bar. Then, navigate to and open your ITX file."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/itx",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.556Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.556Z",
  "category": "other",
  "related": [],
  "containers": []
}