{
  "slug": "ivue",
  "extension": "ivue",
  "name": "Live Picture IVUE Image",
  "summary": "Learn about .IVUE files and view a list of programs that open them.",
  "developer": "HSC Software",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=7722&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "When editing an IVUE image in Live Picture, adjustment layers can be applied to modify subsections of the image. While the IVUE image itself is not modified, instructions for the adjustments are stored in FITS (Functional Interpolating Transformation System) or FPX files. When a manipulated IVUE image is ready for output in Live Picture, the IVUE image and FITS or FPX files are processed together and built into a more standard format such as .JPG, .TIFF, or .PSD. Final images can be built with calculations in 48-bit depth and down sampled to 24-bit depth. Localized views can also be selected in Live Picture and output as standard image files.",
      "NOTE: The IVUE format is no longer supported. Live Picture was previously available for Mac OS Classic and also offered a Photoshop plug-in for reading the IVUE format. Live Picture competed with Adobe Photoshop in the 1990s as one of the top image editors for Mac."
    ]
  },
  "more_information": {
    "description": [
      "Raster image created by Live Picture, an image editing application for Mac OS Classic that is now discontinued; uses the IVUE format, which is a multi-resolution image format used as the basis for FlashPix (.FPX files)."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/ivue",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.832Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.832Z"
}