{
  "slug": "jarc",
  "extension": "jarc",
  "name": "WiiU or 3DS Archive File",
  "summary": "Learn about .JARC files and view a list of programs that open them.",
  "developer": "Nintendo",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12087&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "JARC files are similar to .ARC (Nintendo Archive) files. Both contain assets used in a Nintendo video game. However, the JARC format is a newer archive format that is used in WiiU and 3DS video games.",
      "Typically, JARC files contain some combination of .JMDL (WiiU or 3DS Model), .JTEX (WiiU or 3DS Texture), and .JMOT (WiiU or 3DS Animation) files. Together, these files are used to show and animate in-game characters, objects, locations, and other items."
    ]
  },
  "more_information": {
    "description": [
      "A JARC file is an archive file used by a Nintendo WiiU or 3DS video game. It contains a variety of game assets, including in-game models, textures, and animations, saved in proprietary Nintendo file formats. JARC files are most notably used in Wii Fit U, Dragon Ball Fusions, and One Piece: Super Grand Battle! X."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can decompress JARC files and extract their contents using QuickBMS (Windows). You have to download QuickBMS's JARC script (linked on QuickBMS's homepage) to decompress JARC files.",
      "Note that, while you can extract JARC files' contents using QuickBMS, you cannot use QuickBMS to view those contents. Because they are saved in proprietary Nintendo file formats, most files saved within JARC files cannot be opened."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/jarc",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.834Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.834Z"
}