{
  "slug": "jdl",
  "extension": "jdl",
  "name": "Jammer Dash Level",
  "summary": "Learn about .JDL files and view a list of programs that open them.",
  "developer": "Karlo Ramulic",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13643&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Jammer Dash is a rhythm-based video game with an editor that allows you to modify custom levels. After editing a JDL level, you can upload it to the game's servers to share it with other gamers.",
      "When you download a level within the Jammer Dash interface, the game downloads the appropriate JDL file from its server. When stored on the server, the JSON data in the JDL file is encrypted for security purposes. However, the game decrypts the JSON data when downloading the level.",
      "Then, Jammer Dash places the JDL file in its installation directory with other game resource files that store background music, graphics, etc. Finally, Jammer Dash reads the files and displays the information in the game. Additionally, when you upload a level to the game's server, the game encrypts the JSON data in the JDL file and then saves it to its server for other players to access when downloading new levels for the game."
    ]
  },
  "more_information": {
    "description": [
      "A JDL file contains information about a level for Jammer Dash, a 2D rhythm video game (in beta development). It stores information in the JSON standard that Jammer Dash references to load a level (e.g., the position of objects in the level or metadata, including the creator and level difficulty). Jammer Dash allows players to download and upload JDL level files from and to its server to share levels with others."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You should not attempt to open JDL files. Instead, Jammer Dash (in beta development) references JDL files to load their level information."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/jdl",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.562Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.562Z",
  "category": "other",
  "related": [],
  "containers": []
}