{
  "slug": "jdx",
  "extension": "jdx",
  "name": "JCAMP-DX Data File",
  "summary": "Learn about .JDX files and view a list of programs that open them.",
  "developer": "IUPAC",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11883&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "The JCAMP-DX format is primarily utilized for storing various types of chemical data, such as infrared absorption, nuclear magnetic resonance, and optical emission. Chemists collect their data with specific spectrometer instruments and save it in the JCAMP-DX format in JDX files. They then share the JDX file(s) in their reports to be viewed by other chemists along with an analysis of their findings.",
      "NOTE: The Subcommittee for Electronic Standards, which is part of The International Union of Pure and Applied Chemistry (IUPAC), oversees the JCAMP-DX format."
    ]
  },
  "more_information": {
    "description": [
      "A JDX file is a data file saved in the Joint Committee on Atomic and Molecular Physical (JCAMP-DX) format. It contains spectral x,y coordinate data collected from a spectrometer instrument. JDX files may also store comments (preceded by ##) about how and who created the data."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open JDX files with JCAMP Viewer (multiplatform), which is an application developed by the Polymer Science Learning Center and the University of Wisconsin-Stevens Point Chemistry Department. The program allows you to view the raw spectral data as a graph.",
      "Since JDX files are saved in plain text, you can also use a text or source code editor to view and edit the raw data. Keep in mind that these editors do not display the data in graph format."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/jdx_11883.png",
      "alt": "Screenshot of a .jdx file in JCAMP Viewer 3.1",
      "caption": "JDX file open in JCAMP Viewer 3.1"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/jdx",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.843Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.843Z"
}