{
  "slug": "jenkinsfile",
  "extension": "jenkinsfile",
  "name": "Jenkins Pipeline Definition",
  "summary": "Learn about .JENKINSFILE files and view a list of programs that open them.",
  "developer": "Jenkins",
  "programs": {
    "windows": [
      {
        "name": "Microsoft Visual Studio Code",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13552&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Jenkins is an open-source automation server that developers use to automate the building, testing, and delivery of software. Jenkins Pipeline is a suite of Jenkins plug-ins that allows developers to create continuous delivery pipelines (called Jenkins Pipelines) into Jenkins. This allows developers to quickly build, test, and deliver updates to software deployed through Jenkins.",
      "When creating a Jenkins Pipeline, developers must create a text file that defines the Pipeline's stage's (e.g., Build, Test, and Deploy) and associated settings. This Pipeline definition is called a JENKINSFILE, and its filename is always .jenkinsfile.",
      "Developers can use Jenkins, the program's Blue Ocean plug-in, or any source code editor to create and edit their JENKINSFILE. Most often, developers use Blue Ocean to create a JENKINSFILE, as part of setting up a new Jenkins Pipeline project."
    ]
  },
  "more_information": {
    "description": [
      "A JENKINSFILE is a plain text file that defines a Jenkins Pipeline. It contains declarations written in the Apache Groovy programming language. Developers creating Pipeline projects must always create a JENKINSFILE and store it in their project's source control repository."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a JENKINSFILE with Microsoft Visual Studio Code or any other text editor, to view and edit the Jenkins Pipeline definition it contains. If possible, you should open a JENKINSFILE with a source code editor that supports Apache Groovy syntax highlighting.",
      "For instructions on how to use a JENKINSFILE with Jenkins Pipeline, refer to Jenkins' official documentation."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/jenkinsfile_13552.png",
      "alt": "Screenshot of a .jenkinsfile file in Microsoft Visual Studio Code",
      "caption": "JENKINSFILE file open in Microsoft Visual Studio Code"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/jenkinsfile",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.562Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.562Z",
  "category": "other",
  "related": [],
  "containers": []
}