{
  "slug": "jfproj",
  "extension": "jfproj",
  "name": "JSON Font Project File",
  "summary": "Learn about .JFPROJ files and view a list of programs that open them.",
  "developer": "Microsoft",
  "category": "font",
  "category_slug": "font",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11517&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "You will only encounter a JFPROJ file if you use Microsoft Font Maker for creating fonts. When you save a font, Microsoft Font Maker creates the JFPROJ file to store the information about the font. You can close and re-open the JFPROJ file at a later time to edit it.",
      "To create and save a JFPROJ file with Microsoft Font Maker, click the \"Save\" icon in the upper-right corner of the program. To open a JFPROJ file with Microsoft Font Maker, click the \"Open\" icon in the upper-right corner of the program. When you are done editing a font with Microsoft Font Maker, you can export it as a .TTF file, which can be installed in Windows or macOS and used as a font in various programs, such as Microsoft Word and Adobe Photoshop.",
      "NOTE: JFPROJ files store project information in JSON format."
    ]
  },
  "more_information": {
    "description": [
      "A file with .jfproj extension is a JSON based custom font created with Microsoft Font Maker application on Windows 10. These can be created by using electronic pen with touch screen devices such as tablets although other computer peripherals such as mouse can also be used in case of computers. JFPROJ files contain the glyphs that are used to render the characters to the screen by defining the spacing between characters and words, and size of the font. Microsoft Font Maker app is available for download on Windows store.",
      "A JFPROJ file is a font project created by Microsoft Font Maker, a font authoring program for Windows. It contains a font based on the penmanship of a user recorded from a connected electronic pen device. JFPROJ files include the glyphs that make up the alphabet and other symbols, several sentences written by the user, and information about the space between characters and words and the size of the font."
    ]
  },
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/font/jfproj/",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-02T02:43:26.521Z"
    },
    {
      "url": "https://fileinfo.com/extension/jfproj",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.521Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.521Z"
}