{
  "slug": "jigdo",
  "extension": "jigdo",
  "name": "Jigdo Download Specification",
  "summary": "Learn about .JIGDO files and view a list of programs that open them.",
  "developer": "Richard Atterer and Steve McIntyre",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13308&b=1"
      },
      {
        "name": "Jigdo",
        "url": "https://www.einval.com/~steve/software/jigdo/"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Jigdo is a file-downloading utility developed by Richard Atterer and Steve McIntyre. It can be used to download and piece together constituent portions of any sort of large file. Most commonly, however, Jigdo is used to download operating system installation images, saved in various disk image formats.",
      "To target, download, and piece together the constituent parts of a disk image, Jigdo uses JIGDO and .TEMPLATE files. The JIGDO file is used to retrieve the TEMPLATE file, which specifies the constituent files Jigdo needs to locate and combine.",
      "Optionally, Jigdo users can combine local portions of a disk image with pieces they download, to create a composite image and speed up the image creation process. After a Jigdo user stops specifying local files, Jigdo downloads the remaining pieces and creates a resulting disk image.",
      "Jigdo users use the jigdo-file utility to create JIGDO and TEMPLATE files. For complete instructions, refer to Jigdo's documentation."
    ]
  },
  "more_information": {
    "description": [
      "A JIGDO file is a download specification created by Jigdo, a disk image download and creation utility. It contains data that Jigdo uses to start creating a disk image. Jigdo users load JIGDO files by running the jigdo-lite script."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can use Jigdo to load and begin the file creation process specified in a JIGDO file. To do so, run the jigdo-lite script and then specify the path to your JIGDO file. For complete instructions, refer to Jigdo's documentation."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/jigdo",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.563Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.563Z",
  "category": "other",
  "related": [],
  "containers": []
}