{
  "slug": "jpg_large",
  "extension": "jpg_large",
  "name": "Twitter Large JPEG Image",
  "summary": "Learn about .JPG_LARGE files and view a list of programs that open them.",
  "developer": "N/A",
  "category": "image",
  "category_slug": "image",
  "programs": {
    "windows": [
      {
        "name": "Adobe Photoshop",
        "url": "https://fileinfo.com/software/adobe/photoshop"
      },
      {
        "name": "Google Chrome",
        "url": "https://fileinfo.com/software/google/chrome"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10734&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "When you open a Twitter-hosted image in a new Chrome tab, the URL may look something like this:",
      "https:/​/​pbs.twimg.com/​media/​FIQbAtSX0AQ4Z7v.jpg:large",
      "If you download the image from the URL above, Chrome may save it with a JPG_LARGE file extension.",
      "Despite using a different extension, JPG_LARGE files are normal JPEG files. Twitter appends the large attribute to the image URL, causing it to end with .jpg:large. When downloading the image, Chrome changes the colon to an underscore since filenames cannot contain colons. The result is a .jpg_large file.",
      "Twitter may also create other image sizes with the corresponding extensions:",
      "Original (.JPG_ORIG)",
      "Thumbnail (.JPG_THUMB)",
      "Small (.JPG_SMALL)",
      "Medium (.JPG_MEDIUM)",
      "NOTE: Twitter now uses the following URL structure to prevent the creation of JPG_LARGE files: https:/​/​pbs.twimg.com/​media/​FIQbAtSX0AQ4Z7v?format=jpg&name=large"
    ]
  },
  "more_information": {
    "description": [
      "The .jpg_large file format is specific to Twitter and refers to a larger version of a JPEG image file. When users upload images to Twitter, they often get processed and resized for optimization across various devices and views. A jpg_large image typically retains higher resolution than the standard version displayed in a tweet. Twitter appends the _large suffix to the filename to indicate it’s a larger, higher-quality JPEG.\n\nIf you download a .jpg_large file, you can rename it to .jpg without losing the image data. The “large” suffix is simply a naming convention used by Twitter and does not represent a different file format.",
      "Twitter is a social media platform where users post and interact through short messages called “tweets,” limited to 280 characters. Founded in 2006, it allows individuals, organizations, and celebrities to share updates, opinions, and multimedia content in real time. Twitter’s timeline format promotes fast-paced conversations, trends, and viral content through hashtags. Users can follow others to curate their feeds. It’s widely used for news, entertainment, activism, and public discourse, making it a hub for global communication.",
      "A JPG_LARGE file is an image created when a Google Chrome user downloads a large-sized image from Twitter. It is saved in the standard JPEG format, but with a custom file extension. To open a JPG_LARGE file, change the extension to \".jpg,\" then open it as you would any .JPG file."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Opening a .jpg_large file is quite simple since it’s essentially a standard JPEG image with a slightly modified file extension. Here’s how you can open it:\n\nRename the file: Change the file extension from .jpg_large to .jpg by renaming the file. Right-click the file, select “Rename,” and remove the _large part, so it ends with .jpg. The operating system will then treat it as a regular JPEG image.Open with an image viewer: Once renamed, you can open the file using any standard image viewer, such as:Windows Photo Viewer or Photos (Windows)Preview (macOS)Any other image editing software like Paint, GIMP, or Photoshop.",
      "Some image viewers and web browsers, such as Adobe Photoshop and Google Chrome, can open files with a .jpg_large extension. If an image viewer does not recognize a JPG_LARGE file, first change the file extension from .jpg_large to .jpg, then open the file."
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/jpg_large_10734.png",
      "alt": "Screenshot of a .jpg_large file in Google Chrome",
      "caption": "JPG_LARGE file open in Google Chrome"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/image/jpg_large/index.html",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-01T22:32:42.275Z"
    },
    {
      "url": "https://fileinfo.com/extension/jpg_large",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.275Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.275Z",
  "containers": []
}