{
  "slug": "jsc",
  "extension": "jsc",
  "name": "Bytenode Compiled JavaScript",
  "summary": "Learn about .JSC files and view a list of programs that open them.",
  "developer": "Osama Abbas",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13261&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Node.js is an open-source JavaScript runtime environment, used to run JavaScript programs on a server. Bytecode is a Node.js package, which developers can add to Node.js and use to compile their program's JS files to JSC files.",
      "Primarily, compiling a JS file to a JSC file is meant to prevent app users and other developers from examining, and potentially stealing or altering, the app's source code. For example, a developer creating a browser-based video game using Node.js may choose to compile the game's JS files to JSC files, to prevent other developers from copying their game's logic.",
      "NOTE: Bytenode also works with Electron, a JavaScript desktop application framework that uses Node.js."
    ]
  },
  "more_information": {
    "description": [
      "A JSC file is a JavaScript (.JS) file that has been compiled by the bytenode package for Node.js. It contains JavaScript source code that has been translated from plain text to bytecode. Compiling a JS file to a JSC file allows developers to obscure the source code the JS file contains (preventing others from copying or stealing it)."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can use bytenode (multiplatform) to run the compiled script a JSC file contains. To do so, enter the following command:",
      "bytenode --run YourFile.jsc",
      "For complete instructions on how to create and use JSC files with bytenode, refer to bytenode's documentation (linked below)."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/jsc",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.849Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.849Z"
}