{
  "slug": "k",
  "extension": "k",
  "name": "KFramework Source Code File",
  "summary": "Learn about .K files and view a list of programs that open them.",
  "developer": "Runtime Verification",
  "programs": {
    "windows": [
      {
        "name": "Microsoft Visual Studio Code",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      },
      {
        "name": "Vim",
        "url": "https://fileinfo.com/software/vim/vim"
      },
      {
        "name": "GNU Emacs",
        "url": "https://fileinfo.com/software/gnu/emacs"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12915&b=1"
      },
      {
        "name": "Microsoft Visual Studio Code with KFramework Support extension",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      }
    ]
  },
  "technical_info": {
    "content": [
      "K is a framework that allows developers to design and model programming languages and software and hardware systems. The framework includes its own programming language, referred to as K.",
      "Developers working with the K Framework write programs using the K language and save those programs' source code as K files. Typically, each K file includes one or more modules, which define a program's function(s). Each module's name consists of one or more groups of letters, numbers, or underscores, separated by hyphens. Primarily, modules consist of syntax and rules. Modules can also import other modules, saved in other K files.",
      "After a developer finishes creating their K file(s), they can use kompile to compile the files. They can then use krun to run the program their K file(s) contain."
    ]
  },
  "more_information": {
    "description": [
      "A K file contains source code written in the K programming language. Developers create K files using source code editors like Microsoft Visual Studio Code. They then compile them using the K Framework compiler, known as kompile."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a K file with Microsoft Visual Studio Code (multiplatform), Vim (Linux), GNU Emacs (multiplatform), or any other text or source code editor.",
      "K's developer, Runtime Verification, maintains VSCode, Vim, and Emacs extensions that make editing K files in those programs easier. For information on how to download these extensions, refer to the K Framework's official documentation."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/k_12915.png",
      "alt": "Screenshot of a .k file in Microsoft Visual Studio Code",
      "caption": "K file open in Microsoft Visual Studio Code"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/k",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.571Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.571Z",
  "category": "other",
  "related": [],
  "containers": []
}