{
  "slug": "kart",
  "extension": "kart",
  "name": "SRB2Kart Game Data File",
  "summary": "Learn about .KART files and view a list of programs that open them.",
  "developer": "SRB2Kart development team",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13795&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "SRB2Kart is a community-developed fan game that adapts SRB2’s 3D engine for kart racing mechanics. Various independent developers and community contributors (known as the \"SRB2Kart development team\") maintain the game and format, which they introduced in 2018.",
      "Players typically download KART files from community websites, forums, or modding repositories and load them into the game to modify or enhance the gameplay experience. For example, SRB2Kart hosts can load KART files in multiplayer sessions to enable custom content for all connected players. Enabling custom content in KART files allows players to add expanded character rosters, new racecourses, and gameplay tweaks."
    ]
  },
  "more_information": {
    "description": [
      "A KART file is a game data file used by SRB2Kart, a kart racing game based on Sonic Robo Blast 2 (SRB2). It contains custom content in a format similar to the Doom .WAD format, including additional characters, tracks, and other game modifications. Players and modders use KART files to expand the game by adding new playable characters and custom racecourses."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open KART files with SRB2Kart in Windows and macOS. To open a KART file with the game, place it in the appropriate SRB2Kart directory and load it using the in-game add-on menu or console commands.",
      "The Sonic Robo Blast 2 and Kart Krew Dr. Robotnik's Ring Racers games also support the KAT format. Finally, programs that support Doom WAD files can also open KART files, most notably SLADE, a Doom modding application."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/kart",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.853Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.853Z"
}