{
  "slug": "kc",
  "extension": "kc",
  "name": "KeyKit Collection",
  "summary": "Learn about .KC files and view a list of programs that open them.",
  "developer": "Tim Thompson and AT&T",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11571&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "KeyKit is an open source programming language and graphical interface used to create MIDI music. Developer Tim Thompson created the language and accompanying program in the 1990s, during the time he worked at AT&T. While KeyKit was originally released through AT&T, it is now available for free from GitHub.",
      "KeyKit was developed for use on Windows NT, but still works on modern Windows, Linux, and Raspberry Pi systems. So if you have a KC file sitting on your computer, you can still open it and play the musical sequences it contains using KeyKit. Additionally, KeyKit comes loaded with a number of sample KC files, including rock-, jazz-, rap-, funk-, and reggae-inspired collections."
    ]
  },
  "more_information": {
    "description": [
      "A KC file is a KeyKit Collection used by Tim Thompson's KeyKit. It contains a set of named musical sequences you can play in KeyKit. KC files are most often used to group similar percussion sequences into collections that can be opened and played using KeyKit's Blocks tool."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To open a KC file in KeyKit:",
      "If you haven't already, download and install KeyKit using the source code available on GitHub (linked below).",
      "Open KeyKit and click within the blank section of the program's GUI. From the menu that appears, select Tools1 → Blocks.",
      "Click anywhere within the GUI's blank section to open the Blocks tool.",
      "Within the Blocks tool, select More → Read Collection. Then, navigate to the location of your KC file, select it, and select Open.",
      "The musical sequences contained within your KC file should now be available to play within KeyKit. To confirm this, select one of the One beat buttons that appears within the Blocks tool. A list of the sequences contained within your KC file should appear beneath the button."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/kc_11571.png",
      "alt": "Screenshot of a .kc file in KeyKit",
      "caption": "KC file open in KeyKit"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/kc",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.853Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.853Z"
}