{
  "slug": "kcb",
  "extension": "kcb",
  "name": "Kindle Create Book File",
  "summary": "Learn about .KCB files and view a list of programs that open them.",
  "developer": "Amazon",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11392&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Kindle Create can be used to publish various types of books, such as novels, essays, textbooks, travel guides, cookbooks, and poem collections. KCB files allow you to save books, close them, them re-open them for further editing.",
      "To create a KCB file in Kindle Create, select the type of book, then import the book you would like to publish, which must be a .PDF, .DOCX, or .DOC file. To save a KCB file in Kindle Create, click Save or select File → Save Project or Save Project As. open the KCB working file that stores your book, then click Publish. To open a KCB file in Kindle Create, select File → Open Project.",
      "When you are ready to publish your book, click Publish or select File → Publish to create a .KPF publishable file. Then, upload the KPF file to Kindle Direct Publishing to be published on the Kindle store."
    ]
  },
  "more_information": {
    "description": [
      "A KCB file is a project file created by Amazon Kindle Create, a program used to create professional-quality books to be published on the Kindle store. It contains information about a book, which includes the book content, table of contents, and book formatting information. KCB files are used to format books to be published on the Kindle store through the Kindle Direct Publishing platform."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/kcb_11392.png",
      "alt": "Screenshot of a .kcb file in Amazon Kindle Create 1",
      "caption": "KCB file open in Amazon Kindle Create 1"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/kcb",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.572Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.572Z",
  "category": "other",
  "related": [],
  "containers": []
}