{
  "slug": "kms",
  "extension": "kms",
  "name": "Correlate Solutions File",
  "summary": "Learn about .KMS files and view a list of programs that open them.",
  "developer": "Correlate",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10626&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Correlate is a program that allows you to organize your files by creating shortcuts. It is available as a web program, which enables you to organize your files from different cloud storage services such as Google Drive, Dropbox, and OneDrive, as well as links to websites or text from notes.",
      "Correlate is also available as a Windows desktop program called \"Correlate Client,\" which is for users that only want to organize files on their computer. This program allows you to organize files on your computer into a structured document by dragging and dropping a file into the document and creating a dynamic link, or shortcut, to the file instead of physically moving or duplicating it. For example, if you are creating a HR business conduct document and want to organize all the related files in one place, you can drag and drop the files into the HR business conduct document, which are transformed into links that you can click to open the related file.",
      "The KMS file is the main file type associated with Correlate Client. When you create a new file by selecting File → New and choose the document type, Correlate Client creates the KMS file to store the links and other information in the document. You can save a KMS file by selecting File → Save or Save As then select \"Correlate Solutions (*.kms)\" from the \"Save as type\" dropdown list. To open a KMS file, select File → Open. You can also create a .KMA file from a KMS file by selecting File → Save As then select \"Correlate Archives (*.kma)\" from the \"Save as type\" dropdown list.",
      "NOTE: Correlate Client is also known as \"Correlate K-Map Desktop.\""
    ]
  },
  "more_information": {
    "description": [
      "A KMS file is a data file created by Correlate Client, a Windows program used to create shortcuts to files and organize them in one document. It contains a structure of one or more shortcuts to files. KMS files are commonly used to store links to business, human resource, project, and productivity-related files."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/kms_10626.jpg",
      "alt": "Screenshot of a .kms file in Correlate Client",
      "caption": "KMS file open in Correlate Client"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/kms",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.859Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.859Z"
}