{
  "slug": "kodu2",
  "extension": "kodu2",
  "name": "Kodu World",
  "summary": "Learn about .KODU2 files and view a list of programs that open them.",
  "developer": "Microsoft",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12811&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Kodu Game Lab is a game development program used to teach children about programming. For example, a teacher might use Kodu as part of a middle school game development curriculum.",
      "To create levels in Kodu, developers create a world, place game objects, and program those game objects using a tile-based programming language. Developers can export their finished Kodu games, comprised of one more levels, as .KODU files. Developers can also export a single level as a .KODU2 file.",
      "Exporting a single level as a KODU2 file can be useful if, for example, a developer needs to turn in only a single level for a homework assignment. It can also be useful if the developer has a question about the code contained in the level, and wants to share only that level with another user."
    ]
  },
  "more_information": {
    "description": [
      "A KODU2 file is a game world developed in Microsoft Kodu Game Lab, an educational 3D game development environment. It contains the world's terrain, placed objects, and tile-based code. Developers export worlds as KODU2 files to share them with others."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a KODU2 file in Kodu Game Lab (Windows). To do so, double-click the file (on a computer with Kodu installed). The world your KODU2 file contains will then appear in Kodu's Load World menu. (If you already have Kodu open, you may have to return to the Main Menu before the world appears in your Load World menu.)"
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/kodu2",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.578Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.578Z",
  "category": "other",
  "related": [],
  "containers": []
}