{
  "slug": "kra~",
  "extension": "kra~",
  "name": "Krita Image Backup",
  "summary": "Learn about .KRA~ files and view a list of programs that open them.",
  "developer": "Krita",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13330&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Krita is a digital painting application available for Windows, macOS, and Linux. It allows illustrators to create concept art, comics, animation frames, pin-ups, and other illustrations. These layer-based images are saved as KRA files.",
      "To allow illustrators to quickly revert to the previous version of an illustration, Krita stores each illustration's last-saved version in a KRA~ file. Thus, when an illustrator saves a KRA file for the second time, Krita automatically creates an accompanying KRA~ file. This file uses the same base filename as its associated KRA file. Krita continually updates (overwrites) the KRA~ file as an illustrator saves new versions of their illustration.",
      "Optionally, Krita users can configure whether and how the app creates KRA~ files. To do so:",
      "Open the app's Settings or Preferences menu.",
      "On the General screen, select the File Handling tab.",
      "If you want to stop Krita from creating KRA~ files, de-select the Create a Backup File on Saving checkbox. Otherwise, modify Krita's KRA~ file creation settings as you desire."
    ]
  },
  "more_information": {
    "description": [
      "A KRA~ file is a backup of a Krita image document (.KRA file). It contains a previous version of the document, saved automatically by Krita. By default, Krita automatically saves one KRA~ file for each KRA file, in the same folder as the original document."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To open a KRA~ file, first remove the ~ from the file's extension. Then, open the file with Krita as you would any KRA file (by selecting File → Open...).",
      "You can also view the image a KRA~ file contains with qView, a multiplatform image viewer."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/kra~",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.862Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.862Z"
}