{
  "slug": "lay6",
  "extension": "lay6",
  "name": "Sprint Layout 6 PCB Layout File",
  "summary": "Learn about .LAY6 files and view a list of programs that open them.",
  "developer": "ABACOM",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11725&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Printed circuit boards are used in a large number of electronics to connect different electronic components. Some devices that utilize PCBs include computers, televisions, cameras, phones, and radios.",
      "PCB manufacturers use software like Sprint Layout to design PCBs, then send them to a machine to manufacture the actual boards. When saving a PCB layout in Sprint Design, the application creates a LAY6 file to store the information.",
      "To create a LAY6 file with Sprint Layout, select File → New, design the layout, then select File → Save or Save as.... To export a LAY6 file to another format with Sprint Layout, select File → Export, and choose the format. Some formats you can export to include Gerber, HPGL, Bitmap, JPEG, PNG, GIF, and EMF.",
      "NOTE: LAY6 files were introduced with the release of version 6 of Sprint Layout."
    ]
  },
  "more_information": {
    "description": [
      "A LAY6 file contains a printed circuit board (PCB) layout created by ABACOM Sprint Layout 6, an PCB designing application. It stores a PCB layout, which includes the placement of electronic components and their pathway connections as drawn on the design canvas in the program."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open LAY6 files with Sprint Layout (version 6 or later) in Windows. To open a LAY6 file, select File → Open.... You can also double-click the LAY6 file to open it if it is already associated with the Sprint Layout application."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/lay6",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.583Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.583Z",
  "category": "other",
  "related": [],
  "containers": []
}