{
  "slug": "lbt",
  "extension": "lbt",
  "name": "Visual FoxPro Label Memo",
  "summary": "Learn about .LBT files and view a list of programs that open them.",
  "developer": "Microsoft",
  "programs": {
    "windows": [
      {
        "name": "Microsoft Visual FoxPro",
        "url": "https://fileinfo.com/software/microsoft/visual_foxpro"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1342&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Visual FoxPro was software that developers used to build database applications. Along with its various database features, it included tools for designing labels, such as mailing labels and product tags. While the LBX files store the actual design for the labels, including their layout and formatting, the LBT files store helpful information related to the labels to assist whoever may modify the labels.",
      "NOTE: Microsoft discontinued Visual FoxPro after releasing version 9 in 2007, and LBT files are now obscure."
    ]
  },
  "more_information": {
    "description": [
      "An LBT file is a memo for a label definition (.LBX file) created by the now-discontinued Microsoft Visual FoxPro database management system. It stores text-based notes that Visual FoxPro developers add when working with LBX label files so future users can reference them to understand their functionality better. LBT files bear the same name as the LBX label files with which they are associated (example.lbx and example.lbt)."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You should not attempt to open LBT files. Instead, Microsoft Visual FoxPro automatically references LBT files when you open their associated LBX files."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/lbt",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.867Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.867Z"
}