{
  "slug": "ldabak",
  "extension": "ldabak",
  "name": "Legistant Encrypted Backup File",
  "summary": "Learn about .LDABAK files and view a list of programs that open them.",
  "developer": "White Star Web Solutions",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11356&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "You most likely will only encounter LDABAK files if you use Legistant software for legal purposes. The files store multiple JSON-formatted files, which include information entered by the user (content.dat file), various metadata (meta.dat file), and a log of file events (file.log file), such as when the file was opened and modified.",
      "The files stored in an LDABAK file are encrypted by Bcrypt for security purposes. The LDABAK file is also Zip-compressed to reduce the size of the contents.",
      "NOTE: Legistant discontinued Digital Assistant."
    ]
  },
  "more_information": {
    "description": [
      "An LDABAK file is a Legistant Digital Assistant Backup (LDABAK) file created by Legistant Digital Assistant, an application used to manage legal cases. It contains an exact encrypted backup of data entered by users in the software. LDABAK files are typically used for archiving data in case of corruption or for sharing data to be imported by other Legistant users."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an LDABAK file with Legistant Digital Assistant. However, Legistant discontinued the software.",
      "You can also decompress LDABAK files with Zip-compression software, such as Microsoft File Explorer, Corel WinZip, or Apple Archive Utility. However, the contents of the LDABAK file are encrypted, requiring Legistant software or the Bcrypt key to decrypt them."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/ldabak",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.585Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.585Z",
  "category": "other",
  "related": [],
  "containers": []
}