{
  "slug": "lev",
  "extension": "lev",
  "name": "Levelogger Software Data File",
  "summary": "Learn about .LEV files and view a list of programs that open them.",
  "developer": "Solinst",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10744&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "LEV files are created by Levelogger Software from measurement data transferred from Levelogger measurement devices. After you transfer data from the devices, you can view the data in Levelogger Software and create the LEV file to store the data.",
      "When you create a LEV file, it is saved by default in the following directory:",
      "C:\\​Program\\​Files\\​Solinst\\​Levelogger [version]\\​Data\\​",
      "Even though LEV files were replaced by XLE files in version 4 of Levelogger Software, they are still supported by version 4 and later. You can open a LEV file in Levelogger Software by selecting File → Open, navigate to the LEV file location, and click Open."
    ]
  },
  "more_information": {
    "description": [
      "A LEV file is a data file created by Levelogger Software, a program used to view groundwater and surface water data recorded by Levelogger Edge devices. It contains data recorded during a logging session, which includes groundwater and surface water level and temperature measurements. LEV files were used by versions 1 to 3 of Levelogger Software as the default file format but were replaced by .XLE files with the release of version 4 of Levelogger Software."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/lev",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.869Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.869Z"
}