{
  "slug": "lh3d",
  "extension": "lh3d",
  "name": "Live Home 3D Project",
  "summary": "Learn about .LH3D files and view a list of programs that open them.",
  "developer": "BeLight Software",
  "programs": {
    "windows": [
      {
        "name": "Mail",
        "url": "https://fileinfo.com/software/apple/mail"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10446&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "The LH3D file is the main file type associated with BeLight Live Home 3D. The files are used to store information for a variety of project types, such as a bathroom, kitchen, bedroom, living room, office, or the exterior of a house. You can begin from one of the Live Home 3D templates or from scratch to completely customize the design. You can then add fixtures, furniture, wall colors, and more to your design, which is all stored in the LH3D file when you choose to save (File → Save...). You can also save the project as an .LHZD file, which is similar to the LH3D project but saved in a compressed format and is better for storing projects or sharing them across different platforms.",
      "When you are finished, you can export the LH3D file to other file formats, such as .PDF, .JPG, .BMP, .PNG, .TIFF, .SKP, .DAE, ZAE, .3DS, .FBX, .WRL, .X3D, RIB, .OBJ, .SCN, SCNZ, and USDZ. You can also share the project to YouTube, Facebook, Twitter, or Vimeo or send a project copy via Mail, Messages, or AirDrop directly from Live Home 3D."
    ]
  },
  "more_information": {
    "description": [
      "An LH3D file is a project created by Live Home 3D, an app used to design and visualize the interior and exterior of a home. It contains a project, which includes floor plans, building materials, lighting designs, fixtures, and furniture. LH3D files allow users to close a design and reopen it for further editing at a later time."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/lh3d_10446.jpg",
      "alt": "Screenshot of a .lh3d file in BeLight Live Home 3D 3",
      "caption": "LH3D file open in BeLight Live Home 3D 3"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/lh3d",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.587Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.587Z",
  "category": "other",
  "related": [],
  "containers": []
}