{
  "slug": "linea",
  "extension": "linea",
  "name": "Linea Sketch Drawing",
  "summary": "Learn about .LINEA files and view a list of programs that open them.",
  "developer": "The IconFactory",
  "programs": {
    "windows": [
      {
        "name": "Adobe Photoshop",
        "url": "https://fileinfo.com/software/adobe/photoshop"
      },
      {
        "name": "Apple Archive Utility",
        "url": "https://fileinfo.com/software/apple/archive_utility"
      },
      {
        "name": "7-Zip",
        "url": "https://fileinfo.com/software/igor_pavlov/7-zip"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12827&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Linea Sketch allows illustrators to create sketches, digital paintings, logos, and other drawings on their iPhone or iPad. It also allows illustrators to add labels, notes, and callouts to their drawings and save a timelapse video of their drawing process.",
      "The app saves illustrators' drawing projects as LINEA files. Each LINEA file contains not only the drawing's data, saved as a series of .PNG images that correspond to each of the drawing's layers, but also an associated thumbnail image, any notes added to the drawing, and the associated timelapse video (if one has been created). All these constituent files are compressed using Zip compression, to make the LINEA file easier to store and share.",
      "If an illustrator wants to view their LINEA file on a desktop computer, they can open it in Linea Link. Linea Link allows users to view, but not edit, the drawing a LINEA file contains, as well as export the drawing to other apps and file formats."
    ]
  },
  "more_information": {
    "description": [
      "A LINEA file is a drawing created by Linea Sketch, an illustration app available for iOS. It is a Zip-compressed archive that contains all of the drawing's data and associated files, such as a thumbnail image, .PNG images of the drawing's layers, and metadata. LINEA files can also be opened in Linea Link, a LINEA file viewer for macOS."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a LINEA file in Linea Sketch (iOS) or Linea Link (Mac). In Linea Sketch, you can edit the drawing a LINEA file contains. In Linea Link, you can view the drawing, export it to other apps (such as Adobe Photoshop), and convert it to more common file formats.",
      "You can also decompress a LINEA file using any Zip-decompression utility, such as Apple Archive Utility (Mac) or 7-Zip (Window), to view the component files it contains. Before doing so, you must change the file's extension to .ZIP."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "You can use Linea Link (Mac) to convert LINEA files to the following formats:",
      ".PNG - Portable Network Graphic",
      ".JPG - JPEG Image",
      ".PSD - Photoshop Document",
      ".PDF - Portable Document Format"
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/linea",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.589Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.589Z",
  "category": "other",
  "related": [],
  "containers": []
}