{
  "slug": "linq",
  "extension": "linq",
  "name": "LINQPad Query File",
  "summary": "Learn about .LINQ files and view a list of programs that open them.",
  "developer": "Joseph Albahari",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11502&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Developers who utilize LINQPad for testing their code are most likely the only type of user that encounters LINQ files. When a developer saves his LINQ query or other code by selecting File → Save or Save As, LINQPad creates the LINQ file to store the contents. After a developer tests his code in LINQPad, he can copy and paste the code into Visual Studio.",
      "LINQ files are meant to be opened with LINQPad, which provides various developer features for testing the code. To open a LINQ file with LINQPad, select File → Open.",
      "Since LINQ files are saved in plain text, they may be opened with any text editor. Microsoft Notepad, which comes bundled with Windows, or Apple TextEdit, which comes bundled with macOS can both open LINQ files. However, they do not provide the same developer features as LINQPad.",
      "NOTE: LINQ is pronounced as \"Link.\""
    ]
  },
  "more_information": {
    "description": [
      "A LINQ file is a text file created by LINQPad, a utility that helps .NET Framework developers test code outside of IDEs like Microsoft Visual Studio. It typically contains a query in the LINQ (Language Integrated Query) query language that interactively queries data sources, such as SQL, SQLite, Oracle, MySQL, Postgres, or OData. LINQ files may also store a C#, F#, Visual Basic (VB) expression, statement block, or program."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/linq_11502.png",
      "alt": "Screenshot of a .linq file in LINQPad 6",
      "caption": "LINQ file open in LINQPad 6"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/linq",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.589Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.589Z",
  "category": "other",
  "related": [],
  "containers": []
}