{
  "slug": "lkr",
  "extension": "lkr",
  "name": "MPLAB C18 Linker Script",
  "summary": "Learn about .LKR files and view a list of programs that open them.",
  "developer": "Microchip Technology",
  "programs": {
    "windows": [
      {
        "name": "Microsoft Visual Studio Code",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13150&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Microchip Technology MPLAB is an integrated development environment (IDE) used to create embedded applications on PIC and dsPIC microcontrollers. When compiling programs using MPLAB, developers use different compilers when targeting different microcontrollers. Version 8 of MPLAB includes support for the C18 compiler, used to compile programs for PIC18 microcontrollers.",
      "When compiling a program using C18, developers previously had to manually specify a linker script used to merge their program's constituent files into a single program file. In the most recent version of C18, however, the compiler automatically selects an appropriate linker script from its ~mcc/​18/​bin/​LKR directory. These scripts are saved as LKR files.",
      "NOTE: Other MPLAB products may also use linker scripts saved as LKR files."
    ]
  },
  "more_information": {
    "description": [
      "An LKR file is a linker script used by Microchip Technology MPLAB C Compiler for PIC18 MCUs (MPLAB C18). The compiler uses the LKR file to merge multiple files into a single program. MPLAB C18 includes multiple LKR files, used when compiling different kinds of programs."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Because LKR files are plain text scripts, you can open and edit them in Microsoft Visual Studio Code (multiplatform) or any other text editor. However, you should not edit the default LKR files included with MPLAB C18, as doing so might cause the compiler to function incorrectly."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/lkr",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.590Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.590Z",
  "category": "other",
  "related": [],
  "containers": []
}