{
  "slug": "lmt",
  "extension": "lmt",
  "name": "RPG Maker 2000/2003 Map Tree",
  "summary": "Learn about .LMT files and view a list of programs that open them.",
  "developer": "Kadokawa Games",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13374&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "RPG Maker is a program that video game developers use to create 2D role-playing games. Over the years, various developers have released many versions of RPG Maker, including RPG Maker 2000 and RPG Maker 2003.",
      "Game development projects created by RPG Maker 2000 and RPG Maker 2003 always include an RPG_RT.lmt file. This file contains a record of the maps a project includes, the order in which those maps should be shown in the RPG Maker project editor, and other map-related data. It is stored alongside a project's .LMU map file, named MAP###.lmu, and LDB map database file, named RPG_RT.ldb.",
      "In some cases (most often, after RPG Maker 2000 or 2003 quit accidentally due to memory overload), RPG Maker 2000 or 2003 may show a Map Tree Data is corrupted error when you open a project. This means the LMT file associated with your game project is damaged. If you have encountered this error, refer to this tutorial, which explains how to create a new LMT file for your project."
    ]
  },
  "more_information": {
    "description": [
      "An LMT file is a map tree used by an RPG Maker 2000 or 2003 project. It contains metadata that describes the order in which a project's maps are shown, as well as each map's name, background music, event information, and other data. All LMT files are named RPG_RT.lmt."
    ]
  },
  "how_to_open": {
    "instructions": [
      "LMT files are not meant to be opened. RPG Maker 2000 and 2003 reference LMT files when they load game development projects."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/lmt",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.591Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.591Z",
  "category": "other",
  "related": [],
  "containers": []
}