{
  "slug": "lnk",
  "extension": "lnk",
  "name": "Windows Shortcut",
  "summary": "Learn about .LNK files and view a list of programs that open them.",
  "developer": "Microsoft",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=48&b=1"
      },
      {
        "name": "Microsoft Windows",
        "url": "https://fileinfo.com/software/microsoft/windows"
      },
      {
        "name": "Parallels Desktop for Mac with Windows installed",
        "url": "https://fileinfo.com/software/parallels/desktop_for_mac"
      }
    ]
  },
  "technical_info": {
    "content": [
      "LNK files typically use the same icon as their target file, with a small curled arrow added to indicate the shortcut points to another location. When you double-click an LNK file, Windows opens the file to which that shortcut points, just as it would if you double-clicked the actual file.",
      "You can edit a Windows shortcut's properties, to add a shortcut key or modify how Windows opens the file to which the shortcut points. To edit a shortcut's properties, right-click the shortcut and select Properties.",
      "Even if you've configured Windows to show file extensions for known file types, it does not show the .lnk file extension. While not recommended, you can make Windows show the .lnk file extension by deleting the NeverShowExt property within the HKEY_CLASSES_ROOT\\​lnkfile Windows registry entry:",
      "Open Registry Editor by typing regedit in the taskbar search box and selecting the program.",
      "In Registry Editor, navigate to Computer\\​HKEY_CLASSES_ROOT\\​lnkfile.",
      "Create a backup of lnkfile by right-clicking it and selecting Export (you can use this to restore your registry key in case of an error).",
      "Select the NeverShowExt property and delete it.",
      "Restart Windows.",
      "Read more about Windows shortcuts in the FileInfo.com Help Center.",
      "NOTE: Changes to the LNK file association can cause your Windows desktop icons to unexpectedly change or disappear. You can visit the Help Center for instructions on how to fix your Windows icons."
    ]
  },
  "more_information": {
    "description": [
      "An LNK file is a Windows shortcut, which points to and is used to open another file, folder, or application. It contains information about the object to which it points, including the object's type, location, and filename. You can create a shortcut to a file, folder, or application by right-clicking that object and selecting Create shortcut. (In Windows 11, you must first select Show more options.)"
    ]
  },
  "how_to_open": {
    "instructions": [
      "Opening an LNK file, by double-clicking it or right-clicking it and selecting Open, opens the file, folder, or program to which the LNK file points. Advanced users can edit an LNK file's properties by right-clicking the file and selecting Properties."
    ]
  },
  "images": [
    {
      "url": "https://assets.file.org/images/fileorg-logo-440x90-4-8b.png",
      "alt": "File.org logo"
    },
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/lnk_48.png",
      "alt": "Editing an LNK file's properties in Microsoft Windows 11",
      "caption": "Editing an LNK file's properties in Microsoft Windows 11"
    }
  ],
  "sources": [
    {
      "url": "https://file.org",
      "source": "file.org",
      "retrieved_at": "2025-11-02T02:43:26.408Z"
    },
    {
      "url": "https://fileinfo.com/extension/lnk",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.408Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.408Z"
}