{
  "slug": "loadmeta",
  "extension": "loadmeta",
  "name": "Kerbal Space Program Save Metadata File",
  "summary": "Learn about .LOADMETA files and view a list of programs that open them.",
  "developer": "Squad",
  "programs": {
    "windows": [
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13640&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Squad Kerbal Space Program is a popular rocket construction and space flight simulation game. The game allows you to save your progress as SFS files, which you can open to load your saved game.",
      "When you load your saved progress from an SFS file by accessing the Load Game dialog in Kerbal Space Program, the game compares the hash in the LOADMETA file to the hash in the SVS file. After verifying it accompanies the SFS file, the game loads the cached information in the LOADMETA file instead of parsing all of the data in the SVS file.",
      "NOTE: Squad introduced LOADMETA files when it released version 1.2.2 of Kerbal Space Program."
    ]
  },
  "more_information": {
    "description": [
      "A LOADMETA file is a metadata file that accompanies a saved game (.SFS) file for Squad Kerbal Space Program, a video game where players build and launch rockets. It stores cached information, including a hash, for an SFS file the game references to quickly load saved game information. Users can find LOADMETA files alongside SFS files with the same name (e.g., example.sfs and example.loadmeta)."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You should not attempt to open LOADMETA files. Instead, Squad Kerbal Space Program references the files to load saved game progress more quickly.",
      "Since LOADMETA files store information in plain text, you can open them with a text editor, such as Microsoft Notepad (Windows) or Apple TextEdit (macOS). However, incorrectly editing the file may corrupt the metadata.",
      "Additionally, you can delete LOADMETA files, but it will increase the time Kerbal Space Program takes to load the saved game progress."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/loadmeta",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.592Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.592Z",
  "category": "other",
  "related": [],
  "containers": []
}