{
  "slug": "locked",
  "extension": "locked",
  "name": "Ransomware Encrypted File",
  "summary": "Learn about .LOCKED files and view a list of programs that open them.",
  "developer": "N/A",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10533&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "The Locked virus is malware that is commonly referred to as ransomware, where the purpose of the virus is to take your files hostage and force you to pay the perpetrator (by way of bitcoin) to unlock your files. The virus is typically introduced through an email attachment, P2P network, or fake software update. Once the virus affects your computer it begins scrambling your files, renaming them, and encrypting them. The virus then generates a .TXT ransom note informing you of the takeover and what you need to do to recover your files."
    ]
  },
  "more_information": {
    "description": [
      "A LOCKED file is a file encrypted by the Locked virus, a trojan horse utilized by cybercriminals. It contains a user's file, such as a .PDF or .XLSX file, encrypted with AES-256 encryption. LOCKED files became prevalent in 2016 along with .LOCKY files that are encrypted by the Locky virus."
    ]
  },
  "how_to_open": {
    "instructions": [
      "There is no program currently available to effectively restore your files. If you back up your files, you can execute a full System Restore."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/locked",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.877Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.877Z"
}