{
  "slug": "locker",
  "extension": "locker",
  "name": "NordLocker Encrypted Archive",
  "summary": "Learn about .LOCKER files and view a list of programs that open them.",
  "developer": "NordLocker",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11877&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "NordLocker allows you to quickly secure your files locally in Windows or macOS, but also provides cloud storage for syncing encrypted files across multiple devices. The LOCKER file stores all of the files and folders you have imported into a specific locker in NordLocker.",
      "To create a LOCKER file with the Windows version of NordLocker, select File → New Locker. To create a LOCKER file with the macOS version of NordLocker, select File → Create New Locker.",
      "LOCKER files are saved by default in the following locations:",
      "Windows - C:\\​Users\\​[username]\\​Documents\\​NordLocker\\​Lockers",
      "macOS - /​Users/​[username]/​Nordlocker/​",
      "LOCKER files are not only used for securing files stored on your computer. They can be shared with others as long as they are registered with NordLocker and have installed the application."
    ]
  },
  "more_information": {
    "description": [
      "A LOCKER file is an encrypted archive created by NordLocker, an application used to secure files. It contains one or more files that have been encrypted with Advanced Encryption Standard 256 bit (AES-256) encryption. LOCKER files are typically created to protect files with sensitive contents, such as a .JPG digital photograph, .XLSX financial spreadsheet, or .PDF business document."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can only open LOCKER files with the NordLocker application in Windows and macOS.",
      "To open a LOCKER file with the Windows version of NordLocker, select File → Open locker. To open a LOCKER file with the macOS version of NordLocker, select File → Open. You can also drag and drop the LOCKER file onto the application interface to open it.",
      "NOTE: You need to enter the appropriate password in order to decrypt the LOCKER file with NordLocker."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/locker_11877.png",
      "alt": "Screenshot of a .locker file in NordLocker 2.1",
      "caption": "LOCKER file open in NordLocker 2.1"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/locker",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.593Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.593Z",
  "category": "other",
  "related": [],
  "containers": []
}