{
  "slug": "lpkg",
  "extension": "lpkg",
  "name": "Liferay Application",
  "summary": "Learn about .LPKG files and view a list of programs that open them.",
  "developer": "Liferay",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10764&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Liferay is used to build and manage websites and the Liferay Marketplace is a place where users can search for and download applications, which are contained in LPKG files, that provide additional functionality to their sites, such as a guestbook or survey and feedback tool.",
      "When you download apps from the Liferay Marketplace, they are transferred in the LPKG file then automatically installed by Liferay Portal. However, if you want to install an application not available on the Liferay Marketplace you must install the application manually. To install an application in Liferay, select Control Panel → Apps → App Manager, and click Install. An alternative method is to place the app in the [Liferay_Home]/deploy folder and it will be automatically deployed to the marketplace subfolder and installed."
    ]
  },
  "more_information": {
    "description": [
      "An LPKG file is a Zip-compressed package used to deploy applications (plugins) to Liferay users that can be installed on their websites. It contains .JAR files that make up the functionality of the application. LPKG files also store a .PROPERTIES file, which includes information about the application and installation requirements."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/lpkg",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.595Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.595Z",
  "category": "other",
  "related": [],
  "containers": []
}