{
  "slug": "lsav",
  "extension": "lsav",
  "name": "Xiaomi Gallery Hidden Video",
  "summary": "Learn about .LSAV files and view a list of programs that open them.",
  "developer": "Xiaomi",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13578&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Xiaomi MIUI Gallery is the default photo and video gallery app installed on Xiaomi MIUI smartphones. In Gallery, users can choose to hide videos and photos, so other users cannot view those files. The exact steps used to hide videos and photos vary in different versions of Gallery, but they always involve:",
      "Selecting one or more videos or photos in Gallery.",
      "Moving the files to Gallery's private folder.",
      "Specifying a password or lock pattern used to prevent others from accessing the private folder.",
      "As Gallery moves the selected videos and photos to its private folder (located at ~/​MIUI/​Gallery/​cloud/​secretAlbum), it encrypts them and changes their extensions to either .lsav (videos) or .LSA (photos). Because these files are encrypted and password-protected, they can be opened only from within Gallery, by accessing your private folder.",
      "NOTE: Xiaomi MIUI Gallery is discontinued."
    ]
  },
  "more_information": {
    "description": [
      "An LSAV file is a video that a Xiaomi mobile phone user has hidden from their phone's Gallery app. When a user hides a video in Gallery, the app encrypts the video, moves it to a private folder, and changes its extension to .lsav. LSAV files can be opened only from the Gallery app's private folder."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an LSAV file using the Gallery app on a Xiaomi mobile phone. To do so, navigate to Gallery's Albums screen and pull down until the Release to open private folder message appears. Then, release. Your phone will prompt you to enter the password or lock pattern associated with your private folder.",
      "After you open your private folder, you can view and/or unhide the hidden videos and photos it contains. To unhide a file, select the file and then select Unhide."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/lsav",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.597Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.597Z",
  "category": "other",
  "related": [],
  "containers": []
}