{
  "slug": "lsn",
  "extension": "lsn",
  "name": "Finale Lesson File",
  "summary": "Learn about .LSN files and view a list of programs that open them.",
  "developer": "MakeMusic",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=7789&b=1"
      },
      {
        "name": "MakeMusic Finale",
        "url": "https://fileinfo.com/software/makemusic/finale"
      }
    ]
  },
  "technical_info": {
    "content": [
      "MakeMusic Finale is a standard music notation application used to compose musical scores. It comes with various tools for writing a composition and recording it.",
      "In Finale version 27 and earlier, you could create music lessons for practicing instruments with the Exercise Wizard tool. In versions of Finale earlier than 27, you can create an LSN file by choosing File → New → Exercise Wizard, then following the prompts to create the lesson.",
      "In a Finale lesson, you can add exercises (intervals, scales, arpeggios, etc.), set the Concert Key for each exercise, specify each exercise's articulation pattern, and choose one or more instruments for which Finale generates the lesson. You can also configure the lesson's appearance when printed, including the font and the size of the pages."
    ]
  },
  "more_information": {
    "description": [
      "An LSN file is a music lesson created by MakeMusic Finale music notation and playback software. It stores a collection of exercises and instruments for practicing instruments, such as the piano or guitar. MakeMusic no longer maintains the LSN format (beginning in version 27.1 of Finale) but still allows users to open LSN files with Finale."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an LSN file with MakeMusic Finale in Windows and macOS. To open an LSN file with Finale, select File → Open."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/lsn",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.882Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.882Z"
}