{
  "slug": "luau",
  "extension": "luau",
  "name": "Luau Script",
  "summary": "Learn about .LUAU files and view a list of programs that open them.",
  "developer": "Roblox",
  "programs": {
    "windows": [
      {
        "name": "Microsoft Visual Studio Code",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13199&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Roblox is a multiplatform video game in which players can choose from and play a wide variety of sub-games. In many cases, players themselves develop these sub-games, using Roblox game development tools like Roblox Studio.",
      "Around 2006, Roblox began using Lua 5.1 as its game scripting language. However, the Roblox development team eventually felt that Lua 5.1 no longer fit their, or game developers', needs. To address this issue, Roblox created its own variant of Lua 5.1, named Luau.",
      "Now, Roblox developers often save game source code in LUAU files. The code these files contain looks similar to the code found in .LUA files, and is designed to be backward-compatible with Lua 5.1 code. However, Luau uses its own compiler and runtime, developed and maintained by Roblox.",
      "NOTE: Some .RBXM files contain LUAU scripts."
    ]
  },
  "more_information": {
    "description": [
      "A LUAU file is a script comprised of Luau source code. It likely contains code used by a Roblox game. Roblox game developers typically create and edit LUAU files with Roblox Studio."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open and edit a LUAU file with Microsoft Visual Studio Code (multiplatform) or any other source code or text editor.",
      "You can also open, edit, and execute a LUAU script with Roblox Studio (Windows, Mac), as part of a Roblox development project. To insert a LUAU script into an existing Roblox Studio project:",
      "Select Insert → Object....",
      "Navigate to and open your LUAU file."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/luau_13199.png",
      "alt": "Screenshot of a .luau file in Microsoft Visual Studio Code",
      "caption": "LUAU file open in Microsoft Visual Studio Code"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/luau",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.883Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.883Z"
}