{
  "slug": "lzx",
  "extension": "lzx",
  "name": "Amiga LZX Compressed Archive",
  "summary": "Learn about .LZX files and view a list of programs that open them.",
  "developer": "Jonathan Forbes and Tomi Poutanen",
  "category": "compression",
  "category_slug": "compression",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=614&b=1"
      },
      {
        "name": "The Unarchiver",
        "url": "https://fileinfo.com/software/dag_agren/the_unarchiver"
      }
    ]
  },
  "technical_info": {
    "content": [
      "In 1995, Jonathan Forbes and Tomi Poutanen released the LZX utility for Amiga computers. It was available as both shareware and a paid application. It allowed users to compress one or more files and store them in LZX archives.",
      "These days, LZX files are uncommon. However, Amiga users may still possess LZX files, stored on hard drives, floppy disks, or other storage media."
    ]
  },
  "more_information": {
    "description": [
      "A file with .lzx extension was developed by Open Source, which is also known as an Amiga LZX Compressed File, for the associated software of Cabextract. The LZX files are commonly used by the users of the United States, running Windows 10 in their systems. Amiga LZX compressed file is classified as a compressed file combined with compression standards used in files saved in the LZX format. This extension was initially used by applications designed for Amiga computers in the 1990s. the compression and decompression tools of different files are still applied with provision for compressing files and folders selected by the user as an LZX file. These related programs also have different cohesive features that can decompress these LZX files quickly than other archive files compressed with such old compression conditions.",
      "An LZX file is an archive created by the LZX archive utility, which was available for Commodore Amiga computers in the 1990s. It contains one or more compressed files. The LZX format uses compression methods that Microsoft has since incorporated into the .CAB and .CHM formats."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Following are the few problems that may cause poor working of LZX file format:\n\nThe file may be corrupt. To solve this issue, download the file again or ask the sender to resend the file againThe second reason is infected file in this case scan the file properlyImproper links to the LZX fileRemoval of the description of the LZXNot enough hardware resourcesOutdated drivers of the equipment",
      "You can open an LZX file with Total Commander (Windows), with the UnLZX plug-in installed, or The Unarchiver (Mac).",
      "On an Amiga or in an Amiga emulator, you can use LZX, XAD, or unarc to extract the files an LZX file contains."
    ]
  },
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/compression/lzx/",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-02T02:43:26.523Z"
    },
    {
      "url": "https://fileinfo.com/extension/lzx",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.523Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.523Z"
}