{
  "slug": "m3u8",
  "extension": "m3u8",
  "name": "UTF-8 M3U Playlist",
  "summary": "Learn about .M3U8 files and view a list of programs that open them.",
  "developer": "Apple",
  "category": "audio",
  "category_slug": "audio",
  "programs": {
    "windows": [
      {
        "name": "Philips Songbird",
        "url": "https://file.org/free-download/philips-songbird"
      },
      {
        "name": "iTunes",
        "url": "https://file.org/free-download/itunes"
      },
      {
        "name": "VLC Media Player",
        "url": "https://file.org/free-download/videolan-vlc-media-player"
      },
      {
        "name": "Winamp",
        "url": "https://file.org/free-download/winamp"
      },
      {
        "name": "MediaMonkey",
        "url": "https://file.org/free-download/mediamonkey"
      },
      {
        "name": "GOM Audio",
        "url": "https://file.org/free-download/gom-audio"
      },
      {
        "name": "PotPlayer",
        "url": "https://file.org/free-download/potplayer"
      },
      {
        "name": "MPC-HC",
        "url": "https://file.org/free-download/mpc-hc"
      },
      {
        "name": "KMPlayer",
        "url": "https://file.org/free-download/kmplayer"
      },
      {
        "name": "JRiver Media Center",
        "url": "https://file.org/free-download/jriver-media-center"
      },
      {
        "name": "FormatFactory",
        "url": "https://file.org/free-download/formatfactory"
      },
      {
        "name": "Microsoft Windows Media Player",
        "url": "https://fileinfo.com/software/microsoft/windows_media_player"
      },
      {
        "name": "VideoLAN VLC media player",
        "url": "https://fileinfo.com/software/videolan/vlc_media_player"
      },
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=5882&b=1"
      },
      {
        "name": "Nullsoft Winamp",
        "url": "https://fileinfo.com/software/nullsoft/winamp"
      },
      {
        "name": "Roxio Creator NXT Pro 9",
        "url": "https://fileinfo.com/software/roxio/creator"
      },
      {
        "name": "Apple iTunes",
        "url": "https://fileinfo.com/software/apple/itunes"
      },
      {
        "name": "Foobar2000",
        "url": "https://fileinfo.com/software/foobar2000/foobar2000"
      }
    ]
  },
  "technical_info": {
    "content": [
      "M3U8 files are plain text files that contain a list of media files or streaming segments. Each entry in the M3U8 file refers to a specific media file (or segment) in the playlist. The file typically follows the following structure:\n\nHeader:The file starts with the #EXTM3U tag, which indicates that the file is an M3U or M3U8 playlist.In HLS streaming, the #EXT-X-VERSION tag specifies the version of the protocol being used.Metadata Tags:The M3U8 file contains metadata tags that provide additional information about the media. Common tags include:#EXT-X-TARGETDURATION: Specifies the maximum length (in seconds) of each media segment.#EXT-X-MEDIA-SEQUENCE: Indicates the sequence number of the first media segment.#EXT-X-KEY: Contains encryption information for the media segments.#EXT-X-STREAM-INF: Describes the media stream’s properties, such as bandwidth and resolution, for adaptive bitrate streaming.Media Segments:The file lists the individual media segments (such as .ts files) that make up the entire video or audio stream. Each segment contains a reference to a media file, such as:segment1.tssegment2.tsThese segments are typically small chunks of video or audio data, allowing the player to download and buffer only a small portion of the stream at a time for smoother playback.",
      "In addition to file paths and URLs, M3U8 files contain metadata that media players use to play the referenced media files correctly. For example, M3U8 files used to stream videos that are hosted online may contain information about the referenced videos' resolution, codec, and maximum needed bandwidth. This information is specified using the #EXT-X-STREAM-INF: setting.",
      "In contrast, M3U8 files used to play audio and video located on your computer are often much simpler. These files may contain only a couple pieces of metadata, such as the playlist title (specified using the #PLAYLIST setting) and track information (specified using the #EXTINF setting).",
      "NOTE: M3U8 files are similar to .M3U files, except the text they contain is always encoded using UTF-8 character encoding. On rare occasions, M3U8 files may be saved with the .M3UP extension."
    ]
  },
  "more_information": {
    "description": [
      "The M3U8 file format is used by audio and video playback programs to store playlists. The playlist consists of an Internet web path or URL, along with information about each track in the list (playtime duration). M3U8 files use UTF-8 character encoding as compared to M3U file types. M3U8 files can be opened using applications like VideoLAN VLC media player.",
      "An M3U8 file is a playlist file used by various audio and video players. It contains plain text that describes where the audio and video files included in the playlist are located. These descriptions may take the form of file paths or URLs. Typically, M3U8 files that contain file paths are used to play media files stored on your PC, and those that contain URLs are used to play media files accessed over the Internet."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Text Editors:Since M3U8 files are plain text, they can be opened and viewed with any text editor, such as Notepad or TextEdit. However, viewing the contents will only show the playlist references and metadata, not the actual media.Media Players:To play the media referenced by an M3U8 file, you will need a media player that supports HLS streaming. Popular players include:VLC Media Player: Can open M3U8 files directly and stream the content.QuickTime Player: Apple’s player can also handle M3U8 playlists for HLS.Web Browsers: Many modern web browsers (like Chrome, Safari, and Firefox) can stream M3U8 files through embedded video players (HTML5-based video players).Streaming Platforms:If the M3U8 file is from a streaming platform (such as a live stream), you can usually play it directly within the service’s interface or app (like YouTube Live or other HLS-based platforms).",
      "You can open an M3U8 file and play the playlist it contains in many media players, including Microsoft Windows Media Player (Windows) and VideoLAN VLC media player (multiplatform). If you open an M3U8 file and the playlist it describes does not begin playing, it may be because you do not have access to the files included in the playlist.",
      "You can also open your M3U8 file in any text editor, such as Microsoft Notepad (Windows) or Apple TextEdit (Mac), to view the text it contains."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "M3U8 files are not video or audio files, so you cannot convert them to .MP4, .MP3, or other media formats. To convert the media files an M3U8 playlist references to other formats, you must locate or download the files. Then, you must convert them using an applicable program.",
      "For example, if your M3U8 file references a series of .TS files, you must locate or download the TS files. Then, you can use VideoLAN VLC media player to convert them to other video formats."
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ],
  "images": [
    {
      "url": "https://assets.file.org/images/fileorg-logo-440x90-4-8b.png",
      "alt": "File.org logo"
    },
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/m3u8_5882-2.png",
      "alt": "Screenshot of a .m3u8 file in Microsoft Visual Studio Code",
      "caption": "M3U8 file open in Microsoft Visual Studio Code"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/m3u8_5882-3.png",
      "alt": "The same M3U8 file open in VideoLAN VLC media player",
      "caption": "The same M3U8 file open in VideoLAN VLC media player"
    }
  ],
  "sources": [
    {
      "url": "https://file.org",
      "source": "file.org",
      "retrieved_at": "2025-11-01T22:32:42.175Z"
    },
    {
      "url": "https://docs.fileformat.com/audio/m3u8/index.html",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-01T22:32:42.175Z"
    },
    {
      "url": "https://fileinfo.com/extension/m3u8",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.175Z"
    },
    {
      "source": "filext.com",
      "retrieved_at": "2025-11-01T22:32:42.175Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.175Z",
  "mime": [
    "application/vnd.apple.mpegurl"
  ],
  "containers": []
}