{
  "slug": "madesktop",
  "extension": "madesktop",
  "name": "macOS Desktop Background Configuration File",
  "summary": "Learn about .MADESKTOP files and view a list of programs that open them.",
  "developer": "Apple",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13882&b=1"
      },
      {
        "name": "Apple macOS",
        "url": "https://fileinfo.com/software/apple/os_x"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Apple introduced the MADESKTOP file type in macOS Monterey 12.3, which is part of the Dynamic Desktop feature, enabling users to set wallpapers that change according to the time of day. Before this update, macOS only used .HEIC files for wallpapers.",
      "They are typically stored within system or user preference directories and are used internally by the operating system's desktop management services. Changing a wallpaper through System Settings → Wallpaper updates the associated MADESKTOP file behind the scenes.",
      "Most users will never directly interact with a MADESKTOP file. However, those who customize or troubleshoot macOS desktop preferences might encounter one when inspecting configuration data or transferring wallpaper settings between user accounts.",
      "NOTE: You can find MADESKTOP files in the following location:",
      "/​System/​Library/​Desktop Pictures"
    ]
  },
  "more_information": {
    "description": [
      "An MADESKTOP file is a configuration file used by macOS to store desktop background settings. It contains information about the wallpaper image applied to a user's desktop, including the file path, display scaling, position, and other appearance options in the XML standard. macOS uses MADESKTOP files to store the user's chosen desktop background when they log in or restart their computer."
    ]
  },
  "how_to_open": {
    "instructions": [
      "MADESKTOP files are not meant to be opened or edited manually. Instead, macOS automatically creates and references MADESKTOP files.",
      "Since MADESKTOP files are plain-text property lists, advanced users can view their contents with a text editor, but macOS may not recognize manual changes until the operating system reloads the desktop settings."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/madesktop_13882.png",
      "alt": "Screenshot of a .madesktop file in Apple TextEdit 1.2",
      "caption": "MADESKTOP file open in Apple TextEdit 1.2"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/madesktop",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.604Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.604Z",
  "category": "other",
  "related": [],
  "containers": []
}