{
  "slug": "mc",
  "extension": "mc",
  "name": "Molecular Constructor Molecule File",
  "summary": "Learn about .MC files and view a list of programs that open them.",
  "developer": "Alexander Teplukhin",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11929&b=1"
      },
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Github Atom",
        "url": "https://fileinfo.com/software/github/atom"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Vim",
        "url": "https://fileinfo.com/software/vim/vim"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Molecular Constructor is a 3D molecule builder that allows users to design molecules and optimize their geometry. In the mobile versions of Molecular Constructor, users' molecules are saved as MC files. While MC files are used to show 3D images in Molecular Constructor, the files are actually text files. When you open an MC file in a text editor, such as Microsoft Notepad, Apple TextEdit, or GitHub Atom, you can read the coordinates of each atom a Molecular Constructor molecule includes. You can also see the bonds the molecule includes.",
      "Mobile Molecular Constructor users can use the program's File → Save feature to save their molecules as MC files and share them with other users. MC files can be opened in both the Android and iOS versions of Molecular Constructor and, according to the program's developers, will soon be supported in the program's Windows desktop version."
    ]
  },
  "more_information": {
    "description": [
      "An MC file is a 3D model created by Molecular Constructor, a free molecule building program. It is a plain text file that specifies atoms' positions and bonds within a molecule and, when loaded in Molecular Constructor, is used to show the molecule in 3D. Currently, MC files are created and used by only the mobile versions of Molecular Constructor. However, the program's developers say the desktop version of Molecular Constructor will soon support MC files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an MC file in the Android and iOS versions of Molecular Constructor. To do so, open the app and select File → Browse. Then, find and open your MC file.",
      "If you do not have access to the Android or iOS version of Molecular Constructor, you can open an MC file in any text editor to view the text it contains."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/mc_11929.png",
      "alt": "Screenshot of a .mc file in Apple TextEdit",
      "caption": "MC file open in Apple TextEdit"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/mc",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.607Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.607Z",
  "category": "other",
  "related": [],
  "containers": []
}