{
  "slug": "mcproject",
  "extension": "mcproject",
  "name": "Minecraft Bedrock Editor Project",
  "summary": "Learn about .MCPROJECT files and view a list of programs that open them.",
  "developer": "Mojang",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13233&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Minecraft Bedrock Editor is an official world creation and editing tool included with Minecraft Bedrock Edition. It allows players to import existing Minecraft worlds (MCWORLD files) or templates (.MCTEMPLATE files) or create a new world from scratch. Players can then edit the world's settings and contents, using a variety of editing tools.",
      "If a player wants to retain a copy of their world project, to continue editing the world at a later date, they can save the project as an MCPROJECT file. MCPROJECT files open only in Bedrock Editor. To use the world an MCPROJECT file contains with Minecraft Bedrock Edition, players must export the world as an MCWORLD file (and then double-click it to import it into Minecraft).",
      "NOTE: As of March 2023, Minecraft Bedrock Editor is available only in the Preview version of Minecraft Bedrock Edition for Windows."
    ]
  },
  "more_information": {
    "description": [
      "An MCPROJECT file is a project file created by Minecraft Bedrock Editor, an in-engine world editor for Minecraft Bedrock Edition. It contains a Minecraft Bedrock Edition world and settings associated with that world. In Bedrock Editor, users can export the world an MCPROJECT file contains as an .MCWORLD file."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an MCPROJECT file in Minecraft Bedrock Editor (Windows). To do so, open Bedrock Editor, select the Projects tab, and click the Import button (located to the right of Create New Project). Then, navigate to and open your MCPROJECT file."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "You can use Minecraft Bedrock Editor (Windows) to convert an MCPROJECT file to an .MCWORLD file. To do so, open your MCPROJECT file and then select File → Export as → Playable world."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/mcproject",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.609Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.609Z",
  "category": "other",
  "related": [],
  "containers": []
}