{
  "slug": "mel",
  "extension": "mel",
  "name": "Maya Embedded Language Script",
  "summary": "Learn about .MEL files and view a list of programs that open them.",
  "developer": "Autodesk",
  "programs": {
    "windows": [
      {
        "name": "Autodesk Maya",
        "url": "https://fileinfo.com/software/autodesk/maya"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=2698&b=1"
      },
      {
        "name": "Autodesk Maya 2023",
        "url": "https://fileinfo.com/software/autodesk/maya"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Professional animators use Autodesk Maya to create 3D animated scenes for use in video games, films, and television shows. If an animator who is also a programmer wants to create a macro they can use to quickly complete a repetitive or complex Maya task, they can do so using Maya's Script Editor.",
      "After writing their script in Maya's Embedded Language, the animator can save their script as a MEL file. Then, the animator can execute their script via the Script Editor. This will automatically perform the action(s) the MEL file describes.",
      "Animators can also use MEL scripts to customize Maya's user interface. MEL scripts may include Python code, as Maya also supports the Python programming language.",
      "NOTE: Maya was originally developed by Alias Wavefront. Autodesk acquired Alias Wavefront in 2006."
    ]
  },
  "more_information": {
    "description": [
      "A MEL file is a script that can be used as a macro in Autodesk Maya, a 3D modeling and animation program. It contains code written in the Maya Embedded Language. Users create and execute MEL files using Maya's Script Editor."
    ]
  },
  "how_to_open": {
    "instructions": [
      "MEL files are meant to be opened and edited in the Autodesk Maya (cross-platform) Script Editor. To open the Script Editor, select Windows → General Editors → Script Editor from Maya's menu bar. Then, to open your MEL file:",
      "Select File → Open Script....",
      "Navigate to and open your MEL file.",
      "After you finish editing your MEL file, you should save it to Maya's default scripts directory. This will allow you to quickly locate and edit the file in the future.",
      "To execute a MEL script, open it in the Script Editor and then select the Execute button.",
      "To add a MEL script to your Maya shelf items, open the script in the Script Editor and then select File → Save Script to Shelf...."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/mel_2698.png",
      "alt": "Screenshot of a .mel file in Autodesk Maya 2022 Script Editor",
      "caption": "MEL file open in Autodesk Maya 2022 Script Editor"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/mel",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.902Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.902Z"
}