{
  "slug": "memo",
  "extension": "memo",
  "name": "Samsung Memo",
  "summary": "Learn about .MEMO files and view a list of programs that open them.",
  "developer": "Samsung",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11789&b=1"
      },
      {
        "name": "7-Zip",
        "url": "https://fileinfo.com/software/igor_pavlov/7-zip"
      },
      {
        "name": "Apple Archive Utility",
        "url": "https://fileinfo.com/software/apple/archive_utility"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Over the years, Samsung mobile phones have saved memos and notes in a variety of file formats, including .NMM, .SNB, .SDOC, and MEMO. The MEMO format was used by the Memo app included on certain Samsung Galaxy phones.",
      "Contrary to what you might expect, MEMO files are not text files. Instead, they are Zip-compressed archives that contain an XML file and a Media folder. The XML file contains a memo's text and other data, while the Media folder contains any images, videos, or other media saved within the memo."
    ]
  },
  "more_information": {
    "description": [
      "A MEMO file is a memo created using the Memo app available on certain Samsung mobile phones, such as the Samsung Galaxy Avant. It is a Zip-compressed archive that contains an .XML file and a Media folder, each of which contains data saved within the memo. MEMO files can be opened with Samsung Notes or shared to Google Drive."
    ]
  },
  "how_to_open": {
    "instructions": [
      "On Samsung devices, you can open MEMO files with Samsung Notes. You can also use Notes' Share function to share your MEMO files with Google Drive, which will allow you to open your memos on other Samsung devices.",
      "If you do not have access to Samsung Notes, you can rename your MEMO file to a .ZIP file, decompress it, and view its contents as you would any Zip archive. This will allow you to access the text and media contained within your memo and manually reconstruct it if necessary."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/memo",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.613Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.613Z",
  "category": "other",
  "related": [],
  "containers": []
}