{
  "slug": "mep",
  "extension": "mep",
  "name": "Movavi Video Project",
  "summary": "Learn about .MEP files and view a list of programs that open them.",
  "developer": "Movavi",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12160&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Movavi provides several applications for working with videos, including Video Editor and Slideshow Maker. These programs are also available with the Video Suite and all use the MEP format (now, the MEPX format).",
      "When saving a project, the Movavi application would store the contents as an MEP file. After saving the project, you could close it, re-open it, and make more edits. To create an MEP file with Video Editor or Video Suite, select File → Save Project.",
      "When you are done editing your video project, you can export it to various video formats, including .MP4 and .AVI. To export an MEP file, select Export."
    ]
  },
  "more_information": {
    "description": [
      "A MEP file is a video project created by Movavi Video Editor (version 10 and earlier) and Movavi Video Suite (version 14 and earlier). It contains imported video, images, transitions, effects, and project settings. MEP files were replaced by .MEPX files with the release of version 11 of Movavi Video Editor and version 15 of Movavi Video Suite."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open MEP files with Movavi Video Editor (version 10 and earlier) and Movavi Video Suite (version 14 and earlier). Later versions of these applications do not support the MEP format. To open an MEP file with either Video Editor or Video Suite, select File → Open Project...."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/mep",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.903Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.903Z"
}