{
  "slug": "mltbx",
  "extension": "mltbx",
  "name": "MATLAB Toolbox Package",
  "summary": "Learn about .MLTBX files and view a list of programs that open them.",
  "developer": "The MathWorks",
  "programs": {
    "windows": [
      {
        "name": "The MathWorks MATLAB",
        "url": "https://fileinfo.com/software/the_mathworks/matlab"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13324&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "MATLAB is specialized software primarily used by engineers and scientists that features a numerical computing environment and dedicated programming language. While the software comes with many features, you can add tools not packaged with the software via toolboxes. Examples of functionality include image-processing algorithms and mapping algorithms for illustrating geographic data as map displays.",
      "You can access installed toolbox add-ons (MLTBX files) by selecting Add-Ons → Manage Add-Ons in the \"HOME\" tab. Additionally, to create an MLTBX file with MATLAB, select Add-Ons → Package Toolbox in the \"HOME\" tab, then click Package."
    ]
  },
  "more_information": {
    "description": [
      "An MLTBX file is a toolbox add-on compressed with Zip compression that adds extra functionality to The MathWorks MATLAB, a programming and numeric computing program for analyzing data, developing algorithms, and building models. It stores all the information required by the add-on, including MATLAB .M and .MLX code files, .MLAPP application projects, and .XML settings files. MATLAB users export and import MLTBX files to share add-ons for the software."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an MLTBX file with The MathWorks MATLAB. To open an MLTBX file, select Open from the \"HOME\" tab or double-click the file. You can also download and open Add-on MLTBX files via MATLAB by selecting Add-Ons → Get Add-Ons in the \"HOME\" tab."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/mltbx_13324.png",
      "alt": "Screenshot of a .mltbx file in The MathWorks MATLAB R2023a",
      "caption": "MLTBX file open in The MathWorks MATLAB R2023a"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/mltbx",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.619Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.619Z",
  "category": "other",
  "related": [],
  "containers": []
}