{
  "slug": "mobirise",
  "extension": "mobirise",
  "name": "Mobirise Project File",
  "summary": "Learn about .MOBIRISE files and view a list of programs that open them.",
  "developer": "Mobirise",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11028&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Mobirise allows users to drag and drop \"blocks\" into a site to customize the appearance and functionality of the site. These blocks are saved in JSON format in the MOBIRISE file. When the site is published by a user, .HTML, .CSS, and .JS files are created for each block depending on the functionality of the block.",
      "To create a new project in Mobirise, select \"Sites\" from the main menu, click \"Create New Site,\" select the site theme, name the site, and click \"OK.\" The MOBIRISE file is created to save the contents of the project. If you do not name the site, the name of the site will be Site-MM-DD_TTTT, with MM representing the month, DD representing the day, and TTTT representing the time that the site was created.",
      "To open a site in Mobirise, select \"Sites\" from the main menu and click the site you want to open. If the site is not already in Mobirise, select \"Sites\" from the main menu, click \"Import Mobirise Site,\" and select the MOBIRISE file you want to import in the explorer.",
      "To export a site in Mobirise, select \"Sites\" from the main menu, click the \"Site Settings\" gear icon of the site you want to export, select \"Export Site,\" and choose the place to which you want to save the site."
    ]
  },
  "more_information": {
    "description": [
      "A MOBIRISE file is a project created by Mobirise, a free Windows, macOS, and Android program that allows users to build websites without any coding. It contains \"blocks\" that make up the site, which may include a menu, header, articles, images, videos, sliders, galleries, features, pricing tables, forms, tables, and footers. MOBIRISE files are saved in JSON format."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/mobirise_11028.jpg",
      "alt": "Screenshot of a .mobirise file in Mobirise 4",
      "caption": "MOBIRISE file open in Mobirise 4"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/mobirise",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.621Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.621Z",
  "category": "other",
  "related": [],
  "containers": []
}