{
  "slug": "mountain",
  "extension": "mountain",
  "name": "A Short Hike Saved Game",
  "summary": "Learn about .MOUNTAIN files and view a list of programs that open them.",
  "developer": "adamgryu",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12079&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "A Short Hike is a cross-platform game in which players set out on a mountainside hike and attempt to reach the mountain's summit. During their hike, players can use A Short Hike's Save & Quit option to save their in-progress game. When they do, the game creates a MOUNTAIN file, which contains a record of the user's current hike.",
      "A Short Hike does not have multiple save slots, so it only ever creates and reads one MOUNTAIN file. If you want to start a new game of A Short Hike but do not want to overwrite your current saved game, you can rename your current GameSaveNew.mountain file to any other filename. Then, when you start your new game, A Short Hike will create a new GameSaveNew.mountain file, instead of overwriting your previous file. Then, you can resume either game by switching the MOUNTAIN files' names as needed.",
      "NOTE: A Short Hike also sometimes creates MOUNTAIN_BACKUP files, which are backups of players' saved game."
    ]
  },
  "more_information": {
    "description": [
      "A MOUNTAIN file is a game save file created by A Short Hike, a wilderness exploration game. It contains a record of a player's in-progress hike. MOUNTAIN files are named GameSaveNew.mountain and stored in the User/​AppData/​LocalLow/​adamgryu/​A Short Hike directory."
    ]
  },
  "how_to_open": {
    "instructions": [
      "MOUNTAIN files are not meant to be opened manually. To use a MOUNTAIN file to resume an in-progress A Short Hike game, place the file in the User/​AppData/​LocalLow/​adamgryu/​A Short Hike directory and make sure the file is named GameSaveNew.mountain. Then, open A Short Hike and select continue from the game's main menu."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/mountain",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.623Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.623Z",
  "category": "other",
  "related": [],
  "containers": []
}