{
  "slug": "mov",
  "extension": "mov",
  "name": "Apple QuickTime Movie",
  "summary": "Learn about .MOV files and view a list of programs that open them.",
  "developer": "Apple",
  "category": "video",
  "category_slug": "video",
  "programs": {
    "windows": [
      {
        "name": "Bitberry File Opener",
        "url": "https://www.bitberry.com/file-opener/"
      },
      {
        "name": "Any Video Converter Professional",
        "url": "https://file.org/free-download/any-video-converter-professional"
      },
      {
        "name": "Switch Sound File Converter",
        "url": "https://file.org/free-download/switch-sound-file-converter"
      },
      {
        "name": "FLV Media Player",
        "url": "https://file.org/free-download/flv-media-player-by-0"
      },
      {
        "name": "PowerDVD",
        "url": "https://file.org/free-download/powerdvd"
      },
      {
        "name": "Free File Converter",
        "url": "https://file.org/free-download/free-file-converter"
      },
      {
        "name": "Any Video Converter",
        "url": "https://file.org/free-download/any-video-converter"
      },
      {
        "name": "QuickTime",
        "url": "https://file.org/free-download/quicktime"
      },
      {
        "name": "VLC Media Player",
        "url": "https://file.org/free-download/videolan-vlc-media-player"
      },
      {
        "name": "GOM Player",
        "url": "https://file.org/free-download/gom-player"
      },
      {
        "name": "RealPlayer",
        "url": "https://file.org/free-download/realplayer"
      },
      {
        "name": "KMPlayer",
        "url": "https://file.org/free-download/kmplayer"
      },
      {
        "name": "Apple QuickTime Player",
        "url": "https://fileinfo.com/software/apple/quicktime_player"
      },
      {
        "name": "Microsoft Media Player",
        "url": "https://fileinfo.com/software/microsoft/media_player"
      },
      {
        "name": "VLC for Android",
        "url": "https://fileinfo.com/software/videolabs/vlc_for_android"
      },
      {
        "name": "VLC for iOS",
        "url": "https://fileinfo.com/software/videolan/vlc_for_ios"
      },
      {
        "name": "Open and view .MOV files with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=64&b=1"
      },
      {
        "name": "FFmpeg",
        "url": "https://fileinfo.com/software/ffmpeg/ffmpeg"
      },
      {
        "name": "File Viewer Plus",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=64"
      },
      {
        "name": "Microsoft Windows Media Player",
        "url": "https://fileinfo.com/software/microsoft/windows_media_player"
      }
    ]
  },
  "technical_info": {
    "content": [
      "MOV files consist of consecutive chunks. Every chunk has an 8 byte header: 4-byte chunk size (big-endian, high byte first) and 4-byte chunk type - one of pre-defined signatures: “ftyp”, “mdat”, “moov”, “pnot”, “udta”, “uuid”, “moof”, “free”, “skip”, “jP2 “, “wide”, “load”, “ctab”, “imap”, “matt”, “kmat”, “clip”, “crgn”, “sync”, “chap”, “tmcd”, “scpt”, “ssrc”, “PICT”. First chunk is of type “ftype” and has a sub-type at offset 8. MOV defined by sub-type which must be “qt “. To compose MOV file, iterating chunks is needed until unknown type is detected.\n\nHere is a sample example: Inspecting a sample MOV file’s binary data it is evident that it starts with a signature ftyp (hex: 66 74 79 70) at offset 4, which defines QuickTime Container File Type. File sub-type is qt~~ (hex: 71 74 20 20) which points to MOV file type. The first block size is 32 (hex: 00 00 00 20, big-endian, high byte first), size located at offset 0. At offset 32 (hex: 20) is located the second chunk, which has a size of 8 and type mdat (hex: 6D 64 61 74).\n\nThe next chunk is located at offset 32+8#40 (hex: 28) and has a size 3,263,028 (hex: 00 31 CA 34) and type mdat (hex: 6D 64 61 74) at offset 44 (hex: 2C). The next chunk is located at offset 40 + 3,263,028#3,263,068 (hex: 00 31 CA 5C) and has a size 21,189 (hex: 00 00 52 C5) and type moov (hex: 6D 6F 6F 76) at offset 1,836,019,574 (hex: 00 31 CA 60). This is the last chunk, so total file size is 3,263,068+21,189#3,284,257 bytes.",
      "Apple introduced the QTFF format in 1991 to support different media types and accommodate multimedia transfer between devices, operating systems, and applications. While it is primarily associated with the QuickTime media player and Mac platform, it has grown into one of the most common video file types, along with .MP4, .WMV, and .AVI.",
      "The format supports multiple media tracks and is not limited to video and audio data. Other media supported by QTFF includes text (subtitles), images, 3D models, virtual reality panoramas, and timecode data. Media tracks may be encoded by various codecs but typically utilize the MPEG-4 codec.",
      "NOTE: Multimedia files saved in the QTFF format may also use the .QT file extension.",
      "While the MP4 format is based on the QTFF format utilized by MOV files, there are noteworthy differences between MP4 and MOV files. One difference is that MOV files are typically higher in quality and file size than MP4 files. Another difference is that MOV files are not as widely supported as MP4 files.",
      "Because of these differences, there are situations where each file type is better suited for your needs. For example, if you want to save a movie at a higher quality and storage space is not an issue, you should save the movie as a MOV file (as long as the video player supports MOV files). However, if you want to save a home movie, share it with others, and can accept a bit of degradation in quality, you should save it as an MP4 file."
    ]
  },
  "more_information": {
    "description": [
      "A MOV file is a video file type, developed by Apple Inc., that contains one or more tracks. Each track stores a movie, audio, movie clips, and subtitles. It is a multimedia container that can store different type of media elements. MOV video format is compatible with both Windows and Macintosh systems. It uses MPEG-4 coded for compression and tracks are maintained in objects called atoms which are placed in a hierarchical data structure.",
      "A MOV file is one of the most common video file types, often storing a movie, TV show, short video clip, or home movie. It is saved in the QuickTime File Format (QTFF), a multimedia container format developed by Apple. Video editors often save video as MOV files due to their support for high-quality video."
    ]
  },
  "how_to_open": {
    "instructions": [
      "React Native API to convert MOV to MP4Python API to repair MOV FilesRuby API to convert MOV to GIF",
      "You can open MOV files with various multimedia players, such as Apple QuickTime Player (Mac), Microsoft Media Player (Windows), and VLC media player (multiplatform).",
      "You can also open MOV files in Android and iOS with VLC for Android, VLC for iOS, olimsoft OPlayer (iOS), and J2 Interactive MX Player (Android)."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "There are plenty of media players and software video editors available to convert MOV files other popular video file formats. Some of the media players that can convert MOV files to other formats include:\n\nVideoLAN VLC media playerEltima Elmedia Player\n\nSeveral media players and video editors, including VideoLAN VLC media player and Eltima Elmedia Player, can convert MOV files to other formats. These software can convert MOV files to following video formats.\n\nMPEG-4 Video - MP4WebM Video - WEBMVideo Transport Stream - TSAdvanced Systems Format - ASFOgg Vorbis Audio - OGGMP3 Audio - MP3Free Lossless Audio Codec - FLACWAVE Audio - WAV",
      "Several media players and video editors, including VideoLAN VLC media player and Eltima Elmedia Player, can convert MOV files to other formats.",
      "For example, VLC media player can convert MOV files to the following formats:",
      ".MP4 - MPEG-4 Video",
      ".WEBM - WebM Video",
      ".TS - Video Transport Stream",
      ".ASF - Advanced Systems Format",
      ".OGG - Ogg Vorbis Audio",
      ".MP3 - MP3 Audio",
      ".FLAC - Free Lossless Audio Codec",
      ".WAV - WAVE Audio"
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ],
  "images": [
    {
      "url": "https://assets.file.org/images/fileorg-logo-440x90-4-8b.png",
      "alt": "File.org logo"
    },
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/mov_64-2.jpg",
      "alt": "Screenshot of a .mov file in Apple QuickTime Player",
      "caption": "MOV file open in Apple QuickTime Player"
    }
  ],
  "sources": [
    {
      "url": "https://file.org",
      "source": "file.org",
      "retrieved_at": "2025-11-01T22:32:42.181Z"
    },
    {
      "url": "https://docs.fileformat.com/video/mov/index.html",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-01T22:32:42.181Z"
    },
    {
      "url": "https://fileinfo.com/extension/mov",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.181Z"
    },
    {
      "source": "filext.com",
      "retrieved_at": "2025-11-01T22:32:42.181Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.181Z",
  "mime": [
    "video/quicktime"
  ],
  "containers": [
    "mov"
  ]
}