{
  "slug": "movpkg",
  "extension": "movpkg",
  "name": "High-Resolution Lossless Media File",
  "summary": "Learn about .MOVPKG files and view a list of programs that open them.",
  "developer": "Apple",
  "programs": {
    "windows": [
      {
        "name": "VideoLAN VLC media player",
        "url": "https://fileinfo.com/software/videolan/vlc_media_player"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12399&b=1"
      },
      {
        "name": "Apple Music",
        "url": "https://fileinfo.com/software/apple/music"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Apple Music and TV allow users to download high-resolution, losslessly compressed versions of audio and video files. These songs, movies, and TV episodes are saved as MOVPKG files. They are downloaded using Apple's HTTP Live Streaming (HLS) adaptive bitrate streaming protocol. This is why, in some instances, forum users may refer to MOVPKG files as HLS files or streams.",
      "Each MOVPKG file contains a series of FRAG files. These files are audio or video segments that contain a portion of the data that makes up a song or video. Each MOVPKG file also contains multiple XML files and an M3U8 file, which define the order in which a MOVPKG's FRAG files should be played, as well as other metadata.",
      "NOTE: Only Apple Music subscribers can download music in MOVPKG format. Non-subscribers cannot download music as MOVPKG files.",
      "Because the MOVPKG format is not widely supported, you may want to stop Apple Music and TV from downloading media as MOVPKG files. To do so, open the apps' Preferences menu and deselect any options that save media as high-resolution or high-definition files."
    ]
  },
  "more_information": {
    "description": [
      "A MOVPKG file is a high-resolution, lossless media file downloaded using Apple Music or TV. It is a package that contains several .frag files and .XML files, and an .M3U8 file. Apple Music downloads MOVPKG files to play high-resolution, lossless audio, while Apple TV downloads MOVPKG files to play high-resolution, lossless movies and TV episodes."
    ]
  },
  "how_to_open": {
    "instructions": [
      "MOVPKG files are meant to be opened in the Apple media application that created them. For example, a MOVPKG file downloaded via Apple Music is meant to be opened and played in Apple Music.",
      "However, some other applications can play MOVPKG files. For example, the AVPlayer media player for iPhone can play MOVPKG files, provided your MOVPKG file is not encrypted.",
      "You may also be able to play the media a MOVPKG file contains by opening its M3U8 file in a media player that supports M3U8 files, such as VideoLAN VLC media player (cross-platform). Again, this will work only if the media your MOVPKG file contains is not encrypted."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/movpkg",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.921Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.921Z"
}