{
  "slug": "mozlz4",
  "extension": "mozlz4",
  "name": "Compressed Firefox User Profile Data File",
  "summary": "Learn about .MOZLZ4 files and view a list of programs that open them.",
  "developer": "Mozilla",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11849&b=1"
      },
      {
        "name": "Mozilla Firefox with the \"mozlz4-edit\" add-on installed",
        "url": "https://fileinfo.com/software/mozilla/firefox"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Only the Firefox web browser utilizes MOZLZ4 files so you will most likely only encounter the file(s) if you use Firefox to browse the Internet. The files are primarily stored in the \"Profile\" folder where Firefox stores information about your web browser user profile. MOZLZ4 files are often found alongside .JSONLZ4 files, which also store user profile data, most often bookmarked websites.",
      "The mozlz4 format is similar to the .LZ4 archive format but includes a unique file header. It typically stores one or more .JSON files that contain the user profile data in plain text JavaScript Object Notation (JSON) format."
    ]
  },
  "more_information": {
    "description": [
      "A MOZLZ4 file contains Mozilla Firefox user profile data saved in the mozlz4 format. It stores various profile data and settings, which may be information about default search engines, home page configuration, toolbar layout, and saved passwords."
    ]
  },
  "how_to_open": {
    "instructions": [
      "MOZLZ4 files are not meant to be manually opened. Instead, they are referenced by Firefox to load user profile settings. You can delete the files if they become too numerous and large, but you will lose information regarding your user profile.",
      "If you need to modify a MOZLZ4 file, you can open, edit, and save MOZLZ4 files using Firefox with the \"mozlz4-edit\" add-on installed."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/mozlz4",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.922Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.922Z"
}