{
  "slug": "mpe1",
  "extension": "mpe1",
  "name": "MediaPortal 1 Extension",
  "summary": "Learn about .MPE1 files and view a list of programs that open them.",
  "developer": "The MediaPortal Team",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12484&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "MediaPortal 1 is a free, open-source application that allows Windows users to connect their PC to their television and watch television, play DVDs, stream videos, record videos, play music, and more. Because the application is open-source, its users have developed a variety of plug-ins that extend the app's capabilities, as well as skins that alter the program's appearance.",
      "These plug-ins and skins are saved as MPE1 files. Users can download a large variety of MPE1 files from the Plugins & Skins section of team-mediaportal.com. They can then install these plug-ins or skins using MediaPortal 1's Extensions Manager.",
      "NOTE: At the time of this writing, MediaPortal 2 does not support MPE1 plug-ins. MediaPortal 2 plug-ins are saved as .ZIP files."
    ]
  },
  "more_information": {
    "description": [
      "An MPE1 file is a plug-in or skin for MediaPortal 1, a media center available for Windows. It can be used to either add a feature to MediaPortal 1 or re-skin the program's user interface (UI). Many MPE1 files are available for download in the Plugins & Skins section of team-mediaportal.com."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can install the MediaPortal 1 plug-in or skin an MPE1 file contains using the MediaPortal Extensions Manager (Windows), which is located in the same folder as MediaPortal 1. After opening the Extensions Manager, select File → Open. Then, open and install your MPE1 file. After you install the file, it will appear in the Extensions Manager's list of installed extensions."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/mpe1",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.923Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.923Z"
}