{
  "slug": "mpkt",
  "extension": "mpkt",
  "name": "MOPEKS Trial File",
  "summary": "Learn about .MPKT files and view a list of programs that open them.",
  "developer": "MOPEKS",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=8997&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "When you open the MOPEKS application for the first time, a window will open asking if you want to make the MPKT file associated with MOPEKS, click Yes.",
      "MOPEKS contains static and dynamic trial examples that have been stored previously:",
      "To view the different static trial examples, select the \"View Static Trial Starting positions which have been Stored Previously\" mode in the \"Stores\" window, when you enter the trial, click Next File in the MOPEKS Trial Player window. This enables you to toggle through different trials. The MPKT files are located in a correlating folder. For example, the static trial MPKT files for the SolarSystem environment contained in MOPEKS is located in this directory: C:\\​MOPEKS\\​FactoryTrials\\​SolarSystem\\​View Static.",
      "To view the different dynamic trial examples, select the \"View Dynamic Trials which have been Stored Previously\" mode in the \"MOPEKS Reception\" window, when you enter the trial click Next File in the MOPEKS Trial Player window. This enables you to toggle through different trials. The MPKT files are located in a correlating folder. For example, the dynamic trial MPKT files for the SolarSystem environment contained in MOPEKS is located in this directory: C:\\​MOPEKS\\​FactoryTrials\\​SolarSystem\\​View Dynamic.",
      "NOTE: Other MOPEKS associated files include .MSCT, .MTHD, and .MTXT."
    ]
  },
  "more_information": {
    "description": [
      "File created by MOPEKS, a program that generates multiple programs run by its script to use each other to solve problems; contains trial data, which is referenced when the file is clicked and used to play trials; data examples include X and Y axis, angle, length, height, and speed coordinates."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/mpkt",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.924Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.924Z"
}