{
  "slug": "ms-one-stub",
  "extension": "ms-one-stub",
  "name": "Microsoft OneNote Stub",
  "summary": "Learn about .MS-ONE-STUB files and view a list of programs that open them.",
  "developer": "Microsoft",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11690&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Microsoft OneNote is a digital notebook application that allows users to take notes on their computer and share those notes with others. Microsoft OneDrive is a cloud storage application that, among other things, allows users to upload, access, and share their OneNote notebooks over the Internet.",
      "When a OneDrive user creates or opens a new cloud-based notebook, OneDrive stores some files associated with that notebook on the user's PC. One of these files is an MS-ONE-STUB file, which is a pointer file that references and can be used to open the cloud-based notebook."
    ]
  },
  "more_information": {
    "description": [
      "An MS-ONE-STUB file is a shortcut used to open a Microsoft OneNote notebook that is stored within Microsoft OneDrive. It contains a reference to the notebook that it opens. MS-ONE-STUB files are created by both OneDrive and OneDrive for Business."
    ]
  },
  "how_to_open": {
    "instructions": [
      "MS-ONE-STUB files are not meant to be opened. To open the cloud-based Microsoft OneNote notebook that an MS-ONE-STUB file points to, locate the file in Windows Explorer and double-click it. Provided you have access to Microsoft OneDrive, the notebook associated with your MS-ONE-STUB file will open in OneNote.",
      "If, for some reason, double-clicking your MS-ONE-STUB file does not open your notebook in OneDrive, you may be able to find a local backup of your OneNote notebook by opening Windows Explorer and following the path:",
      "C:\\Users\\UserName\\AppData\\Local\\Microsoft\\OneNote\\#.#\\Backup",
      "Note that, in the above path, UserName is your user name and #.# is OneNote's current version number."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/ms-one-stub",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.627Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.627Z",
  "category": "other",
  "related": [],
  "containers": []
}