{
  "slug": "msg",
  "extension": "msg",
  "name": "Outlook Message Item File",
  "summary": "Learn about .MSG files and view a list of programs that open them.",
  "developer": "Microsoft",
  "programs": {
    "windows": [
      {
        "name": "Microsoft Outlook",
        "url": "https://file.org/free-download/microsoft-outlook"
      },
      {
        "name": "SysTools MSG Viewer",
        "url": "https://file.org/free-download/systools-msg-viewer"
      },
      {
        "name": "Systools MSG Converter",
        "url": "https://file.org/free-download/systools-msg-converter"
      },
      {
        "name": "Open and view .MSG files with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=139&b=1"
      },
      {
        "name": "File Viewer Plus",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=139"
      },
      {
        "name": "Microsoft Outlook 365",
        "url": "https://fileinfo.com/software/microsoft/outlook"
      },
      {
        "name": "Mozilla SeaMonkey",
        "url": "https://fileinfo.com/software/mozilla/seamonkey"
      },
      {
        "name": "File Viewer for Android",
        "url": "https://fileinfo.com/software/android_file_viewer"
      },
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Bethesda Softworks Fallout 2",
        "url": "https://fileinfo.com/software/bethesda_softworks/fallout_2"
      },
      {
        "name": "Microsoft WordPad",
        "url": "https://fileinfo.com/software/microsoft/wordpad"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Microsoft introduced the MSG format with the release of Microsoft Exchange Server and Microsoft Outlook in 2003 and still actively maintains the MSG format. The primary purpose of the MSG file is to allow Outlook users to share various items, such as messages, appointments, and contacts.",
      "The information stored in an MSG file differs based on the item contained in the file. Examples of items often saved in MSG files and their information:",
      "Email - MSG file contains one or more email fields, which include the date, sender, recipient, subject, and the message body, and any attachments to the message. The default name of the MSG file is the same as the message subject.",
      "Appointment - MSG file contains the appointment details, which include the start and end time of the appointment, location, and message. The default name of the MSG file is the same as the appointment title.",
      "Meeting - MSG file contains the meeting details, which include the required and optional attendees, start and end time of the meeting, location, and message. The default name of the MSG file is the same as the meeting title.",
      "Contact - MSG file contains details about the contact, which include the full name of the person, work information, email address, phone numbers, and business and home address. The default name of the MSG file is the same as the full name of the contact.",
      "Task - MSG file contains the task details, which include the start and due date of the task, priority level, percentage completed, and message. The default name of the MSG file is the same as the task subject.",
      "You can create an MSG file with Outlook by dragging and dropping an email message, appointment, contact, or task item to your desktop or a folder in Windows Explorer. When doing this, Outlook names the MSG file the same name as the message subject. For example, a message with the subject \"Thanks for contacting us\" becomes Thanks for contacting us.msg.",
      "You can also create an MSG file with Outlook by selecting the email message, contact, appointment, or task and clicking File → Save As. You can then choose the save location and name of the MSG file."
    ]
  },
  "more_information": {
    "description": [
      "An MSG file is an item, such as an email message, contact, appointment, or task created or saved within Microsoft Outlook. It contains all the information about the item, which includes attachments to an email message. While Outlook is primarily associated with MSG files, other programs using Microsoft's Messaging Applications Programming Interface (MAPI) also support them."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an MSG file with Microsoft Outlook in Windows simply by double-clicking the file. If Outlook is not set as the default application for opening MSG files, you can right-click the file and choose Outlook to open the MSG file. When opened in Outlook, the program formats the message appropriately to appear the same way it appeared before being exported.",
      "You can also open MSG files with third-party programs, such as Encryptomatic MsgViewer Pro (Windows) and 45RPM MailRaider Pro (macOS)."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "Microsoft Outlook can convert MSG files to several file types. For example, you can convert MSG files to .HTML files by selecting File → Save As. You can also convert MSG files to .PDF files via the Microsoft Print to PDF option."
    ]
  },
  "images": [
    {
      "url": "https://assets.file.org/images/fileorg-logo-440x90-4-8b.png",
      "alt": "File.org logo"
    },
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/msg_139.png",
      "alt": "Screenshot of a .msg file in Microsoft Outlook for Microsoft 365",
      "caption": "MSG file open in Microsoft Outlook for Microsoft 365"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/msg_9485.png",
      "alt": "Screenshot of a .msg file in Microsoft Visual Studio Code",
      "caption": "MSG file open in Microsoft Visual Studio Code"
    }
  ],
  "sources": [
    {
      "url": "https://file.org",
      "source": "file.org",
      "retrieved_at": "2025-11-01T22:32:42.184Z"
    },
    {
      "url": "https://fileinfo.com/extension/msg",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.184Z"
    },
    {
      "source": "filext.com",
      "retrieved_at": "2025-11-01T22:32:42.184Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.184Z",
  "mime": [
    "application/vnd.ms-outlook"
  ],
  "category": "other",
  "related": [],
  "containers": []
}