{
  "slug": "mswmm",
  "extension": "mswmm",
  "name": "Windows Movie Maker Project",
  "summary": "Learn about .MSWMM files and view a list of programs that open them.",
  "developer": "Microsoft",
  "category": "video",
  "category_slug": "video",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1547&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Windows Movie Maker allows the user to combine and edit content saved within an MSWMM file. Once the movie is finished, it can be exported in a standard video format or burned to a DVD.",
      "You can convert an MSWMM file to a .WMV file, which is a more common format, using Window MovieMaker:",
      "Windows Vista - Open the MSWMM file by selecting File → Open Project. Then select [m[File → Publish Movie[/m] and follow the prompts to save the file as a WMV file.",
      "Windows 7 - Open the MSWMM file by selecting File → Open Project. Then, drag the project to the timeline and click \"Save to my computer\", which is under \"Finish Movie\" in the left pane. Then follow the prompts in the wizard to save the file as a WMV file.",
      "You can also convert MSWMM files using Wondershare Video Converter. With this program, you can convert the project to more popular formats, such as .MP4, .AVI, .FLV, .MOV, .DVD, .VOB, an .MPG."
    ]
  },
  "more_information": {
    "description": [
      "MSWMM (Movie Maker Project) is a file format used by the Windows Movie Maker application, which is a video editing software developed by Microsoft for Windows operating systems. MSWMM files are used to save movie projects created using Windows Movie Maker. Just like WLMP files, MSWMM files are not video files, but rather project files that contain information about the arrangement of video clips, photos, and audio tracks in a movie project, as well as the applied effects and transitions.\n\nTo open an MSWMM file, you need to use the Windows Movie Maker application. Once the project is loaded into the application, you can edit it, add or remove elements, and export it as a video file format such as WMV or MP4 to be played on media players.\n\nThe information in an MSWMM file is stored in an XML (Extensible Markup Language) format, which is a markup language used for describing structured data. The MSWMM file contains a series of XML tags that describe the sequence of events in the movie project, such as the size and length of the video, the location and duration of each media clip, the applied transitions and effects, and other project-related details. The MSWMM file also includes references to the actual media files, such as video clips and audio tracks, but does not contain the actual media data.\n\nWhen a movie project is saved in Windows Movie Maker, it is saved as an MSWMM file, which can be opened and edited later using the Windows Movie Maker application. The MSWMM file serves as a blueprint for the final video production, which can be exported as a video file format such as WMV or MP4 to be played on media players.",
      "An MSWMM file is a movie created with Windows Movie Maker. It contains a project, which includes the movie timeline, transitions, and references to video clips, audio files, and still images used by the movie."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To open an MSWMM (Movie Maker Project) file, you need to use the Windows Movie Maker application. Here are the steps to open an MSWMM file:\n\nOpen Windows Movie Maker.Go to the “Home” tab and click on “Open project.”Select the MSWMM file you want to open.The project will be loaded into the Windows Movie Maker and you can now edit or export the movie project.\n\nPlease note that an MSWMM file is not a video file, but rather a project file that contains information about the arrangement of video clips, photos, and audio tracks in a movie project. You need to use Windows Movie Maker to edit the project and export it as a video file format such as WMV or MP4 to be played on media players."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "To convert an MSWMM (Movie Maker Project) file to WMV (Windows Media Video), you need to use the Windows Movie Maker application. Here are the steps to convert an MSWMM file to WMV:\n\nOpen Windows Movie Maker and load the MSWMM project.Go to the “Home” tab and click on “Save movie.”Select “For computer” and then choose “WMV” as the file format.Follow the on-screen instructions to save the movie project as a WMV video file.\n\nOnce the MSWMM project has been saved as a WMV file, it can be played on a variety of media players that support the WMV format, as well as uploaded to websites such as YouTube or Vimeo for sharing with others."
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/video/mswmm/index.html",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-01T22:32:42.278Z"
    },
    {
      "url": "https://fileinfo.com/extension/mswmm",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.278Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.278Z",
  "containers": []
}