{
  "slug": "mtz",
  "extension": "mtz",
  "name": "MIUI Theme",
  "summary": "Learn about .MTZ files and view a list of programs that open them.",
  "developer": "Xiaomi",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=8181&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "MIUI is a variant of the Android operating system used by Xiaomi smartphones. Among other things, MIUI allows users to customize the operating system's skin, using themes saved as MTZ files.",
      "Typically, users download and install themes via Xiamoi Themes (also known as MIUI Theme APP), and never directly interact with MTZ files. However, advanced users sometimes download MTZ files from the internet or other unofficial sources, and then manually install them via Xiaomi Themes or other MIUI theme-related applications.",
      "NOTE: MIUI stores MTZ files in subdirectories of the /​system/​media/​theme directory."
    ]
  },
  "more_information": {
    "description": [
      "An MTZ file contains a custom theme used by a Xiaomi MIUI smartphone. It is a renamed .ZIP package that contains the theme's assets, configuration files, and metadata. MIUI users often download MTZ files via theme-related applications or the internet, to install on their smartphones."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To install the theme an MTZ file contains on a MIUI device:",
      "Place the MTZ file on your device.",
      "Open Xiaomi Themes",
      "Select My Account → Themes.",
      "Scroll down and select Import.",
      "Navigate to and import your MTZ file.",
      "Apply the theme your MTZ file contains.",
      "If you want to edit the theme an MTZ file contains, you can do so with ChaoMe Theme Editor, an unofficial MIUI theme editor.",
      "If you want to view the constituent files an MTZ file contains, you can do so by:",
      "Changing the file's extension from .mtz to .zip.",
      "Opening it as you would any .ZIP file."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/mtz",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.933Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.933Z"
}