{
  "slug": "mtzu",
  "extension": "mtzu",
  "name": "MTZU Ransomware Encrypted File",
  "summary": "Learn about .MTZU files and view a list of programs that open them.",
  "developer": "N/A",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13122&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "In January 2023, some PC users began reporting their computers had been infected by MTZU ransomware. This ransomware encrypts a user's files and renames them to use the .mtzu extension.",
      "MTZU ransomware is one of many variants of STOP DJVU ransomware. Just like other STOP DJVU variants, MTZU ransomware produces a plain text ransom note, named _readme.txt, in every folder that contains an infected file. This ransom note contains instructions users can supposedly follow to restore their files.",
      "MTZU ransomware is most commonly distributed within programs that appear to be legitimate but are actually adware and malware bundles. If you recently downloaded and installed an unverified program, that may be how your computer became infected by MTZU ransomware."
    ]
  },
  "more_information": {
    "description": [
      "A file with the .mtzu extension has been renamed and encrypted by MTZU ransomware. It contains an image, video, document, or other type of file the ransomware is holding hostage. The .mtzu extension is added to the file's normal extension, producing an extension like .jpg.mtzu."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Because MTZU files are encrypted, you cannot open them. At this time, there is no way to decrypt MTZU files. The best way to restore files encrypted by MTZU ransomware is to retrieve them from a recent backup or perform a System Restore."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/mtzu",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.933Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.933Z"
}