{
  "slug": "mui",
  "extension": "mui",
  "name": "Myriad User Instrument File",
  "summary": "Learn about .MUI files and view a list of programs that open them.",
  "developer": "Myriad Software",
  "category": "audio",
  "category_slug": "audio",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=7581&b=1"
      },
      {
        "name": "Myriad Harmony Assistant",
        "url": "https://fileinfo.com/software/myriad/harmony_assistant"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Harmony Assistant comes packaged with many default instruments saved in MUI files. Each instrument file consists of a recording of an instrument playing a specific note and parameters to tell the program how it should be played.",
      "In Harmony Assistant, you can create instruments other than the default ones packaged with the software by editing an instrument and selecting Save predefined instrument in the Action contextual menu. You can also define the parameters of the instruments such as the note range, sound attack rate, decay, volume release, and loop release."
    ]
  },
  "more_information": {
    "description": [
      "The acronym MUI in this context refers to Myriad User Instrument, a specialized and proprietary file format integral to the Harmony Assistant software. Developed by Myriad Software, Harmony Assistant is a comprehensive application for music notation, composition, and sequencing. The primary function of an MUI file is to act as a container for digital instrument sounds, housing detailed sample data and synthesis parameters that define the timbre and behavior of a virtual instrument. These files provide the essential sonic palette, allowing users to load and play a wide variety of custom and proprietary instrument sounds directly within the Harmony Assistant program for their musical projects.\n\nMUI files are generally not compatible with other music software, as they are designed to work specifically with the Harmony Assistant program. To open an MUI file, you need to have the Harmony Assistant software installed on your computer. Once you have Harmony Assistant installed, you can import the MUI file into the program and use the included instrument sounds and other data to compose and arrange music.",
      "An MUI file contains a user instrument created by Myriad Harmony Assistant. It stores sound data for an instrument such as a piano, guitar, clarinet, or trumpet. MUI files are used for generating realistic sounds."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To open the MUI file, you will need to have the Harmony Assistant software installed on your computer. Here are the general steps to open an MUI file using Harmony Assistant:\n\nLaunch the Harmony Assistant software.Click on “File” in the menu bar and select “Open” from the drop-down menu.Browse to the location of the MUI file that you want to open and select it.Click on “Open” to import the MUI file into Harmony Assistant.Once the MUI file is imported, you should be able to access the included instrument sounds and other data in the Harmony Assistant software.",
      "You can only open an MUI file with Myriad Harmony Assistant. The software is available for Windows, macOS, and LInux."
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/mui_7581.jpg",
      "alt": "Screenshot of a .mui file in Myriad Harmony Assistant",
      "caption": "MUI file open in Myriad Harmony Assistant"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/audio/mui/index.html",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-01T22:32:42.279Z"
    },
    {
      "url": "https://fileinfo.com/extension/mui",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.279Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.279Z",
  "containers": []
}