{
  "slug": "nbib",
  "extension": "nbib",
  "name": "PubMed Bibliographic Citation File",
  "summary": "Learn about .NBIB files and view a list of programs that open them.",
  "developer": "U.S. National Library of Medicine",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11687&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "The PubMed format was developed to replace the Research Information Systems (RIS) citation format in order to better accommodate bibliographic information provided by the PubMed search engine. PubMed is developed by the U.S. National Library of Medicine and makes available citations for biomedical literature from life science journals, online books, and the MEDLINE database.",
      "When you want to export a citation from PubMed, click the \"Cite\" button next to the item, which opens the Citation Manager feature. Then, select the desired citation information you want to be included in the NBIB file, click \"Create File,\" and choose the save location (choosing the location prompts the download of the NBIB file through your web browser). Citation information saved in the PubMed format can be exported as a .TXT or NBIB file.",
      "The PubMed format includes one or more records that consist of a series of lines delimited by tags and corresponding values. Some examples of tags:",
      "BTI - Book Title",
      "AU - Author",
      "CI - Copyright Information",
      "DP - Publication Date",
      "IS - ISSN (International Standard Serial Number of the journal)",
      "PB - Publisher",
      "The format also supports PubMed-specific fields that the RIS format does not support, which prompted the move from the RIS format to the PubMed format."
    ]
  },
  "more_information": {
    "description": [
      "An NBIB file is a bibliographic citation file saved in the PubMed format developed by the U.S. National Library of Medicine. It contains citation information, such as title, author, publication date, keywords, publisher, issue number, and start and end page of published medical work."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open NBIB files with various citation management programs, such as Clarivate EndNote (multiplatform). You can also upload NBIB files to Clarivate EndNote Web and ProQuest RefWorks.",
      "Since NBIB files are saved in an ASCII text format, you can also open and modify the files with a text editor. Keep in mind that the citations will not look the same as if you opened them with a citation management program."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/nbib",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.637Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.637Z",
  "category": "other",
  "related": [],
  "containers": []
}