{
  "slug": "ndpi",
  "extension": "ndpi",
  "name": "Hamamatsu TIFF-like Slide Image",
  "summary": "Learn about .NDPI files and view a list of programs that open them.",
  "developer": "Hamamatsu",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12078&b=1"
      },
      {
        "name": "NDPITools",
        "url": "https://pperso.ijclab.in2p3.fr/page_perso/Deroulers/software/ndpitools/"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Pathologists use virtual microscopes and digital slide scanners to save and examine digital images of pathology slide specimens. Some Hamamatsu slide scanners save slide images as NDPI files. These files are TIFF-like files that contain .JPEG images and metadata that specifies the images' size, intended resolution, and other data.",
      "However, because of the way NDPI files are structured, they cannot be read as normal TIFF files. For example, NDPI files' headers are not structured the same way as standard TIFF headers, which can cause applications that can open TIFF files to fail to open NDPI files. Only certain slide-viewing applications allow users to view NDPI files."
    ]
  },
  "more_information": {
    "description": [
      "An NDPI file is a pathology slide specimen image created by a Hamamatsu slide scanner, such as the Hamamatsu NanoZoomer. It contains a picture of a slide specimen, saved in a proprietary, TIFF-like format. NDPI files can be viewed in Hamamatsu's slide-viewing software or in other slide-viewing applications."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open NDPI files in Aperio Technologies ImageScope (Windows), NetScope Viewer (Windows), NDPITools (cross-platform), or OpenSlide (cross-platform)."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/ndpi",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.944Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.944Z"
}