{
  "slug": "nksc",
  "extension": "nksc",
  "name": "Nikon Capture NX-D Sidecar File",
  "summary": "Learn about .NKSC files and view a list of programs that open them.",
  "developer": "Nikon",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12418&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Nikon digital camera users can download and use Nikon Capture NX-D to process the RAW images their camera produces. When a user makes one or more edits to an image in Capture NX-D, a record of those edits is automatically saved as an NKSC, or Nikon sidecar, file.",
      "Saving a user's edits in an NKSC file, rather than applying them directly to the user's NEF or NRW file, allows the user to retain their original image and to revert to the original image in Capture NX-D if needed. To revert to your original image in Capture NX-D, click the Restore button located on the app's right-hand side."
    ]
  },
  "more_information": {
    "description": [
      "An NKSC file is a metadata file created by Nikon Capture NX-D, a Nikon camera RAW image processing application used to edit .NEF and .NRW images. It contains a record of the edits made to a RAW image. Nikon Capture NX-D saves edits in NKSC files so you can retain the original, unedited copy of your RAW image."
    ]
  },
  "how_to_open": {
    "instructions": [
      "NKSC files are not meant to be opened manually. When you open an NEF or NRW image that you've edited in Nikon Capture NX-D, Capture NX-D automatically applies any edits saved in an associated NKSC file."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/nksc",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.949Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.949Z"
}