{
  "slug": "nmm",
  "extension": "nmm",
  "name": "Samsung Memo Backup File",
  "summary": "Learn about .NMM files and view a list of programs that open them.",
  "developer": "Samsung",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10995&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Samsung Memo was a note-taking application that came pre-installed on some Samsung Galaxy phones, such as the Galaxy Trend Plus and S7, and other devices. If a Samsung Memo user wanted to back up their memos on their PC, they could do so by installing Samsung Kies on their PC, connecting their mobile device to their PC, and using Kies to produce a memo backup file. Memo backups contained a copy of all a user's memos, and they were saved as NMM files.",
      "Eventually, Samsung discontinued the Samsung Memo app in favor of Samsung Notes. For a while, users could use Samsung Kies, Samsung Smart Switch, or Samsung Notes to migrate the memos contained within their NMM files to Samsung Notes. At this point, however, no Samsung programs support the NMM format."
    ]
  },
  "more_information": {
    "description": [
      "An NMM file is a memo backup file created by Samsung Kies, a program that allows Samsung smartphone and tablet users to back up files stored on their mobile devices. It contains a copy of memos created using the Samsung Memo app, which previously came pre-installed on select Galaxy phones. NMM files can no longer be opened, as no Samsung programs support them."
    ]
  },
  "how_to_open": {
    "instructions": [
      "There is no known program that can open NMM files. Samsung Kies, Samsung Smart Switch, and Samsung Notes previously allowed users to migrate the memos contained within an NMM file to Samsung Notes, but those programs no longer support the NMM format."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/nmm",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.951Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.951Z"
}