{
  "slug": "nmmm",
  "extension": "nmmm",
  "name": "Samsung Memo Backup File",
  "summary": "Learn about .NMMM files and view a list of programs that open them.",
  "developer": "Samsung",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12495&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Samsung Memo is a note-taking application that came pre-installed on some Samsung Galaxy phones, such as the S7. Memo users could back up their notes using the Samsung Kies or Samsung Smart Switch backup applications. Doing so saved a copy of the user's notes in an NMMM file.",
      "Each NMMM file is a Zip-compressed archive that contains three files:",
      "memo.bk",
      "SmartSwitchBackup.json",
      "SSMDummyValue.exml",
      "Memo.bk contains the backup of a user's notes. However, memo.bk is saved in a proprietary binary file format and cannot be opened manually.",
      "Eventually, Samsung discontinued the Samsung Memo in favor of Samsung Notes. For a while, users could use Samsung Kies, Samsung Smart Switch, or Samsung Notes to migrate the notes contained within their NMMM files to Samsung Notes. At this point, however, no Samsung programs support the NMMM format."
    ]
  },
  "more_information": {
    "description": [
      "An NMMM file is a backup file that contains a copy of a user's Samsung Memo notes. It was likely created by either Samsung Kies or Samsung Smart Switch. NMMM files can no longer be opened, as no Samsung programs support them."
    ]
  },
  "how_to_open": {
    "instructions": [
      "There is no known program that can open NMMM files. Samsung Kies, Samsung Smart Switch, and Samsung Notes previously allowed users to migrate the notes contained within an NMMM file to Samsung Notes, but those programs no longer support the NMMM format."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/nmmm",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.647Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.647Z",
  "category": "other",
  "related": [],
  "containers": []
}