{
  "slug": "nomedia",
  "extension": "nomedia",
  "name": "Android No Media File",
  "summary": "Learn about .NOMEDIA files and view a list of programs that open them.",
  "developer": "Google",
  "programs": {
    "windows": [
      {
        "name": "GOM Player",
        "url": "https://file.org/free-download/gom-player"
      },
      {
        "name": "Adobe Acrobat",
        "url": "https://file.org/free-download/adobe-acrobat"
      },
      {
        "name": "RealPlayer",
        "url": "https://file.org/free-download/realplayer"
      },
      {
        "name": "Windows Media Player",
        "url": "https://file.org/free-download/windows-media-player"
      },
      {
        "name": "Windows Photo Gallery",
        "url": "https://file.org/free-download/windows-photo-gallery"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=7532&b=1"
      },
      {
        "name": "File Viewer for Android",
        "url": "https://fileinfo.com/software/android_file_viewer"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Android's NOMEDIA files have several uses. For example, if you want to exclude a folder containing sensitive photos from your phone's Gallery app, you can create a .nomedia file in that folder. Then, the folder's photos will not appear in Gallery.",
      "NOMEDIA files can also be used to boost multimedia-viewing apps' performance, by manually excluding folders that contain a large number of images, videos, or audio files from the apps' media searches. This will cause the apps to load and display your other multimedia files more quickly.",
      "Many Android audio players, video players, and image browsers recognize NOMEDIA files. Additionally, some Android apps create their own NOMEDIA files, to ensure the multimedia files they include do not appear in multimedia players and image browsers. For example, a free app that includes ads may use a NOMEDIA file to hide its ads from multimedia apps.",
      "In some instances, you may want to re-include a folder that contains a NOMEDIA file in multimedia apps' media searches. In that case, you can safely delete your folder's NOMEDIA file. Android file managers, such as File Viewer for Android, and NOMEDIA management utilities, such as g(x) labs Nomedia or Droida Nomedia, allow users to delete NOMEDIA files."
    ]
  },
  "more_information": {
    "description": [
      "A NOMEDIA file is an empty text file stored on an Android mobile device or external storage card. The file marks the folder it resides within, as well as that folder's sub-folders, as having no multimedia data. This tells multimedia players, gallery apps, and other apps looking for media files to skip the folder when scanning for media files. NOMEDIA files have no filename prefix; they are named just .nomedia."
    ]
  },
  "how_to_open": {
    "instructions": [
      "NOMEDIA files are not meant to be opened. If you want to manually manage your device's NOMEDIA files, you can do so using an Android file manager, such as File Viewer for Android, or NOMEDIA utilities, such as g(x) labs Nomedia."
    ]
  },
  "images": [
    {
      "url": "https://assets.file.org/images/fileorg-logo-440x90-4-8b.png",
      "alt": "File.org logo"
    },
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://file.org",
      "source": "file.org",
      "retrieved_at": "2025-11-01T22:32:42.187Z"
    },
    {
      "url": "https://fileinfo.com/extension/nomedia",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.187Z"
    },
    {
      "source": "filext.com",
      "retrieved_at": "2025-11-01T22:32:42.187Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.187Z",
  "category": "other",
  "related": [],
  "containers": []
}