{
  "slug": "non",
  "extension": "non",
  "name": "Nonogram Puzzle File",
  "summary": "Learn about .NON files and view a list of programs that open them.",
  "developer": "Dr. Steven Simpson",
  "programs": {
    "windows": [
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "gedit",
        "url": "https://fileinfo.com/software/gedit/gedit"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11558&b=1"
      },
      {
        "name": "Nonogram",
        "url": "https://stevocity.me.uk/software/pkg-nonowimp"
      }
    ]
  },
  "technical_info": {
    "content": [
      "You will most likely only encounter a NON file if you enjoy solving puzzles with nonogram puzzle programs. Nonograms are puzzles that originated in Japan in the 1980s. They contain cells in a grid with numbers on the sides to indicate which cells should be colored in or left blank. The user must solve the number pattern, then fill in the cells with the appropriate coloring. Once the coloring is complete, the puzzle reveals a hidden picture to the user.",
      "The NON file is one of many nonogram puzzle file types used by various nonogram puzzle programs. The format was created by Dr. Steven Simpson, a Senior Research Associate at Lancaster University in the United Kingdom.",
      "NOTE: A NON file can store information about only one puzzle. Files that store multiple nonogram puzzles are given the .nonpack extension."
    ]
  },
  "more_information": {
    "description": [
      "A NON file contains information about a nonogram puzzle in the NON nonogram plain text format developed by Dr. Steven Simpson. It stores information organized into \"keys\" that describes various aspects of the puzzle, such as the goal, height, width, columns, and rows. NON files may also contain metadata, such as the title, author, description, and copyright of the puzzle."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a NON file with Nonogram, a nonogram puzzle solving program developed by Dr. Steven Simpson. It is available for Windows and various Linux distributions.",
      "Since NON files are saved in plain text, you can also open and edit them with a text editor, such as Microsoft Notepad (Windows), Apple TextEdit (Mac), or gedit (Linux). Keep in mind that NON files opened in a text editor will not appear the same as if they were opened in Nonogram."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/non",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.953Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.953Z"
}