{
  "slug": "npk",
  "extension": "npk",
  "name": "MikroTik Software Package",
  "summary": "Learn about .NPK files and view a list of programs that open them.",
  "developer": "MikroTik",
  "category": "compression",
  "category_slug": "compression",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10758&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "You most likely will only encounter NPK files if you own a MikroTik router. NPK files can be downloaded from the MikroTik website then uploaded to a MikroTrik router to update the RouterOS. The router needs to be rebooted before the update can be completed.",
      "Here are some examples of NPK software package names and their contents:",
      "advanced-tools - Contains information about network monitor and support for other advanced tools.",
      "framerelay - Contains information about frame relay support for FarSync, Moxa C101, and Cyclades PC300 interfaces.",
      "lcd - Contains information about LCD monitor support.",
      "web-proxy - Contains information about squid based web proxy support",
      "NOTE: MikroTik is a Latvian company that specializes in the development of routers and wireless IPS systems."
    ]
  },
  "more_information": {
    "description": [
      "An NPK file is a software upgrade package file used by MikroTik routers for upgrade of router operating system. It comes as a compressed binary archive that is loaded in the router for installing software updates. Information contained inside an NPK files include networking information such as IP address and IP service, connectors information (ethernet interfaces and serial port), email setup, bridge configuration, and local user management.",
      "An NPK file is a software package used to deliver and install updates to MikroTik routers. It contains MikroTik RouterOS software information, which includes IP address, IP service, ethernet interfaces, serial port, and local user management, email setup, bridge configuration, and package and system resource management information. NPK files are saved in a compressed binary package format."
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/npk_13366.png",
      "alt": "Screenshot of a .npk file in n-Track Studio 9",
      "caption": "NPK file open in n-Track Studio 9"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/compression/npk/index.html",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-01T22:32:42.279Z"
    },
    {
      "url": "https://fileinfo.com/extension/npk",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.279Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.279Z",
  "containers": []
}