{
  "slug": "nus3audio",
  "extension": "nus3audio",
  "name": "Namco Universal Sound 3.0 Audio",
  "summary": "Learn about .NUS3AUDIO files and view a list of programs that open them.",
  "developer": "Bandai Namco",
  "programs": {
    "windows": [
      {
        "name": "VideoLAN VLC media player",
        "url": "https://fileinfo.com/software/videolan/vlc_media_player"
      },
      {
        "name": "Microsoft Windows Media Player",
        "url": "https://fileinfo.com/software/microsoft/windows_media_player"
      },
      {
        "name": "Apple QuickTime Player",
        "url": "https://fileinfo.com/software/apple/quicktime_player"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11957&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "While most video game players will never encounter NUS3AUDIO files, some Super Smash Bros. enthusiasts enjoy extracting, playing, modifying, and creating their own NUS3AUDIO files. These modders have developed programs that allow them to manipulate and create NUS3AUDIO files, so they can add custom music and dialogue to Super Smash Bros. Ultimate.",
      "NOTE: The NUS3AUDIO format replaced the .NUS3BANK format used in Super Smash Bros. 4. Super Smash Bros. Ultimate contains NUS3BANK files, but those files are used only to set audio parameters, such as volume."
    ]
  },
  "more_information": {
    "description": [
      "A NUS3AUDIO file is an audio file included in a Bandai Namco video game. It contains a collection of audio referenced during gameplay, such as background music and character dialogue. Most notably, NUS3AUDIO files are used in Super Smash Bros. Ultimate, a popular fighting game for the Nintendo Switch."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can use the conversion tools available at Smash Ultimate Tools (Web) to convert NUS3AUDIO files to .WAV files. Then, you can play the converted files in any media player, such as VideoLAN VLC media player (cross-platform), Microsoft Windows Media Player (Windows), or Apple QuickTime Player (macOS).",
      "If you want to add a custom NUS3AUDIO file to Super Smash Bros. Ultimate, you can do so by:",
      "Using Smash Ultimate Tools to create a custom NUS3AUDIO file.",
      "Using Sma5hMusic (Windows) to add your custom NUS3AUDIO file to Super Smash Bros. Ultimate."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/nus3audio",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.959Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.959Z"
}