{
  "slug": "nvda-addon",
  "extension": "nvda-addon",
  "name": "NVDA Add-On",
  "summary": "Learn about .NVDA-ADDON files and view a list of programs that open them.",
  "developer": "NV Access",
  "programs": {
    "windows": [
      {
        "name": "7-Zip",
        "url": "https://fileinfo.com/software/igor_pavlov/7-zip"
      },
      {
        "name": "Apple Archive Utility",
        "url": "https://fileinfo.com/software/apple/archive_utility"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12766&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "NVDA (NonVisual Desktop Access) is a free screen reader program developed by NV Access. It can read and recite the contents of a user's screen, to assist blind, visually impaired, and illiterate users with \"reading\" documents, webpages, and other content. NVDA is available only for Microsoft Windows.",
      "Because NVDA is open-source, development-savvy users can easily develop their own new features for the program. These \"add-on\" features are saved as NVDA-ADDON files. The NVDA Community Add-ons website maintains a master list of reviewed and approved add-ons. Users can download any of these add-ons as NVDA-ADDON files and install them in NVDA, to use the feature(s) they contain."
    ]
  },
  "more_information": {
    "description": [
      "An NVDA-ADDON file is a plug-in used to add features to the NVDA screen reader. It contains one or more features that enhance NVDA's default functionality. Users can download NVDA-ADDON files from the NVDA Community Add-ons website and other sources."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can install an NVDA-ADDON file in NVDA (Windows). To do so, double-click the NVDA-ADDON file. NVDA will then show you an Add-on Installation window, asking whether you're sure you want to install the file. Click Yes to begin installing the file.",
      "Because NVDA-ADDON files are Zip files, you can also extract the files they contain using any Zip-decompression utility, such as 7-Zip or Apple Archive Utility."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/nvda-addon",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.960Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.960Z"
}