{
  "slug": "nvl",
  "extension": "nvl",
  "name": "UniChem Results File",
  "summary": "Learn about .NVL files and view a list of programs that open them.",
  "developer": "Oxford Molecular",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1378&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "UniChem is a computational chemistry software package widely used in the 1990s for drug discovery and chemical analysis tasks but is no longer developed. It enabled researchers and scientists to simulate molecular interactions and conduct structure-activity relationship studies, helping accelerate product development in several fields, including pharmaceuticals and materials science. As users performed various chemical analysis tasks with UniChem, the software saved their results in NVL files, which users could then review."
    ]
  },
  "more_information": {
    "description": [
      "An NVL file is a data file created by Oxford Molecular UniChem, a chemical analysis tool used in laboratory settings. It stores results from an analytical job or process completed by UniChem in a proprietary format that users, such as chemists, lab technicians, and researchers, can review for further analysis."
    ]
  },
  "how_to_open": {
    "instructions": [
      "The only known program that can open NVL files is Oxford Molecular UniChem, which is no longer developed."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/nvl",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.960Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.960Z"
}