{
  "slug": "nvp",
  "extension": "nvp",
  "name": "NVivo for Windows Project",
  "summary": "Learn about .NVP files and view a list of programs that open them.",
  "developer": "QSR International",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10523&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "The source materials included in the NVP file may be audio recordings, survey responses, audio recordings, and interview transcripts. The analysis of the materials may be memos, annotations, maps, charts, diagrams, and nodes.",
      "NVivo notifies you to save your NVP project every 15 minutes by default. However, you can alter the 15 minute prompts by selecting File → Options, clicking the \"Notifications\" tab, and changing the interval time in the \"minutes\" box.",
      "NVP files stored on a network drive are only updated when you close the project. If you want to avoid the loss of data be sure to close the file before shutting down your computer.",
      "NOTE: NVivo for Mac saves projects in an NVPX file."
    ]
  },
  "more_information": {
    "description": [
      "An NVP file is a project created by the Windows version of NVivo, a qualitative data analysis application used by researchers. It contains source materials and the user's analysis of the source materials. NVP files also include project properties such as the project title, description, when the project was created, who can view the project, and the paragraph styles."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/nvp",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.655Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.655Z",
  "category": "other",
  "related": [],
  "containers": []
}