{
  "slug": "nxindex",
  "extension": "nxindex",
  "name": "Mig Switch Flash Cartridge Index File",
  "summary": "Learn about .NXINDEX files and view a list of programs that open them.",
  "developer": "Mig Switch",
  "programs": {
    "windows": [
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13690&b=1"
      },
      {
        "name": "Microsoft Wordpad",
        "url": "https://fileinfo.com/software/microsoft/wordpad"
      },
      {
        "name": "gedit",
        "url": "https://fileinfo.com/software/gedit/gedit"
      }
    ]
  },
  "technical_info": {
    "content": [
      "The Mig Switch flashcart is the same size as a Switch game cartridge but contains special chips and an SD Card slot to allow users to load backup game ROMs dumped from Switch cartridges onto a Micro SD card inserted into the flashcart. When a user inserts the flashcart into a Switch, it loads games onto the Switch, but the Switch does not allow users to browse and select the games.",
      "Instead, users must eject and reinsert the flashcart multiple times to change the game. Every time a user does this, the flashcart writes the order of the games to the NXINDEX file and saves it to the Micro SD card inserted in the flashcart."
    ]
  },
  "more_information": {
    "description": [
      "An NXINDEX file is a text file the Mig Switch Flash Cartridge (often abbreviated as \"flashcart\") creates to record the order of games loaded from the flashcart onto a Nintendo Switch console. It contains the order of each game and metadata, including the flashcart firmware version and whether or not the card is locked to the selected game. Users can open NXINDEX files with text or hex editors to view their contents."
    ]
  },
  "how_to_open": {
    "instructions": [
      "NXINDEX files are not meant to be opened. Instead, Nintendo Switch references NXINDEX files via the Mig Switch Flash Cartridge.",
      "However, you can open and view the contents of an NXINDEX file with a hex or text editor, such as HxD, Microsoft Notepad, or Apple TextEdit. For example, you can open an NXINDEX file with HxD to confirm that your Micro SD card is on the latest firmware version or that your Micro SD card is working correctly."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/nxindex",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.962Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.962Z"
}