{
  "slug": "oam",
  "extension": "oam",
  "name": "Adobe Edge Animate Widget File",
  "summary": "Learn about .OAM files and view a list of programs that open them.",
  "developer": "Adobe Systems",
  "category": "web",
  "category_slug": "web",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=8369&b=1"
      },
      {
        "name": "Adobe Edge Animate CC",
        "url": "https://fileinfo.com/software/adobe/edge_animate"
      },
      {
        "name": "Adobe InDesign 2023",
        "url": "https://fileinfo.com/software/adobe/indesign"
      },
      {
        "name": "Adobe Dreamweaver 2021",
        "url": "https://fileinfo.com/software/adobe/dreamweaver"
      }
    ]
  },
  "technical_info": {
    "content": [
      "The internal file structure of a .oam file is proprietary and not publicly documented by Adobe. However, it is known that .oam files contain a collection of files and resources (such as graphics, audio, and ActionScript code) packaged into a single file. The contents of a .oam file may include XML files, SWF files, and other resource files. The exact structure of the .oam file depends on the specific version of Adobe Animate used to create it, as well as the type of animation and assets included in the file.\n\nAn OAM file contains the following information.\n\nAssets: Information about the graphics, audio, and video assets used in the animation.\n\nBehaviors: Descriptions of the actions and interactions that occur in the animation.\n\nActionScript code: The code used to control the animation’s behavior and interactivity.\n\nPublish settings: Information about the platform and format in which the animation will be published, such as HTML5 or AIR.\n\nMetadata: Additional information such as the animation’s author, creation date, and version number.",
      "Each OAM file contains shapes, images, and other content, as well as a timeline for playing the animation the file contains. Users can create OAM files by publishing from an Edge Animate project (.AN file). Users can also export OAM files from Adobe Animate, Adobe Flash, and other animation applications.",
      "To create an OAM file in Edge Animate, follow these steps:",
      "Select File → Publish Settings....",
      "Check the box next to Animate Deployment Package and choose your output options and location.",
      "Select File → Publish and then navigate to the folder you chose in the Publish Settings dialog to retrieve your OAM file.",
      "NOTE: As of November 2015, Edge Animate is no longer being actively developed."
    ]
  },
  "more_information": {
    "description": [
      "A .oam file a an animated widget file exported from Adobe Edge Animate Widget. Animations exported as OAM widget file format can be inserted into other Adobe applications such as InDesign Documents (INDD file, Dreamweaver, and Muse. OAM files are like deployment packages that can be readily inserted into other Adobe’s projects to make use of them. OAM files contain information about the animation’s assets, behaviors, and actionscript code. You can create an OAM file by publishing an Adobe Animate project .AN file. Users can create OAM files by publishing from an Edge Animate project (.AN file).",
      "An OAM file is an animated widget saved in the Adobe Edge Animate Widget file format. It was likely created by Adobe Edge Animate, a program that uses HTML5, CSS, and JavaScript technologies to create animated web content. OAM files are used to insert widgets into InDesign documents (.INDD), Dreamweaver website projects, and other content created with Adobe Creative Suite applications. They may also be referred to as Adobe Edge Animate Deployment Packages."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can use the following applications to open OAM files.\n\nAdobe Edge Animate CC (Discontinued)Adobe Animate 2023Adobe InDesign 2023Adobe Dreamweaver 2021",
      "You can add OAM files as animated widgets in Adobe InDesign, Dreamweaver, and other Adobe applications (Windows, Mac). For example, to insert an OAM file into a Dreamweaver project, select Window → Insert from the program's menu bar. Then, in the Insert window, select Animated Composition. Finally, navigate to and open your OAM file."
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/web/oam/index.html",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-01T22:32:42.280Z"
    },
    {
      "url": "https://fileinfo.com/extension/oam",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.280Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.280Z",
  "containers": []
}