{
  "slug": "objection",
  "extension": "objection",
  "name": "Objection.lol Project",
  "summary": "Learn about .OBJECTION files and view a list of programs that open them.",
  "developer": "HappySylveon",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13299&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Ace Attorney is a popular visual novel series in which, primarily, players take on the role of defense attorney Phoenix Wright. In these games, players question witnesses and attempt to secure their clients' freedom. Periodically, players can make objections, which are not actual procedural objections, but instead dramatic statements about a flaw in a witness's testimony.",
      "Objection.lol Objection Maker is an online tool that allows users to make their own Ace Attorney objection videos. These videos can star nearly any Ace Attorney character, who typically states their objection across one or more frames. Users can also edit each frame's text speed, background music, included Ace Attorney speech bubble, and other settings.",
      "If a user wants to save a local copy of their Objection Maker project, they can select Project → Save. Doing so will save the user's project as an OBJECTION file, which they can re-open in Objection Maker at a later time if they so desire."
    ]
  },
  "more_information": {
    "description": [
      "An OBJECTION file is a project file created by objection.lol Objection Maker, a tool that allows users to create custom Ace Attorney objection videos. It contains a record of the frames a user's video project contains, including each frame's character, pose, text, and other information. Users can play back the video an OBJECTION file describes in Objection Maker."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an OBJECTION file with objection.lol Objection Maker (Web). To do so, select Project → Load. Then, navigate to and open your OBJECTION file.",
      "After opening your OBJECTION file, you can preview the video it describes by clicking the PREVIEW button."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "Users who have created an objection.lol account can export the video their OBJECTION file describes as an .MP4 (MPEG-4 Video) file."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/objection_13299.png",
      "alt": "Screenshot of a .objection file in objection.lol Objection Maker",
      "caption": "OBJECTION file open in objection.lol Objection Maker"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/objection",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.658Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.658Z",
  "category": "other",
  "related": [],
  "containers": []
}