{
  "slug": "obml",
  "extension": "obml",
  "name": "Opera Mini Saved Webpage",
  "summary": "Learn about .OBML files and view a list of programs that open them.",
  "developer": "Opera Software",
  "category": "web",
  "category_slug": "web",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=5508&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Opera Mini users can download webpages to view them without access to the Internet. In the past, when a user downloaded a webpage, Opera Mini saved the page as an OBML file. OBML files have since been replaced by .OBML15 and .OBML16 files. Versions 5 and higher of Opera Mini cannot open OBML files."
    ]
  },
  "more_information": {
    "description": [
      "An OBML (Opera Binary Markup Language) file is an offline version of a webpage saved by Opera Mini mobile web browser. It is a self-contained, compact version of the HTML files that contains all the elements of the page for display on specific devices while offline. The OBML file format has upgraded to several versions with OBML15 and OBML16 being used at large. An important point to keep in consideration is that each Opera Mini version is only compatible with one OBML format. Thus, upgrading of Opera Mini will leave previously saved pages readable. OBML files can be converted to HTML and PDF.",
      "An OBML file is a webpage saved by Opera Mini, a mobile web browser. It contains source code formatted in the Opera Binary Markup Language (OBML), a compact format that reduces a webpage's size. OBML files were used to view webpages in Opera Mini while offline."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Previously, you could open OBML files in Opera Mini and programs that emulated Opera Mini, such as OperaMiniLargeDevice (Windows) and MicroEmulator (Windows). However, current versions of most of these programs cannot open OBML files. If you still have access to an old (version 4 or below) version of Opera Mini or an old Opera Mini emulator, you may be able to use it to open your OBML file."
    ]
  },
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/web/obml/",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-02T02:43:26.527Z"
    },
    {
      "url": "https://fileinfo.com/extension/obml",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.527Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.527Z"
}