{
  "slug": "odex",
  "extension": "odex",
  "name": "Optimized Dalvik Executable",
  "summary": "Learn about .ODEX files and view a list of programs that open them.",
  "developer": "N/A",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=9919&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "ODEX files are optimized versions of DEX files, which contain the executable code for an Android app. While DEX files generically run on all Android devices, ODEX files are optimized for the specific device on which they reside. They not only help load speed but also decrease the amount of space required for the app.",
      "Android creates ODEX files for apps before they are run. These files contain the same filename prefix as their corresponding APK file (e.g., MyApp.apk and MyApp.odex). The data in ODEX files replaces data used in the equivalent DEX file (classes.dex) stored inside the APK file.",
      "NOTE: Dalvik is the name given to the virtual machine that runs the compiled code for Android apps. Therefore, an optimized DEX file, or ODEX file, is optimized for execution by the Dalvik virtual machine."
    ]
  },
  "more_information": {
    "description": [
      "An ODEX file is created by the Android operating system to increase the boot speed of an Android app (an .APK file). It is located alongside an APK file and contains optimized code that speeds up the app load process via the system's Dalvik process virtual machine. Beginning with version 5.0 \"Lollipop\" (2014), Android discontinued Dalvik and no longer uses ODEX files."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/odex",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.660Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.660Z",
  "category": "other",
  "related": [],
  "containers": []
}