{
  "slug": "odlsent",
  "extension": "odlsent",
  "name": "Sent OneDrive Event Log",
  "summary": "Learn about .ODLSENT files and view a list of programs that open them.",
  "developer": "Microsoft",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13022&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Microsoft OneDrive is a file hosting and sharing app that individuals and organizations use to store and share files. Primarily, users access OneDrive via a web browser. However, users can also install a desktop version of OneDrive, allowing them to access and edit their files offline. Offline changes a user makes in the desktop version of OneDrive are synced to their OneDrive account, and thus the web version of OneDrive, the next time they connect to the Internet.",
      "The desktop versions of OneDrive store a record of a user's actions in an ODL file. Microsoft can use these files to troubleshoot synchronization issues with a user's OneDrive account. After an ODL file has been sent to Microsoft, the file's extension is changed to .odlsent, to denote that Microsoft has received the log the file contains."
    ]
  },
  "more_information": {
    "description": [
      "An ODLSENT file is a OneDrive event log (.ODL file) that has been sent to Microsoft. It contains a list of events that occurred while a user was using OneDrive. Microsoft uses the information ODLSENT files contain to troubleshoot synchronization issues caused by editing files offline in the desktop version of OneDrive."
    ]
  },
  "how_to_open": {
    "instructions": [
      "While ODLSENT files are not meant to be opened, you can view their contents with GitHub user ydkhatri's OneDrive Log ODL Reader (multiplatform)."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/odlsent",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.966Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.966Z"
}