{
  "slug": "ofbr",
  "extension": "ofbr",
  "name": "Oxygen Forensics Important Data Backup",
  "summary": "Learn about .OFBR files and view a list of programs that open them.",
  "developer": "Oxygen Forensics",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12560&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Federal agencies, corporate investigators, and law enforcement typically use Oxygen Forensics software to collect digital evidence for legal cases and other investigatory purposes. Examples of data extracted from devices include phone messages, sensitive computer documents, and cloud service customer data.",
      "After you extract data from a device and import it into Detective, you can analyze and organize it with various reporting tools included in the software. Then, you can save the data as an OFBX or OFBR file to share the organized and analyzed data. Choose the OFBX file if you want to share a complete data collection, or choose the OFBR file if you only want to share data you have set as important."
    ]
  },
  "more_information": {
    "description": [
      "An OFBR file is a backup file created by Oxygen Forensics Detective, an application used to extract data from devices and analyze the information. It contains data extracted from a device, such as a laptop, mobile device, or cloud storage service, and imported into Detective. OFBR files are similar to .OFBX backup files but only store data designated as important by the user instead of the entire data."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an OFBR file with Oxygen Forensics Detective or Oxygen Forensics Viewer in Windows."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/ofbr",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.662Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.662Z",
  "category": "other",
  "related": [],
  "containers": []
}