{
  "slug": "ofbx",
  "extension": "ofbx",
  "name": "Oxygen Forensics Detective Backup",
  "summary": "Learn about .OFBX files and view a list of programs that open them.",
  "developer": "Oxygen Forensics",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12524&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Oxygen Forensics develops software that aids in the extraction and analysis of data, such as messages from phones, sensitive documents from computers, and customer data from cloud services. Federal agencies, corporate investigators, and law enforcement primarily use Oxygen Forensics software to collect digital evidence for legal cases and other investigatory purposes.",
      "After importing extracted data into Detective, you can analyze and organize it with various reporting tools included in the software. Then, you can save the data as an OFBX file to share with other Detective users. Or, you can send it to non-Detective users with the free and portable Oxygen Forensics Viewer utility."
    ]
  },
  "more_information": {
    "description": [
      "An OFBX file is a backup file created by Oxygen Forensics Detective, an application used to extract and analyze information extracted from various digital sources. It contains data extracted from a computer, mobile device, cloud service, drone, or Internet of Things (IoT) device that has been imported into Detective and organized for analysis purposes."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an OFBX file with Oxygen Forensics Detective or Oxygen Forensics Viewer in Windows."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/ofbx",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.662Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.662Z",
  "category": "other",
  "related": [],
  "containers": []
}