{
  "slug": "oggu",
  "extension": "oggu",
  "name": "Origin Unicode Graph File",
  "summary": "Learn about .OGGU files and view a list of programs that open them.",
  "developer": "OriginLab",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10837&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "OGGU files replaced .OGG files, which were used to save workbooks in Origin before the 2018 version. OGGU files are saved in a unicode format which features performance advantages over the older OGG file format.",
      "You can open OGGU files with Origin and Origin Viewer. Origin is only available for Windows and is the primary program used to create, open, and edit OGGU files. When open in Origin, the graph appears as a window in an open project (.OPJU or .OPJ file). Origin Viewer is also commonly used since it is a free alternative to Origin and can be used in Windows and macOS.",
      "To open an OGGU file in Origin, select File → Open..., select the \"Origin Window .oggu\" file type, navigate to the OGGU file location, and click Open.",
      "You can save Origin graphs as templates in order to preserve settings to be used with other graphs you create. To do this, select File → Save Template As... and Origin will create an .OTPU file to store the template."
    ]
  },
  "more_information": {
    "description": [
      "An OGGU file contains a graph created by Origin 2018 and later, a data analysis and graphing application used by scientists and engineers in different fields around the world. It stores a graph generated from imported data, such as a column, bar, pie, line, symbol, waterfall, 3D, polar, or statistical graph. OGG files also store metadata about the graph, such as the title and colors."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/oggu",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.968Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.968Z"
}