{
  "slug": "ogmu",
  "extension": "ogmu",
  "name": "Origin Unicode Matrix File",
  "summary": "Learn about .OGMU files and view a list of programs that open them.",
  "developer": "OriginLab",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10841&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "OGMU files replaced .OGM files, which were used to save workbooks in Origin before the 2018 version. OGMU files are saved in a unicode format which features performance advantages over the older OGM file format.",
      "You can open OGMU files with Origin and Origin Viewer. Origin is only available for Windows and is the primary program used to create, open, and edit OGMU files. When open in Origin, the matrix appears as a window in an open project (.OPJ or .OPJU file). Origin Viewer is also used to view OGMU files and features benefits over Origin, as it is free and can be used in Windows and macOS.",
      "To open an OGMU file in Origin, select File → Open..., select the \"Origin Window .ogmu\" file type, navigate to the OGMU file location, and click Open.",
      "You can save Origin matrices as templates in order to preserve settings to be used with other matrices you create. To do this, select File → Save Template As... and Origin will create an .OTMU file to store the template."
    ]
  },
  "more_information": {
    "description": [
      "An OGMU file contains a matrix book created by Origin 2018 and later, a scientific and engineering data analysis and graphing application. It stores one or more matrix sheets, which include columns and rows of numbers, special characters, or spaces. OGMU files also store other information about the matrix, such as the names of the sheets, math functions, matrix dimensions, style and formatting, and data type."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/ogmu",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.968Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.968Z"
}