{
  "slug": "ogw",
  "extension": "ogw",
  "name": "Origin Workbook File",
  "summary": "Learn about .OGW files and view a list of programs that open them.",
  "developer": "OriginLab",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10832&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "You can open OGW files with Origin and Origin Viewer. Origin is only available for Windows and is the primary program used to create, open, and edit OGW files. Origin Viewer is also commonly used since it is a free alternative to Origin and can be used in Windows and macOS.",
      "To open an OGW file in Origin, select File → Open..., select the \"Origin Window .ogw\" file type, navigate to the OGW file location, and click Open.",
      "You can save Origin Workbooks as templates without data in order to preserve a layout to be used with other workbooks. To do this, select File → Save Template As... and Origin will create an OTW file to store the template. You can also save the workbook as a template with analysis, by selecting File → Save Workbook As Analysis Template..., which will be stored in an OGW file.",
      "NOTE: The release of Origin 2018 included an updated unicode format for saving workbooks (.OGWU), which features performance advantages over the older, non-unicode OGW file format."
    ]
  },
  "more_information": {
    "description": [
      "An OGW file is a workbook file created by Origin, a data analysis and graphing application used by various scientists and engineers. It contains one or more worksheets, which consist of data organized into columns and rows, and added notations. OGW files also store information about the workbook theme, column designation, and spreadsheet cell notation."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/ogw",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.663Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.663Z",
  "category": "other",
  "related": [],
  "containers": []
}