{
  "slug": "olk15msgsource",
  "extension": "olk15msgsource",
  "name": "Outlook 15 Message",
  "summary": "Learn about .OLK15MSGSOURCE files and view a list of programs that open them.",
  "developer": "Microsoft",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12947&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Microsoft Outlook 15 is a Mac version of the popular Microsoft Outlook email and calendar program. Microsoft released Outlook 15 in 2014. The program is sometimes also referred to as Microsoft Outlook 2016 for Mac.",
      "Outlook 15 saves local copies of users' email messages in a series of OLK15 files. For example, an email that includes body content and an attachment would have its data saved in three separate files, an .OLK15MESSAGE file, an OLK15MSGSOURCE file, and an .OLK15MSGATTACH file. Outlook 15 uses these files to load messages more quickly as a user browses their email.",
      "The OLK15MSGSOURCE file includes most of the information associated with the email, including the email's recipient, sender, subject, and body content. Outlook 15 saves OLK15MSGSOURCE files in the following directory:",
      "~/​Library/​Group Containers/​UBF8T346G9.Office/​Outlook/​Outlook 15 Profiles/​Main Profile/​Data/​Message Sources"
    ]
  },
  "more_information": {
    "description": [
      "An OLK15MSGSOURCE file is an email data file created by Microsoft Outlook 15 for Mac. It contains an email's body content. Outlook for Mac uses OLK15MSGSOURCE files to load email content more quickly."
    ]
  },
  "how_to_open": {
    "instructions": [
      "OLK15MSGSOURCE files are not meant to be directly opened by users. However, you can use Gladwev OLK14 Message Recovery Tool (Mac) to recover the message data your OLK15MSGSOURCE files (and other OLK15 files) contain."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/olk15msgsource",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.970Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.971Z"
}