{
  "slug": "oms",
  "extension": "oms",
  "name": "HP Printer Substrate Presets Package File",
  "summary": "Learn about .OMS files and view a list of programs that open them.",
  "developer": "HP",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10520&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "If you do not have a web-connected computer, you can download OMS files from the HP Media Solutions Locator webpage. Here you can choose from a variety of OMS files for your printer model and substrate brand and type. Once you download the OMS file you can import the file into your printer. To do this, your computer and printer must be connected to the same LAN.",
      "Find the IP address of your printer by pressing the \"Networking\" icon on the front panel.",
      "Type the printer's IP address into your browser's URL and press Enter.",
      "The printer's embedded web server should be shown in the browser window. Click the \"Setup\" tab.",
      "Select \"Substrate presets management\" and click the \"Import\" tab.",
      "Select Browse..., navigate to your OMS file, click Open, then click Update.",
      "If you have a web-connected printer you can search, download, and install OMS files directly through the printer's touchscreen.",
      "NOTE: Since OMS files are downloaded from the Internet you may come across the file in your downloads folder."
    ]
  },
  "more_information": {
    "description": [
      "An OMS file is a substrate presets package used by HP printers, such as Latex and Scitex series printers. It contains an ICC profile and printing presets, such as color calibration targets, total ink volume, drying time, and gloss enhancer volume. OMS files are used to share presets that configure the process of printing onto different materials, such as paper, textiles, parchment, and plastic."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/oms",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.972Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.972Z"
}