{
  "slug": "one",
  "extension": "one",
  "name": "OneNote Document",
  "summary": "Learn about .ONE files and view a list of programs that open them.",
  "developer": "Microsoft",
  "programs": {
    "windows": [
      {
        "name": "Microsoft OneNote",
        "url": "https://file.org/free-download/microsoft-onenote"
      },
      {
        "name": "Microsoft Office",
        "url": "https://file.org/free-download/microsoft-office"
      },
      {
        "name": "Adobe Acrobat",
        "url": "https://file.org/free-download/adobe-acrobat"
      },
      {
        "name": "V-Tools",
        "url": "https://file.org/free-download/v-tools"
      },
      {
        "name": "CLS",
        "url": "https://file.org/free-download/cls"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=2945&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Microsoft OneNote is a cross-platform note-taking application that is bundled with Windows and also available as a web, macOS, Android, and iOS app. It allows users to create digital notebooks, which are used to take and share notes with other OneNote users. OneNote is often used in corporate settings, to give multiple stakeholders access to the notes recorded during meetings.",
      "When a user creates a new OneNote notebook, that notebook is automatically saved as a ONE file. The file is automatically re-saved as the user (or any other user who can access the notebook) types notes or makes any other edits in the notebook. In addition to being able to type notes, users can insert images, drawings, shapes, tables, and links into the pages of a OneNote notebook.",
      "In the past, OneNote stored ONE files on users' PCs or another local drive. Now, all ONE files are stored in Microsoft OneDrive, which is Microsoft's cloud storage platform. This ensures a user's ONE files are synchronized across all their devices, but also prevents users from being able to export ONE files from OneNote or OneDrive. As a result, users will likely no longer encounter ONE files outside OneNote or OneDrive, unless they stumble upon a ONE file created using a previous version of OneNote."
    ]
  },
  "more_information": {
    "description": [
      "A ONE file is a notebook created by Microsoft OneNote, a note-taking program. It contains one or more pages of notes, which are organized into sections. ONE files may contain text, digitized handwriting, and objects pasted from other applications, such as images, drawings, and audio or video clips."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open ONE files in Microsoft OneNote. To open a ONE file in OneNote for Windows 10 and later versions, you must import the file into your Microsoft OneDrive. To view instructions for how to import a ONE file into OneDrive, click the Microsoft OneNote Notebook Importer link found below.",
      "Mac, iPad, and iPhone users can also open their ONE files in Gorillized Outline, a note-taking application designed for macOS and iOS.",
      "As of April 2020, there is no good way to export OneNote notebooks or the notes they contain out of Microsoft OneNote for Windows 10 and later versions. The best method to move notes out of OneNote is to either manually copy and paste the notes into a word processor document, such as a .DOCX or .PAGES file, or to print each page your notebook includes as a .PDF.",
      "To print a OneNote notebook page as a PDF:",
      "Open your OneNote notebook and select the page you want to print as a PDF.",
      "In the web version of OneNote, select File → Print → Print and set the print destination to Save as PDF. In the Windows version of OneNote, select the hamburger menu (...), select Print, and set the print destination to Microsoft Print to PDF.",
      "MacOS and iOS users can use Gorillized Outline to export OneNote notebooks as ONE files or PDF files. They can store the exported notebooks locally (or in another cloud storage service) and share them with others."
    ]
  },
  "images": [
    {
      "url": "https://assets.file.org/images/fileorg-logo-440x90-4-8b.png",
      "alt": "File.org logo"
    },
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/one_2945-2.png",
      "alt": "Screenshot of a .one file in Microsoft OneNote for Windows 10",
      "caption": "ONE file open in Microsoft OneNote for Windows 10"
    }
  ],
  "sources": [
    {
      "url": "https://file.org",
      "source": "file.org",
      "retrieved_at": "2025-11-02T02:43:26.428Z"
    },
    {
      "url": "https://fileinfo.com/extension/one",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.428Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.428Z"
}