{
  "slug": "onepkg",
  "extension": "onepkg",
  "name": "Microsoft OneNote Package",
  "summary": "Learn about .ONEPKG files and view a list of programs that open them.",
  "developer": "Microsoft",
  "programs": {
    "windows": [
      {
        "name": "Microsoft OneNote",
        "url": "https://file.org/free-download/microsoft-onenote"
      },
      {
        "name": "Microsoft Office",
        "url": "https://file.org/free-download/microsoft-office"
      },
      {
        "name": "V-Tools",
        "url": "https://file.org/free-download/v-tools"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=4019&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Microsoft OneNote 2016 and earlier versions allowed users to back up multiple OneNote notebooks in a single ONEPKG file. This allowed users to share or back up multiple notebooks as a single file, rather than many separate files.",
      "However, the Microsoft 365 version of OneNote does not allow users to create ONEPKG files, and it does not allow users to import existing ONEPKG files. If you want to import the notebooks a ONEPKG file contains into the Microsoft 365 version of OneNote, you must first extract those notebooks from the ONEPKG file."
    ]
  },
  "more_information": {
    "description": [
      "A ONEPKG file is a Microsoft OneNote archive, which contains multiple OneNote documents (.ONE files). OneNote users create ONEPKG files to move or back up multiple notebooks more efficiently. ONEPKG files are renamed .ZIP files, so you can extract their contents with any Zip-decompression utility. (You may first have to rename the file to use the .zip extension.)"
    ]
  },
  "how_to_open": {
    "instructions": [
      "If you are using the Microsoft 365 version of OneNote, you must extract all the ONE files your ONEPKG file contains and then manually import them into OneNote, using Microsoft's OneNote Notebook Importer. To extract the ONE files your ONEPKG file contains:",
      "Rename the file to use the .zip extension (instead of .onepkg).",
      "Open it as you would any ZIP file (via 7-Zip, Apple Archive Utility, or another Zip-decompression utility).",
      "If you have Microsoft OneNote 2016 or an earlier version installed on your computer, you can import the notebooks a ONEPKG file contains by double-clicking the file. After you double-click the file, OneNote will ask where you want to save the imported notebooks.",
      "You can also open ONEPKG files with Gorillized Outline, a note-taking application available for macOS and iOS."
    ]
  },
  "images": [
    {
      "url": "https://assets.file.org/images/fileorg-logo-440x90-4-8b.png",
      "alt": "File.org logo"
    },
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://file.org",
      "source": "file.org",
      "retrieved_at": "2025-11-02T02:43:26.429Z"
    },
    {
      "url": "https://fileinfo.com/extension/onepkg",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.429Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.429Z"
}