{
  "slug": "orrs",
  "extension": "orrs",
  "name": "Deliveries Package Tracker Backup",
  "summary": "Learn about .ORRS files and view a list of programs that open them.",
  "developer": "oRRs",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13132&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Deliveries Package Tracker allows you to input tracking codes or link your delivery service account information (such as your eBay, UPS, or Amazon account) to track in-transit packages. It stores package, delivery, and account information in databases. Optionally, you can choose to back up these databases at any time, by selecting Backup & restore.",
      "Backing up your Deliveries Package Tracker data creates one or more ORRS files that are stored in a ZIP archive. You can use these files to restore your Deliveries Package Tracker data or transfer it across devices."
    ]
  },
  "more_information": {
    "description": [
      "An ORRS file is a backup file created by oRRs Deliveries Package Tracker, an Android app that lets users track to-be-delivered packages. It contains an encrypted record of a user's in-progress deliveries and linked delivery service account information. Deliveries Package Tracker stores ORRS files in .ZIP archives, created when a user backs up their data."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can import an ORRS file into oRRs Deliveries Package Tracker (Android) to restore the information it contains. To do so, use the Backup & restore option. Note that if your ORRS file was created by a different version of Deliveries Package Tracker, you may not be able to import it, as different versions of Deliveries Package Tracker use different database versions."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/orrs",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.671Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.671Z",
  "category": "other",
  "related": [],
  "containers": []
}