{
  "slug": "ost",
  "extension": "ost",
  "name": "Outlook Offline Data File",
  "summary": "Learn about .OST files and view a list of programs that open them.",
  "developer": "Microsoft",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=2345&b=1"
      },
      {
        "name": "Microsoft Outlook 365",
        "url": "https://fileinfo.com/software/microsoft/outlook"
      }
    ]
  },
  "technical_info": {
    "content": [
      "OST files are stored on the local computer of a user, which allows the user to access his emails and other mailbox information when he does not have Internet access. The user can look up and create appointments, search or add contacts, and read and write emails when offline. However, any changes made offline will not be synchronized with the user account on the server until an Internet connection is re-established.",
      "An OST file is created when the \"Use Offline Folders\" option is selected in Outlook. The file will be located in the following directory:",
      "\\​Users\\​user\\​AppData\\​Local\\​Microsoft\\​Outlook",
      "You can also navigate to the location of the OST file by selecting File → Account Settings, clicking Account Settings..., selecting the Data Files tab, clicking an entry, and then selecting Open Folder Location.",
      "NOTE: The OST file is similar to a Personal Folder (.PST) file but is only used for storing offline data."
    ]
  },
  "more_information": {
    "description": [
      "An OST file is a data file created by Microsoft Outlook (2005 or later), an email client and personal information manager. It is used to store a copy of mailbox information from an Office 365, Exchange, or Outlook.com account. OST files may contain email messages, contacts, tasks, calendar data, and other account information."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/ost",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.977Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.977Z"
}