{
  "slug": "pdn",
  "extension": "pdn",
  "name": "paint.net Image",
  "summary": "Learn about .PDN files and view a list of programs that open them.",
  "developer": "Rick Brewster",
  "category": "image",
  "category_slug": "image",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=3476&b=1"
      },
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Microsoft Visual Studio Code",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Paint.net is an image and photo editor that allows Windows users to add effects, adjustments, layers, text, and shapes to their images. If a user wants to retain a record of the edits and additions they've made to an image, they can save the image as a PDN file (by selecting File → Save As... and selecting PDN in the Save as type: field).",
      "Saving an image as a PDN file allows users to continue editing that image's layers and effects as needed. In contrast, saving an image to any of the other file formats paint.net supports will flatten it, compressing all the image's layers into one."
    ]
  },
  "more_information": {
    "description": [
      "The PDN file format is the native format used by Paint.NET, which is a popular free image and photo editing software. The format is specifically designed to store images created or edited in Paint.NET application. The format preserves all layers, settings and effects that occur during editing the image so that user can continue to edit the images without worrying to lose original information relating to source image.\n\nPDN file format is more advanced than other formats like JPEG or PNG because of its ability to support multiple layers. Because of this feature, user can edit individual elements of an image without disturbing the whole composition of image. It also has support for transparency which enable users to create complex designs and graphics that require transparency. Since, PDN retains all editing information of image, user can revise their projects at any time and make changes without compromising quality because of this reason PDN files are larger than other image formats due to extra data inside them that keep the information of layers and effects.\n\nIf you are working on project that is not yet complete, saving in PDN format enables you to return and make further edits easily. Once, you are satisfied with your work, you can export it to other formats like PNG, JPEG or BMP for sharing, printing or online use.",
      "Paint.NET is a free image and photo editing software for Windows. It was originally developed as a student project at Washington State University as an alternative to Microsoft Paint. From that time, it is evolving into a powerful tool having features comparable to professional editors. It supports layers, special effects and other wide range of tools for editing. It is suitable for both beginners and advanced users. It has user friendly and intuitive interface and has active community that provides plugins to expand its functionality.",
      "A PDN file is a bitmap image created by paint.net, a free image-editing program for Windows. It contains an image as well as a record of the layers, effects, text, and other items applied to that image. PDN files are similar to Adobe Photoshop Documents (.PSD files)."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To open a .pdn file, you’ll need to use Paint.NET, as it is the only software that can fully support this format.",
      "You can open a PDN file in paint.net (Windows). To do so, select File → Open... from the program's menu bar. Then, navigate to and open your PDN file."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "You can use paint.net's File → Save As... feature to convert PDN files to the following image formats:",
      ".PNG - Portable Network Graphic",
      ".JPEG - JPEG Image",
      ".BMP - Bitmap Image",
      ".TIFF - Tagged Image File Format",
      ".GIF - Graphical Interchange Format",
      ".TGA - Targa Graphic",
      ".DDS - DirectDraw Surface Image",
      ".JXR - JPEG XR Image",
      ".HEIC - High Efficiency Image Format",
      ".AVIF - AVIF Image",
      ".WEBP - WebP Image"
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/pdn_3476.png",
      "alt": "Screenshot of a .pdn file in paint.net",
      "caption": "PDN file open in paint.net"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/pdn_12197.png",
      "alt": "Screenshot of a .pdn file in Dragon Draughts 4.5",
      "caption": "PDN file open in Dragon Draughts 4.5"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/image/pdn/index.html",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-01T22:32:42.281Z"
    },
    {
      "url": "https://fileinfo.com/extension/pdn",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.281Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.281Z",
  "containers": []
}