{
  "slug": "pes",
  "extension": "pes",
  "name": "Brother PE Embroidery Format",
  "summary": "Learn about .PES files and view a list of programs that open them.",
  "developer": "Brother International Corporation",
  "programs": {
    "windows": [
      {
        "name": "Google Chrome",
        "url": "https://fileinfo.com/software/google/chrome"
      },
      {
        "name": "File Viewer Plus",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1096"
      },
      {
        "name": "Google Chrome with Embroidery Viewer and Converter plugin",
        "url": "https://fileinfo.com/software/google/chrome"
      }
    ]
  },
  "technical_info": {
    "content": [
      "The PES format is one of the most popular file formats in the embroidery community and is supported by a large number of embroidery applications. PES files may be created by various embroidery applications, which include PE-Design software included with Brother sewing machines, but may also be used with Babylock and Bernina home embroidery machines.",
      "Users may upload PES designs online and share them in web forums, on websites, and as email attachments. Other users can then download PES designs and open them with a program that supports viewing or editing the PES format.",
      "To transfer the design to a sewing machine, users can save their design to a portable USB storage device. Then, they can insert the storage device into the sewing machine to transfer the design to embroider it."
    ]
  },
  "more_information": {
    "description": [
      "A PES file is a computer-aided manufacturing (CAM) file that contains embroidery instructions for a sewing machine to stitch a pattern onto a piece of fabric. It stores codes such as \"stop,\" \"jump,\" and \"trim\" that make up instructions that direct the sewing machine. PES files also include information about the embroidery design, such as colors in the design from the supported Brother color palette and stitch density and length."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open PES files with various applications, which include BALARAD Embird Studio (Windows), PREMIER+ Embroidery (multiplatform), S & S Computing SewWhat! (Windows), and Buzz Tools BuzzXplore (Windows). You can open PES files with several Android apps, such as Touch Embroidery Free and Embroidery Viewer.",
      "You can also view and convert PES files to other formats with the Embroidery Viewer and Converter web application and plugin for the Google Chrome web browser."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/pes_1096.png",
      "alt": "Screenshot of a .pes file in Buzz Tools BuzzXplore 4",
      "caption": "PES file open in Buzz Tools BuzzXplore 4"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/pes_7191.png",
      "alt": "Screenshot of a .pes file in CodeAndWeb PhysicsEditor",
      "caption": "PES file open in CodeAndWeb PhysicsEditor"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/pes",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.686Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.686Z",
  "category": "other",
  "related": [],
  "containers": []
}