{
  "slug": "pfc",
  "extension": "pfc",
  "name": "AOL Personal Filing Cabinet",
  "summary": "Learn about .PFC files and view a list of programs that open them.",
  "developer": "AOL",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=75&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "AOL Desktop is a software application that AOL users can use to browse the Internet, send instant messages, and access their accounts. The program stores account-specific information, such as a user's favorites and sent and received emails, in a user-specific PFC file.",
      "PFC files are compressed binary files. You cannot simply open a PFC file to view your email messages or favorites outside of AOL Desktop. However, a variety of third-party programs and utilities allow you to extract various pieces of information from your PFC file, if necessary."
    ]
  },
  "more_information": {
    "description": [
      "A PFC file is a personal filing cabinet created by AOL Desktop Software, an application that lets America Online (AOL) users access their AOL accounts. It contains an address book, a record of bookmarks, stored email messages, away messages, and newsgroup postings. Each AOL Desktop user account has an associated PFC file."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can import the data a PFC file contains into AOL Desktop (Windows). To do so:",
      "Sign in to AOL Desktop.",
      "Click the Settings icon.",
      "From the General screen, select the My Data tab.",
      "Click PFC Import.",
      "Navigate to and import your PFC file.",
      "You can also use various third-party programs to extract data from a PFC file. For example, PFCEx (Windows) allows users to extract their bookmarks from their PFC file and save them in an .HTML file."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/pfc",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.686Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.686Z",
  "category": "other",
  "related": [],
  "containers": []
}