{
  "slug": "pft",
  "extension": "pft",
  "name": "ChiWriter Printer Font",
  "summary": "Learn about .PFT files and view a list of programs that open them.",
  "developer": "Horstmann Software Design",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12293&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Cay Horstmann created and released ChiWriter in 1986. The program was one of the first WYSIWYG editors that could write mathematical formulas. ChiWriter also gave users the ability to add superscripts and subscripts to their text.",
      "ChiWriter allowed users to write text and formulas using several different fonts. The printed versions of these fonts were saved as PFT files, while the displayed versions of these fonts were saved as .SFT files."
    ]
  },
  "more_information": {
    "description": [
      "A PFT file is a printer font used by Horstmann Software Design ChiWriter, a discontinued scientific document editor for MS-DOS. It contains data used to print a ChiWriter document (or a portion of a document) written in a certain font. PFT files can be opened and edited in ChiWriter's font editor."
    ]
  },
  "how_to_open": {
    "instructions": [
      "If you still have access to ChiWriter (MS-DOS), you can open and edit your PFT file in the program's font editor. If you do not have access to ChiWriter, you may be able to use the Linux program Dosbox to run the version of ChiWriter linked below."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/pft",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.995Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.995Z"
}