{
  "slug": "pfx",
  "extension": "pfx",
  "name": "PKCS #12 Certificate File",
  "summary": "Learn about .PFX files and view a list of programs that open them.",
  "developer": "RSA Laboratories",
  "programs": {
    "windows": [
      {
        "name": "KeyStore Explorer",
        "url": "https://file.org/free-download/keystore-explorer"
      },
      {
        "name": "PowerVR SDK",
        "url": "https://file.org/free-download/powervr-sdk"
      },
      {
        "name": "Preset Manager",
        "url": "https://file.org/free-download/preset-manager-by"
      },
      {
        "name": "Mixman Spin Control",
        "url": "https://file.org/free-download/mixman-spin-control"
      },
      {
        "name": "Kleopatra Certificate Manager",
        "url": "https://file.org/free-download/kleopatra"
      },
      {
        "name": "Adobe Acrobat",
        "url": "https://fileinfo.com/software/adobe/acrobat"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=2257&b=1"
      },
      {
        "name": "OpenSSL",
        "url": "https://fileinfo.com/software/openssl/openssl"
      },
      {
        "name": "Adobe Acrobat DC",
        "url": "https://fileinfo.com/software/adobe/acrobat"
      }
    ]
  },
  "technical_info": {
    "content": [
      "RSA Laboratories developed and maintains the PKCS #12 format, which is the \"Personal Information Exchange Syntax Standard\" in the family of Public Key Cryptography Standards (PKCS). The digital certificates saved in the PKCS #12 format verify the authenticity of a computer, web server, application, etc., so users can trust their security and reliability. Frequently, web administrators purchase X.509 digital certificates from a certificate authority (CA), such as DigiCert or IdenTrust, then install them on a web server to validate the security and identity of the website it hosts.",
      "CAs often send certificates in the PKCS #12 format (PFX files) to the requesting parties. For example, a CA may send a software publisher certificate (SPC) in an encrypted PFX file to a software publisher who enters the password to retrieve the digital certificate and keys to digitally sign their software for authentication purposes before distributing it.",
      "You can also generate PFX files with programs to authenticate applications, devices, and people. For example, a person may generate a PFX file with Adobe Acrobat to store their digital certificate to authenticate themselves to complete highly sensitive business transactions. Other programs that generate PFX files include the cross-platform OpenSSL command-line tool and the Microsoft Management Console in Windows.",
      "NOTE: You may also see security certificates and keys in the PKCS #12 format saved as .P12 files."
    ]
  },
  "more_information": {
    "description": [
      "A PFX file is an encrypted security format that typically stores one or more password-protected digital certificates and private keys for authenticating a person, application, or device (including computers and web servers). PFX files were initially saved in the Personal Information Exchange (PFX) format Microsoft released in 1996 but are now saved in the PKCS #12 format, which succeeded and extended PFX (people often use the format names interchangeably). Users typically send PFX files to transfer private and public keys and other sensitive information; various security and encryption programs support PFX files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a PFX file with the Microsoft Certificate Manager (Certmgr.exe) or Management Console utilities in Windows. For example, you can view the contents of a PFX file with Microsoft Management Console by right-clicking the file and selecting Install PFX.",
      "You can also open PFX files with the OpenSSL utility. To do so, type the following command:",
      "openssl pkcs12 -info -in <filename.pfx>",
      "Adobe Acrobat also allows you to add digital IDs stored in PFX file. To do so:",
      "Select the three-line hamburger menu in Windows or Acrobat in macOS, and then choose Preferences.",
      "Click Signatures from the \"Categories\" list, and choose More for Identities & Trusted Certificates.",
      "Select Digital IDs, and then click the Add ID option.",
      "Click A file under My existing digital ID from: and select Next.",
      "Choose the PFX file you want to add."
    ]
  },
  "images": [
    {
      "url": "https://assets.file.org/images/fileorg-logo-440x90-4-8b.png",
      "alt": "File.org logo"
    },
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://file.org",
      "source": "file.org",
      "retrieved_at": "2025-11-02T02:43:26.434Z"
    },
    {
      "url": "https://fileinfo.com/extension/pfx",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.434Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.434Z"
}