{
  "slug": "plist",
  "extension": "plist",
  "name": "Property List",
  "summary": "Learn about .PLIST files and view a list of programs that open them.",
  "developer": "Apple",
  "programs": {
    "windows": [
      {
        "name": "Apple Xcode",
        "url": "https://fileinfo.com/software/apple/xcode"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=699&b=1"
      },
      {
        "name": "Microsoft Visual Studio Code",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      },
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Notepad++",
        "url": "https://fileinfo.com/software/notepad_plus_plus/notepad_plus_plus"
      }
    ]
  },
  "technical_info": {
    "content": [
      "While developing a macOS or iOS application, developers create PLIST files that define several key pieces of the app's configuration information and metadata. Typically, these PLIST files are XML files, which store a list of Keys (setting names) and Values (settings).",
      "As a developer finalizes their application for delivery to end users, they often convert some or all of their PLIST files to a binary format. For example, developers often convert PLIST files that track a user's preferences to binary. Thus, PLIST files packaged with or installed by an app may be plain text files or binary files.",
      "NOTE: Some Apple applications for Windows, such as iTunes and Safari, also use PLIST files. Additionally, in some rare cases, PLIST files may use JSON formatting."
    ]
  },
  "more_information": {
    "description": [
      "A PLIST file is a properties list used by a macOS or iOS application. It defines many of the app's default settings and can store user settings. Most commonly, PLIST files are saved as binary files or XML files. In either case, PLIST files are typically not meant to be opened or edited by users."
    ]
  },
  "how_to_open": {
    "instructions": [
      "In most cases, you should not open or edit a PLIST file. Doing so may cause the app that uses that PLIST file to function incorrectly.",
      "However, if you want to open a PLIST file, to view or edit the settings it contains, you can do so with Apple's Property List Editor (bundled with Apple Xcode). The program can open both plain text and binary PLIST files."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "In macOS, you can use the plutil command to convert PLIST files between the XML and binary PLIST formats:",
      "Binary to XML: plutil -convert xml1 file.plist",
      "XML to Binary: plutil -convert binary1 file.plist",
      "In Linux, you can use the Withgraphite Plutil utility to convert PLIST files between the XML and binary PLIST formats."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/plist_699.jpg",
      "alt": "Screenshot of a .plist file in Apple Xcode",
      "caption": "PLIST file open in Apple Xcode"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/plist",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.004Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.004Z"
}