{
  "slug": "pma",
  "extension": "pma",
  "name": "Windows NT Performance Monitor Analytics",
  "summary": "Learn about .PMA files and view a list of programs that open them.",
  "developer": "Microsoft",
  "programs": {
    "windows": [
      {
        "name": "Google Chrome",
        "url": "https://fileinfo.com/software/google/chrome"
      },
      {
        "name": "Microsoft Edge",
        "url": "https://fileinfo.com/software/microsoft/edge"
      },
      {
        "name": "Microsoft Visual Studio Code",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12195&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Windows Performance Monitor is a Microsoft Management Console component that allows system administrators to monitor and report on system performance. Application developers can use Performance Monitor's performance tracking framework to automatically gather usage and crash report data for an application, provided you allow the app to track and record your usage data.",
      "For example, when you install Google Chrome on Windows, you are presented with the option to Automatically send usage statistics and crash reports to Google. If you enable this feature, Chrome will periodically create PMA files and send the data they contain to Google.",
      "While Chromium-based web browsers, like Chrome, are the most popular applications that create PMA files, other applications also create them. For example, Microsoft Visual Studio Code creates PMA files that log crash report data. PMA files are often located in an app's AppData/​Local/​DeveloperName/​AppName/​User Data or C:/​Program Files (x86)/​DeveloperName/​AppName/​Application/​SetupMetrics directories, or the shared AppData/​Local/​Temp directory."
    ]
  },
  "more_information": {
    "description": [
      "A PMA file contains performance data collected by Windows Performance Monitor, a Windows system monitoring program. PMA files are created for use by applications that send usage statistics and crash reports to their developers. Most often, PMA files contain usage and crash report data for Google Chrome, Microsoft Edge, or another Chromium-based web browser."
    ]
  },
  "how_to_open": {
    "instructions": [
      "PMA files are not meant to be opened. There is no known program that allows users to view the data their PMA files contain."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/pma",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.006Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.006Z"
}