{
  "slug": "poop",
  "extension": "poop",
  "name": "POOP Ransomware Encrypted File",
  "summary": "Learn about .POOP files and view a list of programs that open them.",
  "developer": "N/A",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12632&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "In June 2019, users began reporting the existence of POOP ransomware. This ransomware encrypts a user's files and appends them with the .poop extension. It then changes the user's desktop background to the image of a pile of poop, produces a ransom note named READ_IT.txt, and pops up a window containing ransom demands and instructions. (FileInfo recommends you never pay a ransom to decrypt your files.)",
      "Ransomware is most commonly distributed within programs that appear to be legitimate but are actually adware and malware bundles. If you recently downloaded and installed an unverified program, that may be how your computer became infected by POOP ransomware."
    ]
  },
  "more_information": {
    "description": [
      "A file with the .poop extension has been renamed and encrypted by POOP ransomware. The .poop extension is added to the file's original extension, producing an extension like .docx.poop. There is currently no way to decrypt and open POOP-encrypted files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Because POOP files are encrypted, you cannot open them. The best option to restore your files to their original state is likely to perform a System Restore. Note that performing a System Restore will cause you to lose any data created in the interval between now and your last restore point. Therefore, you may want to back up any data and files created since your last restore point."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/poop",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.010Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.010Z"
}