{
  "slug": "ppkg",
  "extension": "ppkg",
  "name": "Windows Provisioning Package",
  "summary": "Learn about .PPKG files and view a list of programs that open them.",
  "developer": "Microsoft",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12809&b=1"
      },
      {
        "name": "Microsoft Windows",
        "url": "https://fileinfo.com/software/microsoft/windows"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Windows 10 and Windows 11 include the Windows Configuration Designer, a program that can be used to (among other things) create Windows provisioning packages. These packages contain configuration settings that can be applied to a Windows device during initial setup or from Windows Settings.",
      "For example, a provisioning package may contain settings used to:",
      "Assign a device name",
      "Connect the device to a Wi-Fi network",
      "Install applications",
      "Customize a user's Start menu",
      "Provisioning packages are saved as PPKG files. Typically, IT administrators create and distribute PPKG files. For example, your IT administrator may host a PPKG file online, which you can download and apply to your device, or they may provide you with a USB drive from which you can retrieve and apply the file."
    ]
  },
  "more_information": {
    "description": [
      "A PPKG file is a provisioning package created for use with Windows 10 or 11. It contains settings used to configure a Windows 10 or 11 device. IT administrators in small- to medium-sized organizations often use PPKG files to configure users' devices using standard, organization-level settings."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can apply the settings a PPKG file contains by either:",
      "Double-clicking the file",
      "Opening Windows Settings and selecting Accounts → Access work or school → Add or remove a provisioning package → Add a package, then adding your PPKG file",
      "Windows will then ask you to confirm you want to add the provisioning package your PPKG file contains. Note that you must have administrator-level privileges to use a PPKG file."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/ppkg",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.012Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.012Z"
}