{
  "slug": "procreate",
  "extension": "procreate",
  "name": "Procreate Artwork",
  "summary": "Learn about .PROCREATE files and view a list of programs that open them.",
  "developer": "Savage Interactive",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11491&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Savage Procreate is a digital painting application designed for use on the iPad Pro. It allows artists to draw and paint images using an Apple Pencil. Procreate Pocket is a streamlined version of Procreate available for iPhones.",
      "Both versions of Procreate save artists' illustrations as PROCREATE files. These files include a record of all the layers an artist has added to their illustration, allowing the artist to continue editing any of those layers in the future. Each PROCREATE file also includes an artwork's Canvas Information and other settings data.",
      "NOTE: PROCREATE files created by Procreate 5.3 and above cannot be opened in earlier versions of Procreate. To open these files, update to the latest version of Procreate."
    ]
  },
  "more_information": {
    "description": [
      "A PROCREATE file is an image created by Savage Procreate or Procreate Pocket, which are illustration apps for iOS. It contains a layer-based image, which may be comprised of multiple images, adjustments, masks, text, and animations. PROCREATE files are similar to .PSD files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open and edit a PROCREATE file with Savage Procreate and Procreate Pocket (iOS). Procreate is available for iPad, while Procreate Pocket is available for iPhone.",
      "You can also open a PROCREATE file with Prospect, a Procreate viewer app for Mac. Prospect allows you to view and convert the image a PROCREATE file contains."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "You can use Savage Procreate (iOS) to convert PROCREATE files to the following formats:",
      ".PSD - Photoshop Document",
      ".PDF - Portable Document Format",
      ".JPEG - JPEG Image",
      ".PNG - Portable Network Graphic",
      ".TIFF - Tagged Image File Format",
      "You can use Prospect (macOS) to convert PROCREATE files to the .PNG, .JPEG, .BMP, and .TIFF formats."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/procreate",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.703Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.703Z",
  "category": "other",
  "related": [],
  "containers": []
}