{
  "slug": "psv",
  "extension": "psv",
  "name": "Pipe System Viewer File",
  "summary": "Learn about .PSV files and view a list of programs that open them.",
  "developer": "Engineered Software",
  "category": "video",
  "category_slug": "video",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=7652&b=1"
      },
      {
        "name": "Microsoft Excel 365",
        "url": "https://fileinfo.com/software/microsoft/excel"
      },
      {
        "name": "Microsoft Access 365",
        "url": "https://fileinfo.com/software/microsoft/access"
      },
      {
        "name": "File Viewer for Android",
        "url": "https://fileinfo.com/software/android_file_viewer"
      }
    ]
  },
  "technical_info": {
    "content": [
      "PIPE-FLO Professional is a fluid system modeling and calculation program that fluid engineers use to design and test prototype piping systems. In the early 2000s, Engineered Software, the company that produces PIPE-FLO Professional, created the PSV file format and PIPE-FLO Viewer application to allow engineers to share project drafts with clients, vendors, and other engineers.",
      "Those who opened a PSV file in PIPE-FLO Viewer could see not just the piping system's design, but also the system's test results and other associated information. They could not, however, edit the piping system, as PSV files were read-only."
    ]
  },
  "more_information": {
    "description": [
      "A “Pluralsight Video File” (PSV) is a proprietary video file format used by the Pluralsight online learning platform. Pluralsight provides video-based courses and tutorials on various topics related to software development, IT, and creative skills.\n\nPSV files are specifically encoded and encrypted for use within the Pluralsight platform and are not intended for direct playback outside of the official Pluralsight application or website.\n\nTo access and watch Pluralsight courses, you generally need a valid Pluralsight subscription or access provided by your organization. You can use the official Pluralsight application or access the content through their website using a web browser.",
      "A PSV file is a computer-assisted design (CAD) file created by Engineered Software PIPE-FLO Professional, an application used to design liquid piping systems. It contains a read-only model of a piping system. PSV files could previously be opened in PIPE-FLO Viewer, but that application is now discontinued."
    ]
  },
  "how_to_open": {
    "instructions": [
      "PSV files were meant to be opened in PIPE-FLO Viewer, a free application that Engineered Software made available on their website. Unfortunately, PIPE-FLO Viewer is now discontinued."
    ]
  },
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/video/psv/",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-02T02:43:26.531Z"
    },
    {
      "url": "https://fileinfo.com/extension/psv",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.531Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.531Z"
}