{
  "slug": "ptrz",
  "extension": "ptrz",
  "name": "PTRZ Ransomware Encrypted File",
  "summary": "Learn about .PTRZ files and view a list of programs that open them.",
  "developer": "N/A",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13531&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "In October 2023, some PC users began reporting their computers had been attacked by PTRZ ransomware. PTRZ ransomware is a variant of STOP Djvu ransomware, a popular type of ransomware distributed by cybercriminals.",
      "Like other variants of STOP Djvu, PTRZ ransomware encrypts many of a user's files, renames those files to use the .ptrz extension, and then creates a ransom note named _readme.txt. This ransom note contains instructions that users can supposedly follow to pay a ransom and decrypt their files.",
      "PTRZ ransomware is most commonly distributed within programs that appear to be legitimate but are actually adware and malware bundles. If you recently downloaded and installed an unverified program, that may be how your computer became infected by PTRZ ransomware."
    ]
  },
  "more_information": {
    "description": [
      "A file with the .ptrz extension has been maliciously encrypted and renamed by PTRZ ransomware. It contains a document, image, video, or other file that the ransomware is holding hostage. At this time, there is no way to restore PTRZ files to their original state."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Because PTRZ files are encrypted, you cannot open them. Currently, there is no way to decrypt PTRZ files.",
      "To recover your files, you should retrieve them from a recent backup or perform a System Restore. Note that performing a System Restore will cause you to lose any files created since your last restore point. You may want to back up uninfected files before performing a System Restore."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/ptrz",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.709Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.709Z",
  "category": "other",
  "related": [],
  "containers": []
}