{
  "slug": "purge",
  "extension": "purge",
  "name": "Globe Ransomware Encrypted File",
  "summary": "Learn about .PURGE files and view a list of programs that open them.",
  "developer": "N/A",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12464&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "In 2016, users began reporting the existence of Globe ransomware. Globe infects a user's computer, encrypts and renames the user's files, and then produces a ransom note named How to restore files.hta. It then automatically opens the ransom note. It also changes the user's desktop background to an image that contains characters from the movie Purge: Election Year.",
      "At this time, it is unknown exactly how Globe ransomware is distributed. However, ransomware is most often distributed via spam email attachments and programs that appear to be legitimate but are actually adware and malware bundles.",
      "FileInfo recommends you never pay a ransom to decrypt your files. Also, free decryption tools exist that may allow you to restore your PURGE files to their normal state.",
      "NOTE: Variants of Globe ransomware append users' files with the .globe or .xtbl extension, instead of .purge."
    ]
  },
  "more_information": {
    "description": [
      "A file with the .purge extension has been encrypted and renamed by Globe ransomware. It could be an encrypted image, video, document, database, or other type of file. Because the file is encrypted, you cannot open it. The .purge extension is added to the file's normal extension, producing an extension like .jpg.purge."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can decrypt PURGE files using Emsisoft Decryptor for Globe (Windows). This tool requires that you have at least one pair of encrypted and decrypted files. (For example, the file document.docx, retrieved from a backup device, and its sibling, document.docx.purge, stored on your computer.) For full instructions on how to use Emsisoft Decryptor for Globe, click the link found below."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/purge",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.026Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.026Z"
}