{
  "slug": "pyproj",
  "extension": "pyproj",
  "name": "Visual Studio Python Project",
  "summary": "Learn about .PYPROJ files and view a list of programs that open them.",
  "developer": "Microsoft",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11485&b=1"
      },
      {
        "name": "Microsoft Visual Studio 2022",
        "url": "https://fileinfo.com/software/microsoft/visual_studio"
      }
    ]
  },
  "technical_info": {
    "content": [
      "You will most likely encounter a PYPROJ file if you are developing a Python application with Visual Studio. The format is designed to help developers better manage the various aspects of a Python application build.",
      "Visual Studio uses the Microsoft Build Engine (MSBuild) platform to build applications. The various projects created by Visual Studio (.CSPROJ, .VBPROJ, etc.) are all saved in the MSBuild format. These projects contain MSBuild XML code that is compiled into executable code using the MSBuild platform when a developer builds a project into a program.",
      "To create a PYPROJ file with Visual Studio, select File → New → Project, then follow the prompts in the wizard to complete the creation of the Python project. To open a PYPROJ file with Visual Studio, select File → Open."
    ]
  },
  "more_information": {
    "description": [
      "A PYPROJ file is a Python programming project created with Microsoft Visual Studio, a software development tool. It contains references to source files associated used by the project, along with project settings, such as build information and settings for integrating with source-control systems."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/pyproj",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.032Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.032Z"
}