{
  "slug": "pzf",
  "extension": "pzf",
  "name": "GraphPad Prism Project",
  "summary": "Learn about .PZF files and view a list of programs that open them.",
  "developer": "GraphPad Software",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10309&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Prism gives you the choice of saving your project in the PZF, .PZFX, and Compact PZF formats. The PZF file is saved in a binary format and was the primary format until version 5 of Prism when it was replaced by the PZFX format. There are several benefits to saving in the PZFX format, however, there have been reports of trouble opening PZFX files sent through email that have been resolved by saving Prism data in the older PZF format. Also, current versions of Prism still support the PZF format. The compact PZF format is another alternative as it allows you to save your Prism project in the PZF format but without the anlysis results (to save space), which will need to be recomputed when opening the file.",
      "GraphPad Prism is primarily used by biologists, students, and physical and social scientists at universities, medical centers, and pharmaceutical companies around the world. The application features scientific-graphing tools, nonlinear regression curve fitting, and biostatistics for analyzing data and generating graphs that can be published to websites, .DOCX files, and .PPTX files."
    ]
  },
  "more_information": {
    "description": [
      "A PZF file is a Prism project created by GraphPad Prism, an application used to create scientific graphs. It contains Prism project data such as analysis results and choices, graphs and layouts, tables, and notes."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/pzf",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.714Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.714Z",
  "category": "other",
  "related": [],
  "containers": []
}