{
  "slug": "qat",
  "extension": "qat",
  "name": "Microsoft Office Quick Access Toolbar File",
  "summary": "Learn about .QAT files and view a list of programs that open them.",
  "developer": "Microsoft",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=9258&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "When you make changes to the ribbon in Microsoft Word, it will not change the ribbons in the other applications of the Microsoft Office Suite. You must change the UI in each, individual program to make changes. QAT files are named according to the program they're changed in, e.g., the Microsoft Excel QAT file is named Excel.qat.",
      "To make changes to the ribbon, select the Microsoft Office button, click the Word Options button, and click Customize. You can also just right-click the toolbar and select Customize Quick Access Toolbar.... A third and more direct method would be just to modify the XML code directly in the QAT file.",
      "NOTE: The QAT file was replaced by the OFFICEUI file in Microsoft Office 2010. To transfer your UI customizations to Office 2010 rename the \"QAT\" extension to \"OFFICEUI\" and place the file in the appropriate program's directory."
    ]
  },
  "more_information": {
    "description": [
      "Customization file used by Microsoft Office, a document production suite; contains XML code that customizes ribbons in Microsoft Office; includes code that defines custom commands, groups, groups, tabs, etc. that make up the Microsoft Office UI."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/qat",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.716Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.716Z",
  "category": "other",
  "related": [],
  "containers": []
}