{
  "slug": "qpj",
  "extension": "qpj",
  "name": "QGIS Map Projection File",
  "summary": "Learn about .QPJ files and view a list of programs that open them.",
  "developer": "QGIS",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11753&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Various amateur and professional geographers use QGIS to map, edit, and publish geospatial information. As part of using QGIS, geographers must create shapefiles, which use mapped points, lines, and polygons to denote geographic features and boundaries. QGIS shapefiles are actually composed of several component files, one of which is a QPJ file.",
      "A QPJ file defines a coordinate reference system and map projection function that QGIS uses to transform the Earth's curved, ellipsoidal surface into a 2D plane, so geographers can draw 2D shapes (and thereby map data) upon that plane. Different QGIS maps use different CRSes and map projections to transform the Earth's surface into a 2D plane, depending on the location a geographer is studying and the analysis the geographer wants to perform.",
      "QGIS map projections include QGIS-specific parameters that are used only by QGIS (such as the AXIS, EXTENSION, and AUTHORITY parameters). For that reason, when a geographer creates a new shapefile within QGIS, the program creates two map projection files: a QPJ file (used by QGIS) and a PRJ file (which can be used by other GIS programs, such as ArcGIS, when transferring data)."
    ]
  },
  "more_information": {
    "description": [
      "A QPJ file is a GIS map projection file created by QGIS, an open-source, cross-platform GIS application. It contains the coordinate reference system (CRS) and map projection used to transform a 3D representation of the Earth into a 2D plane. QPJ files are similar to the PRJ map projection files used by other GIS systems, but QPJ files contain QGIS-specific data."
    ]
  },
  "how_to_open": {
    "instructions": [
      "QPJ files are not meant to be opened by themselves. They are intended to be read by QGIS when a geographer opens a shapefile (.SHP file). However, because QPJ files are text files, you can open and edit them in any text editor if needed."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/qpj",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.039Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.039Z"
}