{
  "slug": "qscx",
  "extension": "qscx",
  "name": "QSCX Ransomware Encrypted File",
  "summary": "Learn about .QSCX files and view a list of programs that open them.",
  "developer": "N/A",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12337&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "In June 2021, some PC users began reporting their computers had been infected by a new variant of STOP ransomware. This variant encrypts users' files and appends them with the .qscx extension. This prevents users from opening and using the files.",
      "The ransomware then produces a plain text ransom note named _readme.txt in every folder that contains an infected file. The note contains instructions users are meant to follow to decrypt their files.",
      "QSCX ransomware is most commonly distributed within \"free programs\" that are actually adware and malware bundles. If you recently downloaded and installed a \"free program\" (especially one that is meant to be a copy of a paid program) from a software download website, that may be how your computer became infected by QSCX ransomware.",
      "NOTE: To learn more about STOP ransomware and its variants, refer to the .STOP entry."
    ]
  },
  "more_information": {
    "description": [
      "A QSCX file is a file that has been renamed and encrypted by QSCX ransomware, which is malware distributed by cybercriminals. It is a normal file, such as a document, image, song, or video, that the ransomware is holding hostage. QSCX files cannot be decrypted."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Because QSCX files are encrypted, you cannot open them. Additionally, because QSCX files are encrypted using an online private key, there is no way to decrypt them.",
      "If your computer has been infected by QSCX ransomware, the best option to restore your files to their original state is likely to perform a System Restore. Note that performing a System Restore will cause you to lose any data created in the interval between now and your last restore point. So, you may want to back up any data and files created since your last restore point."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/qscx",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.040Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.040Z"
}