{
  "slug": "raw",
  "extension": "raw",
  "name": "Raw Image Data",
  "summary": "Learn about .RAW files and view a list of programs that open them.",
  "developer": "N/A",
  "category": "image",
  "category_slug": "image",
  "programs": {
    "windows": [
      {
        "name": "Adobe Photoshop",
        "url": "https://fileinfo.com/software/adobe/photoshop"
      },
      {
        "name": "Adobe Photoshop Elements",
        "url": "https://fileinfo.com/software/adobe/photoshop_elements"
      },
      {
        "name": "Corel PaintShop Pro",
        "url": "https://fileinfo.com/software/corel/paintshop_pro"
      },
      {
        "name": "ACD Systems ACDSee",
        "url": "https://fileinfo.com/software/acd_systems/acdsee"
      },
      {
        "name": "File Viewer Plus",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=141"
      },
      {
        "name": "Adobe Photoshop 2025",
        "url": "https://fileinfo.com/software/adobe/photoshop"
      },
      {
        "name": "Corel PaintShop Pro 2023",
        "url": "https://fileinfo.com/software/corel/paintshop_pro"
      },
      {
        "name": "ACD Systems ACDSee Photo Studio",
        "url": "https://fileinfo.com/software/acd_systems/acdsee"
      },
      {
        "name": "Canvas GFX Canvas X Pro",
        "url": "https://fileinfo.com/software/acd_systems/canvas"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Because the images that RAW files contain are either uncompressed or losslessly-compressed, they are higher quality than lossy-compressed images, like .JPG and .PNG files. However, because RAW files retain all this image data, their file sizes are often quite large. This is the tradeoff between lower-quality, smaller images and higher-quality, larger images.",
      "RAW files are one of many raw camera image formats. Some other common formats are Digital Negative Images (.DNG files), Canon Raw Images (.CR2 files), Sony Digital Camera Images (.ARW files), Kodak RAW Images (.DCR files), Nikon RAW Images (.NRW files), and Nikon Electronic Format Images (.NEF files).",
      "NOTE: RAW files may also be created by image generation software instead of digital cameras, although this is not as common."
    ]
  },
  "more_information": {
    "description": [
      "A raw file format refers to file format that stores unprocessed and uncompressed data directly from digital image sensor or other sources. It is commonly used in digital photography and imaging.\n\nOther formats apply compression and processing algorithms to reduce file size and optimize image for display or printing, raw files contain all data captured by sensor without any alterations. This includes information such as color, brightness and other sensor-specific data.\n\nRaw files are often specific to particular camera manufacturer and model as they store data in format unique to sensor and hardware characteristics of that camera. Common raw file formats include CR2 (Canon), NEF (Nikon), ARW (Sony) and DNG (Adobe Digital Negative).\n\nBecause raw files are unprocessed, they provide greater flexibility for post-processing adjustments and offer more control over final image. Photographers and professionals prefer working with raw files because they can make precise adjustments to aspects such as exposure, white balance, color grading and noise reduction during editing process.\n\nHowever, raw files are typically larger in size compared to compressed formats like JPEG. Additionally, raw files require specialized software or dedicated image editors that support specific raw format to open, view and process them.",
      "The format of RAW file is binary format.",
      "A RAW file is a photo created by a digital camera, such as a Panasonic, Leica, or Casio camera. It contains raw image data captured by a digital camera's CCD. Professional photographers often work with RAW files, since they can more accurately edit images stored in the RAW format."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open RAW file using various image editing software applications e.g.\n\nAdobe PhotoshopAdobe Photoshop ElementsCorel PaintShop ProACD Systems ACDSeeRawTherapee",
      "You can open RAW files with various image-editing and -viewing applications. Some options include Adobe Photoshop (Windows and macOS), Adobe Photoshop Elements (Windows and macOS), Corel PaintShop Pro (Windows), ACD Systems ACDSee (Windows), and RawTherapee (multiplatform)."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "Several image editing softwares can convert RAW file into different formats. Adobe Photoshop can convert your RAW files into image formats like\n\nPNG - Portable Network GraphicJPEG - JPEG ImageGIF - Graphical Interchange FormatPSD - Adobe Photoshop DocumentBMP - Bitmap Image",
      "Many image editors, including Adobe Photoshop and Corel PaintShop Pro, can convert RAW files to other formats. For example, Photoshop can convert RAW files to the following formats (and several others):",
      ".PNG - Portable Network Graphic",
      ".JPEG - JPEG Image",
      ".GIF - Graphical Interchange Format",
      ".PSD - Adobe Photoshop Document",
      ".BMP - Bitmap Image",
      ".PCX - Paintbrush Bitmap Image",
      ".TGA - Targa Graphic",
      ".TIFF - Tagged Image File Format"
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/raw_141-2.jpg",
      "alt": "Screenshot of a .raw file in Adobe Photoshop 2021",
      "caption": "RAW file open in Adobe Photoshop 2021"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/image/raw/index.html",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-01T22:32:42.284Z"
    },
    {
      "url": "https://fileinfo.com/extension/raw",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.284Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.284Z",
  "containers": []
}