{
  "slug": "rba",
  "extension": "rba",
  "name": "Rock Band Network Song Package",
  "summary": "Learn about .RBA files and view a list of programs that open them.",
  "developer": "Harmonix",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12834&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "The Rock Band series of rhythm games allows players to \"play\" songs as a band by pressing buttons on instrument-like game controllers in time to music. Previously, Rock Band's developer, Harmonix, maintained the Rock Band Network, an online service through which artists could publish their songs as downloadable Rock Band tracks.",
      "To publish a song to the Rock Band Network, artists needed to package the song as an RBA file. Each RBA file contains the song's audio files, divided into separate tracks for each instrument, MIDI data that tracks when players must play notes, and metadata, such as the song's title, artist, and genre.",
      "The primary tool artists use to package their songs as RBA files is Magma, a free application provided by Harmonix. However, the Rock Band community has created additional versions of Magma, such as Magma C3, and included RBA-authoring tools in other applications, such as Onyx Music Game Toolkit."
    ]
  },
  "more_information": {
    "description": [
      "An RBA file is a song package used to load a custom song in the video games Rock Band 2 and 3. It contains audio, MIDI, and metadata files. RBA files are primarily created using the Magma song packaging and distribution tool."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can use Harmonix Magma (Windows) to transfer an RBA file to the Xbox 360 versions of Rock Band 2 and 3. To do so, refer to the documentation linked below.",
      "You can also open an RBA file with Magma C3 and Onyx Music Game Toolkit."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/rba",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.046Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.046Z"
}