{
  "slug": "rcm",
  "extension": "rcm",
  "name": "Autodesk Reality Capture Mesh",
  "summary": "Learn about .RCM files and view a list of programs that open them.",
  "developer": "Autodesk",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11709&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Autodesk ReCap Pro is a 3D scanning software used to create digital representations of buildings, structures, and environments. These 3D models, which are created using either photographs or laser scans of the to-be-modeled area, are saved as RCM files.",
      "In the past, ReCap users could import RCM models into Autodesk ReMake, in order to create movies or VR experiences featuring RCM models. Autodesk ReMake has since been discontinued, but Autodesk users can still use ReCap Photo to create RCM models and export them in a variety of 3D model formats, for use in other Autodesk and 3D modeling programs."
    ]
  },
  "more_information": {
    "description": [
      "An RCM file is a reality capture mesh created in Autodesk ReCap Pro. It contains a 3D model that was created from either terrestrial laser scans, via ReCap's now-discontinued Scan-to-Mesh feature, or photos, via ReCap's Photos feature. RCM files were also previously used by Autodesk ReMake, before Autodesk discontinued that program."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open RCM files in ReCap Photo, which is available as part of Autodesk ReCap Pro. You can download a free trial of ReCap Pro from Autodesk's website, using the link provided below.",
      "If you need to convert an RCM file to another 3D model format, such as OBJ or FBX, you can do so by opening the file in ReCap Photo and then exporting it in your desired format."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/rcm",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.730Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.730Z",
  "category": "other",
  "related": [],
  "containers": []
}