{
  "slug": "rdzip",
  "extension": "rdzip",
  "name": "Rhythm Doctor Custom Level",
  "summary": "Learn about .RDZIP files and view a list of programs that open them.",
  "developer": "7th Beat Games",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12699&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "In Rhythm Doctor, players play as a doctor who heals patients by defibrillating in time to their heartbeats. The game includes a default set of levels, but players can also create their own levels using the game's Level Editor.",
      "When making a level, players first import the song (or other audio file) they want to be used in that level. They then add characters, rhythm prompts, special effects, dialogue, and other items to the level.",
      "If a player wants to share their level with other players, they can do so by selecting File → Export. This saves the level as an RDZIP file. Players commonly upload RDZIP files to custom level websites, such as rhtyhm.cafe, so other players can find and download them."
    ]
  },
  "more_information": {
    "description": [
      "An RDZIP file is a custom level created for use in Rhythm Doctor, a one-button rhythm game. It is a Zip archive that contains all the level's assets, including one or more .OGG audio files, .JPG and/or .PNG images, and a main.rdlevel file. Players create RDZIP files using Rhythm Doctor's Level Editor."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an RDZIP file in Rhythm Doctor (Windows, Mac). From the game's main menu, select Custom Levels → Import Levels. Then, navigate to and open your RDZIP file. After you do, the level the file contains will appear in-game.",
      "If you want to view the assets an RDZIP file contains, you can decompress the file using any .ZIP decompression utility. You may first have to change the file's extension to .zip."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/rdzip",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.050Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.050Z"
}