{
  "slug": "rel",
  "extension": "rel",
  "name": "Relocatable Module File",
  "summary": "Learn about .REL files and view a list of programs that open them.",
  "developer": "Nintendo",
  "programs": {
    "windows": [
      {
        "name": "BrawlBox",
        "url": "https://fileinfo.com/software/brawlbox/brawlbox"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=9208&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Mario Kart Wii holds only one REL file, named StaticR.rel. This file contains gameplay logic and other data, and it is located in the /​rel directory.",
      "Super Smash Bros. Brawl's REL files are located in the game's Modules folder. Each REL stage file has an identifying string of code that looks as follows: 38 A5 00 00 38 80 00 ID. The ID is actually two digits that signify the specific stage."
    ]
  },
  "more_information": {
    "description": [
      "A REL file is a relocatable module file used by some Nintendo Wii games, such as Super Smash Bros. Brawl and Mario Kart Wii. It contains gameplay data, including stage and character models. REL files function similarly to the .DLL files used by the Windows operating system."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open and edit Nintendo REL files with BrawlBox (Windows), a free program that allows gamers to edit Nintendo game resource files.",
      "Those who want to replace Super Smash Bros. stages with other stages (including custom stages) can use Stage Switcher (Windows) to overwrite a stage's REL file. Then, the new stage will appear instead of the overwritten stage.",
      "Those who want to edit data in Mario Kart Wii's StaticR.rel file can do so using the wstrt utility included in Wiimms SZS Tools (Windows) or StaticR.rel Tool (Windows)."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/rel",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.733Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.733Z",
  "category": "other",
  "related": [],
  "containers": []
}