{
  "slug": "rem",
  "extension": "rem",
  "name": "BlackBerry Encrypted Media",
  "summary": "Learn about .REM files and view a list of programs that open them.",
  "developer": "Research In Motion",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=3618&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "When a BlackBerry smartphone user has enabled media file encryption, their phone automatically encrypts any .JPG, .MP3, and other media files stored on their memory card. After doing so, the phone adds the .rem extension to those files' names, to denote they are encrypted.",
      "If a user attempts to manually transfer these files to another device (such as a computer) and open them, they typically will not be able to do so, because the files are encrypted. Instead, a user should transfer their REM files to their computer using BlackBerry Desktop Manager, which decrypts the files during the transfer process, or decrypt their media files on their phone before attempting to transfer them.",
      "If you still have access to the BlackBerry phone on which your REM files were created, you can decrypt the files on your phone by:",
      "Inserting the memory card that contains your files into your phone.",
      "Selecting Options → Media Card → Encrypt Media Files → No.",
      "Selecting Options → Media Card → Encryption Mode → None.",
      "(While the above steps work on most BlackBerry phones, encryption settings may reside in different places on different phones.)",
      "Then, you can use the unencrypted files as you would normally (e.g. you can email them to yourself from your phone, download them, and open them). In some cases, you may have to manually remove the .rem extension from the files' names to use them.",
      "NOTE: Typically, REM encryption is device-specific. Thus, you cannot decrypt REM files created by one phone on a different phone (unless they are password-encrypted instead)."
    ]
  },
  "more_information": {
    "description": [
      "An REM file is an encrypted file created by a BlackBerry smartphone. Most often, REM files contain a photo a user took with their phone. These REM files use the compound extension .jpg.rem. Other REM files may contain audio, video, or a backup of a user's BlackBerry Messenger messages or contacts."
    ]
  },
  "how_to_open": {
    "instructions": [
      "The easiest way to open REM files on your computer is to use BlackBerry Desktop Manager (Windows, Mac) to transfer the files from your phone to your PC. During the transfer process, Desktop Manager will automatically decrypt the REM files you transfer, allowing you to open them as you would normally. (Note that, in most cases, you must transfer the REM files from the phone that created them, as REM encryption is often device-specific. Also, you must know the device's password, as you will have to enter it during the process.)",
      "If you cannot decrypt your REM files, you can try transferring them to your PC and simply renaming them to not use the .rem extension. (For example, you would rename YourPhoto.jpg.rem to YourPhoto.jpg.) Depending on how your REM file was encrypted, you may be able to open it as you would normally after removing the .rem extension."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/rem",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.053Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.053Z"
}