{
  "slug": "rensenware",
  "extension": "rensenware",
  "name": "Rensenware Encrypted File",
  "summary": "Learn about .RENSENWARE files and view a list of programs that open them.",
  "developer": "Kangjun Heo",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13401&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "In 2017, developer Kangjun Heo created rensenWare. Like typical ransomware, rensenWare maliciously encrypts and renames a user's files. Unlike typical ransomware, rensenWare does not ask users to pay a ransom to decrypt their files. Instead, it requires users to achieve a score of 200 million points in the Lunatic difficulty of Touhou Seirensen ~ Undefined Fantastic Object, a scrolling shooter video game. (RensenWare does not include Touhou Seirensen ~ Undefined Fantastic Object, so users had to acquire and install it themselves.)",
      "After accidentally infecting his own computer with rensenWare, Heo created a tool that allows players to automatically set their Touhou Seirensen ~ Undefined Fantastic Object score to 200 million, to terminate the ransomware and restore infected files. Later, Heo iterated on this tool and created a version that does not require users to install or play Touhou Seirensen ~ Undefined Fantastic Object to decrypt their files."
    ]
  },
  "more_information": {
    "description": [
      "A file with the .rensenware extension has been encrypted and renamed by rensenWare ransomware. It contains a document, image, video, or other file the ransomware is holding hostage. You can use the rensenWare Forcing Tool to disable rensenWare and decrypt your RENSENWARE files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can use rensenWare Forcing Tool (Windows) to restore your RENSENWARE files to their original state. To do so, simply download and run rensenWare Forcing Tool (by double-clicking it). The program will then restore your files and terminate the rensenWare process."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/rensenware",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.733Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.733Z",
  "category": "other",
  "related": [],
  "containers": []
}