{
  "slug": "repeaks",
  "extension": "repeaks",
  "name": "REAPER Peak File",
  "summary": "Learn about .REPEAKS files and view a list of programs that open them.",
  "developer": "Cockos",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11707&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Whenever a user imports an audio file into REAPER, REAPER creates a REPEAK file to visually represent that audio file within the program's audio editing tools. These files have no function other than displaying an audio file's waveform in REAPER, and they are not meant to be opened outside of REAPER.",
      "If, like other REAPER users, you find your computer cluttered with REPEAK files, you can safely delete them without affecting your REAPER projects (.RPP files). When you re-load a project, REAPER will create whatever REPEAKS files the project needs. For this reason, many REAPER users configure the program to save REPEAK files in one, designated location, so they can regularly delete the many REPEAKS files that REAPER creates and free up space on their computers."
    ]
  },
  "more_information": {
    "description": [
      "A REPEAKS file is a waveform file created by REAPER, a digital audio editing program published by Cockos. It contains a visual representation of an audio file that has been imported into REAPER. REPEAKS files are commonly referred to as REAPER peak files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "REPEAKS files are not meant to be opened outside of Cockos REAPER. You can delete REPEAKS files if needed; REAPER will re-create any REPEAKS files it needs when you open a project or import an audio file."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/repeaks",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.053Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.053Z"
}