{
  "slug": "repp",
  "extension": "repp",
  "name": "Repp Ransomware Encrypted File",
  "summary": "Learn about .REPP files and view a list of programs that open them.",
  "developer": "N/A",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11438&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Repp is a type of malware utilized by cybercriminals that takes a user's files hostage and forces him to pay the perpetrator to unlock the files. It is most often introduced to a victim's computer through spam emails with malicious links or file attachments that are downloaded and run by unsuspecting users. The virus may also be introduced when a user clicks on fake social media posts or downloads malicious files from torrent websites.",
      "When the ransomware runs on a user's computer, it encrypts files on the computer and adds the .repp extension onto the names of the files. The types of files typically targeted include documents, images, videos, and backup files, such as .DOCX, .JPG, .WMV, and .DB files. For example, a document.pdf file becomes document.pdf.repp.",
      "The virus then generates a _readme.txt file in each folder that stores an encrypted file on the user's computer. The _readme.txt file contains instructions explaining the hostile takeover of the user's files and how the user can recover his files by paying a ransom payment."
    ]
  },
  "more_information": {
    "description": [
      "A file with a .repp extension is a file that has been encrypted by the Repp virus, which is a variant of STOP (Djvu) ransomware that became prevalent in early 2020. It is encrypted so it is not possible to open the file by simply changing the .repp file extension."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Currently, there is no program available to effectively restore REPP files to their original state. If you have a recent backup of your files, you can perform a system restore to remove the virus, but any changes made to files after the backup was made will be lost."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/repp",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.734Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.734Z",
  "category": "other",
  "related": [],
  "containers": []
}