{
  "slug": "rgrid",
  "extension": "rgrid",
  "name": "RepGrid File",
  "summary": "Learn about .RGRID files and view a list of programs that open them.",
  "developer": "Dr. Mildred Shaw",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11075&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "The RGRID file was originally developed by Dr. Mildred Shaw in 1975. It was developed for the repertory grid technique (RepGrid or RGT), which is a method used to elicit and organize how and what people think about a specific topic. The RepGrid technique is based on the Personal Construct Theory proposed by George Kelly in 1955.",
      "Shaw was the first one to operationalize the theory in interactive computer programs on the PDP12, PDP10, and the Wang machines. The programs were then ported to Apple II, Macintosh, Windows, and Unix. Support for RGRID files was maintained through the years as programs were developed. Currently, RGRID files are primarily created by the Rep Plus desktop program and the WebGrid online program."
    ]
  },
  "more_information": {
    "description": [
      "An RGRID file contains grid data used by conceptual grid analysis programs, such as WebGrid, Rep Plus, Rep 5, Rep IV, RepGrid 2, and PLANET. It stores various grid data, which includes a list of elements and constructs, ratings of elements on constructs, class definitions of compound constructs, and default parameters. RGRID files are typically used by psychology students and researchers."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/rgrid",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.736Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.736Z",
  "category": "other",
  "related": [],
  "containers": []
}