{
  "slug": "riq",
  "extension": "riq",
  "name": "Heaven Studio Remix",
  "summary": "Learn about .RIQ files and view a list of programs that open them.",
  "developer": "RHeavenStudio",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13371&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Heaven Studio is a fan-made recreation of Rhythm Heaven that includes a custom level editor. Using the level editor, players can create their own levels, referred to as remixes. They can then play those remixes in Heaven Studio.",
      "Each Heaven Studio remix is saved as an RIQ file. This file is a ZIP archive that contains two files: a JSON file describing a level's beats per minute, volume, properties, and rhythm prompts, and an audio file that contains the level's music. When opened in Heaven Studio's level editor, RIQ files appear as timeline-based level creation projects, which chart a level's prompts across one or more color-coded tracks."
    ]
  },
  "more_information": {
    "description": [
      "A RIQ file is a game level created and used by Heaven Studio, a PC port of the Nintendo DS game Rhythm Heaven. It is a renamed .ZIP file that contains a song and a level description. The level description is saved as a .JSON file; the song is likely saved as an .OGG or .WAV file."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a RIQ file with Heaven Studio, to edit and play the level it contains. If you want to extract the audio and JSON file a RIQ file contains, rename it to use the .zip extension and open it as you would any ZIP archive."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/riq",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.057Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.057Z"
}