{
  "slug": "rmmzsave",
  "extension": "rmmzsave",
  "name": "RPG Maker MZ Save File",
  "summary": "Learn about .RMMZSAVE files and view a list of programs that open them.",
  "developer": "Gotcha Gotcha Games, KADOKAWA, Yoji Ojima",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13311&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "RPG Maker is a series of RPG creation tools for Windows that enable gamers to design, play, and share custom RPG games. RPG Maker MZ is the ninth entry in the series (released in 2020).",
      "The RMMZSAVE format is similar to the .RPGSAVE format, which stores saved progress for games created by RPG Maker MV. Games that create RMMZSAVE files typically save them in a Saves folder in the game installation directory."
    ]
  },
  "more_information": {
    "description": [
      "An RMMZSAVE file is a save file created by RPG Maker MZ, a role-playing game (RPG) creation tool. It contains information related to game progress in the JSON format, such as a character's earned money, experience, status points, skills, items, and weapons. RPG Maker MZ games reference RMMZSAVE files to load saved progress, but gamers may also open RMMZSAVE files to modify the saved progress."
    ]
  },
  "how_to_open": {
    "instructions": [
      "While games created with the RPG Maker MZ tool reference RMMZSAVE files, you can open and edit the files with other programs.",
      "RPG MAKER MZ SAVE EDITOR is a free app available on the web that can open RMMZSAVE files. To open an RMMZSAVE file with the app, select Choose File, then upload the RMMZSAVE file to edit it. You can also open RMMZSAVE files offline with the RPGMaker Save Editor (developed by nathan-b) in Windows."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/rmmzsave",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.059Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.059Z"
}