{
  "slug": "rnqs",
  "extension": "rnqs",
  "name": "Universal Pokemon Randomizer Settings",
  "summary": "Learn about .RNQS files and view a list of programs that open them.",
  "developer": "N/A",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13736&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Fans of Pokemon who want to play old games on their computers can extract game data from console cartridges and save them in file formats, such as .GB, .GBA, .SGB, and .NDS, to use them with emulators on their computers. The Universal Pokemon Randomizer is a free tool for Windows that allows gamers to customize the settings of a Pokemon game to enhance their gameplay.",
      "Universal Pokemon Randomizer comes packaged with various RNQS files that store settings for different types of gameplay. You can find them in the \"Settings\" folder included with the game installation. This is also the default location for saving RNQS files."
    ]
  },
  "more_information": {
    "description": [
      "An RNQS file contains settings for Universal Pokemon Randomizer, a tool used to enhance gameplay in Pokemon games on Windows. It stores information that modifies gameplay, including available Pokemon types, evolution behavior, encounters, learnable moves, and trainer attributes. Players save their Universal Pokemon Randomizer settings as RNQS files to preserve and reuse them later."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an RNQS file with Universal Pokemon Randomizer in Windows. To open an RNQS file with the program, select Load Settings."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/rnqs_13736.jpg",
      "alt": "Screenshot of a .rnqs file in Universal Pokemon Randomizer 1.10",
      "caption": "RNQS file open in Universal Pokemon Randomizer 1.10"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/rnqs",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.739Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.739Z",
  "category": "other",
  "related": [],
  "containers": []
}