{
  "slug": "rpc",
  "extension": "rpc",
  "name": "Rich Page Content Document",
  "summary": "Learn about .RPC files and view a list of programs that open them.",
  "developer": "Synthrone",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10381&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "The RPC file is mainly used with the Synthrone Crafter tool for producing e-content. However, it may also be opened by another ecommerce program with the Crafter plugin installed.",
      "Synthrone offers end to end services to brands and retailers for conducting online transactions. Synthrone Crafter is one of several programs available as part of the Synthrone ecommerce platform. Other programs include Synthrone Explorer for gathering ecommerce information, Synthrone Publisher for delivering e-content, Synthrone Booster for increasing a brand's visibility, and Synthrone Tracker for measuring the performance of ecommerce assets."
    ]
  },
  "more_information": {
    "description": [
      "An RPC file is a document created by Synthrone Crafter, an e-content production application used by retailers to administer, manage, format, and update e-content. It contains the content of a page or product, which may include text, images, video, or forms. RPC files were replaced by .ELP files by Synthrone Crafter to save landing page content."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/rpc",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.741Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.741Z",
  "category": "other",
  "related": [],
  "containers": []
}