{
  "slug": "rpg",
  "extension": "rpg",
  "name": "DTPS Robot Program",
  "summary": "Learn about .RPG files and view a list of programs that open them.",
  "developer": "Panasonic",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13301&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Panasonic DTPS allows those working with certain Panasonic welding robots, such as the TM-1400, to design programs those robots can execute. For example, a user can design a program that specifies and automates how a robot welds a standard set of parts together into a single component.",
      "After creating a program, users save that program as an RPG file. They then transfer this compiled, binary file to a robot's controller device (such as the G3 Robot Controller), from which they can execute the program the RPG file contains."
    ]
  },
  "more_information": {
    "description": [
      "An RPG file is a compiled program created by Panasonic Desktop Programming & Simulation (DTPS). It specifies a set of automated actions that a Panasonic welding robot can execute. To use an RPG file with a robot, users must transfer the file to that robot's controller device."
    ]
  },
  "how_to_open": {
    "instructions": [
      "RPG files are not meant to be opened. To use an RPG file with a compatible Panasonic welding robot, transfer the RPG file to that robot's controller. For example, you can transfer an RPG file to the G3 Robot Controller used with the TM-1400 welding robot. Then, you can use the controller to execute the program the RPG file contains."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/rpg",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.741Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.741Z",
  "category": "other",
  "related": [],
  "containers": []
}