{
  "slug": "rrbb",
  "extension": "rrbb",
  "name": "RRBB Ransomware Encrypted File",
  "summary": "Learn about .RRBB files and view a list of programs that open them.",
  "developer": "N/A",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12723&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "RRBB ransomware is a variant of STOP Djvu ransomware. Like other STOP Djvu variants, RRBB ransomware encrypts users' files, including documents, videos, and images, and appends them with a custom extension. It then produces a ransom note named _readme.txt in every folder that contains an infected file. The ransom note lists instructions users can supposedly follow to decrypt their files.",
      "Ransomware is most commonly distributed within programs that appear to be legitimate but are actually adware and malware bundles. If you recently downloaded and installed an unverified program, that may be how your computer became infected by RRBB ransomware.",
      "NOTE: To learn more about STOP Djvu ransomware and its variants, refer to the .STOP entry."
    ]
  },
  "more_information": {
    "description": [
      "A file with the .rrbb extension has been maliciously encrypted by RRBB ransomware. As part of the encryption process, the ransomware adds .rrbb to the file's original extension, producing an extension like .docx.rrbb. There is currently no way to decrypt RRBB files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Because RRBB files are encrypted, you cannot open them. Currently, there is no way to decrypt RRBB files.",
      "To recover your files, you should retrieve them from a recent backup or perform a System Restore. Note that performing a System Restore will cause you to lose any files created since your last restore point. You may want to back up these files before performing a System Restore."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/rrbb",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.065Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.065Z"
}