{
  "slug": "rscollection",
  "extension": "rscollection",
  "name": "RetroShare Collection",
  "summary": "Learn about .RSCOLLECTION files and view a list of programs that open them.",
  "developer": "RetroShare",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11876&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "RetroShare is an open-source, cross-platform decentralized social network that allows users to communicate over encrypted connections. In addition to chatting, messaging, and calling each other, RetroShare users can share files. To do so, users must move their files to a shared directory on their computer and then use RetroShare to create an RSCOLLECTION file that references the shared directory (and describes the files it contains).",
      "After a user creates an RSCOLLECTION, they can create and share a link to the collection to allow others to download the files the collection describes. For example, if a user were to paste a link to their RSCOLLECTION file in a RetroShare chat room, other users could click the link to download that RSCOLLECTION file. They could then open the RSCOLLECTION in RetroShare to download the files the collection describes. In this way, RetroShare users can easily share files stored on their computers with other RetroShare users."
    ]
  },
  "more_information": {
    "description": [
      "An RSCOLLECTION file is a metadata file used by RetroShare, a decentralized social sharing network. It identifies a group of files a user intends to share via RetroShare. RSCOLLECTION files can be linked to and downloaded via RetroShare, email, text message, and other programs, but can be opened (and used to download files) only in RetroShare."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To use an RSCOLLECTION file to download files via RetroShare, you must:",
      "Locate the file in RetroShare.",
      "Right-click the file and select Open File.",
      "When the Collection Editor window appears, select Download!.",
      "At this point, the files your RSCOLLECTION describes will begin downloading in RetroShare."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/rscollection",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.066Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.066Z"
}