{
  "slug": "rtfd",
  "extension": "rtfd",
  "name": "Rich Text Format Directory File",
  "summary": "Learn about .RTFD files and view a list of programs that open them.",
  "developer": "Apple",
  "programs": {
    "windows": [
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1174&b=1"
      },
      {
        "name": "Apple Pages",
        "url": "https://fileinfo.com/software/apple/pages"
      }
    ]
  },
  "technical_info": {
    "content": [
      "RTFD files are actually \"bundles\" that contain an RTF file and its associated attachments as separate files. When you open an RTFD file using TextEdit, the file's attachments appear within it. You can double-click an attachment to open it in its associated app. For example, if you double-click an image, the image will open in Apple Preview.",
      "If needed, you can view and open all the files contained within an RTFD bundle separately. In macOS, you can right-click an RTFD file and select Show Package Contents to view all the files contained within a bundle. In Windows File Explorer, you can open an RTFD bundle as you would any Windows folder, and then access the files contained within."
    ]
  },
  "more_information": {
    "description": [
      "An RTFD file is a rich text file similar to an .RTF document. However, RTFD files can contain \"attachments,\" such as images, PDFs, spreadsheets, and other files. The RTFD file format was originally developed for use in the NeXT operating system but later moved to macOS, where it is used primarily by Apple TextEdit."
    ]
  },
  "how_to_open": {
    "instructions": [
      "On Macs, you can open RTFD files using Apple TextEdit. To do so, open TextEdit, select File → Open, and then open your RTFD file.",
      "Because Windows does not support RTFD bundles, you cannot open RTFD files natively on Windows PCs. You can, however, open each of the files contained within an RTFD bundle. To do so, locate your RTFD file in File Explorer, where it will appear as a folder. Then, click into the folder and select the component file you want to view."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/rtfd_1174-2.png",
      "alt": "Screenshot of a .rtfd file in Apple TextEdit",
      "caption": "RTFD file open in Apple TextEdit"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/rtfd",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.745Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.745Z",
  "category": "other",
  "related": [],
  "containers": []
}