{
  "slug": "rumba",
  "extension": "rumba",
  "name": "RUMBA Ransomware Encrypted File",
  "summary": "Learn about .RUMBA files and view a list of programs that open them.",
  "developer": "N/A",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12339&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Ransomware is a category of malicious programs that encrypt or otherwise prevent a user from accessing files before producing a ransom note. The ransom note details how the user can pay to unlock their files. STOP ransomware, which encrypts a user's files and then produces a plain text ransom note named _readme.txt, is one of the most common types of ransomware.",
      "In January 2019, some PC users reported their computers had been infected by a new variant of STOP, which appended encrypted files with the .rumba extension. The RUMBA variant of STOP encrypts users' files using an offline encryption key, which means users can likely decrypt the files themselves using the Emsisoft Decryptor for STOP Djvu (linked below).",
      "RUMBA ransomware is most commonly distributed in programs that appear to be legitimate but are actually adware and malware bundles. If you recently downloaded and installed an unverified program, that may be how RUMBA ransomware infected your computer.",
      "NOTE: To learn more about STOP ransomware and its variants, refer to the .STOP entry."
    ]
  },
  "more_information": {
    "description": [
      "A RUMBA file is a normal file, such as a document, image, or video, that has been renamed and encrypted by RUMBA ransomware. Because the file is encrypted and being held hostage, you cannot open it. Typically, the .rumba extension is added to the file's normal extension, producing a file whose name ends in an extension like .jpg.rumba."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Because RUMBA files have been encrypted by ransomware, you cannot open them as you would normally. However, you can attempt to decrypt your RUMBA files using Emsisoft Decryptor for STOP Djvu. Read the instructions at the program's website carefully before attempting to decrypt your RUMBA files."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/rumba",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.747Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.747Z",
  "category": "other",
  "related": [],
  "containers": []
}