{
  "slug": "rvn",
  "extension": "rvn",
  "name": "Riven Game Save",
  "summary": "Learn about .RVN files and view a list of programs that open them.",
  "developer": "Cyan Worlds",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13805&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Cyan Worlds released Riven in 1997 as the sequel to the hit game Myst. Like its predecessor, Riven focuses on exploration and environmental puzzle-solving, immersing players in a mysterious world they must navigate without combat or dialogue options. Riven generates RVN files during gameplay whenever the player manually saves or uses the game's autosave feature.",
      "The location of RVN files depends on the platform and version of Riven you're using. For example, you can find RVN files for the GOG version in Windows here:​",
      "C:\\​Program Files (x86)\\​Galaxy\\​Games\\​Riven - The Sequel to Myst\\​",
      "RVN files created by the Steam version (ScummVM-based) are found in Windows here:",
      "C:\\​Users\\​[YourUsername]\\​AppData\\​Roaming\\​ScummVM\\​Saved games",
      "Finally, you can find RVN files created by the 2024 remake of Riven in Windows here:",
      "C:\\​Users\\​[YourUsername]\\​AppData\\​Local\\​Riven\\​Saved\\​SaveGames\\​"
    ]
  },
  "more_information": {
    "description": [
      "An RVN file is a game save file created by Riven, a first-person puzzle adventure game developed by Cyan Worlds. It stores the state of a player's game, including the player's position in the game world, items collected, and the status of puzzles solved. RVN files enable players to resume gameplay from a specific point without having to start over."
    ]
  },
  "how_to_open": {
    "instructions": [
      "RVN files are not meant to be opened. Instead, Cyan Worlds Riven references the RVN file to load the saved game progress it contains."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/rvn",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.069Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.069Z"
}