{
  "slug": "rvz",
  "extension": "rvz",
  "name": "Compressed Wii / GameCube ROM",
  "summary": "Learn about .RVZ files and view a list of programs that open them.",
  "developer": "Dolphin",
  "programs": {
    "windows": [
      {
        "name": "Dolphin",
        "url": "https://fileinfo.com/software/dolphin/dolphin"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11924&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Dolphin is a cross-platform Wii and GameCube emulator that gamers can use to play Wii and GameCube games on their PCs. To play a game in Dolphin, gamers must first acquire a disk image that contains a virtual copy of that game. Dolphin allows players to load Wii and GameCube disk images saved in various formats, including .ISO, .GCZ, WIA, .WBFS, and RVZ files.",
      "The team behind Dolphin created the RVZ file format in 2020. The RVZ format allows gamers to store the entirety of a game's data, including update data and so-called garbage data, within files that are smaller or comparably-sized to GCZ and WIA files, which do not contain all of a game's data. Unlike other lossless game disk image formats, RVZ files are also optimized for emulation, making the format ideal for both game performance and preservation.",
      "Gamers who want to convert their existing GameCube and Wii ROMs to the RVZ format can do so using Dolphin. For example, gamers who use ISO files with Dolphin may want to convert those files to RVZ files, to save space on their hard drives."
    ]
  },
  "more_information": {
    "description": [
      "An RVZ file is a ROM file created for use with Dolphin, a cross-platform Nintendo Wii and GameCube emulator. It contains a compressed copy of a Nintendo Wii or GameCube video game. RVZ files allow gamers to play Wii and GameCube games on their PCs."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an RVZ file in Dolphin (cross-platform). To do so, select Open from Dolphin's menu bar and then navigate to and open your RVZ file."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/rvz",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.748Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.748Z",
  "category": "other",
  "related": [],
  "containers": []
}