{
  "slug": "rxr",
  "extension": "rxr",
  "name": "RecordXR Recording",
  "summary": "Learn about .RXR files and view a list of programs that open them.",
  "developer": "Medicalholodeck",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13049&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Medicalholodeck is a VR program that allows Windows VR and Meta Quest users to view, study, and manipulate medical images in 3D. Users who want to share a Medicalholodeck session with others (for example, a teacher who wants to share a session with their students) can save that session as an RXR file.",
      "Each RXR file contains a recording of not just a user's actions during a Medicalholodeck session, but also the environment in which those actions took place. Storing a recording of the entire environment allows viewers to move around that environment while they play the recording. Viewers can also manipulate items shown in the recording."
    ]
  },
  "more_information": {
    "description": [
      "An RXR file is a 3D recording saved in the RecordXR format. The virtual reality (VR) medical imaging program Medicalholodeck allows users to record sessions as RXR files. Other users can load the files in Medicalholodeck to play the recordings they contain."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an RXR file with Medicalholodeck (Windows), provided you have a compatible virtual reality headset."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/rxr",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.071Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.071Z"
}