{
  "slug": "ryk",
  "extension": "ryk",
  "name": "Ryuk Ransomware Encrypted File",
  "summary": "Learn about .RYK files and view a list of programs that open them.",
  "developer": "N/A",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12290&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "In 2018, users first began reporting the existence of Ryuk ransomware. Named after a death god from the manga Death Note, Ryuk is distributed primarily by Russian criminal cartels. The cartels tend to target large organizations that have a large amount of essential data, network entry points, and money.",
      "After a user's computer becomes infected by Ryuk, the ransomware targets what it believes to be the user's essential files, as well as any files stored on a network drive. Ryuk encrypts these files and appends them with the .ryk or .rycrypted extension. The ransomware then attempts to delete or disable any backup files and system restore points it can find, to ensure users must pay the ransom to decrypt their files. At that point, the criminals behind Ryuk reach out to the infected user or organization, asking for a ransom paid in Bitcoin. (FileInfo recommends you never pay a ransom to decrypt your files.)",
      "Ryuk is most commonly distributed via phishing emails designed to trick recipients into downloading and executing the ransomware. However, in early 2021, a new, self-propagating variant of Ryuk ransomware was discovered. This variant of Ryuk can jump from computer to computer within a network, meaning you may not have downloaded anything suspicious, and your computer may still be compromised."
    ]
  },
  "more_information": {
    "description": [
      "An RYK file is a file that has been renamed and encrypted by Ryuk ransomware, which is malware distributed by cybercriminals. It contains a normal file, such as a document or database, that the ransomware is holding hostage. RYK files cannot be decrypted."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Because RYK files are encrypted and cannot be decrypted, you cannot open them. Typically, your best option for restoring ransomware-encrypted files to their previous state is to perform a System Restore. However, Ryuk typically disables this option. At this time, there is no solution for restoring RYK files to their previous state."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/ryk",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.750Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.750Z",
  "category": "other",
  "related": [],
  "containers": []
}