{
  "slug": "s4dix",
  "extension": "s4dix",
  "name": "Scratch for Discord Extension",
  "summary": "Learn about .S4DIX files and view a list of programs that open them.",
  "developer": "Androz 2091",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12321&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Discord is a text, voice, and video chat program that provides gamers and other social communities with a place to hang out online. Discord contains many public and private servers organized by topic, which users can join to chat with their friends, host virtual game nights, and conduct other social activities.",
      "Advanced users can create and add bots to their Discord servers. These bots automatically perform various functions, such as welcoming new members to a server, moderating content, and rewarding a server's most active members.",
      "Scratch for Discord is a program that allows developers to create Discord bots within a block-based development environment. If a developer wants to add a feature to Scratch for Discord, they can do so by installing an S4DIX file that contains that feature."
    ]
  },
  "more_information": {
    "description": [
      "An S4DIX file is a plug-in that can be installed in Scratch for Discord, a Discord bot development tool. It contains an additional Scratch for Discord tool or feature. S4DIX files allow developers to customize Scratch for Discord and extend the program's capabilities."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an S4DIX file in Scratch for Discord (cross-platform). To install the feature an S4DIX file contains, File → Open a file ... from the Scratch for Discord code editor's menu bar."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/s4dix",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.074Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.074Z"
}