{
  "slug": "saber",
  "extension": "saber",
  "name": "Beat Saber Custom Saber",
  "summary": "Learn about .SABER files and view a list of programs that open them.",
  "developer": "Beat Games",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12267&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Beat Saber is a VR-based rhythm game in which players slice blocks with sabers in time to music. If a player is dissatisfied with Beat Saber's default sabers, they can download and install custom sabers, saved as SABER files.",
      "Modders create custom sabers in Beat Saber, using a plug-in such as Saber Factory 2, or in Open Saber VR. They then export the sabers as SABER files, so they and other players can import and select the sabers in-game.",
      "NOTE: The Oculus Quest version of Beat Saber uses custom sabers saved as .ZIP or QSABER files. Only the PC version of Beat Saber uses SABER files."
    ]
  },
  "more_information": {
    "description": [
      "A SABER file is a custom saber meant to be imported into Beat Games Beat Saber or its open-source clone, Open Saber VR. Beat Saber modders create and distribute SABER files online, via the BeastSaber website and the Beat Saber Discord server."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a SABER file in Beat Saber (Windows) or Open Saber VR (Windows). To use a SABER file with Beat Saber, you must first download and install a plug-in that allows you to import custom sabers.",
      "For example, you can download and install Beat Saber Mod Manager and select the Custom Sabers option during installation to use that program to import custom sabers. After you install Beat Saber Mod Manager, a Custom Sabers directory will appear in Beat Saber's Beat Saber directory. Place your SABER files in that directory, and they will appear in-game on the Custom Saber menu."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/saber",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.075Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.075Z"
}