{
  "slug": "sall",
  "extension": "sall",
  "name": "SimplySync Backup Configuration File",
  "summary": "Learn about .SALL files and view a list of programs that open them.",
  "developer": "Carifred Windows Software",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11950&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "SimplySync Backup is a program that allows Windows users to create copies of their files and store those copies on a separate hard drive or server. After a user specifies what files they want to back up and where the backups should be stored, they can save those settings in a SALL file. The user can then load their SALL file in SimplySync Backup to perform the same backup operation again at a later time, such as after the user has added or edited files stored in a backed-up folder.",
      "While SALL files are used to perform backup operations, they do not contain any backed-up files or data. They contain only the settings used to create backups. As such, you cannot use a SALL file to restore backed-up data. You can, however, open your SALL file in SimplySync Backup and use the file as a reference if you've forgotten where you saved your backups."
    ]
  },
  "more_information": {
    "description": [
      "A SALL file is a backup configuration file created by SimplySync Backup, a data backup application for Windows. It contains settings that specify what files a backup operation will back up and where the backed-up files will be stored. SALL files do not themselves contain any backed-up data."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a SALL file, view the backup settings it contains, and use it to perform a backup operation in SimplySync Backup (Windows). To do so, either drag your SALL file to the SimplySync Backup icon or desktop shortcut, or open the program and select the Open button."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/sall",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.752Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.752Z",
  "category": "other",
  "related": [],
  "containers": []
}