{
  "slug": "sami",
  "extension": "sami",
  "name": "Grand Theft Auto San Andres Mod Installer File",
  "summary": "Learn about .SAMI files and view a list of programs that open them.",
  "developer": "cpmusick",
  "category": "video",
  "category_slug": "video",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=8771&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "The San Andreas Mod Installer program makes adding modifications such as extra cars, new maps, custom missions, and miscellaneous other original modifications to the Grand Theft Auto San Andreas game easy, and without the user having to edit the game files themselves."
    ]
  },
  "more_information": {
    "description": [
      "A file with the extension “.sami” typically refers to a Subtitles And Metadata Interchange (SAMI) file. SAMI is a captioning format used for displaying subtitles or closed captions in videos. It was originally developed by Microsoft for their Windows Media Player.\n\nSAMI files contain timing information and text content for subtitles or closed captions, allowing them to be synchronized with a video playback. The format supports basic formatting options such as font style, color, and positioning of the subtitles on the screen.\n\nSAMI files are usually plain text files and can be opened and edited using a text editor. The contents of a SAMI file typically include a header section that provides information about the file, followed by individual subtitle entries with their respective timing and text.\n\nHere’s an example of what a SAMI file might look like:\n\n<SAMI> <HEAD> <TITLE>Example Subtitles</TITLE> </HEAD> <BODY> <SYNC Start=100><P Class=ENCC>Subtitle 1</P></SYNC> <SYNC Start=500><P Class=ENCC>Subtitle 2</P></SYNC> <SYNC Start=1000><P Class=ENCC>Subtitle 3</P></SYNC> </BODY> </SAMI>\n\nSAMI files are commonly used in conjunction with video players or media players that support subtitle display, such as Windows Media Player or VLC Media Player. The player reads the SAMI file and synchronizes the subtitles with the video content, allowing viewers to read the captions while watching the video.",
      "Backup file created by San Andreas Mod Installer, a modification installer for the PC version of the popular open-world action-adventure video game Grand Theft Auto: San Andreas; file contains the custom modifications the user can create for use in the game, including automatic vehicle replacements (such as replacing a certain make of vehicle with another), or other modifications made to custom vehicles."
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/video/sami/index.html",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-01T22:32:42.285Z"
    },
    {
      "url": "https://fileinfo.com/extension/sami",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.285Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.285Z",
  "containers": []
}