{
  "slug": "sbpage",
  "extension": "sbpage",
  "name": "Storybook Creator 4 Page",
  "summary": "Learn about .SBPAGE files and view a list of programs that open them.",
  "developer": "Creative Memories",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13668&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Storybook Creator is a program that allows you to design pages (SBPAGES in version 4 of the software) of a scrapbook, photo book, or wall calendar with text, photos, shapes, and other elements. You can then export the pages to be preserved digitally or printed and combined with other pages into a scrapbook, calendar, or another type of commemorative item.",
      "NOTE: Creative Memories discontinued the development of Storybook Creator in 2014 as FOREVER acquired it and transformed it into Artisan software."
    ]
  },
  "more_information": {
    "description": [
      "An SBPAGE file is a scrapbook page created by version 4 of the now-discontinued Creative Memories Storybook Creator scrapbook designing software. It is a Zip-compressed archive that contains the content of a page, including text, shapes, and images, and metadata describing the page. FOREVER Artisan replaced Creative Memories software and introduced .ARTPAGE files and .A6PAGE files to replace SBPAGE files with versions 5 and 6 of Artisan software."
    ]
  },
  "how_to_open": {
    "instructions": [
      "While Storybook Creator is discontinued and no longer available, you can open SBPAGE files with FOREVER Artisan in Windows. For example, you can open an SBPAGE file with version 5 and 6 of Artisan by selecting File → Open."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "FOREVER Artisan can convert SBPAGE files to various file types, including the following formats:",
      ".JPG - JPEG Image",
      ".PNG - Portable Network Graphic",
      ".TIF - Tagged Image File Format",
      ".PDF - Portable Document Format",
      ".ARTPAGE - Artisan 5 Page",
      ".A6PAGE - Artisan 6 Page"
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/sbpage",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.079Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.079Z"
}