{
  "slug": "sc2map",
  "extension": "sc2map",
  "name": "Blizzard StarCraft 2 Map File",
  "summary": "Learn about .SC2MAP files and view a list of programs that open them.",
  "developer": "Blizzard Entertainment",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=5142&b=1"
      },
      {
        "name": "Blizzard Starcraft 2",
        "url": "https://fileinfo.com/software/blizzard/starcraft_2"
      }
    ]
  },
  "technical_info": {
    "content": [
      "StarCraft II maps can contain the following types of data:",
      "Terrain: Includes brush, roads, cliffs, foliage, water, and miscellaneous objects; may be raised or lowered, and noise and smoothing effects can be added.",
      "Units: Includes Terran, Protoss, and Zerg units and structures, as well as resources (mineral fields and vespene geysers), miscellaneous shapes, and destructible objects.",
      "Doodads: Includes various objects that add variety to the map, such as cliff spires, lava, crystals, trees, flood lights, artifacts, statues, temple building blocks, and others.",
      "Points: Includes player starting points, sound emitters, and 2D and 3D points that can be referenced by triggers or other objects.",
      "Regions: Used for setting rectangular or circular regions that have certain predefined properties.",
      "Cameras: Allows users to place overhead or first-person perspective cameras throughout the map for creating cinematic sequences with triggers.",
      "Pathing: Enables map developers to set static or dynamic paths, as well as no-fly zones and blockage points; used by the game's artificial intelligence for routing units.",
      "Triggers: Allows users to specify events that occur when something happens; for example, if a base is destroyed, the map creator could trigger a cinematic sequence.",
      "Text: Enables map creators to set map text with fonts, colors, images, and gradients.",
      "The StarCraft II Editor (also called the \"Galaxy Editor\") can be used to create custom maps that are playable in Starcraft II. The editor is included with the StarCraft II installation.",
      "NOTE: The StarCraft II Editor requires you to authenticate with a valid Battle.net account before you can edit and save StarCraft II maps."
    ]
  },
  "more_information": {
    "description": [
      "Game map used by StarCraft II: Wings of Liberty, a real-time strategy (RTS) game created as the sequel to StarCraft; contains the map name, author, description, size, terrain, units, triggers, pathing settings, and player starting points, as well as various objects; can be used for single player or multiplayer games."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/sc2map",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.080Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.080Z"
}