{
  "slug": "schdoc",
  "extension": "schdoc",
  "name": "Altium Designer Schematic Document",
  "summary": "Learn about .SCHDOC files and view a list of programs that open them.",
  "developer": "Altium",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13528&b=1"
      },
      {
        "name": "Altium Designer",
        "url": "https://fileinfo.com/software/altium/designer"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Electrical engineers and other PCB designers use Altrium Designer to mock up and test PCBs. While designing a PCB project, a designer can create one or more schematic sheets, which show that PCB project's components and connections in an easy-to-understand graphical format. These schematic sheets are saved within an SCHDOC file.",
      "If a designer wants to share their project's schematic sheets with others (e.g., for review purposes), they can export the project's SCHDOC file. Other designers can then open the SCHDOC file in Altium Designer or in one of Altium's free SCHDOC viewer applications."
    ]
  },
  "more_information": {
    "description": [
      "An SCHDOC file is a schematic document created by Altium Designer, a printed circuit board (PCB) design application. It is comprised of one or more schematic sheets, which show a PCB's layout. When opened in Altium Designer or Altium Designer Viewer, each of an SCHDOC's sheets appears as a separate tabbed document, which PCB designers can select and view."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an SCHDOC file with Altium Designer (Windows), Altium Designer Viewer (Windows), or Altium 365 Viewer (Web). In Altium Designer, you can view and edit an SCHDOC file's contents. In Altium Designer Viewer and Alrium 365 Viewer, you can only view an SCHDOC file's contents."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/schdoc",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.084Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.084Z"
}