{
  "slug": "sdfi",
  "extension": "sdfi",
  "name": "Softing Data File",
  "summary": "Learn about .SDFI files and view a list of programs that open them.",
  "developer": "Softing Industrial",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13099&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Softing Industrial is a software and hardware manufacturer that specializes in connecting and standardizing data transfers between a variety of industrial automation devices. Softing's dataFEED exporter allows Siemens TIA users to export their project files in the SDFI format. Users can then import these SDFI files into Softing apps that connect to Siemens and other companies' automation controllers.",
      "SDFI files are encrypted and can be opened only with Softing applications. They contain information about the special designations, structure, and variable data types used by an automation controller."
    ]
  },
  "more_information": {
    "description": [
      "An SDFI file is an encrypted data file created by Softing Industrial dataFEED exporter. It contains a Siemens Totally Integrated Automation (TIA) project, exported from TIA for use with Softing applications. SDFI files can be imported into Softing Industrial products such as edgeConnectors, uaGates, or the dataFEED OPC Suite."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can import SDFI files into many Softing Industrial products and applications, such as edgeConnectors, uaGates, or the dataFEED OPC Suite. For specific instructions, refer to each application's documentation."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/sdfi",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.089Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.089Z"
}