{
  "slug": "sdtid",
  "extension": "sdtid",
  "name": "SecurID Soft Token File",
  "summary": "Learn about .SDTID files and view a list of programs that open them.",
  "developer": "RSA",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10462&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Tokens are used to authorize a user to gain access to a computer system or secure location. A soft token, or \"virtual token,\" is generated and sent to authorized users to verify that their device can be used within a secure network or access the server. The SDTID is used by RSA to store and distribute tokens to authorized users to allow them to gain access to a network.",
      "The primary way to distribute the SDTID files is by email or download from a secure site, which requires you to log in. You must download the RSA SecurID Software Token program in order to authenticate your identity and access the specific network.",
      "You can convert SDTID file to a compressed token format (CTF) string to be used on mobile devices, such as Android and iOS phone or tablets. You can convert the SDTID file using the RSA Software Token Converter."
    ]
  },
  "more_information": {
    "description": [
      "An SDTID file is a soft token file used by RSA SecurID Software Token, an application used to authenticate a user's identity and manage their access to a network. It contains token data which includes the token profile name, device type, token code duration, token code digit length, authentication type, delivery method, and device specific attributes. SDTID files are typically encrypted with 128-bit (AES) encryption and distributed in .ZIP files."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/sdtid",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.090Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.090Z"
}