{
  "slug": "sec",
  "extension": "sec",
  "name": "PGP Secret Key Ring",
  "summary": "Learn about .SEC files and view a list of programs that open them.",
  "developer": "Broadcom",
  "category": "video",
  "category_slug": "video",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1569&b=1"
      },
      {
        "name": "FFmpeg",
        "url": "https://fileinfo.com/software/ffmpeg/ffmpeg"
      },
      {
        "name": "Microsoft Windows with USB connection",
        "url": "https://fileinfo.com/software/microsoft/windows"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Phil Zimmermann initially developed Pretty Good Privacy (PGP) encryption software in 1991 to provide strong encryption for securing email communication and file transfers for people concerned with privacy. Ownership of PGP changed over the years, with several companies, including Symantec, continuing to develop the software. However, Broadcom, which acquired it in 2019, now maintains it.",
      "PGP encryption uses a pair of keys, a private key and a public key, which work together to secure information. The public key is shared with others and used to encrypt messages or files intended for you. The private key stored in the SEC file is kept secret and used to decrypt those messages or files.",
      "NOTE: SEC files are often called \"secret key rings\" since they can store multiple private keys in one file. Because of their importance, people typically protect SEC files with a passphrase to prevent unauthorized access."
    ]
  },
  "more_information": {
    "description": [
      "A SEC file is a video file that is created with Samsung DVR surveillance system. Video is captured from surveillance cameras and stored to disc in SEC format. The recorded SEC video can be played back with Samsung’s video software that can manage video feed from multiple cameras.",
      "An SEC file is a data file that contains private encryption keys used by Pretty Good Privacy (PGP) encryption software, which are necessary for decrypting messages or files encrypted using a corresponding public key. SEC files may also store key metadata, such as creation and expiration dates, and be passphrase-protected."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open SEC files with Broadcom Symantec PGP Desktop. You can also open the files with GnuPG, an open-source implementation of the OpenPGP standard."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "SEC file can be converted to the standard AVI file format using FFmpeg.\n\nffmpeg -i 0010600.sec -vcodec copy -vsync drop -fflags genpts -f avi 0010600.avi"
    ]
  },
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/video/sec/",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-02T02:43:26.534Z"
    },
    {
      "url": "https://fileinfo.com/extension/sec",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.534Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.534Z"
}