{
  "slug": "self",
  "extension": "self",
  "name": "Signed Executable and Linkable Format",
  "summary": "Learn about .SELF files and view a list of programs that open them.",
  "developer": "Sony",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12266&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Instead of including common PS3 and Vita functions in their apps and games, developers can instead reference a relevant SELF file. This saves developers the time of writing and testing the function themselves. It also allows developers to create smaller apps (because they can reference SELF files instead of adding additional code to their app).",
      "The PS3 and Vita include many SELF files. Updates sometimes install updated or new SELF files, which include updated or new functions that developers' apps and games might reference.",
      "NOTE: .SPRX files are similar to SELF files."
    ]
  },
  "more_information": {
    "description": [
      "A SELF file is a code library used by the Sony PlayStation 3 (PS3) or PlayStation Vita. It contains drivers and functions that can be referenced and run by multiple PS3 or Vita apps and games. The PS3 and Vita use SELF files similarly to how Windows uses .DLL files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "SELF files are not meant to be opened. The most common interaction gamers have with SELF files is installing them as part of the setup for RPCS3 (Windows, Linux), a PC-based PlayStation 3 emulator."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/self",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.761Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.761Z",
  "category": "other",
  "related": [],
  "containers": []
}