{
  "slug": "sgf",
  "extension": "sgf",
  "name": "Smart Game Format File",
  "summary": "Learn about .SGF files and view a list of programs that open them.",
  "developer": "Anders Kierulf",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10346&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "SGF files contain game records in the form of properties and property values to describe features of the game. Some examples of information stored in the file include the date of the game, version of the SGF specification, locations of black and white stones on the board, moves by the black and white players, time limit of the game, ranking of the player and team, and the place where the game was played.",
      "The SGF format was originally developed in 1987 by Anders Kierulf as the Smart Go Format. It was used to save game records for SmartGo, a program used to play the Go board game. Go was created in ancient China as a two player abstract strategy game where black and white stones are placed on grid line intersection points in order to surround a larger total area than your opponent. The game is widely played in China, Japan, and Korea. The Smart Go Format was later extended to other games and the name changed to Smart Game Format."
    ]
  },
  "more_information": {
    "description": [
      "An SGF file is a board game record file saved in the Smart Game Format and used by various board game programs, most popularly, SmartGo. It contains information about board games played between two players and board markup and variations. SGF files are saved in plain text making them easy to share by email, post in forums, and to upload in web programs."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/sgf",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.096Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.096Z"
}