{
  "slug": "shs",
  "extension": "shs",
  "name": "Microsoft Scrap File",
  "summary": "Learn about .SHS files and view a list of programs that open them.",
  "developer": "Microsoft",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=517&b=1"
      },
      {
        "name": "Microsoft Word 365",
        "url": "https://fileinfo.com/software/microsoft/word"
      },
      {
        "name": "Microsoft Excel 365",
        "url": "https://fileinfo.com/software/microsoft/excel"
      }
    ]
  },
  "technical_info": {
    "content": [
      "SHS files are special OLE object files and cannot be opened directly. They can only be dragged into another open document. When SHS files are created, an associated icon is placed on the desktop. If this icon is deleted, the scrap file is also deleted.",
      "Support for scrap files was discontinued with Windows Vista. Earlier versions of Windows included the Windows Shell Scrap Object Handler, which is stored in the file shscrap.dll. This file handled the drag and drop operations to and from Word and Excel documents to create SHS files. However, SHS files cannot be opened in Windows Vista, Windows 7, or Windows 8, since these Windows versions do not include the handler.",
      "NOTE: SHS files typically have a hidden .shs file extension. Be careful when opening them since they are executable and have been known to contain viruses."
    ]
  },
  "more_information": {
    "description": [
      "An SHS file is a file created by Microsoft Word and Excel when a user drags and drops selected document text onto the desktop. It contains a copy of the highlighted contents in its native document format. SHS files are used to save copied portions of a document for insertion into another document."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/shs",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.100Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.100Z"
}