{
  "slug": "sii",
  "extension": "sii",
  "name": "SCS Software Game Data",
  "summary": "Learn about .SII files and view a list of programs that open them.",
  "developer": "SCS Software",
  "programs": {
    "windows": [
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=5993&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "SCS Software is a video game developer known primarily for publishing the Truck Simulator series, which includes Euro Truck Simulator, UK Truck Simulator, and American Truck Simulator. All of SCS Software's truck-related video games use SII files, which store various game data.",
      "Some SII files, such as controls.sii, contain plain text data. Players can open and edit these files in any text editor to customize the related game. Other SII files, such as profile.sii, are saved as binary files by default.",
      "However, players can choose to save some binary SII files as encrypted plain text files, to make them editable. For example, if a player sets Euro Truck Simulator 2's g_save_format configuration parameter (found in the game's config.cfg file) to 2, the game will begin saving game.sii, which contains a player's saved game data, as an encrypted plain text file instead of a binary file. The player can then use the third-party SII_DECRYPT utility to decrypt game.sii, turning it into a normal plain text file (which can be opened and edited in any text editor)."
    ]
  },
  "more_information": {
    "description": [
      "An SII file is a game data file used by SCS Software truck driving games and simulators, such as 18 Wheels of Steel: Haulin' and Euro Truck Simulator. SII files contain a variety of game data, such as truck properties, saved game data, player settings, and mod configurations. Some SII files contain data saved as plain text, while others contain binary data."
    ]
  },
  "how_to_open": {
    "instructions": [
      "If your SII file contains plain text data, you can open it with Microsoft Notepad, Apple TextEdit, or any other text editor, to view and edit the data it contains. If the plain text data your SII file contains is encrypted, you may first have to decrypt it with SII_DECRYPT.",
      "If your SII file contains binary data, it is not meant to be opened or edited."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/sii",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.101Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.101Z"
}