{
  "slug": "sky",
  "extension": "sky",
  "name": "Emulated Skylander Character or Item",
  "summary": "Learn about .SKY files and view a list of programs that open them.",
  "developer": "N/A",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13364&b=1"
      },
      {
        "name": "Dolphin",
        "url": "https://fileinfo.com/software/dolphin/dolphin"
      },
      {
        "name": "Adobe Photoshop 2025",
        "url": "https://fileinfo.com/software/adobe/photoshop"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Skylanders is a series of adventure video games that is paired with an accompanying toy line. To play as new characters in Skylanders, players place a toy representing that character on the Skylanders Portal (aka Portal of Power), a peripheral device connected to their gaming console or PC.",
      "Players playing Skylanders in a video game console emulator may not own or be able to use a Skylanders Portal. For this reason, some emulators, including RPCS3 and Dolphin, include built-in systems that emulate the Portal. RPCS3 was the first emulator to include this built-in version of the Skylanders Portal; it supports creating and loading Skylanders saved as SKY files.",
      "When a Skylander saved as a SKY file levels up or collects coins, that progress is saved to the SKY file. This allows players to load their leveled-up Skylanders while playing different games in different emulators."
    ]
  },
  "more_information": {
    "description": [
      "A SKY file contains data used to load a Skylander (or item) while playing a Skylander video game in a PC-based emulator, such as RPCS3 or Dolphin. Using SKY files allows players to load Skylanders without a connection to a Skylanders Portal. Players can create their own SKY files with RPCS3, or they can download pre-existing SKY files from the internet."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can load a SKY file while playing a Skylanders video game in RPCS3 or Dolphin. In RPCS3, select Manage → Skylanders Portal to access the portal-related menu and load your SKY file. In Dolphin, select Tools → Emulated USB Devices → Skylanders Portal to access the portal-related menu and load your SKY file."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/sky_13365.jpg",
      "alt": "Screenshot of a .sky file in Adobe Photoshop",
      "caption": "SKY file open in Adobe Photoshop"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/sky",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.775Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.775Z",
  "category": "other",
  "related": [],
  "containers": []
}