{
  "slug": "slbk",
  "extension": "slbk",
  "name": "Smart Launcher Home Screen Backup",
  "summary": "Learn about .SLBK files and view a list of programs that open them.",
  "developer": "Smart Launcher Team",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12457&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Smart Launcher is an Android app that allows users to customize their home screen. For example, Smart Launcher users can create an Android home screen in which their apps are grouped by category.",
      "If a Smart Launcher user wants to back up and/or share their custom home screen with another user, they can save the screen as an SLBK file. The SLBK file contains the theme, wallpaper, icon packs, widget settings, and app page settings used on a user's home screen. It does not contain any Android application or user data (i.e. it does not contain a backup of your device's files)."
    ]
  },
  "more_information": {
    "description": [
      "An SLBK file is a home screen layout created using Smart Launcher, a home screen replacement app for Android. It contains data Smart Launcher uses to load and display a custom home screen."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an SLBK file in Smart Launcher (Android) to use as your Android device's home screen. To do so:",
      "Install Smart Launcher.",
      "Locate your SLBK file in Files or another Android file manager.",
      "Tap your SLBK file, select Open With, and then select Smart Launcher."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/slbk",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.106Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.106Z"
}