{
  "slug": "sn2",
  "extension": "sn2",
  "name": "Drive Snapshot Backup Continuation 2",
  "summary": "Learn about .SN2 files and view a list of programs that open them.",
  "developer": "Tom Ehlert",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=3061&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Using Drive Snapshot, Windows users can create backup copies of their drives. They can then use Drive Snapshot to retrieve or restore these backups' contents if needed.",
      "If a drive's contents are large enough, Drive Snapshot will split those contents across multiple backup files: a primary SNA file and one or more backup continuation files. The continuation files use the same base filename as their associated SNA file, but the .sn1, .sn2, and so on extensions.",
      "Users cannot view or restore data from continuation files alone. Instead, they must gather a backup's SNA file and all its continuation files and place them in the same directory, before attempting to view or restore data from their backup."
    ]
  },
  "more_information": {
    "description": [
      "An SN2 file is a backup continuation file created by Drive Snapshot, a Windows backup utility created by Tom Ehlert. It contains the third portion of a backup disk image created by Drive Snapshot. SN2 files are always associated with accompanying .SNA and .SN1 files, and they may be associated with additional SN# continuation files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can use Drive Snapshot (Windows) to view and restore the files an SN2 file contains. To do so, you will need the SN2 file's accompanying SNA and SN1 files, as well as any other continuation files included in the backup (such as an SN3, SN4, etc. file).",
      "After you've placed all the files associated with your Drive Snapshot backup in the same directory, open Drive Snapshot and select either Restore Disk from File, to restore your backup's contents, or View contents of saved Disk Image, to view your backup's contents. Then, browse to your SNA file and restore or view your backup's contents."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/sn2",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.110Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.110Z"
}