{
  "slug": "spi",
  "extension": "spi",
  "name": "ShadowProtect Incremental Backup File",
  "summary": "Learn about .SPI files and view a list of programs that open them.",
  "developer": "StorageCraft",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=4444&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "StorageCraft ShadowProtect is a program system administrators can use to back up the current state and contents of a computer's hard drive, or hard disk. ShadowProtect saves backup disk images as SPF and SPI files.",
      "An SPF file contains the entirety of a disk's contents at the time it was initially backed up. SPI files contain only the changes made to a disk since the last time it was backed up. The changes an SPI file contains are referred to as an incremental backup.",
      "Incremental backups can be used to restore a disk to its state at the time the incremental backup was created. However, they must be combined with an SPF file and, sometimes, other SPI files to do so. For example, if you created an SPF backup and two SPI incremental backups, and you wanted to restore your system to its state at the time you created the second incremental backup, you would need your SPF file and both SPI files. ShadowProtect could then apply the changes saved in both SPI files to your SPF file as it restored your system."
    ]
  },
  "more_information": {
    "description": [
      "An SPI file is a backup file created by StorageCraft ShadowProtect, a backup and disaster recovery program available for Windows. It contains incremental backup data that can be combined with an .SPF file and previous SPI files to restore a system's data."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can use the Explore Backup Wizard included in StorageCraft ShadowProtect (Windows) to mount the backup disk image an SPI file contains. Remember that, to use an SPI file as a backup disk image, you will need access to the SPI file's corresponding SPF file, as well as any additional SPI files created in the time between your SPI and SPF file's creation. For more information, refer to StorageCraft's official support documentation."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/spi",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.782Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.782Z",
  "category": "other",
  "related": [],
  "containers": []
}