{
  "slug": "spm",
  "extension": "spm",
  "name": "SuperTuxKart 3D Model",
  "summary": "Learn about .SPM files and view a list of programs that open them.",
  "developer": "SuperTuxKart Team",
  "programs": {
    "windows": [
      {
        "name": "Blender",
        "url": "https://fileinfo.com/software/blender/blender"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12202&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "SuperTuxKart is a kart racing game available for Windows, macOS, Linux, Android, and the Nintendo Switch. Because SuperTuxKart is an open-source project, players can download, examine, and modify the game's source code. Among other things, SuperTuxKart's source code contains 3D models used to show karts, racetracks, and other objects in-game. These models are saved as SPM files.",
      "SPM files comprise only a portion of an in-game object. To show a finalized object, SPM files are combined with PNG files that contain textures (or skins) and XML files that detail how SuperTuxKart applies those textures. If a player wants to modify a SuperTuxKart object's appearance (e.g. they want to add larger wheels to a kart), they can do so by opening and editing the object's SPM and PNG files (and if necessary, its XML file)."
    ]
  },
  "more_information": {
    "description": [
      "An SPM file is a 3D model used by SuperTuxKart, a free, open-source kart racing game. It contains a collection of polygons, known as a mesh, that serves as the skeleton of an in-game object, such as a kart or racetrack. SPM files are typically paired with .XML files and .PNG files, which SuperTuxKart uses to apply textures to the SPM file."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an SPM file in Blender (cross-platform) with the stk-blender add-on (cross-platform) installed. The stk-blender add-on allows SuperTuxKart modders to import SPM files into Blender and export models from Blender in the SPM format."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/spm",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.117Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.117Z"
}