{
  "slug": "spryzip",
  "extension": "spryzip",
  "name": "LumaFusion Legacy Project",
  "summary": "Learn about .SPRYZIP files and view a list of programs that open them.",
  "developer": "LumaTouch",
  "programs": {
    "windows": [
      {
        "name": "Apple Archive Utility",
        "url": "https://fileinfo.com/software/apple/archive_utility"
      },
      {
        "name": "7-Zip",
        "url": "https://fileinfo.com/software/igor_pavlov/7-zip"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12563&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "LumaFusion is an iPad-optimized video editor that allows you to combine multiple video and audio tracks into a polished movie. In the past, LumaFusion allowed users to save video editing projects as SPRYZIP files.",
      "SPRYZIP files are Zip-compressed files that contain all of a project's assets (imported video, audio, and image files). The files also include a record of the project's cuts, transitions, effects, and levels. Because each SPRYZIP file contains all of a project's data, you can easily transfer a project between devices and users by saving and sharing it as a SPRYZIP file.",
      "For example, if you want to open a LumaFusion project you created on your Mac in the iPad version of LumaFusion, you can do so by:",
      "Exporting the project as a SPRYZIP file.",
      "Transferring the file to your iPad.",
      "Opening the file in the iPad version of LumaFusion."
    ]
  },
  "more_information": {
    "description": [
      "A SPRYZIP file is a video editing project created by LumaFusion, a multitrack video editor available for macOS and iOS. It contains a copy of the video, audio, and other assets used in the project, as well as the project's timeline data. In more recent versions of LumaFusion, SPRYZIP files have been replaced by .LFPACKAGE files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a SPRYZIP file in LumaFusion (Mac, iOS). After you do, LumaFusion will show the video editing project your SPRYZIP file contains.",
      "If necessary, you can also use any Zip-decompression utility, such as Apple Archive Utility (Mac) or 7-Zip (Windows), to extract the videos, audio, and other files your SPRYZIP file contains. Before doing so, you may have to rename the file's extension from .spryzip to .zip."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/spryzip",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.118Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.118Z"
}