{
  "slug": "sqx",
  "extension": "sqx",
  "name": "SQX Archive",
  "summary": "Learn about .SQX files and view a list of programs that open them.",
  "developer": "N/A",
  "category": "compression",
  "category_slug": "compression",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1931&b=1"
      }
    ]
  },
  "more_information": {
    "description": [
      "SQX file is typically associated with SQX Archiver which is file compression and archiving utility. SQX Archiver is alternative to other popular compression formats like ZIP or RAR.\n\nSQX Archiver uses its own proprietary compression algorithm to reduce file sizes and create compressed archives. It offers various compression levels and options to balance compression efficiency and processing speed. The resulting “.sqx” file contains compressed data and can be extracted using SQX Archiver or compatible software.\n\nTo work with “.sqx” file, you will need a software program that supports SQX format. SQX Archiver itself is one such program. You can use it to compress files and create “.sqx” archives or extract files from existing “.sqx” archives.\n\nIf you have “.sqx” file and want to extract its contents, you can use SQX Archiver or alternative utility that supports the SQX format. These programs typically provide options to browse the archive, select files for extraction and specify a destination folder for the extracted files.",
      "SQX Archiver uses a proprietary format for its “.sqx” files. The specific details of file format used by SQX Archiver may not be publicly available since it is a proprietary format. The file format includes information about compressed data, file metadata and any additional options or settings applied during the compression process.\n\nWhile the exact specifications of the SQX file format are not widely documented, the SQX Archiver software itself provides the necessary functionality to create and extract files from “.sqx” archives. To work with an “.sqx” file, you would typically use the SQX Archiver or a compatible utility that understands the SQX format.",
      "File archive compressed using the SQX Archiver, an open-source file compression tool; uses a variation of .LZH as its main compression algorithm; free to download and incorporate into other file compressors."
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/compression/sqx/index.html",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-01T22:32:42.287Z"
    },
    {
      "url": "https://fileinfo.com/extension/sqx",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.287Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.287Z",
  "containers": []
}