{
  "slug": "sqz",
  "extension": "sqz",
  "name": "Squeeze Project File",
  "summary": "Learn about .SQZ files and view a list of programs that open them.",
  "developer": "Sorenson Media",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=765&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Sorenson Squeeze was a video enhancement and conversion program available for Windows and macOS. It was discontinued in 2018.",
      "Squeeze supported a wide variety of input and output video file formats, as well as many additional conversion options. Users could specify their video's container, codec, aspect ratio, and more. Users could also create videos optimized for use with YouTube, Amazon Web Services, and other online services.",
      "When a user worked with a video in Squeeze, that video's settings and version history were saved in an SQZ file. SQZ files also contain references to the locations at which videos imported into Squeeze are stored. If a user moves a video referenced in an SQZ file, the file may not load correctly in Squeeze."
    ]
  },
  "more_information": {
    "description": [
      "An SQZ file is a project file created by Sorenson Squeeze, a program used to compress and convert videos to different file formats. It is an XML file that contains video encoding settings and a record of when and how a video was converted. SQZ files may also include settings for converting video using a cloud-based Squeeze Server. The files store only references to imported video files; they do not include actual video data."
    ]
  },
  "how_to_open": {
    "instructions": [
      "If you still have access to it, you can open an SQZ (Squeeze Project File) in Sorenson Squeeze (Windows, Mac). If you do not have access to Squeeze, you can open your SQZ file in any text editor, to view the XML-formatted text it contains."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/sqz",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.120Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.120Z"
}