{
  "slug": "srec",
  "extension": "srec",
  "name": "S-record File",
  "summary": "Learn about .SREC files and view a list of programs that open them.",
  "developer": "Motorola",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13276&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Motorola developed the S-record format in the 1970s for use with the Motorola 6800 microprocessor. Developers creating executable programs for the 6800 could convert those programs' source code to the S-record format. They could then flash the S-record, or SREC, file to a microprocessor to install the program it contained.",
      "Each SREC file contains a series of ASCII text records, each of which begins with the letter S (which stands for Start-of-Record). The records also consist of type, byte count, address, data, and checksum information. Each record is listed on its own line, to make SREC files easier to parse (for both humans and machines)."
    ]
  },
  "more_information": {
    "description": [
      "An SREC file is a data file saved in the Motorola S-record format. It contains ASCII hexadecimal values used to represent binary data. Most often, SREC files contain firmware that is meant to be flashed onto a microcontroller or other erasable programmable read-only memory (EPROM) device."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can use Peter Miller's SRecord package (multiplatform) to view summary information of and manipulate SREC files. You can also open an SREC file in any text editor, if you want to view the ASCII text records it contains. (You likely should not edit an SREC file in a text editor, as doing so may cause the program the file contains to function incorrectly.)"
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/srec_13276.png",
      "alt": "Screenshot of a .srec file in Microsoft Visual Studio Code",
      "caption": "SREC file open in Microsoft Visual Studio Code"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/srec",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.784Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.784Z",
  "category": "other",
  "related": [],
  "containers": []
}