{
  "slug": "srm",
  "extension": "srm",
  "name": "Super Nintendo ROM Save",
  "summary": "Learn about .SRM files and view a list of programs that open them.",
  "developer": "N/A",
  "programs": {
    "windows": [
      {
        "name": "Snes9x",
        "url": "https://fileinfo.com/software/snes9x/snes9x"
      },
      {
        "name": "ZSNES",
        "url": "https://fileinfo.com/software/zsnes/zsnes"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=2773&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Emulators create SRM files by storing an emulated game's current Saved RAM (SRAM) state in a file. Typically, this happens when a player uses a game's default Save option to save their game. Later, the player can use this file to resume their saved game. They can also share the file with other players, to allow those players to load the saved game.",
      "To load an SRM file, a player must possess a corresponding game ROM. For example, to load an SRM file created from the game The Legend of Zelda: A Link to the Past, a player must possess both the SRM file and an A Link to the Past ROM (likely stored in a .ZIP file). Also, both files must use the same filename (except their extensions)."
    ]
  },
  "more_information": {
    "description": [
      "An SRM file is a saved game created by a video game console emulator. Typically, it contains a Super Nintendo game save, which can be loaded in Snes9x, ZSNES, or another Super Nintendo emulator. However, on rare occasions, an SRM file may contain a saved game created from a video game for another platform, such as the Game Boy Advance or SEGA Genesis."
    ]
  },
  "how_to_open": {
    "instructions": [
      "If your SRM file contains a Super Nintendo game save, you can open it in Snes9x (multiplatform) or ZSNES (Windows, Linux). For example, to open an SRM file in Snes9x, place the file in the program's Saves directory. Then, open the corresponding game ROM, and use its in-game menu to load your saved game.",
      "If your SRM file contains a different type of game save, you should refer to your emulator's instructions for how to load that type of SRM file."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/srm",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.121Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.121Z"
}