{
  "slug": "stop",
  "extension": "stop",
  "name": "STOP Ransomware Encrypted File",
  "summary": "Learn about .STOP files and view a list of programs that open them.",
  "developer": "N/A",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12000&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "STOP ransomware, also known as STOP Djvu ransomware, is one of the most common types of ransomware. Typically, STOP ransomware encrypts users' files and produces a ransom message named _readme.txt, which contains instructions a user is supposed to follow to decrypt their files. The ransom message asks for a ransom of $980, unless the user contacts the ransomer in the first 72 hours after infection, in which case the ransom is halved to $490. Other variants of STOP ransomware append users' files with the .DJVU, .RUMBA, .RADMAN, .GERO, or .CADQ extensions.",
      "STOP ransomware is most commonly distributed within \"free programs\" that are actually adware and malware bundles. If you recently downloaded and installed a \"free program\" (especially one that is meant to be a copy of a paid program) from a software download website, that may be how your computer became infected by STOP ransomware."
    ]
  },
  "more_information": {
    "description": [
      "A STOP file is a file that has been encrypted by STOP ransomware, which is malware distributed by cybercriminals. It contains a file, such as a .DOCX or .PNG file, that the virus has renamed and encrypted. Some STOP files can be decrypted for free using Emsisoft Decryptor for STOP Djvu."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Because STOP files have been encrypted by ransomware, they cannot be opened. However, you can attempt to decrypt your STOP files using Emsisoft Decryptor for STOP Djvu. Read the instructions at the program's website carefully before attempting to decrypt your STOP files."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/stop",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.126Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.126Z"
}