{
  "slug": "storyboard",
  "extension": "storyboard",
  "name": "Xcode Interface Builder Storyboard",
  "summary": "Learn about .STORYBOARD files and view a list of programs that open them.",
  "developer": "Apple",
  "programs": {
    "windows": [
      {
        "name": "Apple Xcode",
        "url": "https://fileinfo.com/software/apple/xcode"
      },
      {
        "name": "Microsoft Visual Studio Code",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      },
      {
        "name": "GitHub Atom",
        "url": "https://fileinfo.com/software/github/atom"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=7590&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Interface Builder is an Apple Xcode component that allows developers to create application interfaces by dragging and dropping UI elements, rather than coding interfaces from scratch. Developers who are creating iOS applications can create and link multiple UI scenes together in a single STORYBOARD file. This allows them and other developers to view the app's workflows.",
      "To create a STORYBOARD file, developers select Storyboard in the User Interface: field while creating an iOS app project. Xcode then creates a main.storyboard file. Developers can also manually add a STORYBOARD to their iOS projects at any time by selecting File → New → New File... from Xcode's menu and choosing to create an iOS Storyboard file."
    ]
  },
  "more_information": {
    "description": [
      "A STORYBOARD file is a user interface (UI) storyboard created by Apple Xcode's Interface Builder. It contains one or more screen layouts, which are connected to show an app's event and UI flow. Developers create STORYBOARD files while developing iOS applications."
    ]
  },
  "how_to_open": {
    "instructions": [
      "STORYBOARD files are meant to be opened in Apple Xcode (Mac), as part of an Xcode project (.XCODEPROJ file). In Xcode, you can view a STORYBOARD file's contents as a visual storyboard or as XML. To change your view of the file's contents, right-click the file and select Open As → Xcode Storyboard or Open As → Source Code. (If your STORYBOARD file's contents always appear as source code, you need to Hide Code Review.)",
      "You can also view a STORYBOARD file's contents in the Mac version of Microsoft Visual Studio. After opening the project that contains your STORYBOARD file, right-click the file and select Open With → Xcode Interface Builder.",
      "Finally, you can view the XML a STORYBOARD file contains in Microsoft Visual Studio Code (multiplatform), GitHub Atom (multiplatform), or any other text or source code editor."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/storyboard",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.787Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.787Z",
  "category": "other",
  "related": [],
  "containers": []
}