{
  "slug": "t18",
  "extension": "t18",
  "name": "H&R Block 2018 Tax Return",
  "summary": "Learn about .T18 files and view a list of programs that open them.",
  "developer": "H&R Block",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11192&b=1"
      },
      {
        "name": "H&R Block Tax Software",
        "url": "https://fileinfo.com/software/hr_block/tax_software"
      }
    ]
  },
  "technical_info": {
    "content": [
      "When you begin a tax return in Tax Software you can choose to import data from a previous year by importing a .T17 file. You can also import tax information from your H&R Block account or another tax service, such as TurboTax or TaxAct. If you have no information to import you will be asked to enter your basic information and social security number. The software then guides you as you add other tax information, which includes any 2018 life changes, income, deductions, adjustments, and credits on the federal and state levels.",
      "When you choose to save your tax return, H&R Block Tax Software creates the T18 file to store your progress. The file allows you to close your tax return and resume it at a later time. Once you finish your tax return, you can electronically file it directly from H&R Block Tax Software or print and mail the return to the appropriate tax authorities.",
      "You may also use the T18 file as a backup of a tax return for archival purposes. To create a backup in Tax Software select File → Backup Tax Return....",
      "NOTE: The file extension appended on to H&R Block tax returns indicate the year of the return. T18 files store information for 2018 tax returns, .T17 files store information for 2017 tax returns, and so on."
    ]
  },
  "more_information": {
    "description": [
      "A T18 file is a tax return created by the 2018 version of H&R Block Tax Software, a Windows and macOS program used to complete tax returns in the U.S. It contains tax data, which includes 2018 state and federal tax forms and personal tax information entered by the user."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/t18",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.794Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.794Z",
  "category": "other",
  "related": [],
  "containers": []
}