{
  "slug": "t64",
  "extension": "t64",
  "name": "Commodore 64 Tape Image File",
  "summary": "Learn about .T64 files and view a list of programs that open them.",
  "developer": "Miha Peternel",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1632&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Commodore 64 supported various storage devices for transporting and loading data. Examples of supported devices include floppy disks, cartridges, and datasettes (data cassettes that were magnetic tape data storage devices).",
      "Miha Peternel developed the T64 format to store game or program data copied from a Commodore tape storage device. The T64 format is one of several formats utilized to store Commodore 64 games or programs that computer enthusiasts load in emulators to run the game or program. Other formats created by Commodore 64 enthusiasts include .G41, .D64, and .X64."
    ]
  },
  "more_information": {
    "description": [
      "A T64 file contains a game or program copied from a Commodore 64 tape storage device. It stores an exact copy of a game or program in the Commodore 64 Tape (T64) format, including a header, a directory of files stored on the tape, and the data for each file. T64 files are supported by select emulators of Commodore 64 (C64), a popular personal computer from the 1980s."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open T64 files with several emulators, including Vice (multiplatform), WinVICE (Windows), and CCS64 (Windows). You can also upload T64 files to C64 online emulator to run them in a web browser or run T64 files with Joerg Jahnke Mobile C64 on an Android device."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/t64_1632.png",
      "alt": "Screenshot of a .t64 file in VICE 3",
      "caption": "T64 file open in VICE 3"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/t64",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.795Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.795Z",
  "category": "other",
  "related": [],
  "containers": []
}