{
  "slug": "tasproj",
  "extension": "tasproj",
  "name": "BizHawk TAStudio Project",
  "summary": "Learn about .TASPROJ files and view a list of programs that open them.",
  "developer": "TASVideos",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11748&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "BizHawk is a multi-system video game emulator available for Windows and Linux. In addition to providing normal emulation features, BizHawk also includes a variety of tools that tool-assisted speedrun (TAS) creators can use to create, edit, and save speedruns.",
      "TAStudio is one of those tools. It allows TAS creators to record, manually edit, and save speedrun inputs. In this way, TAS creators can fine-tune their speedruns, deleting extraneous inputs and streamlining characters' progress through levels.",
      "When TAS creators save a speedrun in TAStudio, they save it as a TASPROJ file. After a TAS creator has finished editing their speedrun, they can use their TASPROJ file to play the speedrun within BizHawk."
    ]
  },
  "more_information": {
    "description": [
      "A TASPROJ file is a project file created in TAStudio, a tool-assisted video game speedrun editor included in BizHawk. It contains an editable video game input file that is used to create a tool-assisted speedrun. TASPROJ files can be opened and edited only in TAStudio."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a TASPROJ file in TAStudio, which is included with BizHawk. To do so:",
      "Download and install BizHawk (using the link provided below).",
      "Open TAStudio (by opening BizHawk and selecting Tools → TAStudio).",
      "In TAStudio, select File → Open... and open your TASPROJ file."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/tasproj",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.797Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.797Z",
  "category": "other",
  "related": [],
  "containers": []
}