{
  "slug": "tax18",
  "extension": "tax18",
  "name": "TurboTax 2018 Tax Return File",
  "summary": "Learn about .TAX18 files and view a list of programs that open them.",
  "developer": "Intuit",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11893&b=1"
      },
      {
        "name": "Intuit TurboTax",
        "url": "https://fileinfo.com/software/intuit/turbotax"
      }
    ]
  },
  "technical_info": {
    "content": [
      "TurboTax is a tax return application used to prepare and file U.S. State and Federal tax returns. The software is available as a downloadable desktop version for Windows and macOS, and as a web version called TurboTax Online.",
      "NOTE: TAX18 files are rare since the 2018 desktop version of TurboTax saves tax returns as TAX2018 files by default."
    ]
  },
  "more_information": {
    "description": [
      "A TAX18 file is a tax return created by the desktop version of Intuit TurboTax 2018, a program used to complete tax returns in the U.S. It contains state and federal tax forms and personal information entered by the user. TAX18 files are the same as the more common .TAX2018 files but are instead saved with the .tax18 file extension."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a TAX18 file with the desktop version of Intuit TurboTax (2018 or later), which is available for both Windows and macOS. To open a TAX18 file, select File → Open Tax Return.",
      "You can also upload a TAX18 file to Intuit TurboTax Online when uploading your tax data from the previous year. For example, you can upload a TAX18 file to TurboTax Online when filing your taxes for the 2019 calendar year (but not the 2020 year). To open a TAX18 file with TurboTax Online, select Tax Tools → Tools, click \"Transfer last year's TurboTax return from your computer,\" then follow the prompts to upload the file."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/tax18",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.142Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.142Z"
}