{
  "slug": "tax2021",
  "extension": "tax2021",
  "name": "TurboTax 2021 Tax Return",
  "summary": "Learn about .TAX2021 files and view a list of programs that open them.",
  "developer": "Intuit",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12479&b=1"
      },
      {
        "name": "Intuit TurboTax",
        "url": "https://fileinfo.com/software/intuit/turbotax"
      }
    ]
  },
  "technical_info": {
    "content": [
      "TurboTax is a tax return application used to prepare and file U.S. Federal and State tax returns. It is available as a downloadable desktop version for Windows and macOS and a web version called TurboTax Online.",
      "When preparing a tax return with the desktop version of TurboTax, you can save your progress in a TAX2021 file. It is a working file, which means you can save the TAX2021 file, close it, then re-open it to modify the tax return further.",
      "You may also download a TAX2021 file from TurboTax Online when you export your tax information. This is useful when archiving your tax return on a storage device or for transferring your return to the desktop version of TurboTax.",
      "NOTE: TAX2021 files are typically created in 2022 since annual tax returns are filed for the previous year.",
      "To create a TAX2021 file with the desktop version of TurboTax, select File → Save..., choose your save options, then click Save.",
      "To export a TAX2021 file from TurboTax Online, click Tax Tools → Tools then select \"Save your 2021 return to your computer,\" which initiates the download of the TAX2021 file (taxReturn.tax2021).",
      "After downloading the TAX2021 file, you can open it with the desktop version of TurboTax. Keep in mind that if you make any modifications to the return in TurboTax Online, the application does not sync the changes to the TAX2021 file, which means you must export the tax return again.",
      "If you prepared your tax return with the 2020 version of TurboTax and saved your information as a .TAX2020 file, you can import it into the 2021 desktop version of TurboTax. To do this, select \"Use a tax return that's on my computer\" when prompted at the beginning of the tax return process, then select the TAX2020 file. You can also select File → Open Tax Return..., then choose the TAX2020 file."
    ]
  },
  "more_information": {
    "description": [
      "A TAX2021 file contains a United States tax return created with the 2021 version of Intuit TurboTax. It stores tax return information for the 2021 tax year, which typically includes personal data entered by a user, a federal IRS tax form, and one or more state forms. TAX2021 files may be created by the 2021 desktop version or exported and downloaded by the 2021 online version of TurboTax."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a TAX2021 file with the desktop version of Intuit TurboTax 2021 in Windows and macOS. To open a TAX2021 file, select File → Open Tax Return....",
      "You can also upload a TAX2021 file to Intuit TurboTax Online when uploading your tax data from the previous year. For example, you can upload a TAX2020 file, but not a TAX2021 file, to TurboTax Online when filing your taxes for the 2021 calendar year.",
      "However, if you are filing your 2022 taxes with TurboTax Online, you can upload a TAX2021 file. To open a TAX2021 file with TurboTax Online, select Tax Tools → Tools, click \"Transfer last year's TurboTax return from your computer,\" then follow the prompts to upload the file.",
      "NOTE: TurboTax users preparing their TAX2021 tax returns may encrypt them with password protection to protect their sensitive contents. You will only be able to open them by entering the correct password."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/tax2021_12479.png",
      "alt": "Screenshot of a .tax2021 file in Intuit TurboTax 2021",
      "caption": "TAX2021 file open in Intuit TurboTax 2021"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/tax2021",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.143Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.143Z"
}