{
  "slug": "tax2011",
  "extension": "tax2011",
  "name": "TurboTax 2011 Tax Return",
  "summary": "Learn about .TAX2011 files and view a list of programs that open them.",
  "developer": "Intuit",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=7085&b=1"
      },
      {
        "name": "Intuit TurboTax",
        "url": "https://fileinfo.com/software/intuit/turbotax"
      }
    ]
  },
  "technical_info": {
    "content": [
      "TAX2011 files contain data for the 2011 tax year. Therefore, most TAX2011 files are created in the 2012 calendar year. TurboTax can also import data from previous tax returns, such as a .TAX2010 file, when beginning a 2011 tax return.",
      "While Intuit TurboTax 2011 automatically saves tax returns with a \".tax2011\" extension, they can also be exported from TurboTax Online.",
      "To create a TAX2011 file with TurboTax Online, click the \"Save your 2011 return to your computer\" link in the lower-left corner of the browser window, then click \"Save.\" You can then choose an appropriate filename and select the destination where you would like to save the file. The exported file can then be opened and edited in TurboTax 2011.",
      "NOTE: Since TAX2011 files contain personal data, they can be password-protected for security purposes. If a tax return has been secured with a password, it can only be opened if the correct password is entered."
    ]
  },
  "more_information": {
    "description": [
      "Tax return created with TurboTax 2011, a U.S. tax preparation program for the 2011 tax year; contains user data and tax forms filled out using TurboTax 2011; may be filed electronically via e-file or printed and mailed when completed."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/tax2011",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.798Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.798Z",
  "category": "other",
  "related": [],
  "containers": []
}