{
  "slug": "tax2019",
  "extension": "tax2019",
  "name": "TurboTax 2019 Tax Return",
  "summary": "Learn about .TAX2019 files and view a list of programs that open them.",
  "developer": "Intuit",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11411&b=1"
      },
      {
        "name": "Intuit TurboTax",
        "url": "https://fileinfo.com/software/intuit/turbotax"
      }
    ]
  },
  "technical_info": {
    "content": [
      "You will most likely only encounter a TAX2019 file if you are using the desktop version of TurboTax in Windows or macOS to prepare your taxes. You may also acquire a TAX2019 file when you export tax information from TurboTax Online. To export a TAX2019 file from TurboTax Online, click Tax Tools → Tools then select \"Save your 2019 return to your computer,\" which initiates the download of the TAX2019 file (taxReturn.tax2019).",
      "After downloading the TAX2019 file, you can open it with the desktop version of TurboTax. However, if you make any modifications to the return in TurboTax Online, the changes are not synced to the TAX2019 file and must be exported again.",
      "If you have a .TAX2018 file with return information prepared by the 2018 version of TurboTax you can import it in the 2019 desktop version of TurboTax. To do this, select \"Use a tax return that's on my computer\" when prompted at the beginning of the tax return process, then select the TAX2018 file.",
      "NOTE: TAX2019 files are typically created in 2020 since annual tax returns are filed for the previous year."
    ]
  },
  "more_information": {
    "description": [
      "A TAX2019 file contains a United States tax return created with the 2019 version of Intuit TurboTax. It stores tax-related data, which may include personal information entered by a user, a federal IRS tax form, and one or more state forms for the 2019 tax year. Since TAX2019 files store sensitive data they may be encrypted and saved with password protection by the user preparing the return."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open TAX2019 files with the desktop version of Intuit TurboTax 2019 in Windows and macOS. To open a TAX2019 file, select File → Open Tax Return....",
      "You can also upload a TAX2019 file to Intuit TurboTax Online when uploading your tax data from the previous year. For example, you can upload a TAX2019 file to TurboTax Online when filing your taxes for the 2020 calendar year. To open a TAX2019 file with TurboTax Online, select Tax Tools → Tools, click \"Transfer last year's TurboTax return from your computer,\" then follow the prompts to upload the file."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/tax2019",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.143Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.143Z"
}