{
  "slug": "tbm",
  "extension": "tbm",
  "name": "Toribash Mod File",
  "summary": "Learn about .TBM files and view a list of programs that open them.",
  "developer": "Nabi Studios",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=3066&b=1"
      },
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "gedit",
        "url": "https://fileinfo.com/software/gedit/gedit"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Toribash is a 3D turn-based fighting game developed by Nabi Studios, where players control ragdoll-like characters by manipulating their joints and muscles to perform complex moves. Instead of preset attacks, players adjust individual body parts frame by frame to punch, kick, dodge, or throw their opponent.",
      "In Toribash, players can create or modify TBM files and use them to modify the game environment or character equipment during matches. For example, a TBM file might specify the shape and position of swords or other gear attached to a character, changing how the game plays or looks.",
      "NOTE: While TBM files are used for mods, Toribash saves match replays in a different format, using the .RPL extension."
    ]
  },
  "more_information": {
    "description": [
      "A TBM file is a mod (modification) file used by Nabi Studios Toribash, a 3D turn-based fighting game. It contains custom game content such as weapons, armor, buildings, or other objects that players can add to the game. TBM files allow players to change the gameplay experience by introducing new visual elements or mechanics."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open TBM files with Nabi Studios Toribash. For example, you can load a TBM file from the Mods menu in the Toribash main menu or by typing a command (like /mod swords.tbm) in a game lobby.",
      "You can also edit TBM files with a text editor to customize properties like object size, color, physics behavior, and placement."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/tbm",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.144Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.144Z"
}