{
  "slug": "tcvp",
  "extension": "tcvp",
  "name": "TCVP Ransomware Encrypted File",
  "summary": "Learn about .TCVP files and view a list of programs that open them.",
  "developer": "N/A",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13025&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "In November 2022, some PC users began reporting their computers had been infected by ransomware that encrypted their files and renamed them to use the .tcvp extension. Further investigation revealed that TCVP ransomware is a variant of the popular STOP DJVU family of ransomware.",
      "After encrypting a user's files, TCVP ransomware produces a plain text (.TXT) ransom note in every folder that contains an infected file. This ransom note contains instructions users can supposedly follow to decrypt their files.",
      "TCVP ransomware is most commonly distributed within programs that appear to be legitimate but are actually adware and malware bundles. If you recently downloaded and installed an unverified program, that may be how your computer became infected by TCVP ransomware."
    ]
  },
  "more_information": {
    "description": [
      "A file with the .tcvp extension has been maliciously renamed and encrypted by TCVP ransomware. It contains a document, video, image, or other type of file the ransomware is holding hostage. The .tcvp extension is added to the file's normal extension, producing a compound extension like .docx.tcvp."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Because TCVP files are encrypted, you cannot open them. At this time, there is no way to decrypt TCVP files. The best way to restore files encrypted by TCVP ransomware is to retrieve them from a recent backup or perform a System Restore."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/tcvp",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.801Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.801Z",
  "category": "other",
  "related": [],
  "containers": []
}