{
  "slug": "tcx",
  "extension": "tcx",
  "name": "Training Center XML File",
  "summary": "Learn about .TCX files and view a list of programs that open them.",
  "developer": "Garmin",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=3398&b=1"
      },
      {
        "name": "SmartBear TestComplete",
        "url": "https://fileinfo.com/software/smartbear/testcomplete"
      },
      {
        "name": "IMSI TurboCAD Deluxe",
        "url": "https://fileinfo.com/software/imsi/turbocad_for_mac"
      }
    ]
  },
  "technical_info": {
    "content": [
      "In 2007, alongside the release of Garmin Training Center, Garmin introduced the Training Center XML (TCX) file format. TCX files are similar to .GPX files, in that both are used to map runners' and cyclists' routes. However, TCX files also store data recorded during a user's workout. For example, TCX files log users' activity type, lap times, maximum speed, calories burned, and exercise intensity.",
      "Garmin and Fitbit device users can export TCX files from their devices and use the files in other programs, such as Garmin Connect, Strava, and the desktop versions of Google Earth. For example, Fitbit users can export their data from Fitbit.com by:",
      "Logging in to their Fitbit.com account.",
      "Selecting Log → Activities from the Fitbit.com dashboard.",
      "Selecting an activity and clicking View Details.",
      "Selecting the ... menu and then selecting Export as a TCX file.",
      "If you encounter a TCX file on your computer, it was likely exported from a workout-tracking device or program.",
      "NOTE: The TCX format is available in both TCX v1 and TCX v2 schemas."
    ]
  },
  "more_information": {
    "description": [
      "A TCX file is an XML file used to transfer workout data between fitness devices. It contains a record of a user's workout, including the user's running or cycling course, heart rate, cadence, lap time, and calories burned. TCX files are typically created by Garmin and Fitbit devices."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a TCX file in a variety of mapping and workout-tracking programs. For example, you can upload a TCX file to Strava (Web) or Garmin Connect (Web) to view the workout data it contains. You can also open a TCX file in the desktop versions of Google Earth (cross-platform), though Google Earth will show you only the running or biking route a TCX file contains."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/tcx_3398.png",
      "alt": "Screenshot of a .tcx file in GitHub Atom",
      "caption": "TCX file open in GitHub Atom"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/tcx",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.146Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.146Z"
}