{
  "slug": "tgs",
  "extension": "tgs",
  "name": "Telegram Animated Sticker File",
  "summary": "Learn about .TGS files and view a list of programs that open them.",
  "developer": "Telegram",
  "category": "compression",
  "category_slug": "compression",
  "programs": {
    "windows": [
      {
        "name": "Corel WinZip",
        "url": "https://fileinfo.com/software/corel/winzip"
      },
      {
        "name": "Apple Archive Utility",
        "url": "https://fileinfo.com/software/apple/archive_utility"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11854&b=1"
      },
      {
        "name": "Smith Micro StuffIt Deluxe",
        "url": "https://fileinfo.com/software/smith_micro/stuffit_deluxe"
      },
      {
        "name": "7-Zip",
        "url": "https://fileinfo.com/software/igor_pavlov/7-zip"
      },
      {
        "name": "Smith Micro StuffIt Deluxe Mac 16",
        "url": "https://fileinfo.com/software/smith_micro/stuffit_deluxe_mac"
      }
    ]
  },
  "technical_info": {
    "content": [
      "The TGS file format imposes certain limitations on the TGS animated stickers creation. A TGS animated file:\n\nSticker/canvas size must be 512х512 pixels.Sticker objects must not leave the canvas.Animation length must not exceed 3 seconds.All animations must be looped.Sticker size must not exceed 64 KB after rendering in Bodymovin.All animations must run at 60 Frames Per Second.",
      "Telegram provides animated stickers to allow you to enhance messages with animations beyond simple static graphics. The service originally only utilized .WEBP images for stickers but introduced the TGS format in July 2019 (version 5.9 of Telegram), which can store sticker animations at higher resolutions and smaller file sizes than the static WEBP stickers.",
      "The TGS format is based on the Lottie library, which renders JSON-formatted data from Adobe After Effects animations. The format consists of a JSON text file exported from an animation in Adobe After Effects (with the Bodymovin-TG plugin) that is compressed with gzip compression as a .GZIP file. The text file stores information about the animation in JSON format, whereas the gzip compression reduces the size of the file.",
      "TGS animated stickers cannot be larger than 64 KB or longer than 3 seconds and must be looped. Also, the sticker cannot go off of the canvas and the canvas size must be 512x512 pixels."
    ]
  },
  "more_information": {
    "description": [
      "A file with .tgs extension is an animated sticker file that was introduced by the cross-platform messaging service, Telegram. Animated stickers are used by messaging apps users to send more enhanced and lively content in messages unlike the static graphics that are still images. Telegram initially used the WEBP file format for still image stickers. The TGS file format can store animation data at higher resolutions and smaller file size as compared to the static WEBP stickers. TGS files can be opened using applications such as Telegram, 7-zip, Apple Archive Utility, and Corel WinZip.",
      "A TGS file is an animated sticker used by Telegram, a cross-platform messaging service. It is saved in the Telegram Sticker (TGS) format and stores an animation that users can add to their messages."
    ]
  },
  "how_to_open": {
    "instructions": [
      "TGS files are not meant to be opened with Telegram. Instead, the files are typically only used by Telegram users creating their own animated sticker packs to be added to the messaging service. If you created a TGS animated sticker pack, you must send the /​newanimated command to the @stickers bot, then send the TGS files with a 100x100 pixels icon to successfully upload the pack to Telegram. After completing the upload you can use and share the sticker pack.",
      "You can also open TGS files by decompressing them with a decompression program that supports the gzip algorithm, such as Corel WinZip or Apple Archive Utility."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "You can use the website Emojibest.com to convert TGS files to the .GIF (Graphical Image Interchange) format. Additionally, PC users can use Ed Asriyan's Lottie Converter to convert TGS files to GIF file."
    ]
  },
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/compression/tgs/",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-02T02:43:26.536Z"
    },
    {
      "url": "https://fileinfo.com/extension/tgs",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.536Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.536Z"
}