{
  "slug": "theme",
  "extension": "theme",
  "name": "Microsoft Plus! Desktop Theme",
  "summary": "Learn about .THEME files and view a list of programs that open them.",
  "developer": "Microsoft",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=359&b=1"
      },
      {
        "name": "Microsoft Windows",
        "url": "https://fileinfo.com/software/microsoft/windows"
      }
    ]
  },
  "technical_info": {
    "content": [
      "The first Plus! package was developed as Microsoft Plus! for Windows 95. The enhancement software was later created for Windows 98 and Windows XP as well. It was discontinued after the release of Microsoft Vista, which included many of the Microsoft Plus! features.",
      "The Windows 7 THEME file format includes new features that were not available in previous versions of Windows. Older versions of Windows can still read these files, but they ignore the unrecognized sections. Windows 7 also supports the newer .THEMEPACK format, which stores the THEME file as well as the image, sound, and other files referenced by the theme.",
      "NOTE: WineHQ can use THEME files to stylize the skins of Windows programs on the Linux platform."
    ]
  },
  "more_information": {
    "description": [
      "A THEME file contains a theme for Microsoft Plus!, a software enhancement to the Windows operating system. It contains settings used to customize the Windows desktop and is saved in Microsoft's .INI text-based format, which includes colors, styles, and references to image and sound files used by the theme. THEME files may be included with the Microsoft Plus! software or may be custom-made by the user."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/theme",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.152Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.152Z"
}