{
  "slug": "tm",
  "extension": "tm",
  "name": "Teachable Machine Project",
  "summary": "Learn about .TM files and view a list of programs that open them.",
  "developer": "Google",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13201&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Developers use Teachable Machine to create machine learning models (MLMs) that can recognize and categorize different images, audio clips, and poses. For example, a developer might use Teachable Machine to create a model that can recognize and categorize images of different types of fruit.",
      "Teachable Machine users can save their MLM projects to their Google Drive or as a local file. These project files, which use the .tm extension, contain a copy of each of the image or audio assets a developer has added to their project. They also contain a manifest.json file, which defines their project's type (image, audio, pose), the version of Teachable Machine that created the project, and other metadata."
    ]
  },
  "more_information": {
    "description": [
      "A TM file is a project file created by Google Teachable Machine, an online app used to create machine learning models. It contains a copy of the project's training samples and a JSON manifest file. TM files are renamed .ZIP files, which you can open and extract files from as you would any ZIP file."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a TM file with Google Teachable Machine (Web). To do so, open Teachable Machine in your web browser, select the app's sandwich menu, and click Open project from file. Then, navigate to and open your TM file.",
      "You can also open a TM file as you would any ZIP file, to retrieve the project assets and manifest file it contains. To do so, you may first have to rename the file's extension to .zip."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/tm_13201.png",
      "alt": "Screenshot of a .tm file in Google Teachable Machine",
      "caption": "TM file open in Google Teachable Machine"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/tm",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.810Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.810Z",
  "category": "other",
  "related": [],
  "containers": []
}