{
  "slug": "trg",
  "extension": "trg",
  "name": "TriggerReactor Script",
  "summary": "Learn about .TRG files and view a list of programs that open them.",
  "developer": "wysohn",
  "programs": {
    "windows": [
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Github Atom",
        "url": "https://fileinfo.com/software/github/atom"
      },
      {
        "name": "Microsoft Visual Studio Code",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11909&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "TriggerReactor is a Minecraft Java Edition plug-in players can use to modify and extend Minecraft's gameplay. After installing TriggerReactor, players can create and execute custom commands that are triggered by in-game actions. For example, a player could create a command that automatically spawns creepers when players step on a certain block. The scripts used to execute TriggerReactor commands are saved in TRG files.",
      "Several example TRG scripts can be found on TriggerReactor's Github page. To learn how to create your own TriggerReactor scripts, you can visit TriggerReactor's Github wiki."
    ]
  },
  "more_information": {
    "description": [
      "A TRG file is a script used by TriggerReactor, a plug-in used to modify Minecraft Java Edition gameplay. It contains plain text code written in the TriggerReactor language, which is executed when triggered by an in-game event. For example, a TRG script may be triggered by a player's actions or the passage of time. TRG files are similar to .SK files, except that they can utilize a Minecraft server's API, allowing them to perform more actions."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Because TRG files are plain text files, you can open them and view their contents using any text editor, such as Microsoft Notepad (Windows), Apple TextEdit (Mac), or Github Atom (cross-platform). If you intend to edit a TRG file, you should open it with a source code editor, such as Microsoft Visual Studio Code (cross-platform).",
      "To use a TRG file as a TriggerReactor script, you must install TriggerReactor alongside Minecraft Java Edition. For more detailed instructions on how to create and use a TRG file as a TriggerReactor script, click here."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/trg",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.816Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.816Z",
  "category": "other",
  "related": [],
  "containers": []
}