{
  "slug": "tt2017state",
  "extension": "tt2017state",
  "name": "TurboTax 2017 State Tax Form",
  "summary": "Learn about .TT2017STATE files and view a list of programs that open them.",
  "developer": "Intuit",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10819&b=1"
      },
      {
        "name": "Intuit TurboTax",
        "url": "https://fileinfo.com/software/intuit/turbotax"
      }
    ]
  },
  "technical_info": {
    "content": [
      "When you begin filling out your state tax return in TurboTax, you will be asked to download the tax forms for your specific state. Click the \"Download State\" button, choose your state, and then TurboTax will download the TT2017STATE file(s) for your state and automatically open them. After they are opened you can fill out your state return to finish your taxes. You will most likely never see the TT2017STATE file because it is downloaded and opened automatically by the tax software.",
      "TurboTax is available in Basic, Deluxe, Premier, and Home & Business editions. Each edition provides different features at different prices. The Basic edition requires the purchase of a TurboTax state return, whereas the Deluxe, Premier, and Home & Business editions come with one TurboTax state return included. If you would like additional state returns, you must purchase them."
    ]
  },
  "more_information": {
    "description": [
      "A TT2017STATE file is a state tax form created by the 2017 version of TurboTax tax preparation software. It contains one or more U.S. state tax forms referenced by TurboTax when completing a tax return. TT2017STATE files are linked to a .TAX2017 file, which is the default file created by TurboTax to store a user's tax return."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/tt2017state",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.168Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.168Z"
}