{
  "slug": "tt23",
  "extension": "tt23",
  "name": "TurboTax Canada 2023 Tax Return",
  "summary": "Learn about .TT23 files and view a list of programs that open them.",
  "developer": "Intuit",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13783&b=1"
      },
      {
        "name": "Intuit Canada TurboTax",
        "url": "https://fileinfo.com/software/intuit/canada_turbotax"
      }
    ]
  },
  "technical_info": {
    "content": [
      "As users enter their information in TurboTax Canada 2023, they save their progress as TT23 files. This allows them to close and resume work on their return, make changes, and submit it electronically or by mail. They may also use the files to back up tax data to prevent loss or transfer 2023 tax information into TurboTax Canada 2024 to prefill the return for the next year.",
      "When saving a tax return with TurboTax Canada 2023 for the first time, the software creates the TT23 file in the following location:",
      "C:\\​Users\\​[username]\\​Documents\\​TurboTax\\​2023",
      "Also, TurboTax Canada uses file extensions for tax returns that correlate with the tax year. For example, .TT22 is for 2022.",
      "NOTE: TT23 files are similar to .TAX2023 files, which the U.S. version of TurboTax 2023 uses to save tax returns."
    ]
  },
  "more_information": {
    "description": [
      "A TT23 file is a tax return created by TurboTax Canada 2023, a tax preparation software Canadians use to file federal and provincial taxes. It stores tax data required for a 2023 tax return a user has entered, including income information, credits, deductions, and other financial details."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open TT23 files with Intuit Canada TurboTax 2023 in Windows. To open a TT23 file with the software, select File → Open Tax Return and then choose your tax return.",
      "You can also upload a TT23 file to the 2024 version of TurboTax Canada Online to import your 2023 tax data. To do this, go to My Returns → Start a new return, choose your TurboTax product, select TurboTax Download/CD, click Continue, and then upload your TT23 file."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/tt23",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.168Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.168Z"
}