{
  "slug": "tvlayer",
  "extension": "tvlayer",
  "name": "mimoLive TV Layer",
  "summary": "Learn about .TVLAYER files and view a list of programs that open them.",
  "developer": "Boinx Software",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=9471&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "mimoLive allows you to place layers over your video to create a more engaging and interactive presentation. The program comes with several pre-built layers, which include weather, 3D graphs, breaking news alerts, clocks, iOS device demos, overshoulder inserts, Twitter, Facebook, Twitch, and subtitles. Each layer is stored in the TVLAYER file. You can import new layers by selecting File → Import Layer Compositions....",
      "mimoLive was formerly known as BoinxTV. The application is mainly used to stream live video to sites such as YouTube, Facebook, and Twitch.tv. It is also used to project video to an external screen via VGA, DVI, or HDMI. You can use video from your computer, webcams, connected video cameras, and mobile devices. The software also comes with useful production tools that include support for multiple camera angles, graphics, keying capabilities, and social media integration."
    ]
  },
  "more_information": {
    "description": [
      "A TVLAYER file is a layer used by BoinxTV, an application that enables users to produce broadcasts such as lectures, sermons, newscasts, podcasts, and more. It stores layer information, such as transition duration, that configures how the graphics are displayed on the screen during a broadcast. TVLAYER files can be exported as .QTZ files."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/tvlayer",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.824Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.824Z",
  "category": "other",
  "related": [],
  "containers": []
}