{
  "slug": "tvshow",
  "extension": "tvshow",
  "name": "mimoLive Show",
  "summary": "Learn about .TVSHOW files and view a list of programs that open them.",
  "developer": "Boinx Software",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=9470&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "When you save a project in mimoLive the TVSHOW file is created to store the content of the project. When your show is ready to record, hit the \"Start Show\" button at the top of the interface. When you are finished recording you can save the show as a .MOV file.",
      "To create a TVSHOW file, select File → Save or Save As..., name the file, choose the save location, and click Save.",
      "To open a TVSHOW file, double-click the file or select File → Open..., navigate to the file, and click Open.",
      "mimoLive was formerly known as BoinxTV. The application is primarily used for live video streaming directly to sites such as YouTube, Facebook, and Twitch.tv and for projecting video to an external screen. It supports video from your computer, webcams, connected video cameras, and mobile devices. It comes with useful production tools that include support for multiple camera angles, graphics, keying capabilities, and social media integration. Also, nearly everything in mimoLive is customizable, which includes fonts, graphics, colors, and object positions."
    ]
  },
  "more_information": {
    "description": [
      "A TVSHOW file is a show created by mimoLive, a video editor used to produce broadcasts such as sermons, lectures, podcasts, newscasts, and more. It contains a show project, which includes settings and aspects, such as text content, graphics, transitions, animations, frame rate, show length, and author, that make up the show presentation."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/tvshow_9470.png",
      "alt": "Screenshot of a .tvshow file in Boinx Software mimoLive 2.8",
      "caption": "TVSHOW file open in Boinx Software mimoLive 2.8"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/tvshow",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.171Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.171Z"
}