{
  "slug": "ubz",
  "extension": "ubz",
  "name": "OpenBoard Document",
  "summary": "Learn about .UBZ files and view a list of programs that open them.",
  "developer": "The OpenBoard Team",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11781&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "OpenBoard is a free, interactive whiteboard software that Windows, Mac, and Linux users can use to simulate a real-life whiteboard. When a user exports an OpenBoard document, that document is saved as a UBZ file. Each UBZ file contains all the whiteboard pages saved within an OpenBoard document, stored as SVG images. UBZ files also contain JPG thumbnails of each whiteboard page as well as a metadata (RDF) file used by OpenBoard."
    ]
  },
  "more_information": {
    "description": [
      "A UBZ file is a Zip-compressed archive created by OpenBoard, a free interactive whiteboard software. It contains a set of .SVG images saved by OpenBoard, each of which represents a whiteboard drawing, as well as .JPG thumbnails and .RDF metadata. UBZ files can be renamed to .ZIP files and opened as Zip archives to access the images they contain outside OpenBoard."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a UBZ file in OpenBoard. To do so, select Documents → Import from the program's menu bar, and then import your UBZ file.",
      "If you do not have access to OpenBoard, you can still view the whiteboard pages contained within an OpenBoard document. To do so, rename your UBZ file to a ZIP file. Then, decompress the file as you would any Zip archive. After that, you can browse the uncompressed archive and open the SVG, JPG, and RDF files it contains."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/ubz",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.827Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.827Z",
  "category": "other",
  "related": [],
  "containers": []
}