{
  "slug": "ufdx",
  "extension": "ufdx",
  "name": "UFED Multiple Dump File",
  "summary": "Learn about .UFDX files and view a list of programs that open them.",
  "developer": "Cellebrite",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12832&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Cellebrite's digital forensics suite allows investigators to extract data from a variety of devices, including smartphones, drones, and SD cards, analyze that data, and share their findings with other law enforcement professionals. UFED and Physical Analyzer are two of the suite's primary applications.",
      "Both UFED and Physical Analyzer allow investigators to extract a device's contents and save them as a single .UFD file. However, if investigators are extracting data from multiple related devices, they may instead save all of the devices' contents as a UFDX file. This allows investigators to load all the devices' data as a single file while building a case in Physical Analyzer, and more easily share the data with other investigators if needed."
    ]
  },
  "more_information": {
    "description": [
      "A UFDX file contains data extracted from multiple devices using Cellebrite Universal Forensic Extraction Device (UFED) or Cellebrite Physical Analyzer. For example, it may contain data extracted from a drone and data extracted from a smartphone. UFDX files are used to build cases and reports in Physical Analyzer."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a UFDX file while opening or editing a case in Cellebrite Physical Analyzer (Windows). For example, while opening a case, select Add → Load extraction on the Load evidence screen to load a UFD file.",
      "You can also open a UFDX file with MOBILedit Forensic Express (Windows) or Oxygen Forensics Detective (Windows)."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/ufdx",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.176Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.176Z"
}