{
  "slug": "ugg",
  "extension": "ugg",
  "name": "Wireless Go II Audio File",
  "summary": "Learn about .UGG files and view a list of programs that open them.",
  "developer": "Rode",
  "programs": {
    "windows": [
      {
        "name": "Python",
        "url": "https://fileinfo.com/software/python_software_foundation/python"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13617&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Rode Wireless Go II is a wireless dual-channel microphone system. Audio professionals, filmmakers, and A/V enthusiasts may use Wireless Go II transmitters for various projects, including interviews, films, and shows.",
      "When recording audio, the device creates UGG and EGG files to store audio data and metadata. You can then play and modify the audio with the Rode Central desktop and mobile apps before exporting the UGG files to a more common audio format."
    ]
  },
  "more_information": {
    "description": [
      "An UGG file is an audio file created by Rode Wireless Go II transmitters to store recorded audio, such as an interview or film dialogue. It contains uncompressed audio data in a binary format proprietary to Rode devices. Users can convert UGG files to common audio formats, such as .WAV and .MP3, with the Rode Central apps for computers and mobile devices."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can play UGG files with the Rode Central desktop app (Windows and macOS) and the Rode Central Mobile app (Android and iOS). However, you must first connect the Wireless Go II device to the Rode Central app to transfer the audio recordings."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "You can convert UGG files to .WAV and .MP3 audio files with the Rode Central app. If you cannot access the Rode Central app, you can use the \"Rode_WirelessGoII_UGG2wav\" .PY script (with Python and the wave library installed)."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/ugg",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.177Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.177Z"
}