{
  "slug": "unis",
  "extension": "unis",
  "name": "UniMaker 1.S Course",
  "summary": "Learn about .UNIS files and view a list of programs that open them.",
  "developer": "NinStar",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12061&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "UniMaker is a fan-made Super Mario level design tool that is similar to Super Mario Maker. It allows gamers to create and play their own Super Mario levels, as well as share levels with others.",
      "When a creator saves a UniMaker level, that level is saved as a UNIS file. UniMaker includes several example UNIS files that users can load, edit, and play to learn how UniMaker works, and UniMaker's website contains links to download additional UNIS files, created by other UniMaker users.",
      "Each UNIS file contains hexadecimal data that is used to show a level in UniMaker. The file's header shows what version of UniMaker created the file.",
      "In the UniMaker level editor, you can save a level as a UNIS file by clicking the Robot icon and then clicking the Upload icon. The Save Course window will then appear."
    ]
  },
  "more_information": {
    "description": [
      "A UNIS file is a Super Mario level created by UniMaker, a fan-made Super Mario level creation program. It contains hexadecimal data used to load a level in UniMaker. UNIS files can be edited and played in UniMaker."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a UNIS file in UniMaker (Windows) to either edit the level the file contains or play the level the file contains. To play the level a UNIS file contains:",
      "From UniMaker's main menu, select Play a Course.",
      "Navigate to and open your UNIS file.",
      "To edit the level a UNIS file contains:",
      "From UniMaker's main menu, select Create a Course.",
      "In the level editor, click the Robot icon and then click the red Open icon.",
      "Navigate to and open your UNIS file. The level it contains will appear in the level editor."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/unis_12061.png",
      "alt": "Screenshot of a .unis file in UniMaker 1.2",
      "caption": "UNIS file open in UniMaker 1.2"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/unis",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.833Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.833Z",
  "category": "other",
  "related": [],
  "containers": []
}