{
  "slug": "unr",
  "extension": "unr",
  "name": "Unreal Level Map",
  "summary": "Learn about .UNR files and view a list of programs that open them.",
  "developer": "Epic Games",
  "programs": {
    "windows": [
      {
        "name": "Epic Games UnrealEd",
        "url": "https://fileinfo.com/software/epic_games/unrealed"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1386&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Unreal Engine is a widely used game development platform that provides developers with tools to build interactive experiences, including video games, virtual reality (VR), augmented reality (AR), and other real-time 3D applications. UNR files are specific to the early versions of Unreal Engine, including the original Unreal (1998) and Unreal Tournament (1999).",
      "As the engine evolved, Epic Games introduced new file formats and systems to handle game assets and levels. Starting with Unreal Engine 3 and continuing with versions 4 and 5 (the engine now uses more advanced formats like .UMAP for storing level data)."
    ]
  },
  "more_information": {
    "description": [
      "A UNR file is a level map used by games built with the Unreal Engine, including Unreal and Unreal Tournament. It stores the layout, design, and details of a single game level, including objects, textures, lighting, and other elements that make up the environment. While Epic Games has replaced UNR files with newer formats, developers and modders previously created and modified UNR files when designing custom levels or modifying existing ones."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open or edit UNR files with the Epic Games UnrealEd tool included with older games, such as Unreal and Unreal Tournament, that support the file type. To open the UNR file with the correct version of UnrealEd, select File → Open."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/unr",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.180Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.180Z"
}