{
  "slug": "usr",
  "extension": "usr",
  "name": "SmartMusic Custom File",
  "summary": "Learn about .USR files and view a list of programs that open them.",
  "developer": "MakeMusic",
  "category": "database",
  "category_slug": "database",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=9091&b=1"
      },
      {
        "name": "MakeMusic SmartMusic",
        "url": "https://fileinfo.com/software/makemusic/smartmusic"
      },
      {
        "name": "FileMaker Pro Advanced",
        "url": "https://fileinfo.com/software/filemaker/filemaker_pro"
      }
    ]
  },
  "technical_info": {
    "content": [
      "To create a USR file:",
      "Open a title, click Customize, and choose an existing customization or add a new one by clicking \"New Customization.\"",
      "Add your customizations.",
      "Right-click your customization, select Export..., name the file, choose the save location, and click Save.",
      "To import your USR file, open a title, click Customize, select \"Import,\" navigate to the location of your USR file, and click Open."
    ]
  },
  "more_information": {
    "description": [
      "USR file is a FileMaker database file in a specialized format utilized by FileMaker Pro, a powerful software application designed for creating, organizing, and distributing databases. This file serves as a container for user-specific databases, housing data and related components in a proprietary structure unique to FileMaker.\n\nWith FileMaker Pro, users can efficiently import data from various sources, such as text files, Excel documents, or Bento databases. Once imported, this data can be managed, modified, and analyzed within the FileMaker database, enabling users to generate tailored reports and perform data analysis for informed decision-making.\n\nThe strength of FileMaker Pro lies in its capability to facilitate seamless data sharing and collaboration. By sharing the database files, users can collaborate with others, allowing multiple individuals to access and work on the same data concurrently. Furthermore, the results from data analysis can be shared easily with colleagues or clients to present insights and findings.\n\nIn essence, the FileMaker database file serves as a central repository for organizing and harnessing data, offering users a comprehensive platform for data management, analysis, and collaboration. Its proprietary format ensures smooth operation within the FileMaker ecosystem, making it a valuable tool for businesses and individuals seeking efficient database solutions.",
      "Music file used by SmartMusic, a band, orchestra, and vocal music practice application; contains a customization of a SmartMusic Title; custom changes include altering tempos and cutting measures."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Programs that open or references USR files include\n\nFileMaker Pro Advanced (Windows)FileMaker Pro Advanced (Mac)"
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/database/usr/index.html",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-01T22:32:42.290Z"
    },
    {
      "url": "https://fileinfo.com/extension/usr",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.290Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.290Z",
  "containers": []
}