{
  "slug": "utv",
  "extension": "utv",
  "name": "SmartCast TV Firmware Update",
  "summary": "Learn about .UTV files and view a list of programs that open them.",
  "developer": "Vizio",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13004&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Typically, Vizio SmartCast TVs automatically update to the latest version of the SmartCast TV software. However, if your TV is not connected to the Internet, you must update it manually.",
      "To retrieve the latest version of your TV's firmware, stored in a UTV file, go to the Firmware Information section of Vizio's support website. There, you can download the most recent version of SmartCast TV firmware. This file will arrive as a .ZIP file, which contains the UTV file.",
      "UTV files are typically named for the version of SmartCast TV firmware they contain. For example, a UTV file may be named 2.72.34-4.utv. This file contains firmware version 2.72.34-4."
    ]
  },
  "more_information": {
    "description": [
      "A UTV file is a firmware update file used by a Vizio SmartCast TV. It contains data the TV uses to update to the latest version of the SmartCast TV software. You can use a UTV file to manually update a TV's firmware without connecting to the Internet."
    ]
  },
  "how_to_open": {
    "instructions": [
      "UTV files are not meant to be opened. To install the firmware update a UTV file contains on your Vizio SmartCast TV:",
      "Place the UTV file on a USB flash drive.",
      "Turn on your TV.",
      "Insert the flash drive containing your UTV file into your TV's USB port.",
      "Your TV will show a message and begin installing the firmware update. During this process, your TV will reboot at least two times."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/utv",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.183Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.183Z"
}