{
  "slug": "uxx",
  "extension": "uxx",
  "name": "Unreal Tournament Cache",
  "summary": "Learn about .UXX files and view a list of programs that open them.",
  "developer": "Epic Games",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1387&b=1"
      },
      {
        "name": "Epic Games Unreal Tournament",
        "url": "https://fileinfo.com/software/epic_games/unreal_tournament"
      }
    ]
  },
  "technical_info": {
    "content": [
      "You can find UXX files in the Cache folder within the Unreal Tournament directory. Additionally, you don’t need to manage or open the files since the game generates and updates them automatically.",
      "However, some players may use utilities or modifications to extract or convert UXX files to make custom maps or access game assets for modding purposes. While helpful for improving gameplay, UXX cache files may become numerous over time, potentially taking up much storage space. You can delete UXX files if they take up too much space."
    ]
  },
  "more_information": {
    "description": [
      "A UXX file is a cache file used by Unreal Tournament, a popular first-person shooter game developed by Epic Games. When players access game assets during gameplay, such as maps, textures, and audio, Unreal Tournament temporarily stores this data in UXX cache files. The caching allows for faster access to recently used content, helping to reduce loading times and improve game performance by reusing resources rather than reloading them entirely from scratch."
    ]
  },
  "how_to_open": {
    "instructions": [
      "UXX files are not meant to be opened. Instead, Epic Games Unreal Tournament references the files to load cached data to improve gameplay."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/uxx",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.837Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.837Z",
  "category": "other",
  "related": [],
  "containers": []
}