{
  "slug": "vcfg",
  "extension": "vcfg",
  "name": "Valve Source 2 Configuration File",
  "summary": "Learn about .VCFG files and view a list of programs that open them.",
  "developer": "Valve",
  "programs": {
    "windows": [
      {
        "name": "Microsoft Visual Studio Code",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13163&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Source 2 is a proprietary game engine Valve has used to create games such as Dota 2 Reborn and Half-Life: Alyx. Games created with Source 2 include VCFG scripts, which typically configure certain game settings at startup.",
      "While most players will never need to access or modify a game's VCFG files, modders enjoy using them to customize Source 2 games. For example, a Dota 2 Reborn player might create a script that allows them to quickly toggle their camera between runes, and then add a directive to execute that script in Dota 2 Reborn's game_convars.vcfg file. Or, a player may create an entirely new VCFG script and execute that script using Dota 2's Console.",
      "NOTE: Source 1 engine games and some Source 2 engine games also use configuration files saved with the .cfg extension."
    ]
  },
  "more_information": {
    "description": [
      "A VCFG file is a configuration file used by the Valve Source 2 game engine. It contains one or more console commands that modify a Source 2 game. Source 2 games contain default VCFG files, which modders can modify to alter how the games function."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open and edit a VCFG file with Microsoft Visual Studio Code (multiplatform) or any other text editor. To execute the script a VCFG file contains in a Source 2 game, use the Console available in-game."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/vcfg",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.841Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.841Z",
  "category": "other",
  "related": [],
  "containers": []
}