{
  "slug": "vdoc",
  "extension": "vdoc",
  "name": "VinylMaster Document",
  "summary": "Learn about .VDOC files and view a list of programs that open them.",
  "developer": "Future Corporation",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12232&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Future Corporation VinylMaster is a graphic design program that allows designers to mock up logos, signs, decals, banners, posters, and other marketing materials. Designers can then export their designs and provide them to printing companies, which use the designs to create physical marketing materials.",
      "By default, users' VinylMaster designs are saved as VDOC files. This file format preserves the design's individual elements, allowing users to continue editing those elements in VinylMaster.",
      "However, VDOC files can be opened only in VinylMaster. When providing VinylMaster designs to print shops, designers typically export the designs as EPS, PDF, or SVG files, using VinylMaster's File → Export... option. That way, print shops can open and view the exported design, even if they don't have VinylMaster."
    ]
  },
  "more_information": {
    "description": [
      "A VDOC file is an image created by VinylMaster, a sign-designing program. It contains an editable graphic intended to become a physical sign, decal, banner, or poster. VDOC files can be exported from VinylMaster as .EPS, .PDF, or .SVG files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a VDOC file in VinylMaster (Windows). To do so, select File → Open... from VinylMaster's menu bar. Then, navigate to and open your VDOC file. You can open a VDOC file in any VinylMaster program, including VinylMaster Cut, Letter, Professional, Designer, and Expert."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/vdoc_12232.png",
      "alt": "Screenshot of a .vdoc file in VinylMaster Cut 4",
      "caption": "VDOC file open in VinylMaster Cut 4"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/vdoc",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.191Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.191Z"
}