{
  "slug": "vicar",
  "extension": "vicar",
  "name": "VICAR Image File",
  "summary": "Learn about .VICAR files and view a list of programs that open them.",
  "developer": "NASA Jet Propulsion Laboratory",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10091&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "The VICAR file is made up of two major parts, which are the \"labels\" and the \"image area.\" The \"labels\" part contains information that describes what the file is and is located at the beginning and ending of the file. The image area is sandwiched in between the \"labels\" part and stores the actual image.",
      "VICAR stands for Video Image Communication and Retrieval, which is an image processing software system used to process multidimensional imaging data. The software was first developed in 1966 primarily to process and transport images from the NASA Jet Propulsion Laboratory's unmanned planetary spacecraft. Nowadays, the software is used by other various applications such as biomedical image processing and geological exploration. The VICAR Core is now available as Open Source from GitHub."
    ]
  },
  "more_information": {
    "description": [
      "Raster image format developed by NASA's Jet Propulsion Laboratory; stores an image that has been taken on a mission by NASA's spacecraft; also contains information that describes the structure and type of data along with a history of processing that has been done to the image."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/vicar",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.846Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.846Z",
  "category": "other",
  "related": [],
  "containers": []
}