{
  "slug": "vitalbank",
  "extension": "vitalbank",
  "name": "Vital Synthesizer Soundbank",
  "summary": "Learn about .VITALBANK files and view a list of programs that open them.",
  "developer": "Matt Tytel",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11920&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Vital is a cross-platform synthesizer program developed by Matt Tytel. Vital allows musicians to record music, typically using an electronic musical keyboard, and mimic all sorts of instruments and sounds as they do so.",
      "To give musicians a starting point from which to begin recording music, Vital allows them to install and select from presets that mimic certain instruments and musical styles. These presets are saved in VITAL files. Groups of related VITAL files are often saved in VITALBANK files, which a musician can use to install several presets at once. For example, a group of punk-related presets may be saved in the file Punk Rock.vitalbank.",
      "When Vital users share custom presets with each other, they typically group related VITAL files into VITALBANK files. To create VITALBANK files, users select the Export Bank option from Vital's sandwich menu."
    ]
  },
  "more_information": {
    "description": [
      "A VITALBANK file is a settings file used by Vital, a spectral warping wavetable synthesizer. It contains a collection of .VITAL files. VITALBANK files are created by selecting Export Bank from Vital's sandwich menu."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To open a VITALBANK file in Vital (cross-platform):",
      "Select the sandwich menu located in Vital's center.",
      "From the sandwich menu, select Import Bank.",
      "Browse to and open your VITALBANK file.",
      "The presets your VITALBANK file contains will then appear in Vital."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/vitalbank_11920.png",
      "alt": "Screenshot of a .vitalbank file in Vital",
      "caption": "VITALBANK file open in Vital"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/vitalbank",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.847Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.847Z",
  "category": "other",
  "related": [],
  "containers": []
}