{
  "slug": "viz",
  "extension": "viz",
  "name": "Avee Player Visualizer Template",
  "summary": "Learn about .VIZ files and view a list of programs that open them.",
  "developer": "Daaw Aww",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11360&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "The Avee Music Player allows Android users to listen to various audio and video formats and provides a customizable audio visualizer that changes with the audio being played. VIZ files are used to store information about the appearance of the audio visualizer. The app comes with pre-made templates, but users can also create and distribute VIZ files that store visualizer templates.",
      "You most likely will only encounter a VIZ file if you are attempting to add a template downloaded from the Internet to Avee Music Player. VIZ files are often compressed with other VIZ files in .ZIP archives to reduce the overall size of the templates. A Zip-decompression utility in Android, such as RAR or WinZip, can be used to extract VIZ files from the ZIP archive. The templates can then be installed in Avee Music Player."
    ]
  },
  "more_information": {
    "description": [
      "A VIZ file contains an audio visualizer template used by Avee Music Player, an audio player for Android. It stores information about a visualizer template, which may include theme colors and images that make up the audio visualizer appearance in the app."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/viz",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.848Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.848Z",
  "category": "other",
  "related": [],
  "containers": []
}