{
  "slug": "vmat",
  "extension": "vmat",
  "name": "Valve Source 2 Material File",
  "summary": "Learn about .VMAT files and view a list of programs that open them.",
  "developer": "Valve",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11966&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Source 2 is a proprietary game engine Valve has used to create video games such as Dota 2 Reborn, Half-Life: Alyx, and Artifact. When creating in-game objects, developers use VTEX_C and VMAT files to apply materials to those objects. VTEX_C files contain the texture(s) that appear on an object, and VMAT files contain references to VTEX_C files as well as shading and material properties that control how textures appear when applied to a specific object.",
      "While most gamers will never encounter a VMAT file, those who want to mod Valve Source 2 games or create their own Source 2-powered games may interact with VMAT files. For example, those who want to mod Half-Life: Alyx or Dota 2 using Valve's official modding toolkits may encounter or create VMAT files."
    ]
  },
  "more_information": {
    "description": [
      "A VMAT file is a material file used by the Valve Source 2 game engine, which is used to create video games. It contains references to .VTEX_C files, as well as data specifying shader and material properties. Player-created VMAT files are created by the Material Editor, which is included in the Dota 2 Workshop Tools and Half-Life: Alyx Workshop Tools utility packages."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a VMAT file in the Valve Source 2 Material Editor (Windows, Mac), which is included in the Dota 2 Workshop Tools and Half-Life: Alyx Workshop Tools utility packages. You can also open VMAT files in Valve Resource Viewer (Windows)."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/vmat",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.197Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.197Z"
}