{
  "slug": "vmcz",
  "extension": "vmcz",
  "name": "Hyper-V Compressed Virtual Machine",
  "summary": "Learn about .VMCZ files and view a list of programs that open them.",
  "developer": "Microsoft",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11403&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Microsoft Hyper-V allows users to run multiple operating systems as virtual machines in Windows, as well as create and manage virtualized software and hardware components. Hyper-V software also comes with Hyper-V Manager, which is a tool that provides a friendly user interface (UI) for interacting with Hyper-V. Hyper-V Manager is available as an optional program built into Windows systems that support Hyper-V.",
      "Microsoft introduced the VMCZ file type when it added the virtual machine export capability to Hyper-V Manager with the release of the Windows 10 Insider Build of 16226 in June 2017. The feature was introduced through the addition of a \"Share\" button to the UI of Hyper-V Manager that allows users to export a Hyper-V VM as a compressed VMCZ file.",
      "The Share feature makes it easier for users to copy virtual machines and transport them to other locations. After moving a VMCZ file to another system with Hyper-V installed, a user can simply double-click the file to import it into Hyper-V.",
      "Since a VMCZ file is a Zip-compressed package, a user can also manually extract the contents of the package with a Zip-decompression utility, such as Microsoft File Explorer, Corel WinZip, 7-Zip, or WinRAR. The contents typically include a VM hard disk drive .VHD or .VHDX file, a VM configuration .VMCX file, and a VM run state VMRS file.",
      "To export a virtual machine in Hyper-V Manager as a VMCZ file, select the \"Share\" button in the toolbar or right-click a virtual machine, then select Export.",
      "NOTE: Hyper-V was first released with Windows Server 2008 and has been made available for free beginning with Windows 8 and Windows Server 2012. It is available in 64-bit versions of Windows 10 Pro, Enterprise, and Education."
    ]
  },
  "more_information": {
    "description": [
      "A VMCZ file contains a compressed virtual machine (VM) created by Microsoft Hyper-V, a Windows virtualization program. It stores the state, data, and hardware configuration of a VM at the time of the file creation in a Zip-compressed package. VMCZ files are exported by Hyper-V to share and copy virtual machines to other computers or servers."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/vmcz",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.197Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.197Z"
}