{
  "slug": "vms",
  "extension": "vms",
  "name": "NanoZoomer Virtual Microscope Specimen",
  "summary": "Learn about .VMS files and view a list of programs that open them.",
  "developer": "Hamamatsu",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12064&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Digital slide scanners and virtual microscopes save slide specimen images in a variety of image formats. Hamamatsu NanoZoomer saves slide images in the VMS, .VMU, and .NDPI formats. The VMS format packages a single slide image as at least two JPEGs. One JPEG contains a high-resolution copy of the slide, and the other contains a lower-resolution copy. If the high-resolution image would be larger than 65,535 pixels on one side, NanoZoomer instead saves the high-resolution image as multiple JPEGs, which slide-viewing software automatically combines into one image.",
      "In addition to JPEG files, VMS files contain plain text index and optimization files. These files contain metadata that slide-viewing applications use to show slide images correctly."
    ]
  },
  "more_information": {
    "description": [
      "A VMS file is a slide specimen image created by Hamamatsu NanoZoomer, a pathology slide scanning device. It is a compressed archive that contains an index file, two or more .JPEG images, and an optimization file. VMS files can be viewed using the slide-viewing software that comes with NanoZoomer or in other slide-viewing applications."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Windows users can open VMS files in Aperio Technologies ImageScope, OpenSlide, ImageJ, or NetScope Viewer. Mac and Linux users can open VMS files in OpenSlide or ImageJ."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/vms",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.850Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.850Z",
  "category": "other",
  "related": [],
  "containers": []
}