{
  "slug": "vmsd",
  "extension": "vmsd",
  "name": "VMware Snapshot Metadata File",
  "summary": "Learn about .VMSD files and view a list of programs that open them.",
  "developer": "VMware",
  "programs": {
    "windows": [
      {
        "name": "VMware Fusion",
        "url": "https://fileinfo.com/software/vmware/fusion"
      },
      {
        "name": "VMware Workstation",
        "url": "https://fileinfo.com/software/vmware/workstation"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=6968&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "VMware Fusion and VMware Workstation are virtualization applications that allow you to run multiple operating system VMs on a single machine. When you take a snapshot of a VM, the software creates a frozen saved state of the VM and saves it as a VMSN file. The software also creates a VMSD file to store metadata for the VMSN file.",
      "When taking a snapshot of a VM, VMware virtualization software creates a VMSN file and VMSD file in the VM file. For example, you can take a snapshot in Fusion by selecting Virtual Machine → Snapshots... → Take Snapshot, then Fusion creates the VMSN and VMSD file in the .VMWAREVM file, which you can find in the following location (Fusion saves it here by default):",
      "Macintosh HD/​Users/​[username]/​Virtual Machines"
    ]
  },
  "more_information": {
    "description": [
      "A VMSD file contains metadata for a snapshot of a virtual machine (VM) created by VMware Workstation or VMware Fusion virtualization software. VMSD files accompany .VMSN files, which store the saved snapshot state, and enable the virtualization software to load the snapshot."
    ]
  },
  "how_to_open": {
    "instructions": [
      "VMSD files are saved by VMware software behind the scenes, and you should not attempt to open them manually. Instead, when you open a snapshot from within the VMware Fusion or VMware Workstation user interface, the software references the metadata in the VMSD file.",
      "For example, when you open a snapshot in Fusion by selecting Virtual Machine → Snapshots... → Snapshots... and double-click the snapshot, the software references the metadata in the VMSD file when loading the snapshot."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/vmsd",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.850Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.850Z",
  "category": "other",
  "related": [],
  "containers": []
}