{
  "slug": "vmss",
  "extension": "vmss",
  "name": "VMware Suspended State File",
  "summary": "Learn about .VMSS files and view a list of programs that open them.",
  "developer": "VMware",
  "programs": {
    "windows": [
      {
        "name": "VMware Fusion",
        "url": "https://fileinfo.com/software/vmware/fusion"
      },
      {
        "name": "VMware Workstation",
        "url": "https://fileinfo.com/software/vmware/workstation"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=6970&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "VMware Fusion and VMware Workstation are operating system virtualization applications that enable you to run multiple VMs on a single machine. Suspending a VM allows you to stop a VM and deallocate it from using system resources. This is helpful because it allows you to switch between multiple VMs without overloading your system.",
      "VMware virtualization software automatically creates and saves the VMSS file in the VM file when pausing the VM. For example, Fusion saves the VMSS file in the .VMWAREVM file, which you can find in the following location (Fusion saves it here by default):",
      "Macintosh HD/​Users/​[username]/​Virtual Machines",
      "When you resume a VM, the virtualization software deletes the VMSS file. Therefore, the VMSS file only exists while the VM is suspended.",
      "NOTE: The suspended state of a VM differs from a snapshot (saved in .VMSN and .VMSD files). Snapshots saved as VMSN or VMSD files are explicit saves of a VM at a particular point in time."
    ]
  },
  "more_information": {
    "description": [
      "A VMSS file saves the state of a virtual machine (VM) when it is in a suspended state, meaning that it has been stopped temporarily. VMware virtualization software creates a VMSS file automatically when a user suspends a VM, allowing them to stop and resume a VM."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You should not attempt to open a VMSS file manually. Instead, when you resume a VM in VMware Fusion or VMware Workstation, the software references the VMSS file to resume the suspended VM."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/vmss_6970.jpg",
      "alt": "Screenshot of a .vmss file in VMware Fusion 13",
      "caption": "VMSS file open in VMware Fusion 13"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/vmss",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.199Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.199Z"
}