{
  "slug": "vmu",
  "extension": "vmu",
  "name": "NanoZoomer Uncompressed Virtual Microscope Specimen",
  "summary": "Learn about .VMU files and view a list of programs that open them.",
  "developer": "Hamamatsu",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12070&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Hamamatsu NanoZoomer is a high-speed, high-resolution digital slide scanner that pathologists use to create and examine digital images of pathology specimens. NanoZoomer saves slide specimen images in either the VMS, VMU, or .NDPI format. These formats are largely the same, except that VMS images are compressed and VMU images are not.",
      "VMU files are image archives that contain two or more JPEG images. One JPEG contains a high-resolution copy of a scanned slide. The other contains a lower-resolution copy. If the high-resolution image would be larger than 65,535 pixels on one side, NanoZoomer instead saves the image as multiple JPEGs. Slide-viewing software automatically combines these JPEGs into one slide image, using metadata saved in the archive's index file."
    ]
  },
  "more_information": {
    "description": [
      "A VMU file is a whole slide image created by Hamamatsu NanoZoomer, a pathology slide scanning device. It is an archive that contains an index file and two or more .JPEG images. In contrast to .VMS files, VMU files are not compressed, so they are often quite large."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Windows users can open VMU files in OpenSlide, ImageJ, or NetScope Viewer. Mac and Linux users can open VMU files in OpenSlide or ImageJ."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/vmu",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.199Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.199Z"
}