{
  "slug": "vp9",
  "extension": "vp9",
  "name": "a VP9 file",
  "summary": "What's on this Page",
  "category": "video",
  "category_slug": "video",
  "technical_info": {
    "content": [
      "VP9 provisions a maximum resolution of 8192x4352 at up to 120 fps and multiple color spaces, with Rec 601, Rec 709, Rec 2020, SMPTE-170, SMPTE-240, and sRGBThe full range of web and mobile use cases from low bitrate compression to high-quality ultra-HD, with additional support for 10/12-bit encoding and HDR are fully supported by this formatIt can decrease video bit rates by as much as 50% in comparison with othersIt is braced for adaptive streaming and is used by YouTube and other well-known web video providersChrome, Opera, Edge, Firefox, and Android devices, as well as millions of smart TVs, support the decoding of this codecThe video resolutions greater than 1080p are modified through VP9 and allows lossless compressionDifferent color spaces like Rec. 601, Rec. 709, Rec. 2020, SMPTE-170, SMPTE-240, and sRGB are supported by VP9HDR video using Hybrid Log-Gamma and Perceptual Quantizer can also be supported by VP9"
    ]
  },
  "more_information": {
    "description": [
      "Google has developed the VP9 codec as a royalty-free, open-source video coding standard as the successor to VP8. It was originally designed to compress the ultra HD content on YouTube because it expands and enhances the coding efficiency of its predecessor. If we talk about the original VPX codecs, they came from On2 Technologies, which was assimilated by Google in 2010. Google later open-sourced the codec. VP8 and VP9 both formats are available under a free BSD license that permits operators to organize encode or decode proficiencies in both exclusive software and open-source software without revealing their source code."
    ]
  },
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/video/vp9/",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-02T02:43:26.539Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.539Z"
}