{
  "slug": "vpdoc",
  "extension": "vpdoc",
  "name": "VoodooPad Document",
  "summary": "Learn about .VPDOC files and view a list of programs that open them.",
  "developer": "Primate Labs",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12016&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "VoodooPad is a note-taking application that allows users to create their own personal wikis. These wikis, which may contain any number of pages, are saved as VPDOC files. When opened in VoodooPad, VPDOC files appear and function in much the same way as simple web-based wikis. For example, a user can click a link found in a VPDOC file to open another page of the document in a separate tab, or to access an external webpage via their web browser.",
      "However, while VPDOC files appear as text documents in VoodooPad, they are actually macOS packages. This allows VoodooPad to store and link the many files a wiki contains within just one file. (In macOS, you can view a package's contents by locating the package in Finder, right-clicking it, and selecting Show Package Contents.)",
      "VoodooPad users can export the notes their VPDOC files contain as .PDF, .EPUB, RTFD, .DOC, and .XML documents. When a user exports the notes a VPDOC file contains, VoodooPad may save the notes as one or several documents, depending on the format a user has chosen to export their notes to."
    ]
  },
  "more_information": {
    "description": [
      "A VPDOC file is a text document created by Primate Labs VoodooPad, a note-taking application available for macOS. It contains one or more pages of notes, which may be linked together by hyperlinks. VPDOC files are saved as macOS packages, which contain .PLIST, .RTFD, and other files used to show notes in VoodooPad."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a VPDOC file in Primate Labs VoodooPad (Mac). To do so, select File → Open... from VoodooPad's menu bar, then navigate to and open your VPDOC file. The VPDOC file's Home Page will appear in VoodooPad."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/vpdoc_12016.png",
      "alt": "Screenshot of a .vpdoc file in Primate Labs VoodooPad 5.3",
      "caption": "VPDOC file open in Primate Labs VoodooPad 5.3"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/vpdoc",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.202Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.202Z"
}