{
  "slug": "vrca",
  "extension": "vrca",
  "name": "VRChat Avatar",
  "summary": "Learn about .VRCA files and view a list of programs that open them.",
  "developer": "Unity Technologies",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12131&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "VRChat is a virtual reality program that allows users to don a VR headset and microphone, assume a virtual identity, and socialize within a variety of unique worlds. When creating their VRChat character, players can select one of the platform's default avatars or create a custom avatar. VRChat's servers store avatars as VRCA files.",
      "Unlike .VRCW files, players are not meant to share, download, open, or edit VRCA files. While players can create custom VRChat avatars using the Unity game development engine, those avatars are uploaded directly to the player's VRChat account and converted to VRCA files in the process. However, some players have found ways to download publicly-accessible VRCA files from VRChat using the game's avatars API, and custom VRCA files are available on several VRChat-related websites."
    ]
  },
  "more_information": {
    "description": [
      "A VRCA file is an avatar used in VRChat, a free-to-play virtual reality (VR) social platform. It is a Unity AssetBundle that contains the 3D model, textures, shaders, and other data used to show a player's in-game character. Most VRChat players will never encounter a VRCA file, unless they download a VRCA file from a VRChat-related website or access the public avatars they own using VRChat's API."
    ]
  },
  "how_to_open": {
    "instructions": [
      "VRCA files are not meant to be opened. While you can extract a VRCA file's assets using Assets Bundle Extractor, uTinyRipper, or DevX-GameRecovery and then import those assets into Unity to create an avatar using the VRChat SDK, doing so is a violation of VRChat's terms of service."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/vrca",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.854Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.854Z",
  "category": "other",
  "related": [],
  "containers": []
}