{
  "slug": "vtex_c",
  "extension": "vtex_c",
  "name": "Valve Source 2 Compiled Texture File",
  "summary": "Learn about .VTEX_C files and view a list of programs that open them.",
  "developer": "Valve",
  "programs": {
    "windows": [
      {
        "name": "GIMP",
        "url": "https://fileinfo.com/software/gimp/gimp"
      },
      {
        "name": "Adobe Photoshop",
        "url": "https://fileinfo.com/software/adobe/photoshop"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11968&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Source 2 is a proprietary game engine Valve has used to create video games such as Dota 2 Reborn, Half-Life: Alyx, and Artifact. When creating in-game objects, developers use VTEX_C files to apply textures to those objects. Any common image file, such as a .PNG, .TGA, or .PSD files, can be used to create a VTEX_C texture.",
      "The textures VTEX_C files contain are referenced by VMAT files, which are Source 2 materials files. VMAT files are used to apply the textures that VTEX_C files contain to an in-game object, along with shading and material properties that further define how the object appears. VMAT files are compiled into .VMAT_C files when a developer compiles their Source 2 game.",
      "While most gamers will never encounter a VTEX_C file, those who want to mod Valve Source 2 games or create their own Source 2-powered games may interact with VTEX_C files. For example, those who want to mod Half-Life: Alyx or Dota 2 using Valve's official modding toolkits may encounter VTEX_C files after creating a material."
    ]
  },
  "more_information": {
    "description": [
      "A VTEX_C file is a compiled texture file used by the Valve Source 2 game engine, which is used to create video games. It contains binary data that defines a texture applied to an in-game object. VTEX_C files are referenced within .VMAT files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can use the Valve Source 2 Viewer (Windows) to decompile a VTEX_C file into an image file. Then, you can open the image in any image-viewing or -editing application that supports that file format. For example, if your VTEX_C file is a compiled TGA file, you can open the resulting TGA file in GIMP (cross-platform) or Adobe Photoshop (Windows, Mac)."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/vtex_c",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.208Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.208Z"
}