{
  "slug": "vvc",
  "extension": "vvc",
  "name": "Infinity Engine Spellcasting VFX",
  "summary": "Learn about .VVC files and view a list of programs that open them.",
  "developer": "BioWare",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12200&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Baldur's Gate II (whose full title is Baldur's Gate II: Shadows of Amn) is a video game that allows players to create an Advanced Dungeons & Dragons character and adventure through D&D's Forgotten Realms setting. BioWare released the original version of Baldur's Gate II in September 2000. The game's expansion, Throne of Bhaal, released in June 2001.",
      "BioWare developed both Baldur's Gate II and Throne of Bhaal using their proprietary Infinity Engine game engine. The Infinity Engine saved many of the visual effects used to represent players' in-game spells as VVC files. Each VVC file contains information used to animate a particular spell's effect, including information on how far the spell's animation extends, how the spell's appearance blends with in-game characters' appearances, and what (if any) sounds should accompany the spell.",
      "NOTE: Other RPGs developed using the Infinity Engine, such as Planescape: Torment and Icewind Dale, may also use VVC files to show in-game visual effects."
    ]
  },
  "more_information": {
    "description": [
      "A VVC file is a visual effects file used to show a spellcasting effect, such as a lightning strike or cone of flame, in BioWare Baldur's Gate II and its expansion, Throne of Bhaal. The file contains binary game data that Baldur's Gate II references when a user casts a spell. Other BioWare Infinity Engine games may also use VVC files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "VVC files are not meant to be opened. However, players looking to modify the spellcasting effect a VVC file contains can do so using DragonLance Total Conversion Editor Pro (Windows) or VVC Utility (Windows)."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/vvc",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.859Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.859Z",
  "category": "other",
  "related": [],
  "containers": []
}