{
  "slug": "vwx",
  "extension": "vwx",
  "name": "Vectorworks Design",
  "summary": "Learn about .VWX files and view a list of programs that open them.",
  "developer": "Nemetschek",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=2922&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Architects, landscape designers, and live event designers use Vectorworks software to create 3D models and 2D drawings of buildings, landscapes, and live event setups. Primarily, the Vectorworks suite consists of the following programs (known collectively as the Vectorworks Design Suite):",
      "Architect: Used to model and draw building projects.",
      "Landmark: Used to model and draw landscape projects.",
      "Spotlight: Used to model and draw live event setups (staging, lighting, interior design, etc.).",
      "Fundamentals: Used to create CAD drawings and models for design and fabrication.",
      "These programs all save users' models and drawings as VWX files. They are available in Vectorworks Design Suite and as standalone apps.",
      "Nemetschek introduced the Vectorworks (VWX) format when it released Vectorworks 2008, replacing the .MCD format used by Vectorworks 12.5 and earlier. The binary format is proprietary to Vectorworks and saves all of the design's information, which may include 2D drafts, 3D model data (e.g., object properties and geometry), layer information, and project metadata."
    ]
  },
  "more_information": {
    "description": [
      "A VWX file is a building, interior, or landscape design created by Nemetschek Vectorworks, a CAD design suite. It typically contains both a 3D model and 2D renderings of that model. For example, a VWX file may contain a 3D model of a building and various 2D drawings of the building's architecture and floor plan."
    ]
  },
  "how_to_open": {
    "instructions": [
      "If you only want to view the design your VWX file contains, you can open it with Nemetschek Vectorworks Viewer. This free VWX viewer is available for Windows and macOS.",
      "If you need to edit or convert your VWX file, you can open it with the appropriate Nemetschek Vectorworks program (version 2008 and later). For example, if you have a VWX file created by Vectorworks Landmark, you can open that file with Vectorworks Landmark (select File → Open).",
      "NOTE: Vectorworks 12.5 and earlier versions cannot open VWX files."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "Vectorworks design programs can convert VWX files to various drawing, 3D model, document, and image formats. Typically, to convert a VWX file to another format, you must:",
      "Open the VWX file in the appropriate Vectorworks program.",
      "Select File → Export",
      "Select your desired export format.",
      "Name and save your converted file.",
      "Some common formats that Vectorworks can convert VWX files to include:",
      ".DXF - Drawing Exchange Format",
      ".DWG - AutoCAD Drawing",
      ".FBX - Autodesk FBX Interchange File",
      ".C4D - Cinema 4D Model",
      ".OBJ - Wavefront 3D Object",
      ".STP - STEP 3D Model",
      ".STL - Stereolithography File",
      ".KML - Keyhole Markup Language",
      ".JPG - JPEG Image",
      ".PDF - Portable Document Format"
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/vwx_2922.jpg",
      "alt": "Screenshot of a .vwx file in Nemetschek Vectorworks Fundamentals 2024",
      "caption": "VWX file open in Nemetschek Vectorworks Fundamentals 2024"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/vwx",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.860Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.860Z",
  "category": "other",
  "related": [],
  "containers": []
}