{
  "slug": "wacz",
  "extension": "wacz",
  "name": "Web Archive Collection Zipped",
  "summary": "Learn about .WACZ files and view a list of programs that open them.",
  "developer": "Webrecorder",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13180&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "The International Internet Preservation Consortium (IIPC) created the Web ARChive (WARC) format to serve as a common standard for web archiving. The Webrecorder project created the WACZ format to make it easier for applications and users to access the data WARC files contain.",
      "Each WACZ file is a Zip-compressed WARC file, which uses a preset directory structure and indexes to organize the data the WARC file contains. Organizing and indexing the WARC file's data in this manner allows web browsers and other applications to selectively retrieve portions of data (such as a single webpage) from the WARC file, without having to process the entire file (which may contain a lot of data and be quite large in size)."
    ]
  },
  "more_information": {
    "description": [
      "A WACZ file is a zipped web archive (.WARC file). It contains website content and metadata retrieved using crawlers, for archival purposes. WACZ files use .ZIP formatting to allow web browsers to retrieve data from WARC archives more efficiently."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a WACZ file with Webrecorder ReplayWeb.page (Web). After opening ReplayWeb.page in your web browser, select Load to navigate to and open your WACZ file."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/wacz",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.862Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.862Z",
  "category": "other",
  "related": [],
  "containers": []
}