{
  "slug": "wapproj",
  "extension": "wapproj",
  "name": "Windows Application Packaging Project File",
  "summary": "Learn about .WAPPROJ files and view a list of programs that open them.",
  "developer": "Microsoft",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10727&b=1"
      },
      {
        "name": "Microsoft Visual Studio 2022",
        "url": "https://fileinfo.com/software/microsoft/visual_studio"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Typically, developers do not use the WAPPROJ format for packaging Windows Store apps. Instead, one of the other project types, such as .CSPROJ, is used. However, Windows Application Packaging Projects are useful for developers who need to manually package their apps from non-Universal Windows Platform (UWP) app formats. One such non-UWP example is a Desktop Bridge project, in which a Classic Windows App (CWA), sometimes referred to as a \"Win32\" app, is converted to a UWP app so that it can be distributed on the Microsoft Store.",
      "WAPPROJ files are saved using the Windows Application Packaging Project format, which was introduced with Visual Studio 2017 Preview version 15.4.0. Visual Studio editions before this version do not have the option to create this type of project."
    ]
  },
  "more_information": {
    "description": [
      "A WAPPROJ file is a Windows Application Packaging Project file created by Microsoft Visual Studio, a software development tool used to create Windows apps. The file contains references to graphical assets (tile icons), application metadata, libraries, and programs used for running an application. It is used to generate an .APPXUPLOAD file, which can be submitted to the Microsoft Store for distribution to users."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/wapproj",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.862Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.862Z",
  "category": "other",
  "related": [],
  "containers": []
}