{
  "slug": "wat",
  "extension": "wat",
  "name": "WebAssembly Text File",
  "summary": "Learn about .WAT files and view a list of programs that open them.",
  "developer": "W3C",
  "programs": {
    "windows": [
      {
        "name": "Microsoft Visual Studio Code",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      },
      {
        "name": "Brackets",
        "url": "https://fileinfo.com/software/brackets_community/brackets"
      },
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13770&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "After compiling WAT files to WASM with a WebAssembly compiler, developers typically deploy them to run in web browsers, such as Google Chrome, Mozilla Firefox, Microsoft Edge, and Apple Safari, for games, media editing tools, data simulations, and more. WASM files may also run on server-side platforms like Node.js.",
      "NOTE: The World Wide Web Consortium (W3C) WebAssembly Community Group develops WAT as part of the WebAssembly (WASM) project (beginning in 2015). The group includes major contributors from Mozilla, Google, Microsoft, and Apple and independent developers."
    ]
  },
  "more_information": {
    "description": [
      "A WAT file is a text file written in the WebAssembly Text Format (WAT), a human-readable representation of WebAssembly (WASM) in a syntax similar to the .LISP programming language and based on S-expressions. The WAT format allows developers to write, view, and debug WebAssembly code before compiling it into the binary WebAssembly (.WASM) format, which runs in environments that support WASM, typically in web browsers."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open WAT files with various source code editors, including Microsoft Visual Studio Code and Brackets.",
      "Since WAT files are saved in plain text, you can also open and edit WAT files with a basic text editor, such as Microsoft Notepad or Apple TextEdit. However, text editors do not offer the same helpful editing features that source code editors provide."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "You can compile WAT files to WASM files with various WebAssembly compilers, including the wat2wasm command-line tool available with WABT (The WebAssembly Binary Toolkit)."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/wat_13770.png",
      "alt": "Screenshot of a .wat file in Microsoft Visual Studio Code 1.9",
      "caption": "WAT file open in Microsoft Visual Studio Code 1.9"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/wat",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.862Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.862Z",
  "category": "other",
  "related": [],
  "containers": []
}