{
  "slug": "wbf1",
  "extension": "wbf1",
  "name": "Wii Backup File System File",
  "summary": "Learn about .WBF1 files and view a list of programs that open them.",
  "developer": "Waninkoko",
  "programs": {
    "windows": [
      {
        "name": "7-Zip",
        "url": "https://fileinfo.com/software/igor_pavlov/7-zip"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11855&b=1"
      },
      {
        "name": "Dolphin",
        "url": "https://fileinfo.com/software/dolphin/dolphin"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Certain Wii game disk image management tools, such as Wiimms WBFS Tool and Wii Backup Manager, allow gamers to save Wii games as WBFS files. Gamers can use these files to play games on their Nintendo Wii, using the homebrew program USB Loader GX, or in a Wii emulator, such as Dolphin.",
      "However, due to limitations in previous versions of USB Loader, WBFS files can be no larger than 4GB. So, when a WBFS creation tool is used to save a game that is larger than 4GB, the tool creates both a WBFS file and a WBF1 file. The WBF1 file contains any game data that did not fit into the WBFS file. To play a game created this way, a player must have access to the game's WBFS and WBF1 file."
    ]
  },
  "more_information": {
    "description": [
      "A WBF1 file is the second part of a Wii game disk image created using Wiimms WBFS Tool, Wii Backup Manager, or another Nintendo Wii-related program. It contains a portion of a game that was too large to fit into a single .WBFS file. A WBF1 file must be paired with its corresponding WBFS file to be played on the Nintendo Wii or a Wii emulator."
    ]
  },
  "how_to_open": {
    "instructions": [
      "These days, most Wii USB Loaders and emulators can process files larger than 4GB. So, in order to play a game that is saved across both a WBFS and WBF1 file, you should:",
      "Move both files to a single folder.",
      "Rename your WBFS file to use the wbfs.001 extension. Then, rename your WBF1 file to use the wbfs.002 extension.",
      "Use a Zip-compresion program like 7-Zip to extract the files from the folder, merging them into one WBFS file.",
      "Load and play the WBFS file on your Nintendo Wii or Wii emulator.",
      "If your Wii USB Loader cannot process files larger than 4GB, do not perform the steps above. Instead, make sure your WBFS and WBF1 files are stored in the same folder on your USB drive or PC, before opening and playing your WBFS file."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/wbf1",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.214Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.214Z"
}