{
  "slug": "wcinv",
  "extension": "wcinv",
  "name": "Windows Meeting Space Invitation File",
  "summary": "Learn about .WCINV files and view a list of programs that open them.",
  "developer": "Microsoft",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10645&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Invitations to a meeting can be sent by email or instant message. When a user creates an invitation, the WCINV file is generated by Windows Meeting Space to store the invitation. The invitation can then be shared to other users and when they double-click the WCINV file, Windows Meeting Space is opened and they are brought to join the meeting.",
      "Windows Meeting Space was only used in Windows Vista and was replaced by Microsoft Office Live Meeting in Windows 7. The program featured collaborative editing, file sharing, instant messaging, and desktop sharing. Windows Meeting Space was also known as Windows Collaboration and Windows Shared View."
    ]
  },
  "more_information": {
    "description": [
      "A WCINV file contains an invitation created by Windows Meeting Space, a peer-to-peer collaboration program included with Windows Vista. It stores an invitation created to share with other users in order to invite them to join a meeting. WCINV files are no longer used by Windows Meeting Space since the program was discontinued."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/wcinv",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.865Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.865Z",
  "category": "other",
  "related": [],
  "containers": []
}