{
  "slug": "wcry",
  "extension": "wcry",
  "name": "WannaCry Virus Encrypted File",
  "summary": "Learn about .WCRY files and view a list of programs that open them.",
  "developer": "N/A",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10629&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "The WannaCry (WCry) malware is highly dangerous. The purpose of the virus is to take your files hostage and force you to pay the cybercriminals (by way of bitcoin) to unlock your files. The virus is primarily spread via phishing spam emails designed to coax the victim into opening a malicious email attachment. Once the virus affects your computer it begins scrambling your files, renaming them, and encrypting them. It appends the WCRY extension on to the file extension. For example, your example.pdf file becomes example.pdf.wcry. The virus then generates a .TXT ransom note informing you of the takeover and what you need to do to recover your files.",
      "A second version of the WannaCry virus, called Wana Decrypt0r 2.0, also spread in 2017. This version appended the .WNCRY extension to affected files.",
      "There is no program currently available to effectively restore your files. If you back up your files you can execute a full system restore."
    ]
  },
  "more_information": {
    "description": [
      "A WCRY file is a file encrypted by WannaCryptor, a ransomware infection utilized by cybercriminals. It contains a user's file, such as a .BAK, .DOC, .MPG, or .PDF file, encrypted by the virus. WCRY files became prevalent in 2017."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/wcry",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.216Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.216Z"
}