{
  "slug": "website",
  "extension": "website",
  "name": "Internet Explorer Pinned Site Shortcut",
  "summary": "Learn about .WEBSITE files and view a list of programs that open them.",
  "developer": "Microsoft",
  "category": "web",
  "category_slug": "web",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=5375&b=1"
      },
      {
        "name": "Microsoft Internet Explorer",
        "url": "https://fileinfo.com/software/microsoft/internet_explorer"
      }
    ]
  },
  "technical_info": {
    "content": [
      "To create a WEBSITE file in IE, click and drag the URL in the address bar or the website's \"favicon\" to your desktop. You can also drag the website to the Quick Launch area in Windows Vista or to the Task Bar in Windows 7 and Windows 8. This way, you can have quick access to your favorite websites.",
      "WEBSITE files were introduced in version 9 of IE and are not recognized by Windows computers with Internet Explorer 8 (IE8) or earlier installed. However, you can rename the .website extension to .url and open the file as a URL file. Previous versions of IE created .URL files when you dragged the address bar URL or favicon to the desktop. The difference between the two files is that WEBSITE files require an API key, whereas URL files only require the URL and favicon URL values. You can still create URL files in version 9 or later of IE by holding down the SHIFT key before you drag the favicon from the address bar to the desktop.",
      "To open the web location of a WEBSITE file in another web browser, open the file with a text editor such as Microsoft Notepad or WordPad. Since WEBSITE files are saved in plain text, you can navigate them with the text editor until you locate the \"URL\" property. Copy the URL and then paste it into the address bar of another web browser, such as Google Chrome or Mozilla Firefox.",
      "Windows does not display the .website file extension for pinned site shortcuts. To view the extension, open the file properties window by right-clicking the WEBSITE file and selecting Properties from the drop-down list."
    ]
  },
  "more_information": {
    "description": [
      "A WEBSITE file is a website shortcut file created with Microsoft Internet Explorer (IE). It contains a URL and an icon (ICO) file that points to the website’s favicon. The icon is used for displaying the shortcut. WEBSITE file format was introduced with the release of IE version 9. Previous versions of IE used to save shortcuts to webpages as .url files.",
      "A WEBSITE file contains a pinned site shortcut created by Internet Explorer (IE), a web browser for Windows. It stores a web address reference (a URL) and an icon file, which references the website's favicon.ico and is used as the displayed icon for the shortcut. WEBSITE files are typically used for saving and opening bookmarks and favorite sites."
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/web/website/index.html",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-01T22:32:42.291Z"
    },
    {
      "url": "https://fileinfo.com/extension/website",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.291Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.291Z",
  "containers": []
}