{
  "slug": "whacker",
  "extension": "whacker",
  "name": "Qosmetics Whacker",
  "summary": "Learn about .WHACKER files and view a list of programs that open them.",
  "developer": "RedBrumbler",
  "programs": {
    "windows": [
      {
        "name": "Unity",
        "url": "https://fileinfo.com/software/unity_technologies/unity"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13143&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Beat Saber is a VR rhythm game in which players slice blocks with sabers in time to music. The game's players have created a vibrant modding community that provides custom sabers, blocks, levels, and other items to players.",
      "In the Quest version of Beat Saber, players install mods primarily using BMBF, a modding application. One of the mods players can install is Qosmetics. Qosmetics allows players to import and use custom sabers, blocks, and walls.",
      "Custom sabers created for use with Qosmetics are saved as WHACKER files. Most often, modders create WHACKER files using the Qosmetics Unity Project, a Unity project designed specifically to be used to create custom Beat Saber for Quest assets."
    ]
  },
  "more_information": {
    "description": [
      "A WHACKER file is a custom saber that can be imported into the Oculus Quest version of Beat Saber. Modders create WHACKER files with the Qosmetics Unity Project. Players can import WHACKER files into Beat Saber with BMBF and the Qosmetics mod."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To use a WHACKER file with Beat Saber for Quest, you must first use BMBF to install the Qosmetics mod. Then, connect your Quest to your PC and place your WHACKER file in the following directory:",
      "quest/​moddata/​beatgames.beatsaber/​mods/​qosmetics/​sabers",
      "The saber your WHACKER file contains will then appear in-game on the Custom Saber menu."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/whacker",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.868Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.868Z",
  "category": "other",
  "related": [],
  "containers": []
}