{
  "slug": "win",
  "extension": "win",
  "name": "FoxPro Window Settings",
  "summary": "Learn about .WIN files and view a list of programs that open them.",
  "developer": "Microsoft",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1362&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Fox Software initially developed FoxPro in the 1980s, and Microsoft later acquired the software in 1992. It started as a database management system (DBMS), then evolved into a programming language, and was widely used for building database applications, especially in the 1990s, running in a command-line environment.",
      "FoxPro users could back up window layouts as WIN files with the SAVE WINDOW command. They could then reload window settings saved in a WIN file with the RESTORE WINDOW command.",
      "NOTE: Microsoft eventually replaced FoxPro with Visual FoxPro (VFP) in the 1990s and then discontinued the software in 2007."
    ]
  },
  "more_information": {
    "description": [
      "A WIN file is a window settings file used by older versions of Microsoft FoxPro, a discontinued Windows database management system. It contains window definitions and settings referenced by the software to preserve the position, size, and state of windows within the FoxPro environment. WIN files help maintain a consistent workspace configuration across sessions."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open WIN files with older versions of Microsoft FoxPro, which is no longer developed. To open a WIN file with FoxPro, type the RESTORE WINDOW command."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/win",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.221Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.221Z"
}