{
  "slug": "wlt",
  "extension": "wlt",
  "name": "Unity Window Layout File",
  "summary": "Learn about .WLT files and view a list of programs that open them.",
  "developer": "Unity Technologies",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11869&b=1"
      },
      {
        "name": "Unity Technologies Unity",
        "url": "https://fileinfo.com/software/unity_technologies/unity"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Unity is a cross-platform 3D video game development application. As a developer creates a game in Unity, they can customize Unity's game development workspace. For example, a developer can drag and dock tabs on any side of a workspace, they can add tabs to a workspace, and they can remove tabs from a workspace.",
      "After customizing their workspace in this way, developers can save their custom workspace layout settings. To do so, they open the Layout dropdown menu and then select Save Layout.... When they do, Unity saves the developer's custom layout settings in a WLT file. Unity includes several pre-created WLT files, including the Tall and Wide window layouts that developers can select from the Layout menu."
    ]
  },
  "more_information": {
    "description": [
      "A WLT file is a settings file used to configure the layout of Unity, a 3D game development application. It contains plain text written in the YAML (YAML Ain't Markup Language) format. WLT files control where and how windows appear in Unity's game development workspace."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To use a WLT file as a Unity window layout, you must place the file in Unity's Layouts directory. This directory is located in different places in different versions of Unity, but is always a subdirectory of the Unity directory. After you place your WLT file in Unity's Layouts directory, you should be able to select it from Unity's Layout dropdown menu."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/wlt",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.871Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.871Z",
  "category": "other",
  "related": [],
  "containers": []
}