{
  "slug": "wme",
  "extension": "wme",
  "name": "Windows Media Encoder Session File",
  "summary": "Learn about .WME files and view a list of programs that open them.",
  "developer": "Microsoft",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10461&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "If you come across the WME file on your computer you most likely have used Microsoft Windows Media Encoder 9 Series or at least have it installed. Typically, a WME file is created when a user selects File → Save... in the program's interface. The program comes with a New Session Wizard, which guides you through the steps of configuring an encoding session.",
      "However, the program also comes with quick start WME files that contain settings for common encoding scenarios in order to get you started quicker. These quick start files can be considered template WME files.",
      "NOTE: Microsoft Windows Media Encoder 9 Series is no longer developed. It was replaced by Microsoft Expression Encoder."
    ]
  },
  "more_information": {
    "description": [
      "A WME file is a session profile created by Microsoft Windows Media Encoder 9 Series, a production tool used to convert audio and video that is live or prerecorded into Windows Media files (.WMV or .WMA files) or streams. It contains settings for an encoding session that can be used for other sessions."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/wme",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.224Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.224Z"
}