{
  "slug": "wncryt",
  "extension": "wncryt",
  "name": "Wana Decrypt0r 2.0 Temporary File",
  "summary": "Learn about .WNCRYT files and view a list of programs that open them.",
  "developer": "N/A",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12427&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Wana Decrypt0r 2.0 is an updated version of WannaCry (WCry) ransomware. This virus encrypts your files and appends the .wncry extension to them, producing files that look something like filename.docx.wncry. The encryption prevents you from opening the files.",
      "The virus then produces a .TXT ransom note explaining what has happened to your files, as well as how you can pay a ransom to decrypt them. (FileInfo recommends you never pay a ransom to decrypt your files.)",
      "During the encryption process, Wana Decrypt0r 2.0 produces WNCRYT files. These files are temporary files, which are eventually replaced by corresponding WNCRY files."
    ]
  },
  "more_information": {
    "description": [
      "A WNCRYT file is a temporary file produced by Wana Decrypt0r 2.0 ransomware. It is created as part of the ransomware's encryption process. After the encryption process is completed, WNCRYT files become WNCRY files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "While some WNCRY and WNCRYT decryption tools exist, they do not work reliably. The best way to restore your WNCRYT and WNCRY files is to perform a system restore on your PC or load uninfected versions of your files from a backup. If you cannot restore your files using a system restore or backup, you may want to try the WNCRY decryption tools linked below."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/wncryt",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.225Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.225Z"
}