{
  "slug": "wotbreplay",
  "extension": "wotbreplay",
  "name": "World of Tanks Blitz Replay",
  "summary": "Learn about .WOTBREPLAY files and view a list of programs that open them.",
  "developer": "Wargaming.net",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12287&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "In 2013, Wargaming.net released World of Tanks Blitz. This mobile-friendly version of World of Tanks, which was initially released on Android, iOS, and Windows mobile devices, allows players to engage in 7-on-7 virtual tank battles. Later, Wargaming.net released Windows, Mac, Steam, and Nintendo Switch versions of World of Tanks Blitz.",
      "After players finish a World of Tanks Blitz match, they can view and save a replay of that match. These replays are saved as WOTBREPLAY files. Players can also share WOTBREPLAY files with each other if they want to watch each others' replays. Some players upload their WOTBREPLAY files to replay-hosting websites like wotinspector.com, to make the files easier for other players to access."
    ]
  },
  "more_information": {
    "description": [
      "A WOTBREPLAY file is a game replay created by World of Tanks Blitz, the mobile-friendly version of the World of Tanks video game. It contains footage recorded during a match. WOTBREPLAY files can be played in World of Tanks Blitz."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a WOTBREPLAY using World of Tanks Blitz (cross-platform). The exact steps needed to do so depend on which version of World of Tanks Blitz you're playing. For example, on Android, you can tap your WOTBREPLAY file, select Open with, and select World of Tanks Blitz to play your WOTBREPLAY file."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/wotbreplay",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.227Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.227Z"
}