{
  "slug": "wpp",
  "extension": "wpp",
  "name": "WebPlus Project File",
  "summary": "Learn about .WPP files and view a list of programs that open them.",
  "developer": "Serif",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=3029&b=1"
      },
      {
        "name": "Corel WordPerfect",
        "url": "https://fileinfo.com/software/corel/wordperfect"
      },
      {
        "name": "Corel WordPerfect 2021",
        "url": "https://fileinfo.com/software/corel/wordperfect"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Serif WebPlus was initially released in 2000 and featured WYSIWYG editing capabilities. The application supported manual coding, but it was primarily developed to make website design easier for novices by allowing them to drag and drop elements, such as buttons, graphics, and forms, onto their website design.",
      "The WPP file is the primary file type associated with WebPlus because it stores all the information about a project when you save a website project. You can save a project, close it, then re-open it to edit it further.",
      "WPP files are not meant to be uploaded as a website. Instead, you can publish the site as the appropriate .HTML and .CSS files with WebPlus when you are done modifying it."
    ]
  },
  "more_information": {
    "description": [
      "A WPP file contains a website development project created with Serif WebPlus, a graphics-based web design program. It may store text, images, podcasts, YouTube videos, Flash animations, secure pages, e-commerce functionality, and dynamic content."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can only open WPP files with Serif WebPlus. Unfortunately, Serif no longer develops WebPlus, making it hard to find and install the application. The last version of the program was X8 and discontinued in 2016."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/wpp",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.229Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.229Z"
}