{
  "slug": "wrf",
  "extension": "wrf",
  "name": "WebEx Recording",
  "summary": "Learn about .WRF files and view a list of programs that open them.",
  "developer": "Cisco Systems",
  "programs": {
    "windows": [
      {
        "name": "Microsoft Windows Media Player",
        "url": "https://fileinfo.com/software/microsoft/windows_media_player"
      },
      {
        "name": "VideoLAN VLC media player",
        "url": "https://fileinfo.com/software/videolan/vlc_media_player"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1117&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "WebEx users can use the WebEx Recorder to record the actions they perform on their PC and an audio walkthrough of those actions, creating a training video or demonstration to be shared with other WebEx users. These recordings are saved as WRF files.",
      "WRF files use a proprietary video format that is recognized only by WebEx Recorder, Player, and Recording Editor. To watch the video a WRF file contains outside WebEx's players, you must convert the file to a more common video file format, such as .WMV.",
      "You can use the Cisco WebEx WRF2WMV Converter to convert a WRF file to a WMV file. WMV files can be played in many media players, including Microsoft Windows Media Player and VideoLAN VLC media player."
    ]
  },
  "more_information": {
    "description": [
      "A WRF file is a video recording created by Cisco WebEx Recorder, a screen-recording program that is an extension of Cisco WebEx. Typically, WRF files contain training videos or demonstrations. The files can be played in Cisco WebEx Player, which is freely available on WebEx's website."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open and play a WRF file in Cisco WebEx Player (Windows, Mac). To do so, download, install, and open WebEx Player, and then select File → Open... from the program's menu bar. Then, navigate to and open your WRF file."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/wrf",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.876Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.876Z",
  "category": "other",
  "related": [],
  "containers": []
}