{
  "slug": "wsz",
  "extension": "wsz",
  "name": "Winamp Classic Skin",
  "summary": "Learn about .WSZ files and view a list of programs that open them.",
  "developer": "Nullsoft",
  "programs": {
    "windows": [
      {
        "name": "Winamp",
        "url": "https://fileinfo.com/software/nullsoft/winamp"
      },
      {
        "name": "VLC media player",
        "url": "https://fileinfo.com/software/videolan/vlc_media_player"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1668&b=1"
      },
      {
        "name": "Nullsoft Winamp",
        "url": "https://fileinfo.com/software/nullsoft/winamp"
      },
      {
        "name": "VideoLAN VLC media player",
        "url": "https://fileinfo.com/software/videolan/vlc_media_player"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Winamp is a free media player that supports many audio and video formats and provides tools for organizing media files. The program also allows users to customize its appearance, using files referred to as Winamp skins.",
      "By default, Winamp includes a handful of skins. However, the Winamp community has created thousands of additional custom skins, which are stored on websites such as Winamp Heritage and the Winamp Skin Museum. Typically, these skins are saved as WSZ files.",
      "WSZ files are Zip-compressed archives that contain all the component files needed to transform Winamp's appearance. Specifically, WSZ files contain 45 different files, most of which are BMP images that are applied to Winamp's buttons, borders, and other UI items. WSZ files also contain CUR files, which transform a user's cursor, and .TXT files, which specify how the skin's images should be applied.",
      "Users who want to create their own Winamp skins can do so using a variety of custom skin creation programs. SkinAmp is one popular program that allows users to create their own WSZ files.",
      "NOTE: Winamp skins may also be saved as .WAL files."
    ]
  },
  "more_information": {
    "description": [
      "A WSZ file is a custom skin used to alter the appearance of Nullsoft Winamp, a media player available for Windows. It contains a collection of .BMP images, .CUR images, and text files that, together, comprise a skin. WSZ files are also used to apply skins to some other media players, such as VLC media player and Audacious."
    ]
  },
  "how_to_open": {
    "instructions": [
      "If you have Winamp (Windows) installed, you can simply double-click a WSZ file to apply it as a Winamp skin. Alternatively, you can manually place the file in Winamp's Skins directory and then select it from Winamp's Skin Browser (Options → Skins → Skin Browser...).",
      "You can also use WSZ files to alter the appearance of VLC media player (cross-platform) and Audacious (Linux). For instructions on how to use WSZ files with these programs, refer to the programs' documentation."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/wsz_1668.png",
      "alt": "Screenshot of a .wsz file in Nullsoft Winamp 5",
      "caption": "WSZ file open in Nullsoft Winamp 5"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/wsz",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.878Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.878Z",
  "category": "other",
  "related": [],
  "containers": []
}