{
  "slug": "wvm",
  "extension": "wvm",
  "name": "Google Play Video File",
  "summary": "Learn about .WVM files and view a list of programs that open them.",
  "developer": "Google",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10513&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "You probably will never see the actual WVM file on your Android device. You will most likely only see the movie or TV show in the WVM file within the Google Play Movies & TV app. However, if you have a file manager installed you can navigate to the WVM file located in the following directory:",
      "com.google.android.videos/​files/​Movies/​",
      "WVM files appear to be saved in the same format as .WMV files but are not interchangeable. Do not attempt to change the \".wvm\" extension to \".wmv\". If you come across a WVM file you will not be able to play it on your computer because of the DRM encryption. The WVM file is created and encrypted in order to be played only in Google Play Movies & TV.",
      "NOTE: You can convert a WVM file to another file, such as .MP4 or .MKV, which is supported by other desktop and mobile video players. Handbrake and Brorsoft Video Converter allow you to convert WVM files to other video formats."
    ]
  },
  "more_information": {
    "description": [
      "A WVM file is a video file used by Google Play Movies & TV, an Android app used to watch purchased or rented movies and TV shows. It contains video downloaded from Google Play that is saved in a proprietary format similar to MPEG-4. WVM files are encrypted with Widevine, a DRM platform for protecting copyrighted content."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/wvm",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.879Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.879Z",
  "category": "other",
  "related": [],
  "containers": []
}