{
  "slug": "xem",
  "extension": "xem",
  "name": "eManager Metered Units",
  "summary": "Learn about .XEM files and view a list of programs that open them.",
  "developer": "X-Genics",
  "category": "database",
  "category_slug": "database",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1233&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Businesses use X-Genics eManager and its associated SmartApps to monitor and report on business procedures, quality assurance metrics, and regulatory compliance. One of the items that businesses can use eManager to report on is metered units and credits, of which a business is allowed to use only a certain amount."
    ]
  },
  "more_information": {
    "description": [
      "XEM file is XML metadata interchange file that can be used to export metadata information about PowerDesigner model to external file. XEM file includes information about the model including entities, relationships, keys, diagrams and other relevant metadata. The file can be used to transfer or share model with other users or systems or to create a backup of the model for safekeeping.\n\nTo export PowerDesigner model to .xem file, you can go to File menu and select “Export” and then “XML Metadata Interchange”. You can then select specific elements of model that you want to export and save resulting .xem file to desired location.\n\nSimilarly, you can import .xem file into PowerDesigner model by selecting “Import” from the File menu and then choosing “XML Metadata Interchange” option. You can then select .xem file to import and choose specific elements to import into your model.\n\nThe .xem file format is a useful feature of PowerDesigner that enables users to share and transfer metadata information between different systems or users.",
      "The format of XEM file is text based which means it can be opened or edited using any text editor e.g. Notepad, Notepad++ etc. The format follows XML standard which is a widely used standard to store and exchange data between different systems.",
      "An XEM file is a settings file used by X-Genics eManager. It defines metered units and credits, which businesses can track from within eManager."
    ]
  },
  "how_to_open": {
    "instructions": [
      "For instructions on how to use XEM files with X-Genics eManager, refer to the program's documentation."
    ]
  },
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/database/xem/",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-02T02:43:26.540Z"
    },
    {
      "url": "https://fileinfo.com/extension/xem",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.540Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.540Z"
}