{
  "slug": "xft",
  "extension": "xft",
  "name": "ChiWriter Printer Font",
  "summary": "Learn about .XFT files and view a list of programs that open them.",
  "developer": "Horstmann Software Design",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1868&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "ChiWriter supported both screen fonts and printer fonts. While screen fonts displayed the document on screen, XFT files ensured that the printed output matched the appearance of the on-screen content as closely as possible.",
      "Each XFT file typically contained a specific font style or symbol set and was designed to work with a certain printer resolution and dot arrangement, especially for high-resolution 24-pin matrix printers. Although ChiWriter was discontinued in 1996, researchers, engineers, and academics who used it to create technical documents might still encounter XFT files when accessing old ChiWriter documents."
    ]
  },
  "more_information": {
    "description": [
      "An XFT file is a printer font file used by ChiWriter, a scientific word processor developed for MS-DOS in the 1980s and 1990s. It contains font data formatted explicitly for 24-pin dot matrix printers, which were commonly used at the time. ChiWriter used XFT files to render mathematical and technical text accurately when printing documents that contained multiple fonts and complex symbols."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open XFT files with Horstmann Software Design ChiWriter in Windows. However, the software is no longer developed."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/xft",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.249Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.249Z"
}