{
  "slug": "xma",
  "extension": "xma",
  "name": "Xbox Media Audio File",
  "summary": "Learn about .XMA files and view a list of programs that open them.",
  "developer": "Microsoft",
  "programs": {
    "windows": [
      {
        "name": "File Viewer Plus",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11201"
      }
    ]
  },
  "technical_info": {
    "content": [
      "The XMA format is based on the Windows Media Audio (WMA) format. It was originally conceived by Henrique Malvar before Microsoft took over the development of the format to compete with .MP3 files. The XMA format was then introduced as a variation of the WMA format to store audio used by Xbox 360 video games.",
      "You will most likely only encounter an XMA file if you are attempting to extract music, character voice clips or sound effects from a video game. Because the audio files are not meant to be played outside of the game, they are not supported by media players.",
      "However, there are several programs that can convert XMA files to more widely supported audio formats, such as iDealshare VideoGo and ToWav."
    ]
  },
  "more_information": {
    "description": [
      "An XMA file is an audio file used by the Xbox 360 gaming console and DirectX components in Windows. It contains audio encoded with the Xbox Native Audio codec and is similar to a .WMA file but features more audio channels and a higher bitrate. XMA files are used in various games, such as Castle Crashers, Resident Evil 6, and Dead Rising 2: Case Zero."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/xma",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.897Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.897Z",
  "category": "other",
  "related": [],
  "containers": []
}