{
  "slug": "xmmas",
  "extension": "xmmas",
  "name": "MindManager XML Map Theme File",
  "summary": "Learn about .XMMAS files and view a list of programs that open them.",
  "developer": "Corel",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12594&b=1"
      },
      {
        "name": "Corel MindManager",
        "url": "https://fileinfo.com/software/corel/mindmanager"
      }
    ]
  },
  "technical_info": {
    "content": [
      "MindManager mind maps are diagrams comprised of a main topic connected to subtopics, text, images, and other objects. They may also include notes that provide context for information within the mind map. The primary purpose of mind maps is to organize information, such as brainstorming sessions and complex processes.",
      "MindManager users typically save mind maps as .MMAP files, then apply themes saved as MMAS or XMMAS files to adjust the maps' appearance. For example, a user may use a dark, simple theme for business-related diagrams and a colorful theme for a personal diagram.",
      "NOTE: The advantage of the MMAS binary format is that it requires less storage space. However, the XMMAS XML format is more transportable since other applications can more easily read it."
    ]
  },
  "more_information": {
    "description": [
      "An XMMAS file contains a diagram theme created by Corel MindManager, a visual diagramming application used to organize ideas, plans, and projects. It stores formatting elements, such as the text color and font, shape colors, and the map background, that make up the appearance of a mind map. XMMAS files are similar to the more common .MMAS format but store settings in the XML standard instead of binary code."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an XMMAS file with Corel MindManager (Windows and macOS). To open an MMAS file and apply a theme to a map, select Format → Map Theme → Apply from File... and choose the XMMAS file."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/xmmas_12594.png",
      "alt": "Screenshot of a .xmmas file in Corel MindManager 22",
      "caption": "XMMAS file open in Corel MindManager 22"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/xmmas",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.253Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.253Z"
}