{
  "slug": "xstage",
  "extension": "xstage",
  "name": "Harmony Scene",
  "summary": "Learn about .XSTAGE files and view a list of programs that open them.",
  "developer": "Toon Boom",
  "programs": {
    "windows": [
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12689&b=1"
      },
      {
        "name": "GitHub Atom",
        "url": "https://fileinfo.com/software/github/atom"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Professional animators use Toon Boom Harmony to draw, paint, and animate 2D animations. Harmony is available in three different versions: Essentials, Advanced, and Premium.",
      "All versions of Harmony save animation projects in directories that include an XSTAGE file. Each XSTAGE file stores the information needed to load the project's frames and elements in Harmony. It also defines the project's intended resolution, aspect ratio, and frame rate, and it states the version of Harmony that created the file.",
      "In some versions of Harmony, users can save different versions of the same scene in additional XSTAGE files. Therefore, you may see slightly differently-named XSTAGE files that contain a slightly different version of the same scene.",
      "NOTE: Harmony often creates backup project files that use the .xstage~ extension."
    ]
  },
  "more_information": {
    "description": [
      "An XSTAGE file is a project file created by Toon Boom Harmony, a 2D animation program. It contains all the data needed to open a Harmony animation project, formatted using XML. XSTAGE files are commonly referred to as Harmony scenes."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an XSTAGE file in Toon Boom Harmony (Windows, Mac). To do so, select File → Open. Then, navigate to and open your XSTAGE file.",
      "If you want to view the XML data an XSTAGE file contains, you can open it in Microsoft Notepad, Apple TextEdit, or any other text editor."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/xstage_12689.png",
      "alt": "Screenshot of a .xstage file in Microsoft Visual Studio Code",
      "caption": "XSTAGE file open in Microsoft Visual Studio Code"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/xstage",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.258Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.258Z"
}