{
  "slug": "xy3",
  "extension": "xy3",
  "name": "XyWrite III Document",
  "summary": "Learn about .XY3 files and view a list of programs that open them.",
  "developer": "XyQuest",
  "programs": {
    "windows": [
      {
        "name": "Microsoft Visual Studio Code",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1533&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "XyQuest released the original version of XyWrite in September 1982. Later versions of XyWrite, such as XyWrite III, became popular with newspaper and magazine editors, who used the program to create and edit articles.",
      "XyWrite III saved users' documents as XY3 files. These files are plain text files, which include both document text and plain text markup used to denote document formatting. Other versions of XyWrite saved users' documents as .XY, .XYP, and .XYW files."
    ]
  },
  "more_information": {
    "description": [
      "An XY3 file is a text document created by version 3 of XyWrite, a word processor for MS-DOS. XyWrite III and XY3 files were common in the newspaper and magazine industry during the 1980s. Thus, XY3 files typically contain newspaper or magazine articles."
    ]
  },
  "how_to_open": {
    "instructions": [
      "While XyWrite III is discontinued, you may be able to open an XY3 file with Edward Mendelson of Columbia University's updated version of XyWrite for Windows, which is linked below.",
      "You can also open an XY3 file with Microsoft Visual Studio Code or any other text editor. However, these programs will not format the document your XY3 file contains. (Instead, they'll show the document's formatting as plain text markup.)"
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/xy3",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.261Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.261Z"
}