{
  "slug": "xyw",
  "extension": "xyw",
  "name": "XyWrite for Windows Document",
  "summary": "Learn about .XYW files and view a list of programs that open them.",
  "developer": "The Technology Group",
  "programs": {
    "windows": [
      {
        "name": "Microsoft Visual Studio Code",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1535&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "XyWrite was a word processor available for MS-DOS and early versions of Microsoft Windows in the 1980s and 90s. Because XyWrite contained many powerful (but tough-to-learn) editing features and commands, it was popular in newspaper editorial offices, where it was used to write and edit articles for publication.",
      "The Windows version of XyWrite saved documents as XYW files. Other versions of XyWrite saved documents in other formats, including .XY, .XYP, and .XY3."
    ]
  },
  "more_information": {
    "description": [
      "An XYW file is a text document created by XyWrite for Windows, a discontinued word processor. It likely contains a newspaper article, magazine article, or other document meant for publication. XyWrite and XYW files were most commonly used by newspaper and magazine editors during the early 1990s."
    ]
  },
  "how_to_open": {
    "instructions": [
      "While XyWrite for Windows is no longer available for purchase, Edward Mendelson of Columbia University has created a version of the program that can run on modern Windows machines. You can open XYW files with this version of XyWrite for Windows.",
      "You can also open an XYW file with Microsoft Visual Studio Code or any other text editor, though these programs will not format the document."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "You can use Edward Mendelson's PrintFilePrinter program in combination with his revamped version of XyWrite for Windows to convert XYW files to .PDF files. For detailed instructions, refer to Mendelson's documentation (linked below)."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/xyw",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.907Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.907Z",
  "category": "other",
  "related": [],
  "containers": []
}