{
  "slug": "ycd",
  "extension": "ycd",
  "name": "Y-Cruncher Data",
  "summary": "Learn about .YCD files and view a list of programs that open them.",
  "developer": "Alexander J. Yee",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13304&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Pi is a mathematical constant that describes the ratio of a circle's circumference to its diameter. While most people shorten this constant to the number 3.14 or 3.14159, it is actually a never-ending number that contains an infinite number of digits, extending to an infinite number of decimal places.",
      "Y-Cruncher is a program that allows users to compute Pi (and other mathematical constants) out to trillions of digits. Primarily, IT administrators and other technically-minded users use Y-Cruncher to test system infrastructure, by making their system calculate Pi as far out as it can, as fast as it can. As of this writing, Google employee Emma Haruka Iwao has the record for the number of Pi digits calculated using Y-Cruncher, at 100 trillion digits using Google Cloud.",
      "The Pi digits that Y-Cruncher calculates are saved within YCD files. Various programs, including Y-Cruncher's internal Digit Viewer, can read these files to show the digits they contain. Typically, YCD files use sequentially-numbered filenames, which denote roughly where the digits that they contain fall within Pi."
    ]
  },
  "more_information": {
    "description": [
      "A YCD file is a data file created by Y-Cruncher, a program that computes digits of Pi. It contains a subset of the digits of Pi, stored in a decimal or hexadecimal format. YCD files are typically quite large in size and stored together in large sets, because they are created by users seeking to break the world record for the most digits of Pi ever computed."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can use the Y-Cruncher Digit Viewer to view the digits of Pi that a YCD file contains. The Digit Viewer is packaged with Y-Cruncher and available as a standalone program."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/ycd",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.908Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.908Z",
  "category": "other",
  "related": [],
  "containers": []
}