{
  "slug": "yoti",
  "extension": "yoti",
  "name": "Yoti Recovery File",
  "summary": "Learn about .YOTI files and view a list of programs that open them.",
  "developer": "Yoti",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12398&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Yoti is an identity verification app that allows users to import pictures and documents to create an identification card. The user can then show their card or reference their Yoti account while shopping or performing other transactions, to verify their identity.",
      "If a user wants to \"back up\" their Yoti account, they can do so by creating a Yoti recovery file. This file, named RECOVERY.yoti, does not actually contain any of the user's Yoti account information. Instead, it contains a recovery key that Yoti's servers use to reconnect the user with their account (e.g. if the user switches phones and re-downloads Yoti).",
      "Users who created a YOTI file from their iPhone can find the file in their iCloud. Users who created a YOTI file from an Android device can find the file in their Google Drive. YOTI files are created by selecting More → Settings → Account settings → My recovery file in Yoti."
    ]
  },
  "more_information": {
    "description": [
      "A YOTI file is a recovery file created by Yoti, an identity verification app. It contains a recovery key that allows a user to reconnect the Yoti mobile app with their Yoti account. YOTI files are always named RECOVERY.yoti. They are stored in users' iCloud or Google Drive."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can use a RECOVERY.yoti file to restore your Yoti account on an Android or iOS device, while opening the Yoti app for the first time. To do so, open Yoti and select Already have an account. Then, select Restore from iCloud (iOS) or Restore from Google Drive (Android). Yoti will automatically search for and use your RECOVERY.yoti file to restore your account.",
      "NOTE: You can use your RECOVERY.yoti file to restore your account across platforms. To do so, download and transfer your YOTI file from iCloud to Google Drive, or vice-versa, before starting the recovery process."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/yoti",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.265Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.265Z"
}