{
  "slug": "zbot",
  "extension": "zbot",
  "name": "zBot Replay",
  "summary": "Learn about .ZBOT files and view a list of programs that open them.",
  "developer": "FigmentBoy",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12754&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "zBot is a Geometry Dash mod that allows players to record and play back their gameplay. Players can also use zBot to slow down Geometry Dash's gameplay, making levels easier to complete (and successful replays easier to record).",
      "After a player finishes creating a replay, they can choose to save it in a ZBOT file. zBot saves ZBOT files in the ~/​Geometry Dash/​replays directory. Any player who has zBot installed can load a ZBOT file to play the replay it contains."
    ]
  },
  "more_information": {
    "description": [
      "A ZBOT file is a Geometry Dash replay created by zBot, a Geometry Dash mod. It contains a recording of a player's run through a Geometry Dash level. ZBOT files can be played in Geometry Dash after installing zBot."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a ZBOT file in Geometry Dash with the zBOT mod installed (Windows). To do so, first make sure your ZBOT file is saved in the following directory:",
      "Steam/​steamapps/​common/​Geometry Dash/​replays",
      "Then, open Geometry Dash and press Right Shift to open zBot. After the zBot window appears, select the Open Replays Folder button to open your replays folder and load your ZBOT file."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/zbot",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.267Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.267Z"
}