{
  "slug": "zma",
  "extension": "zma",
  "name": "Impedance Data File",
  "summary": "Learn about .ZMA files and view a list of programs that open them.",
  "developer": "N/A",
  "programs": {
    "windows": [
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=9097&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "SPL Tracer was a small Windows utility during the late 1990s and early 2000s designed to help speaker enthusiasts and audio engineers convert printed or scanned speaker measurement graphs, such as frequency response and impedance plots, into digital data formats like FRD and ZMA. Users could then import these formats into speaker design and simulation tools, most notably Speaker Workshop, a now-discontinued Windows program developed by Audua for designing and testing loudspeakers.",
      "NOTE: Both SPL Tracer and Speaker Workshop are no longer actively maintained or available for download."
    ]
  },
  "more_information": {
    "description": [
      "A ZMA file contains speaker impedance data created by SPL Tracer, a tool that converts speaker measurement graphs into digital data. It stores numeric data, such as impedance values and phase response, which are used to evaluate and simulate the performance of a speaker driver. ZMA files are similar to .FRD files, which store frequency response data."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open ZMA files with Room EQ Wizard by selecting File → Open. Speakerbench.com also supports ZMA files.",
      "You can also open ZMA files with SPL Tracer and Audua Speaker Workshop; however, both of these programs are now discontinued. If you do have access to Speaker Workshop, select Resource → Import… from the menu or right-click the “Project Tree” and choose Import…, then locate and open the ZMA file.",
      "Since ZMA files store plain text information, you can also open them with a text editor, such as Microsoft Notepad (Windows) and Apple TextEdit (macOS)."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/zma",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T22:32:42.917Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.917Z",
  "category": "other",
  "related": [],
  "containers": []
}