{
  "slug": "zoo",
  "extension": "zoo",
  "name": "Zoo Compressed File",
  "summary": "Learn about .ZOO files and view a list of programs that open them.",
  "developer": "Rahul Dhesi",
  "category": "compression",
  "category_slug": "compression",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=237&b=1"
      },
      {
        "name": "ESTsoft ALZip",
        "url": "https://fileinfo.com/software/estsoft/alzip"
      },
      {
        "name": "The Unarchiver",
        "url": "https://fileinfo.com/software/dag_agren/the_unarchiver"
      }
    ]
  },
  "technical_info": {
    "content": [
      "In the 1980s, developer Rahul Dhesi created the zoo compression program and the ZOO file format. Zoo was available for Unix-based operating systems, MS-DOS, and AmigaOS.",
      "Notably, ZOO archives can contain multiple versions of the same file, if each version was modified on a different date. This allows zoo users to save and retrieve prior versions of a file from a ZOO archive, to revert to a previous version or compare an old version to a more recent version."
    ]
  },
  "more_information": {
    "description": [
      "A .zoo file is an archive format that is used to compress and store files and directories; is similar to other archive formats like .zip, .tar, and .rar. The .zoo format was popular in early days of computing but has become less common in recent years. It was originally developed by Rahul Dhesi and was used primarily on Unix and DOS systems.\n\nA .zoo file typically contains one or more files and directories that have been compressed and archived into single file. You can create and extract .zoo files using various software tools that support this format.\n\nZOO archives have a unique feature that allows them to store multiple versions of same file provided each version was modified on different date. This means that ZOO users can save and access previous iterations of file directly from ZOO archive. This feature enables users to revert to earlier version of file or compare older version with more recent one offering convenient way to manage file revisions and changes over time.",
      "A ZOO file is a compressed archive created by the zoo compression program. It contains one or more files that have been compressed using a variant of the Lempel-Ziv-Welch (LZW) compression algorithm. Zoo was primarily available on Unix systems, so Unix users are most likely to encounter ZOO files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Programs that open ZOO files include\n\nzoo (Free) for (Windows, Linux)",
      "You can open a ZOO file with Logipole Konvertor (Windows), ESTsoft ALZip (Windows), The Unarchiver (Mac), or zoo (Windows, Linux)."
    ]
  },
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ],
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://docs.fileformat.com/compression/zoo/",
      "source": "fileformat.com",
      "retrieved_at": "2025-11-02T02:43:26.542Z"
    },
    {
      "url": "https://fileinfo.com/extension/zoo",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:26.542Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.542Z"
}