{
  "slug": "zvf",
  "extension": "zvf",
  "name": "Zipped Intergraph Smart Review Project",
  "summary": "Learn about .ZVF files and view a list of programs that open them.",
  "developer": "Hexagon",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13450&b=1"
      }
    ]
  },
  "technical_info": {
    "content": [
      "Hexagon publishes applications that allow process plant, power plant, and marine structure designers to create and review 3D models of complex structures. Hexagon's software suite includes SmartPlant Publisher and Smart Interop Publisher, programs used to create and publish models, and SmartPlant Review, a program used to review models.",
      "When publishing a set of models from SmartPlant Publisher or Smart Interop Publisher, designers can choose to package those models within a single ZVF file. Like Hexagon SVF files, ZVF files contain multiple models saved in the VUE format, as well as accompanying attribute and metadata files. However, unlike SVF files, ZVF files are Zip-compressed, to make them easier to share with others and store on a network or cloud server.",
      "NOTE: Hexagon recommends saving and opening models as VUE files when possible, to maximize application performance and model fidelity."
    ]
  },
  "more_information": {
    "description": [
      "A ZVF file is a Zip-compressed Intergraph Smart Review project file (.SVF file). It contains multiple SmartPlant Review .VUE files, which have been packaged together as a single file and then compressed. Structure designers create ZVF files with SmartPlant Publisher and Smart Interop Publisher."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a ZVF file with Hexagon Intergraph Smart Review (Windows), to view the 3D models it contains. To do so:",
      "Select File → Open from Smart Review's menu bar.",
      "Navigate to and open your ZVF file.",
      "In the Create Project window, click OK.",
      "In the Load View Files window, select the VUE files you want to load.",
      "Click OK.",
      "Smart Review will then display the VUE files you selected."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/zvf",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-02T02:43:27.273Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.273Z"
}