{
  "slug": "aft",
  "extension": "aft",
  "name": "Ancestry.com Family Tree Database",
  "summary": "Learn about .AFT files and view a list of programs that open them.",
  "developer": "Ancestry.com",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "Ancestry.com released Ancestry Family Tree in 2001 as a free Windows application for managing family tree information. The program allows you to add family members and information about them, such as their name, birth date, and birthplace, then save the information in an AFT file.",
      "When Ancestry.com acquired Family Tree Maker, another ancestry management application, they ceased the development of Ancestry Family Tree and the AFT format. Family Tree Maker supported the AFT format up to version 2005 SE of the software. Since the AFT format is no longer developed, AFT files are rare."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an AFT file with Ancestry.com Family Tree Maker. However, the software is discontinued, and the program is no longer available.",
      "If you have access to Family Tree Maker 2005 SE, you can convert it to an .FTM file and open it with version 2008 and later of Family Tree Maker (Software MacKiev acquired Family Tree Maker from ancestry.com in 2015)."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "You can convert an AFT file to an FTM file with Family Tree Maker 2005 SE. To convert the file, select File → Open to open the AFT file, then follow the prompts to save it as a new working file (FTM file)."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1221&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/aft",
      "retrieved_at": "2025-11-01T22:32:42.319Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.319Z"
}