{
  "slug": "art70",
  "extension": "art70",
  "name": "BERNINA ARTlink 7 Embroidery File",
  "summary": "Learn about .ART70 files and view a list of programs that open them.",
  "developer": "BERNINA",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "The ART70 format was introduced with the release of ARTlink 7. It is the default file type used by version 7 of ARTlink to save designs that can be re-opened and modified by software. The format is only used by version 7 and later of ARTlink.",
      "Older versions of ARTlink save designs as ART files, by default. But beginning with version 5 of ARTlink, the software saves designs with file extensions that reflect the version of the software. For example, ARTlink 5 saves designs as .ART50 files, and ARTlink 6 saves designs as .ART60 files.",
      "To transfer the converted design, insert a USB storage device in your computer, then copy the converted design file to the connected storage device via File Explorer in Windows or Finder in macOS. You can also transfer the file to a connected storage device directly from within ARTlink by selecting File → Write to Card/Machine....",
      "After successfully transferring the file, eject the storage device from your computer and insert it into the sewing machine port. Then, transfer the design to the machine and embroider it onto the material."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open ART70 files with BERNINA ARTlink (version 7 and later) in Windows. To open the ART70 file, select File → Open Design... and choose the ART70 file you would like to open."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11985&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/art70_11985.png",
      "alt": "Screenshot of a .art70 file in BERNINA ARTlink 8",
      "caption": "ART70 file open in BERNINA ARTlink 8"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/art70",
      "retrieved_at": "2025-11-01T22:32:42.331Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.331Z"
}