{
  "slug": "asl",
  "extension": "asl",
  "name": "Photoshop Style",
  "summary": "Learn about .ASL files and view a list of programs that open them.",
  "developer": "Adobe Systems",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "As a Photoshop user edits an image, they can apply visual effects that alter how the layers their image contains appear. For example, a user could apply an outline and drop shadow effect to a text layer, to set the text apart from the rest of their image. If a user plans to apply the same set of effects to multiple layers, they can save that set of effects as a layer style, or ASL file.",
      "Users can see the layer styles they have access to by selecting Window → Styles from Photoshop's menu bar. The Styles window will then appear in Photoshop.",
      "To apply a style to a layer, select the layer from the Layers tab, and then select the style you want to apply from the Styles window. The effects the style contains will be applied to the layer.",
      "To save a set of effects as a layer style:",
      "From the Layers tab, select the layer that you've applied the set of effects to.",
      "In the Styles window, select the Create new style button.",
      "After the New Style window appears, give your style a name and select OK.",
      "To export a layer style, select and right-click the style in the Styles window. Then, select Export Selected Styles.... Photoshop will ask where you want to save the exported style.",
      "After you export a style, you can share it with other Photoshop users to allow them to apply that style to their Photoshop layers."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can import ASL files into Adobe Photoshop (Windows, Mac) to use them as layer styles. To import a layer style into Photoshop:",
      "From the Photoshop menu bar, select Edit → Presets → Export/Import Presets....",
      "Click the Select Import Folder button, navigate to the folder that contains your ASL file(s), and then click Open.",
      "In the Export/Import Presets window, Photoshop will list the presets you can import in the Source Presets section. Select the presets you want to import and then click the > button to move them to the Presets to Import section.",
      "Select the Import Presets button.",
      "The next time you open the Styles window (by selecting Window → Styles from Photoshop's menu bar), the ASL files you imported will appear and be available to apply as layer styles."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Adobe Photoshop",
        "url": "https://fileinfo.com/software/adobe/photoshop"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1076&b=1"
      },
      {
        "name": "Adobe Photoshop 2025",
        "url": "https://fileinfo.com/software/adobe/photoshop"
      },
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "GitHub Atom",
        "url": "https://fileinfo.com/software/github/atom"
      },
      {
        "name": "Vim",
        "url": "https://fileinfo.com/software/vim/vim"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/asl_1076.png",
      "alt": "Screenshot of a .asl file in Adobe Photoshop 2021",
      "caption": "ASL file open in Adobe Photoshop 2021"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/asl_11975.png",
      "alt": "Screenshot of a .asl file in GitHub Atom",
      "caption": "ASL file open in GitHub Atom"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/asl",
      "retrieved_at": "2025-11-01T22:32:42.333Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.333Z"
}