{
  "slug": "canvas",
  "extension": "canvas",
  "name": "Obsidian Canvas",
  "summary": "Learn about .CANVAS files and view a list of programs that open them.",
  "developer": "Obsidian",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "Canvas is a feature within Obsidian that allows users to organize and connect notes, images, links, and other content in a two-dimensional space. Users organizing complex or interconnected information, such as researchers, writers, and students, often use Canvas to brainstorm, plan, or explore ideas visually.",
      "When users select the \"Create new canvas\" feature in Obsidian, the app automatically creates a CANVAS file in the user's vault, which is a folder storing a user's notes, calendars, and imported media files. Obsidian is available on Windows, macOS, Linux, iOS, and Android, and CANVAS files can be synced across platforms using Obsidian's sync service or standard file syncing tools.",
      "NOTE: The JSON Canvas format is an open format designed to be stored locally and accessible offline to give users full control over their information. It is the native format for storing visual workspace information in Obsidian, but other programs can import and export the format, such as Kinopio, Flowchart Fun, hi-canvas, and OrgPad."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open CANVAS files with Obsidian; the app automatically opens CANVAS files included with your vault when you open it. Several other programs can also import CANVAS files, including Flowchart Fun, Kinopio, hi-canvas, and OrgPad.",
      "Since CANVAS files are saved in plain text JSON format, you can open and edit them with a text editor, such as Microsoft Notepad (Windows) or Apple TextEdit (macOS). You may need to rename the .canvas file extension to .txt for the text editor to recognize and open it."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "Obsidian can convert CANVAS files to .PDF format. To convert a canvas to PDF format, select File → Export to PDF."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13819&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/canvas_13819.jpg",
      "alt": "Screenshot of a .canvas file in Obsidian 1.8",
      "caption": "CANVAS file open in Obsidian 1.8"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/canvas",
      "retrieved_at": "2025-11-01T22:32:42.373Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.373Z"
}