{
  "slug": "ccctask",
  "extension": "ccctask",
  "name": "Carbon Copy Cloner Task Configuration",
  "summary": "Learn about .CCCTASK files and view a list of programs that open them.",
  "developer": "Bombich Software",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "Carbon Copy Cloner users can either manually back up their data or create tasks that automatically back up their data. These tasks are stored in CCCTASK files. Users often schedule Carbon Copy Cloner to execute CCCTASK files at regular intervals, to produce frequent backups of their data. CCCTASK files may also contain other backup-related settings, such as additional tasks to perform during and after the backup process.",
      "Each time Carbon Copy Cloner executes a CCCTASK file, it stores a record of the task's success or failure in the app's Task History. To see the last time a CCCTASK file was used to perform a backup task, as well as whether the task was completed successfully, select History from Carbon Copy Cloner's toolbar.",
      "NOTE: If you've encountered a CCCTASK file outside the Macintosh HD/​Library/​Application Support/​com.bombich.ccc directory, it was likely exported from Carbon Copy Cloner. Users can export CCCTASK files using Carbon Copy Cloner's Export Task..., Export Task Group..., and Export All Tasks... options."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open CCCTASK files in Carbon Copy Cloner (Mac). To import a CCCTASK file into Carbon Copy Cloner, double-click the file. Carbon Copy Cloner will then walk you through importing the task."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12100&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/ccctask_12100.png",
      "alt": "Screenshot of a .ccctask file in Bombich Software Carbon Copy Cloner",
      "caption": "CCCTASK file open in Bombich Software Carbon Copy Cloner"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/ccctask",
      "retrieved_at": "2025-11-01T22:32:42.376Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.376Z"
}