{
  "slug": "chd",
  "extension": "chd",
  "name": "Compressed Hunks of Data File",
  "summary": "Learn about .CHD files and view a list of programs that open them.",
  "developer": "The MAME Team",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "Gamers commonly use CHD files in retro gaming and emulation communities. By compressing data dumped from physical storage devices, such as arcade machines, game cartridges, and CD-ROMs, CHD files enable easier storage and sharing of games while maintaining full compatibility with emulation software.",
      "The MAME Team initially developed the CHD format to store arcade game disk images for use with the Multiple Arcade Machine Emulator (MAME) software. These CHD files are used alongside their corresponding .ROM files to load and play arcade games. Some arcade CHD files are large because they contain the entire contents of a hard disk, so even compressed files may require significant storage space.",
      "The CHD format was also used to store the contents of CD-ROM games for consoles such as the Sega Dreamcast and 3DO. In these cases, CHD files compress the data from .CUE and .BIN files dumped from the original discs.",
      "NOTE: Users can create CHD files from dumped CUE and BIN files using CHDMAN, a command-line program developed by The MAME Team. This allows users to compress and manage game data efficiently while preserving compatibility with emulators."
    ]
  },
  "how_to_open": {
    "instructions": [
      "CHD files are not meant to be opened directly by users. Instead, emulators, such as MAME and RetroArch, load the contents of a CHD file to run games. How a CHD file is opened depends on the emulator, so it’s important to consult your emulator’s documentation for specific instructions.",
      "For MAME arcade games, a CHD file must be stored in a subdirectory that matches the ROM’s filename (without the .zip extension). For example, if your ROM is named mygame.zip and your CHD file is mygame.chd, the files would typically be organized like this:",
      "/​Roms/​mygame.zip",
      "/​Roms/​mygame/​mygame.chd",
      "MAME will automatically load the CHD file when the corresponding ROM is launched.",
      "Other emulators may require all CHD files to be placed in a single directory, often named Rom or similar. Placement rules vary between emulators, so always check the documentation for the correct folder structure and naming conventions."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=5558&b=1"
      },
      {
        "name": "MAME",
        "url": "https://fileinfo.com/software/mame/mame"
      },
      {
        "name": "MAME OS X",
        "url": "https://fileinfo.com/software/dave_dribin/mame_os_x"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/chd",
      "retrieved_at": "2025-11-01T22:32:42.382Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.382Z"
}