{
  "slug": "crypt14",
  "extension": "crypt14",
  "name": "WhatsApp Encrypted Database File",
  "summary": "Learn about .CRYPT14 files and view a list of programs that open them.",
  "developer": "WhatsApp",
  "category": "database",
  "category_slug": "database",
  "containers": [],
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ],
  "technical_info": {
    "content": [
      "Periodically, WhatsApp backs up a user's messages in CRYPT14 files. These files are .DB database files that are encrypted and appended with the .crypt14 extension to create a .db.crypt14 file. Throughout WhatsApp's existence, the app has used different algorithms to encrypt users' messages and has appended backups with the .CRYPT12, .CRYPT10, .CRYPT8, and .CRYPT7 extensions, among others.",
      "If you want to decrypt a CRYPT14 database and view the message history it contains, you must first locate your WhatsApp key file, which stores your CRYPT14 file's encryption key. Your key file is stored in the following location: /data/data/com.whatsapp/files/key.",
      "Then, you must locate your CRYPT14 file. WhatsApp stores CRYPT14 files in the following directory: /sdcard/WhatsApp/Databases.",
      "You may find multiple CRYPT14 database files in your Databases folder, with YYYY-MM-DD dates included in their filenames. WhatsApp creates new backup files periodically; the dates in these files' filenames represent when they were created.",
      "If you need to free up space on your SD card, you can delete most of your dated CRYPT14 files without affecting WhatsApp or your message history. However, you should always keep the most recent one or two CRYPT14 files, in case you need to restore your message history.",
      "NOTE: WhatsApp began saving message history backups as CRYPT14 files in version 2.21.8.17, which released in May 2021."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Crypt14 files are a type of encrypted container, designed to secure and protect sensitive information. They commonly utilize advanced encryption algorithms to safeguard their contents from unauthorized access.\n\nTo open a Crypt14 file, you will need decryption software compatible with the encryption algorithm employed. Various tools are available online that cater to specific encryption methods\n\nEach decryption tool comes with its set of instructions. Carefully follow the steps provided by the chosen software to decrypt the Crypt14 file. This may involve specifying the file path, entering a decryption key or utilizing other authentication methods.",
      "After you retrieve both your WhatsApp encryption key and your CRYPT14 file, you can decrypt, view, and save your WhatsApp message history using WhatsApp Viewer (Windows), a free WhatsApp database decryption tool.",
      "You can also use a CRYPT14 file to migrate or restore your WhatsApp message history on an Android device. To do so, you must rename your most recent CRYPT14 file to msgstore.db.crypt14, delete and reinstall WhatsApp, and then follow the app's prompts to manually restore your message history. For more detailed instructions from WhatsApp, click here."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "WhatsApp",
        "url": "https://file.org/free-download/whatsapp-0"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12080&b=1"
      },
      {
        "name": "WhatsApp Messenger",
        "url": "https://fileinfo.com/software/whatsapp_inc/whatsapp_messenger"
      }
    ]
  },
  "images": [
    {
      "url": "https://assets.file.org/images/fileorg-logo-440x90-4-8b.png",
      "alt": "File.org logo"
    },
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "file.org",
      "url": "https://file.org",
      "retrieved_at": "2025-11-01T22:32:42.137Z"
    },
    {
      "source": "fileformat.com",
      "url": "https://docs.fileformat.com/database/crypt14/index.html",
      "retrieved_at": "2025-11-01T22:32:42.137Z"
    },
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/crypt14",
      "retrieved_at": "2025-11-01T22:32:42.137Z"
    },
    {
      "source": "filext.com",
      "retrieved_at": "2025-11-01T22:32:42.137Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.137Z"
}