{
  "slug": "csb",
  "extension": "csb",
  "name": "CRIWARE Sound Bank",
  "summary": "Learn about .CSB files and view a list of programs that open them.",
  "developer": "CRI Middleware",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "CRI Middleware, also known as CRIWARE, is a company that provides audio and movie middleware tools to video game developers. Using CRI-ADX, developers can create and integrate various types of audio, including CSB files, into their video games.",
      "CSB files are archives that usually contain two .ADX or .ACB audio files. The first ADX or ACB file contains a song's unique, introductory measures, and the second ADX or ACB file contains the portion of the song that loops while a player remains in a menu or stage.",
      "Street Fighter IV and Sonic game modders are most likely to encounter CSB files, while attempting to edit a game's background music. For example, players using the Windows version of Street Fighter IV can find that game's CSB files in its SFIV/​bgm directory."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open CSB files and play the music they contain with Goshanes' Street Fighter IV Audio Manager (Windows). If you want to edit a CSB file's contents, you can do so using Sonic Audio Tools (Windows)."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "You can use Street Fighter IV Audio Manager to convert the audio files that a CSB file contains into .WAV files. You can then play the converted files as you would any WAV file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11938&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/csb",
      "retrieved_at": "2025-11-01T22:32:42.399Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.399Z"
}