{
  "slug": "csproj",
  "extension": "csproj",
  "name": "Visual Studio C# Project",
  "summary": "Learn about .CSPROJ files and view a list of programs that open them.",
  "developer": "Microsoft",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "When developers create a new program in Microsoft Visual Studio, they start by creating a new project and associated project file. The project file contains information that MSBuild uses to compile the developer's project into an executable program. Specific types of Visual Studio projects use specific types of Visual Studio project files; C# projects use CSPROJ files.",
      "CSPROJ files define a project's content, platform requirements, versioning information, and web server or database server settings. They also list the files that are part of the project. All this information is defined using MSBuild's XML schema, which use the following elements (among others):",
      "<Project>: Used to identify the project file's XML schema and specify entry points for the build process.",
      "<PropertyGroup>: Used to define build configuration properties.",
      "<ItemGroup>: Used to add inputs, such as source code files, into the build system.",
      "<Target>: Used to specify and execute build operations.",
      "To build a C# application developed in Visual Studio, a developer invokes MSBuild.exe from the Windows command-line interface along with the name of their CSPROJ file. For example, to build a project named MyProject.csproj, a developer would enter the command MSBuild.exe MyProject.csproj in the command prompt, along with any other appropriate command-line options."
    ]
  },
  "how_to_open": {
    "instructions": [
      "CSPROJ files are are meant to be opened and edited in Microsoft Visual Studio (Windows, Mac) as part of Visual Studio projects. However, because CSPROJ files are XML files, you can open and edit them in any text or source code editor."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Microsoft Visual Studio",
        "url": "https://fileinfo.com/software/microsoft/visual_studio"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=3836&b=1"
      },
      {
        "name": "Microsoft Visual Studio 2022",
        "url": "https://fileinfo.com/software/microsoft/visual_studio"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/csproj_3836.png",
      "alt": "Screenshot of a .csproj file in Microsoft Visual Studio Code",
      "caption": "CSPROJ file open in Microsoft Visual Studio Code"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/csproj",
      "retrieved_at": "2025-11-01T22:32:42.400Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.400Z"
}