{
  "slug": "ecar",
  "extension": "ecar",
  "name": "DIKSHA Offline Content Archive",
  "summary": "Learn about .ECAR files and view a list of programs that open them.",
  "developer": "DIKSHA",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "DIKSHA (short for Digital Infrastructure for Knowledge Sharing) is a national platform that the Government of India provides so Indian teachers and students can access approved school curriculum materials online. The platform is built on open-source technology and available via browser-based, PC-based, and Android-based apps.",
      "Teachers and students can download DIKSHA content for use offline. The Android version of DIKSHA saves offline-accessible content in ECAR files. Each ECAR file is a Zip-compressed archive that contains three files:",
      "A manifest.json file describing the ECAR file's contents",
      "A .thumb.png file that acts as the content's thumbnail",
      "A .PDF, .MP4, or other file that contains educational content"
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can access the content an ECAR file contains in DIKSHA (Android). If you want to access the content an ECAR file contains outside of DIKSHA:",
      "Rename your ECAR file to use the .zip extension.",
      "Expand the file as you would any Zip archive (using Corel WinZip, RARLAB RAR, or another Zip-decompression tool).",
      "When the decompressed version of your file appears, open that folder and find the PDF, MP4, or other content file it contains. Open that file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12517&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/ecar",
      "retrieved_at": "2025-11-01T22:32:42.439Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.439Z"
}