{
  "slug": "ftz",
  "extension": "ftz",
  "name": "Quick Family Tree",
  "summary": "Learn about .FTZ files and view a list of programs that open them.",
  "developer": "Digital Gene",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "Digital Gene Quick Family Tree is an Android and iOS app that allows you to record your own or someone else's family tree. You can add parents, children, and spouses to a tree by tapping and creating a new entry in that tree. When you add a person to a family tree, you can record that person's name, birthdate, death date, and gender. You can also add a photograph of that person. Trees are displayed as a set of photographs and/or icons linked together, with each family member's name appearing under their photo or icon.",
      "If you want to export a family tree from Quick Family Tree, you can do so by opening the app's Data manager and selecting the Export icon. After selecting the tree you want to export and the location to which you want to export it, Quick Family Tree will save that tree as an FTZ file."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an FTZ file in Digital Gene Quick Family Tree (Android, iOS). To do so, move your file to a device that has Quick Family Tree installed, tap the file until your device's Open with... menu appears, and select Family Tree. Quick Family Tree will then open and prompt you to import your FTZ file. After importing your file, go to Quick Family Tree's Data manager to open it."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "FTZ files cannot be converted to other file formats."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12629&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/ftz",
      "retrieved_at": "2025-11-01T22:32:42.485Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.485Z"
}