{
  "slug": "gb5",
  "extension": "gb5",
  "name": "Geekbench 5 Pro Results",
  "summary": "Learn about .GB5 files and view a list of programs that open them.",
  "developer": "Primate Labs",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "Geekbench 5 Pro is a program that allows PC and Android device users to check how well their device's CPU and GPU are performing. These tests are referred to as benchmarks. After a user runs a benchmark, Geekbench 5 Pro outputs the results of that benchmark as a series of performance scores. Users can save their benchmark's results as a GB5 file, so they can review the results later (e.g. to compare them to future benchmarks).",
      "By default, Geekbench 5 does not save users' results as GB5 files. Instead, it uploads the results to the user's online Geekbench profile. However, users can manually save results as a GB5 file by:",
      "In the GUI version of Geekbench 5 Pro, selecting File → Save as....",
      "In the command-line version of Geekbench 5 Pro, using the geekbench5 --save command.",
      "Users can also choose to export their results as .CSV, .HTML, .JSON, and .TXT files, by selecting File → Export As... or using the --export command."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a GB5 file in the paid version of Geekbench 5 Pro (multiplatform). (You cannot open a GB5 file in any other version of Geekbench Pro.) To do so, open the GUI version of Geekbench 5 Pro and select File → Open.... Then, navigate to and select your GB5 file. The results your GB5 file contains will appear in Geekbench 5 Pro.",
      "If you do not have access to Geekbench 5 Pro, you can also open your GB5 file in any text editor, such as Microsoft Notepad (Windows) or Apple TextEdit (Mac). This will allow you to view the plain text used to show your test results in Geekbench 5 Pro."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12234&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/gb5",
      "retrieved_at": "2025-11-01T22:32:42.493Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.493Z"
}