{
  "slug": "gw",
  "extension": "gw",
  "name": "GeneWeb Source File",
  "summary": "Learn about .GW files and view a list of programs that open them.",
  "developer": "Daniel de Rauglaudre",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "GeneWeb is used to record, organize, and publish genealogical information. It utilizes a web server that can be accessed with a web browser, such as Chrome or Firefox, and returns an HTML webpage with the specific genealogical information requested.",
      "Users create GW files with GeneWeb to store genealogical data, which may include family, relationship, and personal notes. GW files may also store events if they were created with version 7 of GeneWeb or later.",
      "You can create a GW file with GeneWeb using the \"gwsetup\" utility included with the software. In the user interface, click \"GeneWeb source file\" under the \"Save\" section. You can also create a GW file with the gwc command in the GeneWeb command-line interface.",
      "NOTE: GeneWeb was developed by Daniel de Rauglaudre, a researcher at the Institut National de Recherche en Informatique et en Automatique (INRIA)."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open GW files with GeneWeb software using the \"gwsetup\" utility included with GeneWeb. This tool provides a web-based user interface to open the files. To open a GW file with \"gwsetup,\" click \"GeneWeb source file\" under the \"Create Family Tree\" section.",
      "Since GW files are saved in plain text, you can also open them with a text editor. There are many free text editors available including Microsoft Notepad, which is bundled with Windows, and Apple TextEdit, which is bundled with macOS."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11734&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/gw",
      "retrieved_at": "2025-11-01T22:32:42.514Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.514Z"
}