{
  "slug": "jpg-large",
  "extension": "jpg-large",
  "name": "Twitter Large-sized JPEG Image",
  "summary": "Learn about .JPG-LARGE files and view a list of programs that open them.",
  "developer": "N/A",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "Twitter is a social networking site that allows users to post \"tweets\" containing text, images, and videos. Images uploaded to Twitter by users are hosted on its media server so they can be accessed and viewed again by that same user or by other Twitter users.",
      "As Twitter users view an image in the Chrome web browser, they can right-click the image and select Open Image in New Tab to open the image in a separate browser tab. When opening a Twitter-hosted image in a new Chrome tab, the URL may look something like this:",
      "https:/​/​pbs.twimg.com/​media/​FHKU-pZXsAIQfKH.jpg:large",
      "If a user downloads the image from the URL, Chrome may save it with a JPG-LARGE file extension, creating a FHKU-pZXsAIQfKH.jpg-large file.",
      "NOTE: While Chrome may use the JPG-LARGE file extension, the web browser more commonly adds the .JPG_LARGE extension.",
      "Despite the different extensions, JPG-LARGE files are normal JPG files. The reason the file extensions are different is due to the large size attribute Twitter adds to the image URL to display the appropriate image size to the user, which results in a URL ending with .jpg:large.",
      "Then, when a user downloads the image from the URL ending with .jpg:large, Chrome changes the colon to a hyphen since filenames cannot contain colons. The resulting downloaded file is a JPG-LARGE file."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open JPG-LARGE files with any image viewer or web browser that supports JPEG images. However, some applications may not recognize the .jpg-large file extension and will not open the JPG-LARGE file. If this is the case, change the file extension from .jpg-large to .jpg, then open the file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12492&b=1"
      },
      {
        "name": "Google Chrome",
        "url": "https://fileinfo.com/software/google/chrome"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/jpg-large_12492-2.jpg",
      "alt": "Screenshot of a .jpg-large file in Google Chrome 96",
      "caption": "JPG-LARGE file open in Google Chrome 96"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/jpg-large",
      "retrieved_at": "2025-11-01T22:32:42.566Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.566Z"
}