{
  "slug": "kmproject",
  "extension": "kmproject",
  "name": "KineMaster Project",
  "summary": "Learn about .KMPROJECT files and view a list of programs that open them.",
  "developer": "KineMaster Corp.",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "KMPROJECT files are used to save and open video editing projects in KineMaster. However, KMPROJECT files do not contain any video. Instead, KMPROJECT files contain references to the assets (videos, audio files, and images) included in a video editing project. They also include metadata used to correctly position layers upon KineMaster's video editing timeline.",
      "If you move an asset referenced in your KMPROJECT file, the file may not load correctly in KineMaster. You can resolve the issue by moving the misplaced asset back to the location listed in your KMPROJECT file.",
      "After you finish editing a KineMaster project, you can export the video you've created to Facebook, YouTube, Dropbox, or your mobile device."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a KMPROJECT file in KineMaster (Android, iOS). KineMaster shows a list of saved KMPROJECT files when users open the app. If your KMPROJECT file does not appear listed in KineMaster, you can try double-tapping the file to open it."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12002&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/kmproject",
      "retrieved_at": "2025-11-01T22:32:42.577Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.577Z"
}