{
  "slug": "localized",
  "extension": "localized",
  "name": "macOS Directory Localization File",
  "summary": "Learn about .LOCALIZED files and view a list of programs that open them.",
  "developer": "Apple",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "Localization is the process of translating text and audio content for use across multiple languages. Software programs, including the macOS operating system, use a variety of localization schemes to show content to users in their preferred language.",
      "Part of macOS's system-level localization scheme depends on LOCALIZED files. These files are hidden, blank files that macOS references when showing a directory's name to users. If a directory contains a blank LOCALIZED file, macOS can translate that directory's name into any of its system languages.",
      "Because LOCALIZED files are hidden files that do not appear even after a user chooses to show hidden files (using the Cmd + Shift + . shortcut) on their Mac, most users will never encounter a LOCALIZED file. The most likely way a user would encounter a LOCALIZED file is by viewing the file within a different operating system installed on their Mac. For example, Parallels Desktop users who have chosen to show hidden files in Windows may see a LOCALIZED file on their Windows desktop."
    ]
  },
  "how_to_open": {
    "instructions": [
      "LOCALIZED files are not meant to be opened. While you can open a LOCALIZED file in any text editor, it contains no data and should not be edited. Editing or deleting a LOCALIZED file may cause macOS to show localized directory names incorrectly."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11962&b=1"
      },
      {
        "name": "Apple macOS",
        "url": "https://fileinfo.com/software/apple/os_x"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/localized",
      "retrieved_at": "2025-11-01T22:32:42.592Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.592Z"
}