{
  "slug": "lrv",
  "extension": "lrv",
  "name": "Low-resolution Video File",
  "summary": "Learn about .LRV files and view a list of programs that open them.",
  "developer": "GoPro",
  "category": "video",
  "category_slug": "video",
  "containers": [],
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ],
  "technical_info": {
    "content": [
      "LRV files are used during the editing process to reduce the amount of computing power required to edit a video compared to using the HD file. After a video is edited the LRV file can be replaced with the HD file before rendering the final video.",
      "These files are also used for previewing with GoPro mobile applications, for playback via Wi-Fi, or as the streaming buffer when a smartphone is used as a control device.",
      "LRV video is recorded in 240p at 29.97 frames per second regardless of the camera's settings."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To open and view LRV (Low-Resolution Video) files, you can follow these steps:\n\nRename to MP4: To open and play an LRV file, you can easily do so by renaming the file extension to .MP4 and using any application capable of playing .MPEG4 video files.Video Editing Software: The most common way to open and work with LRV files is by using video editing software. Most professional video editing software, such as Adobe Premiere Pro, Final Cut Pro, or Davinci Resolve, are capable of recognizing and importing LRV files. Simply import the LRV files into your project, and you’ll be able to preview and edit the footage.GoPro Software: GoPro provides its own software called GoPro Quik, which is designed specifically for working with GoPro footage. You can download and install GoPro Quik from the official GoPro website. Once installed, open the software, import your LRV files, and you’ll be able to view and edit them within the application.Media Players: While LRV files are not typically meant for direct playback, you can use certain media players capable of playing these files. VLC media player is a popular choice that supports various video formats and codecs. You can download and install VLC, then open the LRV file directly through the media player.File Conversion: If you prefer to convert LRV files to a more widely supported video format, you can use video conversion software. Tools like Handbrake or Freemake Video Converter allow you to convert LRV files to formats like MP4, which can be opened by a wide range of media players or video editing software.",
      "To play an LRV file, simply rename the file to .MP4 and open it with any application that can open .MPEG4 video files."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=8795&b=1"
      },
      {
        "name": "Microsoft Windows Media Player",
        "url": "https://fileinfo.com/software/microsoft/windows_media_player"
      },
      {
        "name": "Media Player Classic",
        "url": "https://fileinfo.com/software/media_player_classic/media_player_classic"
      },
      {
        "name": "VideoLAN VLC media player",
        "url": "https://fileinfo.com/software/videolan/vlc_media_player"
      },
      {
        "name": "Apple QuickTime Player",
        "url": "https://fileinfo.com/software/apple/quicktime_player"
      },
      {
        "name": "Apple iMovie 10",
        "url": "https://fileinfo.com/software/apple/imovie"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileformat.com",
      "url": "https://docs.fileformat.com/video/lrv/index.html",
      "retrieved_at": "2025-11-01T22:32:42.276Z"
    },
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/lrv",
      "retrieved_at": "2025-11-01T22:32:42.276Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.276Z"
}