{
  "slug": "lucy",
  "extension": "lucy",
  "name": "Black Rose Lucy Ransomware Encrypted File",
  "summary": "Learn about .LUCY files and view a list of programs that open them.",
  "developer": "Lucy Gang",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "Black Rose Lucy is a form of ransomware that affects Android devices. It encrypts users' files, appends them with the .lucy extension, and then produces a ransom note that is purportedly from the FBI. The ransom note asks users to pay a \"penalty\" of $500 to regain access to their files. (FileInfo recommends you never pay a ransom to decrypt your files.)",
      "In addition to encrypting your files, Black Rose Lucy can:",
      "Collect your device data",
      "Connect your device to a remote server, which allows cybercriminals to control your device",
      "Install additional malware",
      "As such, if your device has been infected by Black Rose Lucy ransomware, you should restore your device using a backup created before the device became infected as soon as possible.",
      "Black Rose Lucy is distributed primarily via social media posts and messages. These posts and messages tell you that, to continue watching a video on your phone, you \"must enable Streaming Video Optimization (SVO).\" If you agree to\"enable Streaming Video Optimization (SVO)\" (which does not exist), Black Rose Lucy infects your device."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Unfortunately, LUCY files cannot currently be decrypted or restored to their original state. The best option to retrieve your files (and remove the Black Rose Lucy ransomware from your device) is to restore your data from a backup created before your device became infected by Black Rose Lucy ransomware."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12453&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/lucy",
      "retrieved_at": "2025-11-01T22:32:42.599Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.599Z"
}