{
  "slug": "oml",
  "extension": "oml",
  "name": "OutSystems Modeling Language File",
  "summary": "Learn about .OML files and view a list of programs that open them.",
  "developer": "OutSystems",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "OML files are typically created and edited with Service Studio, which is the IDE for the OutSystems Platform that is used to deploy enterprise web and mobile apps. Service Studio is included with Integration Studio in the Development Environment application.",
      "OML can be used to develop reactive web apps and mobile apps for tablets and phones. A reactive web app includes a responsive interface that runs in a web browser and is adapted to various devices and screen sizes. A mobile app developed with Service Studio consists of OML that is wrapped in a native app shell that utilizes the Apache Cordova mobile application framework. It is optimized to access the mobile device's capabilities and can work offline.",
      "Service Studio is a \"low-code\" IDE that includes WYSIWYG drag-and-drop components that make app development more accessible for beginners. Modules designed in Service Studio make up the various elements of an application, such as the home screen and customer contact forms. As users create and save a module in Service Studio, the OML file is generated to store the module.",
      "Once a user is finished developing an app or creating an update for an already existing app, they can publish it by clicking the green \"1-Click Publish\" button in Service Studio. All the app resources are sent to the OutSystems Platform server and the OML source code is compiled by the OutSystems compiler into Microsoft .NET or Java files.",
      "NOTE: OML files may also be referred to as \"OutSystems Markup Language files\" or as \"espace source files.\""
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can use OutSystems Service Studio, which is part of the OutSystems Development Environment, to open and edit OML files. To do so, open Service Studio and select Environment → Open Files...."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11459&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/oml",
      "retrieved_at": "2025-11-01T22:32:42.667Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.667Z"
}