{
  "slug": "projector",
  "extension": "projector",
  "name": "Screencast Transcript",
  "summary": "Learn about .PROJECTOR files and view a list of programs that open them.",
  "developer": "Google",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "Google Screencast is a screen recording app that allows ChromeOS users to record their screens and themselves at the same time and annotate the recording. For example, ChromeOS users might use Screencast to create an educational presentation or a website design review.",
      "Screencast automatically saves users' recordings to their Google Drive. In Screencast, the recordings appear as a single item, which users can share with others who have Screencast. However, a Screencast recording is actually comprised of three files a user can view separately in Google Drive: a .WEBM video, which contains the recorded video and annotations, a .PNG thumbnail preview, and a PROJECTOR file. The PROJECTOR file contains a transcript of any dialogue a user spoke while recording the video (and accompanying metadata).",
      "Screencast shows the transcript a PROJECTOR file contains while playing back the recording. Optionally, users can have Screencast translate the transcript into other languages, making it easier to share screen recordings with users who speak or read another language.",
      "NOTE: Early versions of Screencast were known as Projector, thus the PROJECTOR file's name."
    ]
  },
  "how_to_open": {
    "instructions": [
      "PROJECTOR files are not meant to be opened outside Google Screencast (ChromeOS). Screencast automatically opens PROJECTOR files and shows the transcripts they contain when you play the associated recording.",
      "However, those who want to view the transcript a PROJECTOR file contains outside Screencast can open the file in any text editor."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12829&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/projector_12829.png",
      "alt": "Screenshot of a .projector file in Google Chrome Text",
      "caption": "PROJECTOR file open in Google Chrome Text"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/projector",
      "retrieved_at": "2025-11-01T22:32:42.704Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.704Z"
}