{
  "slug": "smdh",
  "extension": "smdh",
  "name": "3DS Game Metadata",
  "summary": "Learn about .SMDH files and view a list of programs that open them.",
  "developer": "Nintendo",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "Like most complex programs, Nintendo 3DS games are comprised of many files, including .CIA, .CXI, and .smdh files. A game's SMDH file is stored inside its CIA or CXI file. Most notably, SMDH files contain the game icon shown on a 3DS's home menu and system settings screen. SMDH files also contain a game's localized titles (up to 12 of them, depending on the game), age ratings, and lockout settings, as well as the game's Match Maker ID and other metadata.",
      "Because most Nintendo 3DS players do not examine the structure of the games they play, they will never encounter an SMDH file. However, players who use The Homebrew Launcher to play homebrew games on their 3DS gaming consoles will encounter SMDH files. A homebrew game's SMDH file is typically stored alongside its .3DSX file, allowing Homebrew Launcher to show the game's icon in its main menu."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Homebrew Nintendo 3DS developers can open and edit SMDH files in SMDH Creator, a free program available for Windows and on the web. SMDH Creator allows homebrew developers to overwrite a game's icon, add a description of the game, specify the game's publisher, and specify the game's language."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11875&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/smdh",
      "retrieved_at": "2025-11-01T22:32:42.777Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.777Z"
}