{
  "slug": "tdesktop-theme",
  "extension": "tdesktop-theme",
  "name": "Telegram Desktop Theme",
  "summary": "Learn about .TDESKTOP-THEME files and view a list of programs that open them.",
  "developer": "Telegram",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "Telegram is a cross-platform messaging and video calling application that users can link to their existing cell phone number. This allows users to message or call others from any PC or mobile device. Telegram users can also subscribe to Telegram channels, in which an admin posts channel-specific content, view online articles in-app, and connect with other nearby Telegram users.",
      "Telegram Desktop is the Windows, macOS, and Linux version of Telegram. Users can alter Telegram Desktop's appearance using Telegram Desktop themes, which are saved as TDESKTOP-THEME files. Each TDESKTOP-THEME file is a .ZIP archive, which contains the theme's background image and/or color scheme.",
      "Most commonly, users download and apply TDESKTOP-THEME files from the Telegram Desktop Themes channel. Provided you have Telegram installed, you can access the Telegram Desktop Themes channel by pasting the following URL into your web browser: https://t.me/desktopThemes/27.",
      "Users can also create their own TDESKTOP-THEME files using Telegram's Online Theme Editor and Telegram Desktop's in-app Theme Editor."
    ]
  },
  "how_to_open": {
    "instructions": [
      "When you download a TDESKTOP-THEME file within Telegram Desktop, the program will show you a preview of the theme. In the Theme Preview window, click APPLY THIS THEME to apply the theme your TDESKTOP-THEME file contains.",
      "You can also change Telegram Desktop's theme from the Settings → Chat Settings screen."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12527&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/tdesktop-theme",
      "retrieved_at": "2025-11-01T22:32:42.802Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.802Z"
}