{
  "slug": "tscproj",
  "extension": "tscproj",
  "name": "TechSmith Camtasia Project",
  "summary": "Learn about .TSCPROJ files and view a list of programs that open them.",
  "developer": "TechSmith",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "Camtasia can create various types of videos, including tutorials, video game recordings, training videos, and webinar recordings. TechSmith introduced the TSCPROJ file type when it released version 9 of Camtasia for Windows, replacing the .CAMPROJ file type used by the Windows versions of Camtasia. While the macOS version of Camtasia saves projects as CMPROJ files, it can also export them as TSCPROJ files.",
      "When saving a video with the Windows version of Camtasia, the application creates a TSCPROJ project file to store the contents. After saving the TSCPROJ file, you can close it and re-open it for further editing. To create a TSCPROJ file with the Windows version of Camtasia, follow these steps:",
      "Select File → New Project or New Project From Template... if you have not yet started a project",
      "Select File → Save or Save As...",
      "Name the project, choose the save location, then click Save",
      "You can create a TSCPROJ file with the macOS version of Camtasia by selecting File → Export → Project for Windows. This workflow creates a .ZIP archive, which contains the TSCPROJ file."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a TSCPROJ file with TechSmith Camtasia in Windows and macOS by selecting File → Open Project.",
      "NOTE: If you saved the project as a standalone project with the Windows version of Camtasia, you need to double-click the file folder with the .tscproj file extension (bears the same name as the project), then, you can open the actual TSCPROJ file.",
      "Since TSCPROJ files store information in plain text, you can open TSCPROJ files with text editors, such as Microsoft Notepad and Apple TextEdit, and view their information and metadata.",
      "You can modify the TSCPROJ file's properties when opened in a text editor. However, remember that if you incorrectly edit the file, you may inadvertently corrupt the project."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "Camtasia can convert a TSCPROJ file to several file types, including the following formats:",
      ".MP4 - MPEG-4 Video",
      ".GIF - Graphical Interchange Format",
      ".M4A - MPEG-4 Audio (Windows only)",
      ".MOV - Apple QuickTime Movie (macOS only)",
      "You can also export a TSCPROJ file as a .CAMPACKAGE to back up or share resources with other Camtasia users. To do this, select File → Export → Package."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "TechSmith Camtasia",
        "url": "https://fileinfo.com/software/techsmith/camtasia"
      },
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11118&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/tscproj_11118.jpg",
      "alt": "Screenshot of a .tscproj file in TechSmith Camtasia 2023",
      "caption": "TSCPROJ file open in TechSmith Camtasia 2023"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/tscproj_11118-2.png",
      "alt": "TSCPROJ file open in Apple TextEdit",
      "caption": "TSCPROJ file open in Apple TextEdit"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/tscproj",
      "retrieved_at": "2025-11-01T22:32:42.819Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.819Z"
}