{
  "slug": "tsz",
  "extension": "tsz",
  "name": "Trillian Skin",
  "summary": "Learn about .TSZ files and view a list of programs that open them.",
  "developer": "Cerulean Studios",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "Trillian is a multiplatform IM application that is used by individuals and businesses. It allows users to connect to and chat across multiple IM services. Healthcare organizations, for example, use Trillian to conduct secure, intraorganizational chats.",
      "In previous versions, Trillian allowed users to install skins that changed the program's appearance. These skins are saved in TSZ files. Each TSZ file is a Zip-compressed package that contains all the assets needed to alter Trillian's appearance. This includes .BMP, .PNG., and/or .JPG images and .XML files.",
      "NOTE: Some Trillian skins are saved as normal .ZIP files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Users can no longer install TSZ files in current versions of Trillian. In previous versions of Trillian, you could install a TSZ file by decompressing the file, placing the resulting folder in Trillium's Skins directory, and applying the skin from Trillian's Preferences menu.",
      "If you want to view the assets a TSZ file contains, you can decompress it as you would any ZIP file. Note that you may have to first change the file's extension to .zip."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=3031&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/tsz",
      "retrieved_at": "2025-11-01T22:32:42.820Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.820Z"
}