{
  "slug": "tt19",
  "extension": "tt19",
  "name": "TurboTax Canada 2019 Tax Return",
  "summary": "Learn about .TT19 files and view a list of programs that open them.",
  "developer": "Intuit",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "TurboTax Canada 2019 automatically creates the TT19 file when you save your tax return. It stores your tax return progress, which allows you to close and reopen your tax return. Typically, the file is used for the following purposes:",
      "Saving a 2019 tax return to be electronically filed or printed to be mailed.",
      "Backing up a tax return in case of the loss or corruption of a tax return.",
      "Importing 2019 tax data from the previous year into the 2020 version of TurboTax Canada to fill out a 2020 tax return.",
      "In Windows, TT19 files are saved by default in the following location:",
      "C:\\​Users\\​[username]\\​Documents\\​TurboTax\\​2019",
      "NOTE: Tax return file extensions used by TurboTax Canada reflect the year of the tax data they contain. Tax returns for the 2018 year use the .TT18 extension, returns for the 2017 year use the .TT17 extension, and so on."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open TT19 files with the desktop version of Intuit Canada TurboTax 2019 in Windows. To open a TT19 file, select File → Open Tax Return....",
      "You can also upload a TT19 file to Intuit TurboTax Canada Online when uploading your tax data from the previous year. For example, you can upload a TT19 file to TurboTax Canada Online when filing your taxes for the 2020 calendar year. To open a TT19 file with TurboTax Canada Online when filing taxes for the 2020 year, select My Returns → Start a new return, choose your product version, select \"TurboTax Download/CD,\" click Continue, then choose your TT19 file to upload."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11901&b=1"
      },
      {
        "name": "Intuit Canada TurboTax",
        "url": "https://fileinfo.com/software/intuit/canada_turbotax"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/tt19",
      "retrieved_at": "2025-11-01T22:32:42.821Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.821Z"
}