{
  "slug": "tt20",
  "extension": "tt20",
  "name": "TurboTax Canada 2020 Tax Return",
  "summary": "Learn about .TT20 files and view a list of programs that open them.",
  "developer": "Intuit",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "TurboTax Canada 2020 automatically creates the TT20 file when you save your tax return. The file stores your tax return progress, which allows you to close and reopen your tax return to continue working on it. Typically, the TT20 file is used for the following purposes:",
      "Saving a 2020 tax return to be electronically filed or printed to be mailed.",
      "Backing up a tax return in case of the loss or corruption of a tax return.",
      "Importing 2020 tax data from the previous year into the 2021 version of TurboTax Canada to fill out a 2021 tax return.",
      "In Windows, TT20 files are saved by default in the following location:",
      "C:\\​Users\\​[username]\\​Documents\\​TurboTax\\​2020",
      "NOTE: Tax return file extensions used by TurboTax Canada reflect the year of the tax data they contain. For example, a tax return for the 2019 year is saved with the .TT19 extension and returns for the 2018 year are saved with the .TT18 extension."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open TT20 files with the desktop version of Intuit Canada TurboTax 2020 in Windows. To open a TT20 file, select File → Open Tax Return....",
      "You can also upload a TT20 file to Intuit TurboTax Canada Online when uploading your tax data from the previous year. For example, you can upload a TT20 file to TurboTax Canada Online when filing your taxes for the 2021 calendar year. To open a TT20 file with TurboTax Canada Online when filing taxes for the 2021 year, select My Returns → Start a new return, choose your product version, select \"TurboTax Download/CD,\" click Continue, then choose your TT20 file to upload."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11902&b=1"
      },
      {
        "name": "Intuit Canada TurboTax",
        "url": "https://fileinfo.com/software/intuit/canada_turbotax"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/tt20",
      "retrieved_at": "2025-11-01T22:32:42.821Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.821Z"
}