{
  "slug": "upk",
  "extension": "upk",
  "name": "Unreal Engine 3 Package",
  "summary": "Learn about .UPK files and view a list of programs that open them.",
  "developer": "Epic Games",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "The Unreal Engine is a popular game development engine published by Epic Games. Professional development studios used version 3 of Unreal Engine to develop games such as Unreal Tournament 3, Mass Effect, Mirror's Edge, and BioShock. Epic Games also published a free version of Unreal Engine 3, known as the Unreal Development Kit (UDK).",
      "In version 3, Unreal Engine saved various types of game assets in UPK files. Developers could import UPK files into Unreal Engine 3 projects, to add the assets they contained to their game. However, version 4 of Unreal Engine no longer supports the UPK format. Instead, it saves assets in the .UASSET format."
    ]
  },
  "how_to_open": {
    "instructions": [
      "If you still have access to the Epic Games Unreal Development Kit or Unreal Engine 3 (Windows), you can import and open a UPK file in those programs. If you do not have access to UDK or Unreal Engine 3, you can open your UPK file in UE Viewer (Windows, Linux). UE Viewer allows users to view and extract various assets that UPK files contain."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=4536&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/upk",
      "retrieved_at": "2025-11-01T22:32:42.834Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.834Z"
}