{
  "slug": "utm",
  "extension": "utm",
  "name": "UTM Virtual Machine",
  "summary": "Learn about .UTM files and view a list of programs that open them.",
  "developer": "UTM",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "Virtual machine emulation software allows users to run non-standard operating systems on PCs and other devices. For example, the popular Parallels Desktop application allows Mac users to load and run Windows (and thus, Windows-only applications) on their Macs.",
      "UTM is a virtual machine emulator available for iOS devices. It allows iOS users to run Android, Linux, Windows, and other non-iOS operating systems on their iOS devices. In this way, iPhone users can, for example, install the Android operating system and Android-only apps on their iOS devices.",
      "UTM files contain a prebuilt virtual machine that can be opened within UTM. Several sample UTM files, which can be used to install and access Android and Linux operating systems, are available on UTM's website.",
      "NOTE: When you download a UTM file from UTM's website, you will receive it in compressed .ZIP form. You must decompress the file to use it as a UTM virtual machine."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a UTM file (and install the virtual machine it contains) on an iOS device using UTM. To do so, install UTM and move your UTM file to the app's Documents directory. The next time you open UTM, your UTM file will appear as a selectable virtual machine."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11750&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/utm",
      "retrieved_at": "2025-11-01T22:32:42.836Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.836Z"
}