{
  "slug": "vp4",
  "extension": "vp4",
  "name": "PREMIER+ / Husqvarna Viking / Pfaff Embroidery File",
  "summary": "Learn about .VP4 files and view a list of programs that open them.",
  "developer": "SGSB Co. Ltd",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "The VP4 format was released in 2015 with version 1 of PREMIER+ Embroidery software, which was developed to complement Pfaff and Husqvarna Viking sewing machines. PREMIER+ Embroidery is available for purchase, but you can also use the free version of the software (packaged with PREMIER+ Embroidery that offers limited features) if you do not have an activation code.",
      "The primary difference between VP4 files and VP3 files is that VP4 files are the native file format associated with PREMIER+ Embroidery software. When you open a VP4 file with PREMIER+ Embroidery, you can edit individual parts in the design and edit them. But when you open VP3 designs with PREMIER+ Embroidery, you can only edit the design as a whole.",
      "To transfer a VP4 file to a sewing machine, insert a USB storage device in your computer. Then, transfer the VP4 file from your computer to the connected storage device via File Explorer in Windows or Finder in macOS.",
      "After transferring the file, eject the storage device from your computer and insert it into the Pfaff or Husqvarna Viking sewing machine to transfer the design to embroider it onto the material. If your sewing machine is Wifi-enabled, you can download the design directly to the machine via the machine's touchscreen interface.",
      "NOTE: PREMIER+ software and Husqvarna Viking and Pfaff sewing machines are owned by SGSB Co. Ltd."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open VP4 files with PREMIER+ Embroidery software in Windows and macOS. To open the file, select File → Open... and select the VP4 file.",
      "To convert a VP4 file to another embroidery format, select File → Export and choose the format. Supported formats include VP3, .PES, .PEC, .VIP, .HUS, .JEF, .SEW, and .PCS."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11981&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/vp4_11981.png",
      "alt": "Screenshot of a .vp4 file in PREMIER+ 2 Embroidery",
      "caption": "VP4 file open in PREMIER+ 2 Embroidery"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/vp4",
      "retrieved_at": "2025-11-01T22:32:42.853Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.853Z"
}