{
  "slug": "vpb",
  "extension": "vpb",
  "name": "Photos Legacy Video Project Backup",
  "summary": "Learn about .VPB files and view a list of programs that open them.",
  "developer": "Microsoft",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "The pre-2022 version of Microsoft Photos for Windows 10 and 11, now referred to as Microsoft Photos Legacy, includes a Video Editor. This simple video editor allows users to import photos, videos, and audio files and splice them together into movies. Video Editor also allows users to add title cards, text, motion effects, 3D effects, and filters to their movies.",
      "By default, Photos Legacy Video Editor automatically saves and loads users' video projects from a hidden system directory. However, users can also manually export backups of their Video Editor projects, which are saved as VPB files. For example, a user who wants to transfer their project from one PC to another may want to export the project as a VPB file. Each VPB file includes all of a project's media files, as well as information about edits and effects the user applied to the project.",
      "To back up a Microsoft Photos Legacy Video Editor project:",
      "With your project open in Photos Legacy Video Editor, select the ... button that appears on the program's right-hand side.",
      "Select Back up project and, when prompted, select Choose backup location.",
      "Name and save your project as a VPB file."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a VPB file with Microsoft Photos Legacy (Windows), which is available from the Microsoft Store. To do so:",
      "Install Microsoft Photos Legacy.",
      "Open Photos Legacy's Video Editor.",
      "Select the ... button that appears next to the New video project button.",
      "Select Import backup.",
      "Navigate to and open your VPB file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12443&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/vpb_12443.png",
      "alt": "Screenshot of a .vpb file in Microsoft Photos",
      "caption": "VPB file open in Microsoft Photos"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/vpb",
      "retrieved_at": "2025-11-01T22:32:42.853Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.853Z"
}