{
  "slug": "vsa",
  "extension": "vsa",
  "name": "Visual Show Automation Project",
  "summary": "Learn about .VSA files and view a list of programs that open them.",
  "developer": "Brookshire Software",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "Visual Show Automation is a Windows program that audiovisual designers can use to automate device functions during productions. For example, a designer can connect Visual Show Automation to an animatronic character, a lighting system, and a sound system, to control the character's movements, the lighting system's display, and the sound system's playback.",
      "In Visual Show Automation, designers specify the series of events each connected device should perform during a production, by adding those events to a timeline. Designers then save the project file they've created as a VSA file. Doing so allows them to quickly open and play the VSA file during a production and, if necessary, edit the project in the future.",
      "NOTE: MonkeyBasic TrackSkull can also create VSA files, for use with Visual Show Automation."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a VSA file with Brookshire Software Visual Show Automation (Windows). To do so, select File → Open... from the program's menu bar. Then, navigate to and open your VSA file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13397&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/vsa",
      "retrieved_at": "2025-11-01T22:32:42.855Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.855Z"
}