{
  "slug": "worldpack",
  "extension": "worldpack",
  "name": "Cats Are Liquid: A Better Place World Pack",
  "summary": "Learn about .WORLDPACK files and view a list of programs that open them.",
  "developer": "Last Quarter Studios",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "Cats Are Liquid: A Better Place is a 2D platformer in which players play as a cat who goes on an adventure through several worlds. Players can use A Better Place’s level editor to create their own worlds and rooms, for custom gameplay.",
      "Each set of A Better Place worlds and rooms is saved in a WORLDPACK file. Typically, the worlds a WORLDPACK file contains are related to each other somehow (for example, they’re used to tell an A Better Place side story).",
      "After a player finishes creating a world pack, they can use the level editor to share that WORLDPACK file with others, by emailing it, messaging it, or uploading it to the Internet. WORLDPACK files are cross-platform compatible. For example, a world pack created in Android will work with the Windows version of Cats Are Liquid: A Better Place."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a WORLDPACK file with Cats Are Liquid: A Better Place (multiplatform) to import the worlds it contains. If you are playing A Better Place on an Android or iOS device, you can tap the file to import the worlds it contains. If you are playing A Better Place on PC, you must place your WORLDPACK file in the appropriate game directory (often the maps directory) to use it.",
      "You can also open a WORLDPACK file with Microsoft Notepad (Windows), Apple TextEdit (Mac), or any other text editor, if you want to see the plain text data it contains. Keep in mind, however, that editing a WORLDPACK file may cause it to function incorrectly."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13245&b=1"
      },
      {
        "name": "Vim",
        "url": "https://fileinfo.com/software/vim/vim"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/worldpack",
      "retrieved_at": "2025-11-01T22:32:42.874Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.874Z"
}