{
  "slug": "xcuserstate",
  "extension": "xcuserstate",
  "name": "Xcode User State File",
  "summary": "Learn about .XCUSERSTATE files and view a list of programs that open them.",
  "developer": "Apple",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "Apple Xcode is a free IDE Apple developers use to build software for various platforms, including iOS, macOS, watchOS, and tvOS. The IDE includes many tools for building, testing, and deploying apps. It also assists developers in managing feedback from app users.",
      "Xcode automatically creates the XCUSERSTATE file to preserve the state of your workspace when you save an .XCWORKSPACE or .XCODEPROJ file (both files are macOS packages). For example, when you save a workspace in Xcode by selecting File → New → Workspace, the software creates an XCWORKSPACE file. You can also create an XCWORKSPACE file from an open project by selecting File → Save As Workspace.... Regardless of how you save the file, Xcode creates an XCUSERSTATE file and saves it in the XCWORKSPACE file.",
      "NOTE: You can delete the XCUSERSTATE file and Xcode will regenerate it. However, you will lose the state of the workspace previously saved."
    ]
  },
  "how_to_open": {
    "instructions": [
      "XCUSERSTATE files are not meant to be opened. Instead, Xcode references the files when loading an Xcode project (XCODEPROJ file) or workspace (XCWORKSPACE file).",
      "Additionally, you can find XCUSERSTATE files in the \"xcuserdata\" folder in the XCODEPROJ or XCWORKSPACE macOS package. To locate the folder, right-click the XCODEPROJ or XCWORKSPACE file and select Show Package Contents, and you will see the folder."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13418&b=1"
      },
      {
        "name": "Apple Xcode",
        "url": "https://fileinfo.com/software/apple/xcode"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/xcuserstate_13418.jpg",
      "alt": "Screenshot of a .xcuserstate file in Apple Xcode 14",
      "caption": "XCUSERSTATE file open in Apple Xcode 14"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/xcuserstate",
      "retrieved_at": "2025-11-01T22:32:42.889Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.889Z"
}