{
  "slug": "xmzx",
  "extension": "xmzx",
  "name": "SofTest Exam File",
  "summary": "Learn about .XMZX files and view a list of programs that open them.",
  "developer": "ExamSoft",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "ExamSoft is a digital assessment platform that schools, businesses, and other entities use to test students, employees, and those seeking certifications. To take an ExamSoft exam, exam takers must download and install ExamSoft SofTest, which is a Windows and macOS application, and then open an exam file. SofTest exam files are saved as XMZX files.",
      "Typically, proctors send XMZX files to exam takers along with a password that lets them open and start taking the exam. After an exam taker starts an exam, the exam's XMZX file is automatically deleted and replaced with an XMWX file, which contains a copy of the in-progress exam. When an exam taker finishes an exam, their completed exam is converted to an XMDX file, which is automatically uploaded to ExamSoft's cloud servers."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an XMZX file in ExamSoft SofTest (Windows, Mac). To do so:",
      "Open SofTest and click the Take an Exam button.",
      "In the Exam File dropdown list, find and select your XMZX file.",
      "Complete all required fields and then click Begin Exam to begin your exam."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10214&b=1"
      },
      {
        "name": "ExamSoft",
        "url": "https://fileinfo.com/software/examsoft_worldwide/examsoft"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/xmzx",
      "retrieved_at": "2025-11-01T22:32:42.900Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.900Z"
}