{
  "slug": "xvd",
  "extension": "xvd",
  "name": "Xbox Virtual Disk",
  "summary": "Learn about .XVD files and view a list of programs that open them.",
  "developer": "Microsoft",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "The XVD format is a wrapper for binary data, which means that not all XVD files are the same file type. The XVD format is a more secure and complex version of the STFS package format used by Xbox 360.",
      "The Xbox One console uses NTFS formatted hard drives that can be connected to your computer. You can then access the console's partitions, which store all of its files. The majority of theses files are XVD files.",
      "XVD files can be downloaded from Microsoft by Xbox One owners that need to install console updates but are unable to connect to the Internet due to connectivity problems or lack of Internet where their console is located. The XVD files can be placed on a NTFS formatted USB device, which can be plugged into the console. When you boot the console from the USB you can then install the updates.",
      "NOTE: The xvdtool can be used to manipulate XVD files. It can print information about a package and convert decrypted XVD files to VHD format."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10129&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/xvd",
      "retrieved_at": "2025-11-01T22:32:42.906Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.906Z"
}