{
  "slug": "zsh-theme",
  "extension": "zsh-theme",
  "name": "Oh My Zsh Theme",
  "summary": "Learn about .ZSH-THEME files and view a list of programs that open them.",
  "developer": "Oh My Zsh Community",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "Zsh is a Unix shell and command language that was created by Paul Falstad in 1990. It is very similar to the Bash shell. As zsh has become more popular (including being used as macOS's default Terminal shell), users have sought to extend the shell's functionality. The Oh My Zsh library allows zsh users to install useful zsh plug-ins and change their shell's appearance using custom themes.",
      "Oh My Zsh's custom themes are stored in ZSH-THEME files. These files are shell scripts, similar to .SH files, that users can execute by setting their .zshrc file's ZSH_THEME setting to the name of a ZSH-THEME file. Executing the script changes zsh's appearance. While Oh My Zsh includes over 100 custom themes, zsh users can also create and apply their own custom themes. To be used with zsh, ZSH-THEME files must be stored in Oh My Zsh's themes directory."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Because ZSH-THEME files are plain text files, you can open and examine them using any text editor, such as Microsoft Notepad (Windows), Apple TextEdit (Mac), or Github Atom (cross-platform). If you intend to edit a ZSH-THEME file, however, you should open it in a source code editor, such as Atom, Vim (Linux), or Microsoft Visual Studio Code (cross-platform). These programs will highlight the file's syntax correctly.",
      "To use a ZSH-THEME file as a zsh theme, you must install Oh My Zsh and set your .zshrc file's ZSH_THEME setting to the name of your ZSH-THEME file. You must also place the ZSH-THEME file in Oh My Zsh's themes directory. For more information on Oh My Zsh, click the Oh My Zsh program link found below."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Github Atom",
        "url": "https://fileinfo.com/software/github/atom"
      },
      {
        "name": "Vim",
        "url": "https://fileinfo.com/software/vim/vim"
      },
      {
        "name": "Microsoft Visual Studio Code",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11910&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/zsh-theme",
      "retrieved_at": "2025-11-01T22:32:42.920Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.920Z"
}