{
  "type": "audio",
  "subtype": "vnd.cisco.nse",
  "full": "audio/vnd.cisco.nse",
  "extensions": [],
  "sources": [
    {
      "source": "mime-db",
      "url": "https://www.npmjs.com/package/mime-db"
    },
    {
      "source": "iana",
      "url": "https://www.iana.org/assignments/media-types/media-types.xhtml"
    },
    {
      "source": "apache",
      "url": "https://svn.apache.org/repos/asf/httpd/httpd/trunk/docs/conf/mime.types"
    },
    {
      "source": "nginx",
      "url": "https://hg.nginx.org/nginx/raw-file/default/conf/mime.types"
    },
    {
      "source": "mime-db",
      "url": "https://www.npmjs.com/package/mime-db"
    }
  ],
  "iana": {
    "template_url": "https://www.iana.org/assignments/media-types/audio/vnd.cisco.nse",
    "template_text": "\n\nName : Rajesh Kumar\n\nE-mail : rkumar&cisco.com\n\nMIME media type name : Audio\n\nMIME subtype name : Vendor Tree - vnd.cisco.com\n\nRequired parameters : The \"events\" parameter lists the Cisco NSEs\n(Named Signaling Events) supported by the implementation. Events are\nlisted as one or more comma-separated elements. Each element can\neither be a single integer or two integers separated by a hyphen.\nThe range of these integers is 0-255. No white space is allowed in the\nargument. The integers designate the Cisco NSE numbers supported by the\nimplementation.  Thus, events=\"192,194,200-202\" indicates that the\nCisco NSEs supported by the implementation are 192, 194, 200, 201 and\n202.  The \"events\" parameter can be represented in the  Session\nDescription Protocol (SDP, rfc2327)  and in  ITU-T recommendation\nH.323/H.245  by the \"fmtp\"  attribute and the non-standard capability\nfield in the capability table respectively. When this is done, its\nvalue is represented in a format that is identical in format to the\n\"events\" MIME parameter. The encoding name used in conjunction with\nthis MIME is \"X-NSE\". The \"X-\" prefix results from the fact that this\nencoding name is not defined in a standard.  Since the \"events\"\nparameter is mandatory with this vendor MIME and encoding name,\nthere is no default list of events that can be assumed when this MIME\nsubtype is supported for a session or connection.\n\n\nOptional parameters :\nThe \"rate\" parameter describes the sampling rate, in Hertz.\nThe number is written as an integer. If omitted, the default value is\n8000 Hz. The rate parameter can be represented in the  Session\nDescription Protocol (SDP, rfc2327)  as one of the fields in the\n\"rtpmap\"  attribute line.\n\n\nEncoding considerations :\nThis MIME subtype is only defined for transfer via the Real Time\nProtocol (RTP) as defined in rfc1889. As such, it consists of packets\nof binary data. The packet format is the same as that for telephone\nevents in rfc2833. The difference from rfc2833 events is that this\nMIME subtype  uses a separate name space for event numbers, with\nsemantics defined by Cisco.\n\n\nSecurity considerations :\nRTP packets using the payload format used for Cisco NSEs\ndefined in this specification are subject to the security\nconsiderations discussed in the RTP specification (RFC 1889) and any\nappropriate RTP profile (for example RFC 1890). This implies that\nconfidentiality of the media streams is achieved by encryption. \nBecause the data compression used with this payload format is applied \nend-to-end, encryption may be performed after compression so there \nis no conflict between the two operations. This payload type does not\nexhibit any significant non-uniformity in the receiver side\ncomputational complexity for packet processing to cause a potential\ndenial-of-service threat. This MIME subtype contains no executable content.\n\n\nInteroperability considerations :\nFor interoperability, the use of the Cisco NSE MIME subtype must comply\nwith internal Cisco documentation. For this the Cisco NSE MIME subtype,\nCisco reserves the right to control and change  the assignment of event\nnumbers to events. When used in conjunction with rfc2833 telephone events,\nCisco NSEs are assigned a dynamic payload type that is different\nfrom that of the  rfc2833 telephone events.\n\n\n> > Published specification :\n> > None at this time. Cisco internal documentation available to\n> partners\n> > and customers. Contact name below.\n\n\nApplications which use this media :\nVoice over IP applications with value-adds provided by Cisco\nsolutions.\n\nAdditional information :\n\n1. Magic number(s) : N/A\n2. File extension(s) : N/A\n3. Macintosh file type code : N/A\n4. Object Identifiers: N/A\n\nThe volume and duration fields are generally set to 0. This is because\nCisco NSEs are generally used for state change signaling. In this case,\nthe volume and duration fields are not meaningful.\n\nRedundant transmission of Cisco NSEs is along the lines of telephone\nevents as described in rfc2833. It is optional.\n\nPerson to contact for further information :\n\n 1. Name : Rajesh Kumar\n 2. E-mail : rkumar&cisco.com\n\nIntended usage : Limited Use\nCisco NSEs are meant to be a value-add in applications that use Cisco\nequipment. These are meant to SUPPLEMENT not SUPPLANT the rfc2833\nevents. These are used for state change signaling along the lines of\nthe AAL2 type 3 packets. Examples of the use of Cisco NSEs are:\n\nCisco NSE Number  :: Semantics\n192 :: Shift to voiceband data mode\n193 :: Disable echo cancellation\n194 :: Shift to voice mode\n200 :: Shift to fax relay mode\n201 :: Positive acknowledgement of Cisco NSE\n202 :: Negative acknowledgement of Cisco NSE\n\nAuthor/Change controller : Rajesh Kumar\nrkumar&cisco.com\nCisco Systems\n170 West Tasman Drive\nSan Jose, CA 95134-1706\n\n(created 2001 August 23)\n\n[]\n\n\n\n\n\n\n\n"
  },
  "references": []
}