{
  "source": "fileformat.com",
  "url": "https://docs.fileformat.com/3d/3mf/index.html",
  "slug": "3mf",
  "extension": "3mf",
  "name": "What is a 3MF file?",
  "summary": "What's on this Page",
  "category": "3d",
  "category_slug": "3d",
  "technical_info": {
    "content": [
      "The 3MF file format uses the Open Packaging specifications in the form of ZIP archive for its physical model. It includes a well-defined set of parts and relationships that fullfill particular purpose in the document. This also makes the format follow the package feature including digital signatures and thumbnails."
    ]
  },
  "more_information": {
    "description": [
      "3MF, 3D Manufacturing Format, is used by applications to render 3D object models to a variety of other applications, platforms, services and printers. It was built to avoid the limitations and issues in other 3D file formats, like STL, for working with the latest versions of 3D printers. 3MF is relatively a new file format that has been developed and published by the 3MF consortium. It is rich enough to fully describe a model, retaining internal information, colour, and other characteristics that makes it extensible for supporting new innovations in 3D printing. The format is extensible, able to be broadly adopted and free of issues besetting other widely used file formats."
    ]
  },
  "how_to_open": {
    "instructions": [
      "A typical 3MF document looks as follow:\n\nThe payload includes the full set of parts required for processing the 3D Model part. All content to be used to manufacture an object described in the 3D payload MUST be contained in the 3MF Document. The description of each document part along with its status as required or option is as given in the following table.\n\nNameDescriptionRelationship SourceRequired/Optional3D ModelContains the description of one or more 3D objects for manufacturing.PackageREQUIREDCore PropertiesThe OPC part that contains various document properties.PackageOPTIONALDigital Signature OriginThe OPC part that is the root of digital signatures in the package.PackageOPTIONALDigital SignatureOPC parts that each contains a digital signature.Digital Signature OriginOPTIONALDigital Signature CertificateOPC parts that contain a digital signature certificate.Digital SignatureOPTIONALPrintTicketProvides settings to be used when outputting the 3D object(s) in the 3D Model part.3D ModelOPTIONALThumbnailContains a small JPEG or PNG image that represents the 3D objects in the package or the package as a whole.PackageOPTIONAL3D TextureContains a texture used to apply color to a 3D object in the 3D Model part (available for extensions)3D ModelOPTIONALCustom PartsOPC parts that are associated with metadataPackageOPTIONAL\n\nThe Parts and Relationships, 3D Models, Object Resources, Material Resources and Package Features sections of specifications document give detailed information about the 3MF document."
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ],
  "images": [
    {
      "url": "https://github.com/3MFConsortium/spec_core/raw/master/images/figure_2-1.png",
      "alt": "3MF Document Structure"
    }
  ]
}