{
  "source": "fileformat.com",
  "url": "https://docs.fileformat.com/audio/aac/index.html",
  "slug": "aac",
  "extension": "aac",
  "name": "What is an AAC file?",
  "summary": "What's on this Page",
  "category": "audio",
  "category_slug": "audio",
  "technical_info": {
    "content": [
      "The AAC file format specifications allow more flexibility to design codec than MP3 does, resulting in more concurrent encoding strategies and efficient compression. The format has been choice of selection by a number of hardware platforms for its improvements over MP3 in terms of providing support for more options even at less bitrates. The AAC file format specifications are available as MPEG-2 Part 7 and MPEG-4 Part 3 (not free to download). The format uses following media types:\n\naudio/aacaudio/aacpaudio/3gppaudio/3gpp2audio/mp4audio/mp4a-latmaudio/mpeg4-generic"
    ]
  },
  "more_information": {
    "description": [
      "AAC (Advanced Audio Coding) is a standardized digital audio coding technology designed for lossy audio compression. Officially defined in the MPEG-2 Part 7 (ISO/IEC 13818-7) and later enhanced in MPEG-4 Part 3 (ISO/IEC 14496-3) standards, it was developed to succeed the older MP3 file format. A key driver for its creation was to overcome the technical limitations of MP3, which hindered the implementation of new, more efficient audio encoding and data compression methods. This advanced foundation allows the AAC format to deliver superior sound quality compared to MP3 at an identical bit rate. Due to this efficiency and quality, it has been widely adopted as the default media format by major platforms including YouTube, iPhone, iPod, iPad, and Apple iTunes. To support its broad use, a wide array of software applications and developer APIs are available to convert AAC files to other popular formats like MP3, WMA, M4A, WAV and many others."
    ]
  },
  "mime": [
    "audio/aac",
    "audio/aacp",
    "audio/3gpp",
    "audio/3gpp2",
    "audio/mp4",
    "audio/mp4a-latm",
    "audio/mpeg4-generic"
  ],
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ]
}