{
  "source": "fileformat.com",
  "url": "https://docs.fileformat.com/audio/ac3/index.html",
  "slug": "ac3",
  "extension": "ac3",
  "name": "What is an AC3 file?",
  "summary": "What's on this Page",
  "category": "audio",
  "category_slug": "audio",
  "technical_info": {
    "content": [
      "The Dolby Digital technology uses a very efficient way to compress the size of multichannel audio files without impairing the sound quality. This compression leads to smaller file size which makes it easy to distribute the sound files. Using Dolby Digital, it is possible to include a full 5.1-channel audio mix on a film print or a DVD.\n\nSpecifications\n\nThe Dolby Digital specifications are as follow.\n\nFieldSpecificationChannels1.0 to 5.1, discreteDVD data rate, 5.1-channel audio384 or 448 kbpsBlu-ray Disc data rate, 5.1-channel audio640 kbpsSupports Dolby metadataYesConnectionsS/PDIF, HDMI®, IEEE 1394Mixing/streaming capabilitiesYes\n\nMetaData Parameters\n\nMetadata ParamterInformationalControlDialogue levelYesChannel modeYesLFE channelYesBitstream modeYesYesLine mode compressionYesRF mode compressionYesRF overmodulation protectionYesCenter downmix levelYesSurround downmix levelYesDolby Surround modeYesAudio production informationYesMix levelYesRoom typeYesCopyright bitYesOriginal bitstreamYesPreferred stereo downmixYesLt/Rt Center downmix levelYesLt/Rt Surround downmix levelYesLo/Ro Center downmix levelYesLo/Ro Surround downmix levelYesDolby Digital Surround EX™ modeYesA/D converter typeYesDC filterYesLowpass filterYesLFE lowpass filterYesSurround 3 dB attenuationYesSurround phase shiftYes"
    ]
  },
  "more_information": {
    "description": [
      "The .ac3 file extension signifies an Audio Codec 3 file, a proprietary audio format developed and introduced by Dolby Laboratories. Functioning as the technical container for Dolby Digital audio, this format is engineered to hold up to six discrete channels of audio, enabling rich 5.1 channel surround sound output. While originally developed for cinematic audio, the AC3 format has become a ubiquitous industry standard for a wide array of digital media applications. Today, its primary uses include encoding audio for HDTV broadcasts, DVD-Video, Blu-ray discs, and modern video game consoles. Due to its widespread adoption, numerous popular media players provide support for the format, including Apple QuickTime Player, Microsoft Windows Media Player, Winamp, and MPlayer, ensuring broad compatibility across different platforms."
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ]
}