{
  "source": "fileformat.com",
  "url": "https://docs.fileformat.com/image/arw/",
  "slug": "arw",
  "extension": "arw",
  "name": "What is an ARW file?",
  "summary": "What's on this Page",
  "category": "image",
  "category_slug": "image",
  "more_information": {
    "description": [
      "ARW file is also know as Alpha Raw file. It is a type of digital image used by Sony cameras and contains raw, unprocessed data captured by camera’s image sesnor. The captured data is uncompressed and retains all the original information captured by camera allowing greater flexibilty in post processing.\n\nARW files typically store a high level of detail, dynamic range and color depth. They provide photographers with more control over aspects such as white balance, exposure, and noise reduction during editing process. However, since ARW files are raw and unprocessed, they require specialized software to view and edit properly.\n\nARW files (.arw) are raw image files—essentially digital negatives—produced by many Sony camera models. These files contain unprocessed image data, meaning they bypass in-camera processing features to preserve the original scene as captured by the sensor. Unlike JPEG files, which are compressed and often under 1 MB, ARW files can be significantly larger, sometimes reaching 1–2 GB in size, especially if they store multiple images. ARW file names typically include a sequential number (e.g., “…1”), which increments with each new photo captured.",
      "The format of ARW file is binary format."
    ]
  },
  "how_to_open": {
    "instructions": [
      "ARW file can be opened using various image editing applications. Some of them are following\n\nMicrosoft Photos with Raw Image ExtensionApple PreviewImaging Edge by SonyAdobe PhotoshopCorel PaintShop ProGoogle Photos"
    ]
  },
  "how_to_convert": {
    "instructions": [
      "You can use the following softwares to convert an ARW file into various other formats.\n\nAdobe PhotoshopAdobe LightroomCapture OneSony Imaging EdgeXnConvertRawTherapeeIrfanView\n\nUsing the above softwares, ARW file can be converted to\n\nPNG - Portable Network GraphicJPEG - JPEG ImageGIF - Graphical Interchange FormatPSD - Adobe Photoshop DocumentBMP - Bitmap ImageTIFF - Tagged Image File Format"
    ]
  },
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ]
}