{
  "source": "fileformat.com",
  "url": "https://docs.fileformat.com/web/aspx/index.html",
  "slug": "aspx",
  "extension": "aspx",
  "name": "What is an ASPX file?",
  "summary": "What's on this Page",
  "category": "web",
  "category_slug": "web",
  "more_information": {
    "description": [
      "A file with .aspx extension is a webpage generated using Microsoft ASP.NET framework running on web servers. ASPX stands for Active Server Pages Extended and these pages are displayed in web browser at user end when the URL is accessed. It is successor of ASP technology which are also generated at server end but does not use .NET framework. ASP.NET pages may contain C# or VB.NET scripts that are translated to HTML by the web server for presentation to user in web browser. ASPX pages are also called .NET Web Forms. These can be opened and created with applications like Microsoft Visual Studio, Adobe Dreamweaver, Notepad++, and any text editor."
    ]
  },
  "how_to_open": {
    "instructions": [
      "An ASPX file is a webpage file generated by Microsoft’s ASP.NET framework. It typically contains scripts and server-side code for dynamic web pages. Here’s how you can open it based on your needs:\n\nOpening an ASPX File in a Browser\n\nIf the file is part of a hosted website:\n\nRename the file to index.aspx or something similar.Place it in a server running ASP.NET (like IIS or Visual Studio).Open it using your browser by typing the URL, e.g., http://localhost/index.aspx.\n\nViewing the Code\n\nIf you just want to see its source code:\n\nRight-click the file and choose Open With > Notepad (or any text editor).For better formatting, use code editors like:Visual Studio CodeNotepad++Sublime Text\n\nRunning ASPX Files Locally\n\nIf you want to test the file locally:\n\nSet up a web server:\n\nInstall IIS (Internet Information Services) on Windows.Use Visual Studio to run the project.\n\nConfigure the server:\n\nPlace the ASPX file in the server’s root directory.Access it via the server’s local URL.\n\nConvert ASPX to HTML\n\nIf the ASPX file represents a static webpage:\n\nOpen the file in a browser (with a server).Save the webpage as HTML:Right-click > Save As…Save it with .html extension."
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ]
}