{
  "source": "fileformat.com",
  "url": "https://docs.fileformat.com/audio/cdr/",
  "slug": "cdr",
  "extension": "cdr",
  "name": "What is a CDR file?",
  "summary": "What's on this Page",
  "category": "audio",
  "category_slug": "audio",
  "more_information": {
    "description": [
      "A file with a .CDR extension containing “Raw CD Audio Data” typically holds digital information extracted directly from the source tracks of an audio CD. This “raw” designation signifies that the data is unprocessed, preserving the original binary structure as it exists on the physical disc. The content includes the precise audio samples alongside subcode information like track timings. These .CDR files are not designed for direct playback in standard media players. Instead, they serve as a fundamental resource for specialized tasks such as professional CD mastering, precise audio editing, and authoring new CDs. Specialized software applications for audio production and CD burning utilize this raw data to generate finished audio CDs or to transcode it into more common, playable formats like WAV or MP3.\n\nIf you need to work with .cdr files containing “Raw CD Audio Data,” you would typically use specialized audio software to process or convert them, as they are not standard audio files that can be played in most media players."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Opening .cdr file, particularly one containing “Raw CD Audio Data,” can be bit tricky because it is not standard audio file format. To open and work with such files, you can use specialized software that can handle raw CD audio data. Here is how to do it and some software options:\n\nSoftware to Open and Work with .cdr Files:\n\nExact Audio Copy (EAC):Download and install Exact Audio Copy, which is popular and powerful tool for working with audio CDs and extracting “Raw CD Audio Data.”Insert CD with .cdr file into your computer’s CD/DVD drive.Open EAC and configure it to your preferences, including output format (e.g., WAV or MP3).Use EAC to extract audio tracks from CD and save them in desired format.Audacity:Audacity is free, open-source audio editing software that can also work with “Raw CD Audio Data.”Insert CD.Open Audacity and configure it to record audio from your CD drive.Record audio from CD and then save it in more common audio format.VLC Media Player:VLC can play audio directly from CDs, including those with “Raw CD Audio Data.”Insert CD into your computer.Open VLC, go to “Media” menu and select “Open Disc.”Choose CD drive and play audio tracks directly.CD Ripper Software:There are various CD ripper software options available, such as Windows Media Player (for Windows), iTunes (for Mac) and others.Insert CD into your computer.Open your preferred CD ripper software and use it to extract audio tracks and save them in common audio format.DAEMON Tools (for .cdr image files):If .cdr file is an image file created by software like DAEMON Tools, you can mount image using DAEMON Tools or similar software.Once image is mounted, you can access its contents as if it were physical CD and play or extract audio as needed."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "To convert .cdr file containing “Raw CD Audio Data” to more common audio format like WAV or MP3, you’ll need specialized software. If you’re able to play your .cdr file in VideoLAN VLC media player, you can also use VLC to convert it to different audio formats e.g.\n\n.MP3 - MP3 Audio.FLAC - Free Lossless Audio Codec.WAV - WAVE Audio.OGG - Ogg Vorbis Audio"
    ]
  },
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ]
}