{
  "source": "fileformat.com",
  "url": "https://docs.fileformat.com/image/cur/",
  "slug": "cur",
  "extension": "cur",
  "name": "What is a CUR file?",
  "summary": "What's on this Page",
  "category": "image",
  "category_slug": "image",
  "technical_info": {
    "content": [
      "CUR files are binary system files that can be found on devices functioning on Microsoft Windows operating system. CUR pointer images come in different standard sizes like 16×16, 32×32, etc. CUR files are very similar to the ICO files; both of them consist of small stationary images. Only the extension of CUR and ICO files are different. Furthermore, the explanation of a hotspot in the header of the CUR file is distinct from the ICO file. The hotspot interprets the pixel offset from the top left corner to the place where you are pointing the mouse. Windows systems are still using the CUR files, but now the animated cursors usually have the file extension ANI instead of CUR."
    ]
  },
  "more_information": {
    "description": [
      "A CUR file is a static Microsoft Windows cursor file format. Basically, they are stationary images identical to ICO (icon) files in every way except the extension. Both CUR and ICO are established on the basis of the Device-Independent Bitmap DIB (Device-Independent Bitmap) specification. Default, as well as custom cursor such as Windows mouse pointer for Windows operating system, are stored in CUR files. It can be an arrow for normal use, a spinning hourglass to demonstrate waiting periods, or an I-bar for text editing. CUR files come along with the installation pack of the custom desktop themes to ensure that the Windows cursor matches the custom desktop theme."
    ]
  },
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ],
  "images": [
    {
      "url": "https://docs.fileformat.com/image/cur.png",
      "alt": "CUR File Format"
    }
  ]
}