{
  "source": "fileformat.com",
  "url": "https://docs.fileformat.com/image/dib/",
  "slug": "dib",
  "extension": "dib",
  "name": "What is a DIB file?",
  "summary": "What's on this Page",
  "category": "image",
  "category_slug": "image",
  "technical_info": {
    "content": [
      "A DIB contains the following color and dimension information:\n\nThe color format of the device on which the rectangular image was created.The resolution of the device on which the rectangular image was created.The palette for the device on which the image was created.An array of bits that maps red, green, blue ( RGB ) triplets to pixels in the rectangular image.A data-compression identifier that indicates the data compression scheme (if any) used to reduce the size of the array of bits.",
      "Information contained in a DIB are represented by different structures. These include:\n\nBITMAPInfo - Defines the dimension and color information for a DIBs\n\ntypedef struct tagBITMAPINFO { BITMAPINFOHEADER bmiHeader; RGBQUAD bmiColors[1]; } BITMAPINFO, *LPBITMAPINFO, *PBITMAPINFO;\n\nIt consists of a BITMAPINFOHEADER:\n\ntypedef struct tagBITMAPINFOHEADER { DWORD biSize; LONG biWidth; LONG biHeight; WORD biPlanes; WORD biBitCount; DWORD biCompression; DWORD biSizeImage; LONG biXPelsPerMeter; LONG biYPelsPerMeter; DWORD biClrUsed; DWORD biClrImportant; } BITMAPINFOHEADER, *PBITMAPINFOHEADER;\n\nfollowed by two or more RGBQAD structures.\n\ntypedef struct tagRGBQUAD { BYTE rgbBlue; BYTE rgbGreen; BYTE rgbRed; BYTE rgbReserved; } RGBQUAD;"
    ]
  },
  "more_information": {
    "description": [
      "A Device-Independent bitmap (DIB) is a raster image file that is similar in structure to the standard Bitmap files(BMP/image/bmp/)). It contains a color table that describes the mapping of RGB colors to the pixel values. This enables DIB to represent image on any device. It can be opened with almost all applications that can open a standard BMP file on Windows as well as macOS. DIB are binary files and have a complex file format similar to BMP. DIB images are independent of the output capabilities of rendering devices in terms of color depth and pixel-per-inch."
    ]
  },
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ]
}