{
  "source": "fileformat.com",
  "url": "https://docs.fileformat.com/image/dng/",
  "slug": "dng",
  "extension": "dng",
  "name": "What is a DNG file?",
  "summary": "What's on this Page",
  "category": "image",
  "category_slug": "image",
  "technical_info": {
    "content": [
      "In this section we will describe the DNG format as an extension of TIFF 6.0.\n\nFile Extensions: DNG uses “.DNG” or “.TIF” extensions.SubIFD Trees: DNG does not support SubIFD chains, instead DNG recommends the use of SubIFD trees as mentioned in TIFF-EP specifications. Highest quality and resolution may use NewSubFileType of 0, while the reduced quality thumbnails should use NewSubFileType equal to 1. It is also recommended though not required that the first IFD must have a low quality or resolution thumbnail.Byte Order: Byte order must be supported by DNG readers, also for files from a particular camera model.Masked Pixels: Most of the camera sensors calculate fully masked pixels at the edge of the sensor through black encoding. These pixels can be either included or trimmed before the image is stored in DNG format. If the masked pixels are not trimmed, then the area of these pixels must be mentioned in the ActiveArea tag. The information gathered from these pixels about black encoding level should be used for either before the raw data is stored or may be included in DNG file specifying the level of black.Defective Pixels: Before storing raw data as DNG, defective pixels should be excluded.Metadata: Metadata may be included in DNG in any of the following ways:** By using TIFF-EP or EXIF metadata tags ** Through the IPTC metadata tag (33723) ** Using the XMP metadata tag (700)Proprietary Data: Normally vendors include proprietary data in raw file to be used by their own converters. DNG stores their proprietary data in private tags, private IFDs, and in a private MakerNote. Vendors must use the DNGPrivateData and MakerNoteSafety tags to make sure applications that edit DNG files preserve this proprietary data.\n\nFollowing are some important restrictions and extensions TIFF tags.\n\nBitsPerSample\n\n8 to 32 bits/sample are supported. There must be same depth for each sample when SamplesPerPixel is not equal to 1.But if BitsPerSample is not equal to 8 or 16 or 32, then bits must be packed into bytes using the TIFF default FillOrder of 1 (big-endian).\n\nCompression\n\nTwo Compression tag values are supported:\n\nValue # 1: Uncompressed data.Value # 7: JPEG compressed data, either baseline DCT JPEG, or lossless JPEG compression.\n\nPhotometricInterpretation\n\nThe following values are supported for thumbnail and preview IFDs only:\n\n1 = BlackIsZero. Assumed to be in a gamma 2.2 color space.2 = RGB. Assumed to be in the sRGB color space.6 = YCbCr. Used for JPEG encoded preview images.\n\nThe following values are supported for the raw IFD, and are assumed to be the camera’s native color space:\n\n32803 # CFA (Color Filter Array).34892 # LinearRaw.\n\nOrientation\n\nOrientation tag is used for file browsers so that they can perform lossless rotation of DNG files. DNG readers must support all possible orientations, including mirrored orientations."
    ]
  },
  "more_information": {
    "description": [
      "DNG is a digital camera image format used for the storage of raw files. It has been developed by Adobe in September 2004. It was basically developed for digital photography. DNG is an extension of TIFF/EP standard format and uses metadata significantly. In order to manipulate raw data from digital cameras with the ease of flexibility and artistic control, photographers opt camera raw files. JPEG and TIFF formats store images that are processed by the camera, therefore, not much room for alteration is available in such formats."
    ]
  },
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ]
}