{
  "source": "fileformat.com",
  "url": "https://docs.fileformat.com/page-description-language/eps/index.html",
  "slug": "eps",
  "extension": "eps",
  "name": "What is an EPS file?",
  "summary": "What's on this Page",
  "category": "page-description-language",
  "category_slug": "page-description-language",
  "more_information": {
    "description": [
      "A .eps file is an image file that is saved to disc in Encapsulated Postscript file format. It may contain any combination of text, graphics and images. EPS files may also include a bitmap preview image encapsulated inside for display by applications that can open such files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "A typical EPS file contains a preview image in a format intended for convenient use in a workflow that involves several systems or applications. The intent of a preview is to have an image in a format that most graphics applications can render; a preview is usually of lower resolution, in pixel dimensions and/or in bit-depth. The preview file can be in one of a number of formats. The specification for EPS_3 lists three “device-specific” preview formats:\n\nfor the Apple Macintosh, a PICT image as used by the QuickDraw applicationfor DOS computers, a TIFF bitmapWindows Metafile.\n\nPICT and Windows Metafile can incorporate both bitmap data and vector graphics. In addition, the specification defines a very simple device-independent representation for an embedded bitmapped preview image. This representation is known as Encapsulated PostScript Interchange Format (EPSI).\n\nAn EPSI preview is a bitmap represented as ASCII hexadecimal, wrapped between a few PostScript comments for identification and intended to be simple and easily transportable. In order to distinguish EPS files with the different preview formats, different DOS file extensions and Macintosh file types were recommended in the EPS specification."
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ]
}