{
  "source": "fileformat.com",
  "url": "https://docs.fileformat.com/video/f4v/index.html",
  "slug": "f4v",
  "extension": "f4v",
  "name": "What is an F4V file?",
  "summary": "What's on this Page",
  "category": "video",
  "category_slug": "video",
  "technical_info": {
    "content": [
      "F4V file format is based on the ISO base media file format (MPEG-4 Part 12) and is very similar to the MP4 format. For the details regarding the structure, please see the MP4 page. The major difference between F4V and MP4 is the metadata formats that F4V can store. Given below is the list of the metadata formats supported by the F4V format.\n\nTag box: Additional four optional tag boxes (auth, title, dscp, cprt) within the Movie (moov) box.XMP Metadata box: This box comes right after the Movie (moov) box. With this, the file can communicate XMP metadata to an SWF movie through ActionScript.ilst box: This box occurs inside the Meta (meta) box and can contain a number of metadata tags. The supported data types are given below.0: Custom Data.1: Text Data.12, 14: Binary Data21: Generic Data.Text Track Metadata box: The text samples (text or tx3g) inside the Media Databox (mdat). It can contain the following metadata boxes.Style box: Text style specifications.Highlight box: Specifies the range of text to be highlighted.Highlight Color box: Specifies the highlight color for the text.Karaoke box: Specified the karaoke metadata.Scroll Delay box: Specifies the scroll delay.Drop Shadow Offset box: Specifies the drop shadow offset coordinates for the text.Drop Shadow Alpha box: Specifies the drop shadow alpha value for the text.Hypertext box: Specifies the hypertext text with alt text over a text range.Text Box box: Defines the coordinates for the text box.Blinking box: Specifies blinking for a range of text.Text Wrap box: Sets the text wrap flag for the text.Text Wrap box: Sets the text wrap flag for the text."
    ]
  },
  "more_information": {
    "description": [
      "F4V (Flash MP4 Video File) is a video file saved with the .f4v extension. It is based on the ISO base media file format (MPEG-4 Part 12). It is very similar to MP4 which is why it is also referred to as the Flash MP4 informally. FLV had limitations when streaming H.264/ACC contents which resulted in Adobe Systems creating the new F4V format. Flash Player can play F4V files since the release of Flash Player 9 Update 3."
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ]
}