{
  "source": "fileformat.com",
  "url": "https://docs.fileformat.com/database/fdb/index.html",
  "slug": "fdb",
  "extension": "fdb",
  "name": "What is a FDB file?",
  "summary": "What's on this Page",
  "category": "database",
  "category_slug": "database",
  "more_information": {
    "description": [
      "A .fdb file is a file extension used for the database files in Microsoft Dynamics NAV. The .fdb file extension stands for “Firebird Database File” and it is the file format used by the Firebird Database Management System, which is the underlying database engine used by Microsoft Dynamics NAV. The .fdb file contains all the data, tables, and structures of the NAV system, including financial data, inventory data, customer data, and more. It is important to keep a backup of the .fdb file to ensure data integrity and to be able to recover data in case of any issue. The .fdb file can be exported, imported and also be used in replication."
    ]
  },
  "how_to_open": {
    "instructions": [
      "FDB file is typically opened and managed using the Microsoft Dynamics NAV development environment or the Microsoft Dynamics NAV client.\n\nHere are the steps to open a .fdb file in Microsoft Dynamics NAV:\n\nOpen the Microsoft Dynamics NAV development environment.Click on the “File” menu and select “Open” or press “Ctrl+O”Navigate to the location where the .fdb file is saved.Select the .fdb file and click on the “Open” button.\n\nYou can also open the .fdb file by connecting to the database using the NAV client.\n\nOpen the NAV client.Click on the “File” menu and select “Connect”In the “Server” field, enter the name or IP address of the server where the .fdb file is located.Enter the appropriate “Database Name” and “Credentials”Click on the “Connect” button.\n\nIt is also possible to open .fdb files with Firebird database management system management software, as it is the underlying database engine used by Microsoft Dynamics NAV."
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ]
}