{
  "source": "fileformat.com",
  "url": "https://docs.fileformat.com/audio/gsm/",
  "slug": "gsm",
  "extension": "gsm",
  "name": "What is a GSM file?",
  "summary": "What's on this Page",
  "category": "audio",
  "category_slug": "audio",
  "technical_info": {
    "content": [
      "GSM work on a structured network which consists of the following sections:\n\nModulation : It is a process of transforming input data into a format that can easily be transmitted. The transmitted data is demodulated at the receiving endTransmission rate : GSM is a digital system that has an over the bit rate of 270 kbpsUplink Frequency Range : 933-960 MHzDownlink Frequency Range: 890 – 915 MHzChannel Spacing : It means the spacing between adjacent barriers which should be about 200 kHzDuplex Distance : It is the space between uplink and downlink frequencies which should be 80 MHzSpeech Coding : GSM uses Linear Predictive Coding (LPC). LPC compresses the bit rate. When the audio signal passes through a filter and mimics the vocal tract. GSM encode speech at 13kbps\n\nAudio compression formatAlgorithmSample rateBit rate transformLatencyCBRVBRStereoMultichannelGSM-HRVSELP8 kHz5.6 kbit/s25 msYesNoNoNoGSM-FRRPE-LTP8 kHz13 kbit/s20–30 msYesNoNoNoGSM-EFRACELP8 kHz12.2 kbit/s20–30 msYesNoNoNo"
    ]
  },
  "more_information": {
    "description": [
      "The GSM file format, more technically known as GSM 06.10 or Full Rate, represents a specialized audio compression standard engineered explicitly for crystal-clear human speech. Originally developed as the core codec for the groundbreaking Global System for Mobile Communications (GSM) network, this technology was instrumental in popularizing mobile phones worldwide. As an audio file type, its primary association is with Global System for Mobile Audio Format Files.\n\nA GSM file is encoded with a lossy CBR (Constant bitrate) sound compression codec. The sample rate in a GSM audio file is 8000 samples/second whereas the data rate is around 13 kbps. The bitrate within the GSM files ensures quality during voice recording. Moreover, the GSM file format is also known as the global standard format to be used in mobile phones and WAV files can also be easily encoded using a GSM file format. Any issues with a GSM file can be easily resolved by the user himself without going to an expert.\n\nUsers can also convert GSM files into MP3 and MP4 formats."
    ]
  },
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ]
}