{
  "source": "fileformat.com",
  "url": "https://docs.fileformat.com/video/h265/",
  "slug": "h265",
  "extension": "h265",
  "name": "What is an H265 file?",
  "summary": "What's on this Page",
  "category": "video",
  "category_slug": "video",
  "technical_info": {
    "content": [
      "High quality and better compression ratioCan easily be utilized in high-resolution movies like 2K or 4K.Having better adaptivity having extra coding modesHEVC contains an in-loop deblocking filter, where the blocking items around the transform edges within the rebuilt picture are smoothed to enhance the picture quality and compression proficiency.HEVC introduces a new filtering stage called the sample-adaptive offset (SAO) filter, which can offer both an impartial and development and enhancement in video quality.Useful in reducing the bandwidth with larger resolutionsPotential to back resolutions of 8192 x 4320 pixelsDesigned mainly for top resolution formatsIntra coding in H265 allows 35 prediction modes"
    ]
  },
  "more_information": {
    "description": [
      "H.265 is also known as HEVC (High-Efficiency Video Coding) is a successor to H.264. It is the newest video compression standard that is said to double the data compression proportion as compare to H.264 with the same video quality. Video encoded with HEVC will uphold the high visual quality but at a smaller file size. It was developed in response to the increasing need for higher compression of moving pictures for different applications such as:\n\nStreamingVideoconferencingDigital storage mediaTelecasting\n\nThe main purpose behind developing H.265 was to enable the use of the coded video depiction in a flexible way for a wide variety of networks and with a high compression ability for an anticipated image or video quality."
    ]
  },
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ]
}