{
  "source": "fileformat.com",
  "url": "https://docs.fileformat.com/image/hdr/",
  "slug": "hdr",
  "extension": "hdr",
  "name": "What is an HDR file?",
  "summary": "What's on this Page",
  "category": "image",
  "category_slug": "image",
  "technical_info": {
    "content": [
      "An HDR image file consists of the following three sections:\n\nHeader: An HDR file is identified by the first bytes in the image file i.e. “#?RADIANCE”.Resolution String: The Header is followed by a single resolution line that consists of 4 values; an X and Y label each followed by a numerical integer value. The order of the X and Y indicate rotation. The combination of X and Y with positive and negative values cover all the possible iamge orientation and rotations.Pixel Data: The pixel data of an HDR file is either uncompressed or compressed using a standard run length encoding."
    ]
  },
  "more_information": {
    "description": [
      "An HDR file is a High Dynamic Range (HDR) raster image file format for storing digital camera photos. It allows photo editors to enhance the color and brightness of digital images that have limited dynamic range. This modification can improve the brightness around the corners, resulting in a close-to-natural image. HDR files are usually saved as 32-bit raster images. Adobe Photoshop can create and open HDR files.\n\nHDR files are also known as HDRI."
    ]
  },
  "how_to_open": {
    "instructions": [
      "imageinfo - Cross platform super fast single header C++ library to get image size and format without loading/decoding.imgaeinfo-rs - Rust library to get image size and format without loading/decoding. Supports .avif, .bmp, .cur, .dds, .gif, hdr (pic), heic (heif), .icns, .ico, .jp2, jpeg (jpg), jpx, ktx, png, psd, qoi, tga, tiff (tif), and webp.HdrHistogram - Java implementation of HdrHistogram."
    ]
  },
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ]
}