{
  "source": "fileformat.com",
  "url": "https://docs.fileformat.com/web/html/",
  "slug": "html",
  "extension": "html",
  "name": "What is an HTML file?",
  "summary": "What's on this Page",
  "category": "web",
  "category_slug": "web",
  "technical_info": {
    "content": [
      "An HTML 4 document is composed of three parts:\n\na line containing HTML version informationa declarative header sectiona body, which contains the document’s actual content. The body may be implemented by the BODY element or the FRAMESET element to contain the body in frames\n\nEach section can be lead or followed by white spaces, newlines, tabs and comments. An example of a simple HTML document is as shown below:\n\n<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.01//EN\" \"http://www.w3.org/TR/html4/strict.dtd\"> <HTML> <HEAD> <TITLE>Understanding HTML File Format</TITLE> </HEAD> <BODY> <P>Hello World! </BODY> </HTML>"
    ]
  },
  "more_information": {
    "description": [
      "HTML (Hyper Text Markup Language) is the extension for web pages created for display in browsers. Known as language of the web, HTML has evolved with requirements of new information requirements to be displayed as part of web pages. The latest variant is known as HTML 5 that gives a lot of flexibility for working with the language. HTML pages are either received from server, where these are hosted, or can be loaded from local system as well. Each HTML page is made up of HTML elements such as forms, text, images, animations, links, etc. These elements are represented by tags and several others where each tag has start and end. It can also embed applications written in scripting languages such as JavaScript and Style Sheets (CSS) for overall layout representation."
    ]
  },
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ]
}