{
  "source": "fileformat.com",
  "url": "https://docs.fileformat.com/audio/it/index.html",
  "slug": "it",
  "extension": "it",
  "name": "What is an IT file?",
  "summary": "What's on this Page",
  "category": "audio",
  "category_slug": "audio",
  "more_information": {
    "description": [
      "Originating in the mid-1990s from developer Jeffrey Lim, the IT file format is the native module file format for the influential Impulse Tracker music software. These versatile files function as comprehensive digital containers, housing not just audio but the entire musical blueprint—including intricate musical patterns, detailed sample data, custom instrument settings, and essential sequencing information. This unique structure empowers composers to create rich, layered compositions within a single, highly efficient IT file.\n\nThe IT file format is a binary format, known for its flexibility and efficiency in representing complex musical compositions. It supports up to 64 channels permitting various effects such as panning, volume slides, vibrato and more, supporting multiple sample formats, both digital samples and synthesized waveforms. IT files were widely used in the demoscene and tracker music community, particularly during late 1990s and early 2000s."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Impulse Tracker (Windows) can be used to open an IT file, however, since the software is no longer actively developed, there is a possibility that it may not be compatible with your operating system version and might not run as expected.\n\nHere are few other options that can open IT file.\n\nOpenMPT for WindowsNullsoft Winamp for WindowsSchism TrackerAudacity with third-party plugin"
    ]
  },
  "how_to_convert": {
    "instructions": [
      "OpenMPT and Schism Tracker are examples of programs that offer the capability to convert IT files into different file formats. e.g.\n\nMP3 - MP3 Audio FileOPUS - Opus Audio FileMID - MIDI FileWAV - WAVE Audio FileOGG - Ogg Vorbis Audio FileFLAC - Free Lossless Audio Codec File"
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ]
}