{
  "source": "fileformat.com",
  "url": "https://docs.fileformat.com/web/json/",
  "slug": "json",
  "extension": "json",
  "name": "What is a JSON file?",
  "summary": "What's on this Page",
  "category": "web",
  "category_slug": "web",
  "technical_info": {
    "content": [
      "JSON data is written in key/value pairs. The key and value are separated by a colon(:) in the middle with the key on the left and the value on the right. Different key/value pairs are separated by a comma(,). The key is a string surrounded by double quotation marks for example “name”. The values can be of the following types.\n\nNumberString: Sequence of Unicode characters surrounded by double quotation marks.Boolean: True or False.Array: A list of values surrounded by square brackets, for example[ \"Apple\", \"Banana\", \"Orange\" ] Object: A collection of key/value pairs surrounded by curly braces, for example{\"name\": \"Jack\", \"age\": 30, \"favoriteSport\" : \"Football\"}\n\nJSON objects can also be nested to represent the structure of the data. Given below is an example of a JSON object."
    ]
  },
  "more_information": {
    "description": [
      "JSON (JavaScript Object Notation) is an open standard file format for sharing data that uses human-readable text to store and transmit data. JSON files are stored with the .json extension. JSON requires less formatting and is a good alternative for XML. JSON is derived from JavaScript but is a language-independent data format. The generation and parsing of JSON is supported by many modern programming languages. application/json is the media type used for JSON.",
      "There is practically no limit on the maximum size of a JSON file. It can be as long as the space required by the contents to be stored.\n\nWhen it comes to using JSON file format for transferring data over the internet, one needs to be careful about the available resources of computer. If large JSON data is transferred, the transfer will be affected if the client browser has limited memory.\n\nThere is no hard limit defined by specification, but you need to be careful not to exhaust resources on your users’ computers, as it will quickly degrade their user experience, and they will be likely to abandon your app."
    ]
  },
  "mime": [
    "application/json"
  ],
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ]
}