{
  "source": "fileformat.com",
  "url": "https://docs.fileformat.com/3d/jt/",
  "slug": "jt",
  "extension": "jt",
  "name": "What is a JT file?",
  "summary": "What's on this Page",
  "category": "3d",
  "category_slug": "3d",
  "more_information": {
    "description": [
      "JT (Jupiter Tessellation) is an efficient, industry-focused and flexible ISO-standardized 3D data format developed by Siemens PLM Software. Mechanical CAD domains of Aerospace, automotive industry, and Heavy Equipment use JT as their most leading 3D visualization format.\n\nJT format is a scene graph that supports the attributes and nodes that are CAD specific. Sophisticated compression techniques are used to store facet data (triangles). This format is structured to support visual attributes, product and manufacturing information (PMI), and Metadata. There is a good support for asynchronous streaming of content. In heavy mechanical industry, professionals use JT file in their CAD solutions and product lifecycle management (PLM) software programs to examine the geometry of complicated goods.\n\nAs JT supports nearly all important 3D CAD formats its assembly can deal with a variety of combination which is known as “multi-CAD”. This multi-CAD assembly is always well managed and up-to-date because synchronization among native CAD product description files with their associated JT files takes place automatically. JT files are originally lightweight, so considered to be suitable for internet collaborations. Companies Collaborate through sending 3D visualizations over the media much more easily as compared to “heavy\" original CAD files. In addition, JT files ensures many security feature that make intellectual property sharing more secure."
    ]
  },
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ],
  "images": [
    {
      "url": "https://docs.fileformat.com/3d/3d/JT-1.png",
      "alt": "&ldquo;JT File Format&rdquo;"
    },
    {
      "url": "https://docs.fileformat.com/3d/3d/JT-2.png",
      "alt": "JT Data Segment"
    }
  ]
}