{
  "source": "fileformat.com",
  "url": "https://docs.fileformat.com/compression/lzh/",
  "slug": "lzh",
  "extension": "lzh",
  "name": "What is an LZH file?",
  "summary": "What's on this Page",
  "category": "compression",
  "category_slug": "compression",
  "technical_info": {
    "content": [
      "The compression method of an LZH archive is shown as a five-byte text string, such as -lz1-. These are the third through seventh bytes in the compressed file.\n\nSpecificationDescriptionExtension.lzh, .lhaMedia Typeapplication/x-lzh-compressedType Code“LHA_” (L-H-A-SPACE)UTIpublic.archive.lhaDeveloped ByHaruyasu Yoshizaki (Yoshi)TypeCompressionExtended fromLArc"
    ]
  },
  "more_information": {
    "description": [
      "A file with .lzh and .lha extension usually relates to archive compression file format. This file format is the same as other file compression formats like ZIP, RAR, etc. The main purpose of these file formats is to reduce the size of the format for easily sending as well as to keep them together in compressed form. AS compare to other western companies LZH files are very popular in Japan and usually used for compressing video game data. The LZH add-on for Windows 7 is built into the Japanese version of Windows 7. Microsoft first released the Microsoft Compressed (LZH) Folder Add-on for the Japanese version of Windows XP. This file format is implemented with compression provisions and features used by the Lempel-Ziv and Haruyasu algorithm"
    ]
  },
  "how_to_open": {
    "instructions": [
      "Following are the few problems that may cause poor working of LZH file format:\n\nThe file may be corrupt. To solve this issue, download the file again or ask the sender to resend the file againThe second reason is infected file in this case scan the file properlyImproper links to the LZH fileRemoval of the description of the LZHNot enough hardware resourcesOutdated drivers of the equipment"
    ]
  },
  "mime": [
    "application/x-lzh-compressed"
  ],
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ]
}