{
  "source": "fileformat.com",
  "url": "https://docs.fileformat.com/audio/m3u8/index.html",
  "slug": "m3u8",
  "extension": "m3u8",
  "name": "What is a M3U8 file?",
  "summary": "What's on this Page",
  "category": "audio",
  "category_slug": "audio",
  "technical_info": {
    "content": [
      "M3U8 files are plain text files that contain a list of media files or streaming segments. Each entry in the M3U8 file refers to a specific media file (or segment) in the playlist. The file typically follows the following structure:\n\nHeader:The file starts with the #EXTM3U tag, which indicates that the file is an M3U or M3U8 playlist.In HLS streaming, the #EXT-X-VERSION tag specifies the version of the protocol being used.Metadata Tags:The M3U8 file contains metadata tags that provide additional information about the media. Common tags include:#EXT-X-TARGETDURATION: Specifies the maximum length (in seconds) of each media segment.#EXT-X-MEDIA-SEQUENCE: Indicates the sequence number of the first media segment.#EXT-X-KEY: Contains encryption information for the media segments.#EXT-X-STREAM-INF: Describes the media stream’s properties, such as bandwidth and resolution, for adaptive bitrate streaming.Media Segments:The file lists the individual media segments (such as .ts files) that make up the entire video or audio stream. Each segment contains a reference to a media file, such as:segment1.tssegment2.tsThese segments are typically small chunks of video or audio data, allowing the player to download and buffer only a small portion of the stream at a time for smoother playback."
    ]
  },
  "more_information": {
    "description": [
      "The M3U8 file format is used by audio and video playback programs to store playlists. The playlist consists of an Internet web path or URL, along with information about each track in the list (playtime duration). M3U8 files use UTF-8 character encoding as compared to M3U file types. M3U8 files can be opened using applications like VideoLAN VLC media player."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Text Editors:Since M3U8 files are plain text, they can be opened and viewed with any text editor, such as Notepad or TextEdit. However, viewing the contents will only show the playlist references and metadata, not the actual media.Media Players:To play the media referenced by an M3U8 file, you will need a media player that supports HLS streaming. Popular players include:VLC Media Player: Can open M3U8 files directly and stream the content.QuickTime Player: Apple’s player can also handle M3U8 playlists for HLS.Web Browsers: Many modern web browsers (like Chrome, Safari, and Firefox) can stream M3U8 files through embedded video players (HTML5-based video players).Streaming Platforms:If the M3U8 file is from a streaming platform (such as a live stream), you can usually play it directly within the service’s interface or app (like YouTube Live or other HLS-based platforms)."
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ]
}