{
  "source": "fileformat.com",
  "url": "https://docs.fileformat.com/audio/mp2/",
  "slug": "mp2",
  "extension": "mp2",
  "name": "What is an MP2 file?",
  "summary": "What's on this Page",
  "category": "audio",
  "category_slug": "audio",
  "technical_info": {
    "content": [
      "The MP2 file format is based on successive digital frames of 1152 sampling intervals with four possible formats:\n\nmono formatstereo formatintensity encoded joint stereo format (stereo irrelevance)dual channel (uncorrelated) format Some important technical specifications of MP2 are given in the table below:\n\nSpecificationDescriptionSampling rates32, 44.1 and 48 kHzBit rates32, 48, 56, 64, 80, 96, 112, 128, 160, 192, 224, 256, 320 and 384 kbit/sAdditional sampling rates16, 22.05 and 24 kHzAdditional bit rates8, 16, 24, 40 and 144 kbit/sMultichannel supportUp to 5 full range audio channels and an LFE-channel (Low Frequency Enhancement channel)"
    ]
  },
  "more_information": {
    "description": [
      "An MP2 file, also widely known as an MPA file, is an audio format compressed using MPEG-1 or MPEG-2 Audio Layer II. This lossy audio compression standard was formally defined by ISO/IEC 11172-3, which also established the MPEG-1 Audio Layer I and the vastly more popular MPEG-1 Audio Layer III (MP3). The primary goal of the MP2 format, like its counterparts, was to significantly reduce audio file size. While the MP3 format gained greater mainstream adoption due to its smaller file size and widespread availability online, the MP2 file remains a critical and resilient standard, particularly within the professional realm of audio broadcasting where its specific technical strengths are essential."
    ]
  },
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ]
}