{
  "source": "fileformat.com",
  "url": "https://docs.fileformat.com/video/mxf/index.html",
  "slug": "mxf",
  "extension": "mxf",
  "name": "What is an MXF File?",
  "summary": "What's on this Page",
  "category": "video",
  "category_slug": "video",
  "technical_info": {
    "content": [
      "MXF file format has been defined by the following SMPTE specifications.\n\nSMPTE ST 377-1:2011. Television — Material Exchange Format (MXF) — File Format SpecificationSMPTE ST 377-2 (work in progress as of January 2012). KLV Encoded Extension Syntax for MXF.SMPTE ST 378:2004 (Archived 2010). Television — Material Exchange Format (MXF) — Operational Pattern 1a (Single Item, Single Package)SMPTE ST 379-1:2009. Material Exchange Format (MXF) — MXF Generic ContainerSMPTE ST 379-2:2010. Material Exchange Format (MXF) – MXF Constrained Generic ContainerSMPTE ST 380:2004. Television — Material Exchange Format (MXF) — Descriptive Metadata Scheme-1 (Standard, Dynamic)SMPTE ST 381-1:2005. Television — Material Exchange Format (MXF) — Mapping MPEG Streams into the MXF Generic Container (Dynamic)SMPTE ST 381-2:2011. Material Exchange Format (MXF) — Mapping MPEG Streams into the MXF Constrained Generic ContainerSMPTE ST 382:2007. Material Exchange Format (MXF) — Mapping AES3 Streams and Broadcast Wave Audio to the MXF Generic ContainerSMPTE ST 383:2008. Television — Material Exchange Format (MXF) — Mapping DV-DIF Data to the MXF Generic ContainerSMPTE ST 384:2005. Television — Material Exchange Format (MXF) — Mapping of Uncompressed Pictures into the MXF Generic ContainerSMPTE ST 385:2004. Television — Material Exchange Format (MXF) — Mapping SDTI-CP Essence and Metadata into the MXF Generic ContainerSMPTE ST 386:2004 (Archived 2010). Television — Material Exchange Format (MXF) — Mapping Type D-10 Essence Data to the MXF Generic ContainerSMPTE ST 387:2004 (Archived 2010). Television — Material Exchange Format (MXF) — Mapping Type D-11 Essence Data to the MXF Generic ContainerSMPTE ST 388:2004 (Archived 2010). Television — Material Exchange Format (MXF) — Mapping A-law Coded Audio into the MXF Generic ContainerSMPTE ST 389:2005. Television — Material Exchange Format (MXF) — MXF Generic Container Reverse Play System ElementSMPTE ST 390:2011. Television — Material Exchange Format (MXF) — Specialized Operational Pattern “Atom” (Simplified Representation of a Single Item)SMPTE ST 391:2004 (Archived 2010). Television — Material Exchange Format (MXF) — Operational Pattern 1b (Single Item, Ganged Packages)SMPTE ST 392:2004. Television — Material Exchange Format (MXF) — Operational Pattern 2a (Play-List Items, Single Package)SMPTE ST 393:2004. Television — Material Exchange Format (MXF) — Operational Pattern 2b (Play-List Items, Ganged Packages)SMPTE ST 394:2006. Television — Material Exchange Format (MXF) — System Scheme 1 for the MXF Generic ContainerSMPTE ST 405:2006. Television — Material Exchange Format (MXF) — Elements and Individual Data Items for the MXF Generic Container System Scheme 1SMPTE ST 407:2006. Television — MXF — Operational Patterns 3a and 3bSMPTE ST 408:2006. Television — MXF — Operational Patterns 1c, 2c, and 3cSMPTE ST 410: 2008. Material Exchange Format - Generic Stream Partition.SMPTE ST 422:2006. Material Exchange Format — Mapping JPEG2000 Codestreams into the MXF Generic ContainerSMPTE ST 429.4:2006. D-Cinema Packaging — MXF JPEG 2000 ApplicationSMPTE ST 429.5:2006. D-Cinema Packaging — Timed Text Track FileSMPTE ST 429.6:2006. D-Cinema Packaging — MXF Track File Essence EncryptionSMPTE ST 434:2006. Material Exchange Format — XML Encoding for Metadata and File Structure InformationSMPTE ST 436:2006. Television — MXF Mappings for VBI Lines and Ancillary Data PacketsSMPTE ST 2019-4:2009. Mapping VC-3 Coding Units into the MXF Generic ContainerSMPTE ST 2037:2009. Mapping VC-1 into the MXF Generic ContainerSMPTE RP 2008:2008. Material Exchange Format — Mapping AVC Streams into the MXF Generic ContainerSMPTE RP 2057:2011. Text-Based Metadata Carriage in MXFSMPTE EG 41:2004. Material Exchange Format (MXF) — Engineering Guideline. Note: This document was no longer listed on the SMPTE Web site when consulted in January 2012.SMPTE EG 42:2004. Material Exchange Format (MXF) — MXF Descriptive MetadataSMPTE RDD 3:2008. e-VTR MXF Interoperability SpecificationSMPTE RDD 9-2009. MXF Interoperability Specification of Sony MPEG Long GOP ProductsSMPTE metadata registry spreadsheet menu."
    ]
  },
  "more_information": {
    "description": [
      "A file with .mxf extension is a multimedia container format that contains digital video and audio media along with metadata information about the file. It follows the SMPTE (Society of Motion Picture and Television Engineers) standard that is a global association of professionals from engineering, technology, and executives working in the media and entertainment industry. MXF files can be converted to other file formats such as AVI or MOV."
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ]
}