{
  "source": "fileformat.com",
  "url": "https://docs.fileformat.com/web/oam/index.html",
  "slug": "oam",
  "extension": "oam",
  "name": "What is an OAM file?",
  "summary": "What's on this Page",
  "category": "web",
  "category_slug": "web",
  "technical_info": {
    "content": [
      "The internal file structure of a .oam file is proprietary and not publicly documented by Adobe. However, it is known that .oam files contain a collection of files and resources (such as graphics, audio, and ActionScript code) packaged into a single file. The contents of a .oam file may include XML files, SWF files, and other resource files. The exact structure of the .oam file depends on the specific version of Adobe Animate used to create it, as well as the type of animation and assets included in the file.\n\nAn OAM file contains the following information.\n\nAssets: Information about the graphics, audio, and video assets used in the animation.\n\nBehaviors: Descriptions of the actions and interactions that occur in the animation.\n\nActionScript code: The code used to control the animation’s behavior and interactivity.\n\nPublish settings: Information about the platform and format in which the animation will be published, such as HTML5 or AIR.\n\nMetadata: Additional information such as the animation’s author, creation date, and version number."
    ]
  },
  "more_information": {
    "description": [
      "A .oam file a an animated widget file exported from Adobe Edge Animate Widget. Animations exported as OAM widget file format can be inserted into other Adobe applications such as InDesign Documents (INDD file, Dreamweaver, and Muse. OAM files are like deployment packages that can be readily inserted into other Adobe’s projects to make use of them. OAM files contain information about the animation’s assets, behaviors, and actionscript code. You can create an OAM file by publishing an Adobe Animate project .AN file. Users can create OAM files by publishing from an Edge Animate project (.AN file)."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can use the following applications to open OAM files.\n\nAdobe Edge Animate CC (Discontinued)Adobe Animate 2023Adobe InDesign 2023Adobe Dreamweaver 2021"
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ]
}