{
  "source": "fileformat.com",
  "url": "https://docs.fileformat.com/3d/ply/",
  "slug": "ply",
  "extension": "ply",
  "name": "What is a PLY file?",
  "summary": "What's on this Page",
  "category": "3d",
  "category_slug": "3d",
  "technical_info": {
    "content": [
      "The file structure of a PLY file format is as follow:\n\nFieldFile HeaderVertex ListFace ListList of other elements\n\nExample Structure\n\nWe will use the following example below in our subsequent discussion for various parts of a PLY file format.\n\nply format ascii 1.0 { ascii/binary, format version number } comment made by Greg Turk { comments keyword specified, like all lines } comment this file is a cube element vertex 8 { define \"vertex\" element, 8 of them in file } property float x { vertex contains float \"x\" coordinate } property float y { y coordinate is also a vertex property } property float z { z coordinate, too } element face 6 { there are 6 \"face\" elements in the file } property list uchar int vertex_index { \"vertex_indices\" is a list of ints } end_header { delimits the end of the header } 0 0 0 { start of vertex list } 0 0 1 0 1 1 0 1 0 1 0 0 1 0 1 1 1 1 1 1 0 4 0 1 2 3 { start of face list } 4 7 6 5 4 4 0 4 5 1 4 1 5 6 2 4 2 6 7 3 4 3 7 4 0\n\nFile Header\n\nPLY file format header consists of ASCII text for both the ASCII as well as the binary format. The start and end of header section is identified by ply and end-header keywords. The start of header has the magic word ply which is used for recognition of PLY file format by readers. The next line shows the version number for this file. Comments in a PLY file format start with comment keyword at the start of each comment line.\n\nElement Keyword\n\nThe element keyword then tells what’s inside the file. It is followed by properties for that specific element type where each property has its property type and order specified as shown below:\n\nelement vertex 8 { define \"vertex\" element, 8 of them in file } property float x { vertex contains float \"x\" coordinate } property float y { y coordinate is also a vertex property } property float z { z coordinate, too }\n\nIn this particular example, the specific vertex element has 3 properties of type float with their order specified.\n\nTypes of Data Types\n\nThere are two type of data types that a property may have.\n\nScalar: The scalar data types are as shown below:\n\n|#Name|#Type|#Number of Bytes |char|character|1 |uchar|unsigned character|1 |short|short integer|2 |ushort|unsigned short integer|2 |int|Integer|4 |uint|unsigned Integer|4 |float|single-precision float|4 |double|double precision float|8\n\nList: There is a special form of property definitions that uses the list data type. An example of this is from the cube file above:\n\nproperty list uchar int vertex_index\n\nThis means that the property “vertex_index” contains first an unsigned char telling how many indices the property contains, followed by a list containing that many integers. Each integer in this variable-length list is an index to a vertex."
    ]
  },
  "more_information": {
    "description": [
      "PLY, Polygon File Format, represents 3D file format that stores graphical objects described as a collection of polygons. The purpose of this file format was to establish a simple and easy file type that is general enough to be useful for a wide range of models. PLY file format comes as ASCII as well as Binary format for compact storage and for rapid saving and loading. The file format is used by different applications that provide support for 3D files reading.\n\nObjects in a PLY format are described by a collection of vertices, faces and other elements, along with properties such as colour and normal direction that can be attached to these elements. Other properties that can also be stored with the object include:\n\nSurface normalstexture coordinatestransparencyrange data confidenceproperties for the front and back of a polygon\n\nAn object represented by PLY format can be the result of various sources such as hand-digitized objects, polygon objects from modelling applications, range data, triangles from marching cubes, terain data and radiosity models."
    ]
  },
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ]
}