{
  "source": "fileformat.com",
  "url": "https://docs.fileformat.com/image/raw/index.html",
  "slug": "raw",
  "extension": "raw",
  "name": "What is a RAW file?",
  "summary": "What's on this Page",
  "category": "image",
  "category_slug": "image",
  "more_information": {
    "description": [
      "A raw file format refers to file format that stores unprocessed and uncompressed data directly from digital image sensor or other sources. It is commonly used in digital photography and imaging.\n\nOther formats apply compression and processing algorithms to reduce file size and optimize image for display or printing, raw files contain all data captured by sensor without any alterations. This includes information such as color, brightness and other sensor-specific data.\n\nRaw files are often specific to particular camera manufacturer and model as they store data in format unique to sensor and hardware characteristics of that camera. Common raw file formats include CR2 (Canon), NEF (Nikon), ARW (Sony) and DNG (Adobe Digital Negative).\n\nBecause raw files are unprocessed, they provide greater flexibility for post-processing adjustments and offer more control over final image. Photographers and professionals prefer working with raw files because they can make precise adjustments to aspects such as exposure, white balance, color grading and noise reduction during editing process.\n\nHowever, raw files are typically larger in size compared to compressed formats like JPEG. Additionally, raw files require specialized software or dedicated image editors that support specific raw format to open, view and process them.",
      "The format of RAW file is binary format."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open RAW file using various image editing software applications e.g.\n\nAdobe PhotoshopAdobe Photoshop ElementsCorel PaintShop ProACD Systems ACDSeeRawTherapee"
    ]
  },
  "how_to_convert": {
    "instructions": [
      "Several image editing softwares can convert RAW file into different formats. Adobe Photoshop can convert your RAW files into image formats like\n\nPNG - Portable Network GraphicJPEG - JPEG ImageGIF - Graphical Interchange FormatPSD - Adobe Photoshop DocumentBMP - Bitmap Image"
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ]
}