{
  "source": "fileformat.com",
  "url": "https://docs.fileformat.com/3d/stp/",
  "slug": "stp",
  "extension": "stp",
  "name": "What is an STP file?",
  "summary": "What's on this Page",
  "category": "3d",
  "category_slug": "3d",
  "more_information": {
    "description": [
      "An STP file is a 3D CAD file used for exchange of product data between CAD and CAM applications. It contains information about 3D objects and is saved similar to the STEP file format. STP files facilitate the exchange of data between applications as per the STEP Application Protocols ISO 10303-2xx. This ISO defines the encoding mechanism for data representation in EXPRESS data modeling language. STP files can be opened in applications such as such as Autodesk Fusion 360."
    ]
  },
  "how_to_open": {
    "instructions": [
      "STP files can be opened in STP Viewers as well as Text Editors.",
      "Various CAD applications can open STP files for viewing on Windows, MacOS and Linux. These include:\n\nAutodesk Fusion 360 (cross-platform)FreeCAD (cross-platform)IMSI TurboCAD (Windows, Mac)Dassault Systems CATIA (WIndows, Linux)",
      "STP files are saved as plain text files. This makes it possible to open STP files with text editors. Popular text editors such as Notepad and Notepad++ on Windows OS, and Apple TextEdit on MacOS can open STP files. Once opened in a text editor, user can edit the properties of STP file. However, it can lead to corruption of file in case of updating the properties incorrectly."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "There are several applications that can convert STP files to other file formats. CAD applications that can convert STP files include:\n\nAutodesk Fusion 360IMSI TurboCADSiemens Solid Edge\n\nIn addition to these, there are several online apps that can convert STP files to other file formats. These online apps lets you upload your STP file to cloud servers where they are converted to your desired format and returned back for downloading.\n\nThe Autodesk Fusion 360 can convert STP files to the following 3D and CAD file formats.\n\nOBJ3MFDWGDXFASMIGESSTLFBXF3DUSD"
    ]
  },
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ]
}