{
  "source": "fileformat.com",
  "url": "https://docs.fileformat.com/video/sub/index.html",
  "slug": "sub",
  "extension": "sub",
  "name": "What is a SUB file?",
  "summary": "What's on this Page",
  "category": "video",
  "category_slug": "video",
  "more_information": {
    "description": [
      "A SUB file is a MicroDVD subtitle file format used to display subtitles in videos, typically have .sub file extension. These files contain timing information and text for each subtitle entry.\n\nMicroDVD subtitle files use simple text-based format where each subtitle entry consists of several lines. The first line contains the subtitle’s timing information, including the start and end timestamps. The subsequent lines contain actual subtitle text.\n\nHere is an example of MicroDVD subtitle file:\n\n{0}{100}Subtitle line 1 {150}{300}Subtitle line 2 {350}{550}Subtitle line 3 ...",
      "Open Sub typically means OpenSubtitles which is a popular online platform that provides subtitles for movies and TV shows in multiple languages. It offer vast collection of subtitle files contributed by its community of users. You can visit the OpenSubtitles website (www.opensubtitles.org) to search for and download subtitles for your desired movies or TV series."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Open Sub typically means OpenSubtitles which is a popular online platform that provides subtitles for movies and TV shows in multiple languages. It offer vast collection of subtitle files contributed by its community of users. You can visit the OpenSubtitles website (www.opensubtitles.org) to search for and download subtitles for your desired movies or TV series.",
      "The following media players can open SUB file as a subtitles track.\n\nVideoLAN VLC media playerMPlayer\n\nTo open SUB file in VLC player follow these steps\n\nOpen VLC player and play your videoFrom the VLC Media Player menu bar, select Subtitles > Add Subtitle File ….Navigate to SUB file and open it\n\nIf you need to edit SUB file, you can open it with any text editor e.g. Microsoft Notepad (Windows) or Apple TextEdit (Mac)."
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ]
}