{
  "source": "fileformat.com",
  "url": "https://docs.fileformat.com/page-description-language/swf/index.html",
  "slug": "swf",
  "extension": "swf",
  "name": "What is an SWF file?",
  "summary": "What's on this Page",
  "category": "page-description-language",
  "category_slug": "page-description-language",
  "technical_info": {
    "content": [
      "Path is the basic graphical element in SWF, which is a sequence of segments of basic elements, ranging from simple lines to Bezier curves. These simple elements also help to make other additional primitives like cubes, ellipses, and even texts. The graphical primitives in SWF have similarity with the graphical elements of other formats like SVG and MPEG-4 BIFS.\n\nDisplay lists and reusing/renaming already defined elements are also allowed by the format. The binary stream format of SWF can be compared to QuickTime atoms which is similar in terms of tag, size and payload. The binary stream format allows the older players to skip non-supported contents. Though original versions of SWF were limited to offer vector graphics and images, therefore new versions allow audio and video contents as well.\n\nA new, low-level 3D API of the Flash Player named “Stage3D” was introduced in version 11. This API was envisioned to be counterpart of OpenGL or Direct3D. Stage3D defines colors in a low-level language called Adobe Graphics Assembly Language (AGAL).Following are few basic datatypes of SWF file format."
    ]
  },
  "more_information": {
    "description": [
      "An SWF file is an animation file that is created with Adobe Flash. It may contain different type of elements such as text, vector images, raster images, actionscripts, objects such as circles, lines, squares, and rectangle to create the animation. SWF files arrange these multimedia items in frames that can be played on different frames per second (fps). SWF means Short Web File but is also known has Shockwave Format.\n\nApplications that could open SWF files* included Adobe Flash Player(now discontinued) and Eltima Elmedia Player."
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ]
}