{
  "source": "fileformat.com",
  "url": "https://docs.fileformat.com/font/ttf/index.html",
  "slug": "ttf",
  "extension": "ttf",
  "name": "What is a TTF file?",
  "summary": "What's on this Page",
  "category": "font",
  "category_slug": "font",
  "technical_info": {
    "content": [
      "A TrueType font file is a binary file that consists of a sequence of concatenated tables. Each table is a sequence of words and has a name known as Tag. Each tag is of uint32 data type and consists of four characters. The first table in the file is font directory that gives access to other tables in the font file. Font data is contained in other tables followed after the font directory table. Since each table is accessible by its tag, the tables can appear in any order in the file.\n\nThe required tables and their tag names are shown in the following table.\n\nTagTable‘cmap’character to glyph mapping‘glyf’glyph data‘head’font header‘hhea’horizontal header‘hmtx’horizontal metrics’loca'index to location‘maxp’maximum profile’name'naming‘post’PostScript"
    ]
  },
  "more_information": {
    "description": [
      "A file with .ttf extension represents font files based on the TrueType specifications font technology. It was initially designed and launched by Apple Computer, Inc for Mac OS and was later adopted by Microsoft for Windows OS. TrueType fonts provide highest quality display on computer screens and printers without any dependency on resolution. All modern applications using fonts are able to work with TTF files. TTF font files are freely available over the internet and can also be converted to other font file formats such as OTF and WOFF.",
      "A TrueType font (TTF) is a font format developed by Apple and Microsoft. It uses scalable vector graphics to display text at any size without losing quality. TrueType fonts are widely supported across various operating systems and applications, making them a standard for digital typography."
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ]
}