{
  "source": "fileformat.com",
  "url": "https://docs.fileformat.com/video/ttml2/index.html",
  "slug": "ttml2",
  "extension": "ttml2",
  "name": "What is TTML2?",
  "summary": "What's on this Page",
  "category": "video",
  "category_slug": "video",
  "technical_info": {
    "content": [
      "A typical TTML2 document consists of:\n\n<tt>: The root element.<head>: Contains metadata, styling, and layout information.<metadata>: Includes document-level metadata such as title and copyright.<styling>: Defines style specifications.<layout>: Specifies layout regions.<body>: Contains the timed text content, referencing styles and layouts.\n\ne.g.\n\n<tt xml:lang=\"\" xmlns=\"http://www.w3.org/ns/ttml\"> <head> <metadata/> <styling/> <layout/> </head> <body/> </tt>"
    ]
  },
  "more_information": {
    "description": [
      "Timed Text Markup Language 2 (TTML2) is an XML-based language designed for the representation of timed text media, such as subtitles and captions. It serves as a standardized format for the interchange, authoring, and distribution of timed text content across various platforms and systems.\n\nTTML2 is intended for:\n\nInterchange: Facilitating the exchange of timed text information among different authoring systems.Transcoding: Converting timed text content into various legacy distribution formats used in subtitling and captioning.Distribution: Serving as a distribution format itself, for example, by referencing TTML content from a <track> element in an HTML5 document or a <text> or <textstream> media element in a SMIL 3.0 document."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open and view a TTML2 file using different tools, depending on whether you want to read the text, edit the content, or display it as subtitles. TTML2 files are XML-based, so they can be opened in any text or XML editor, but to play or test them as subtitles, you need compatible tools.",
      "Use any text editor:\n\nWindows: Notepad or Notepad++Mac/Linux: TextEdit or VS Code\n\nJust right-click the file → Open with → choose your editor."
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ]
}