{
  "source": "fileformat.com",
  "url": "https://docs.fileformat.com/image/webp/index.html",
  "slug": "webp",
  "extension": "webp",
  "name": "What is a WEBP file?",
  "summary": "What's on this Page",
  "category": "image",
  "category_slug": "image",
  "more_information": {
    "description": [
      "WebP, introduced by Google, is a modern raster web image file format that is based on lossless and lossy compression. It provides same image quality while considerably reducing the image size. Since most of the web pages use images as effective representation of data, the use of WebP images in web pages results in faster loading of web pages. As per Google, WebP lossless images are 26% smaller in size compared to PNGs, while WebP lossy images are 25-34% smaller than comparable JPEG images. Images are compared based on the Structural Similarity (SSIM) index between WebP and other image file formats. WebP is a sister project of WebM multimedia container format."
    ]
  },
  "how_to_open": {
    "instructions": [
      "WebP images use the compression process based on the prediction of pixels from their surrounding blocks, resulting in pixels to be used multiple times in a single file. It supports animated images and is expected to support more features in the future. Google has made available the source code online for its encoder and decoder so as to be used where required. The WebP image provides support for:\n\nLossy compression: The lossy compression is based on VP8 key frame encoding. VP8 is a video compression format created by On2 Technologies as a successor to the VP6 and VP7 formats.Lossless compression: The lossless compression format is developed by the WebP team.Transparency: 8-bit alpha channel is useful for graphical images. The Alpha channel can be used along with lossy RGB, a feature that’s currently not available with any other format.Animation: It supports true-color animated images.Metadata: It may have EXIF and XMP metadata (used by cameras, for example).Color Profile: It may have an embedded ICC profile.\n\nLossy WebP compression uses predictive coding to encode an image, the same method used by the VP8 video codec to compress keyframes in videos. Predictive coding uses the values in neighboring blocks of pixels to predict the values in a block, and then encodes only the difference.\n\nLossless WebP compression uses already seen image fragments in order to exactly reconstruct new pixels. It can also use a local palette if no interesting match is found."
    ]
  },
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ]
}