{
  "source": "fileformat.com",
  "url": "https://docs.fileformat.com/video/wmv/",
  "slug": "wmv",
  "extension": "wmv",
  "name": "What is a WMV file?",
  "summary": "What's on this Page",
  "category": "video",
  "category_slug": "video",
  "technical_info": {
    "content": [
      "WMV-9 has an 8 bit 4:2:0 internal color format. Like all other popular video compression standards MPEG-1 and H.261, WMV-9 uses a block-based motion compensation and spatial transform scheme. In general, we can say that these standards perform block-by-block motion compensation from the previous reconstructed frame with the help of a 2-D quantity called the motion vector (MV) to signal spatial displacement. The current block is formed with the help of predicting the values from the same size previous reconstructed frame which is displaced from the current position by the motion vector. Eventually, the residual error is calculated as the difference between the motion-compensated predicted block and the actual block. This residual error is transformed using a linear energy-compacting transform then quantized and entropy coded.\n\nQuantized transform coefficients are entropy decoded, de-quantized, and inverse transformed to produce an approximation of the residual error on the decoder side, which is then added to the motion-compensated prediction to generate the reconstruction. The high-level description of the codec is shown in the following image.\n\nThe rest of the section will discuss the new improvements in WMV-9 which differentiate it from the rest of the video coding solutions like MPEG standards. WMV-9 has intra (I), predicted (P), and bi-directionally predicted (B) frames. Intra frames are those which are coded independently and have no dependence on other frames. Predicted frames are frames that depend on one frame in the past. Decoding of a predicted frame can occur only after all reference frames prior to the current frame starting from the most recent (I) frame have been decoded. B frames are frames that have two references—one in the temporal past and one in the temporal future. B frames are transmitted subsequent to their references, which means that B frames are sent out of order to ensure that their references are available at the time of decoding. B frames in WMV-9 are not used as a reference for subsequent frames. This places B frames outside of the decoding loop, allowing shortcuts to be taken during the decoding of B frames without drift or long-term visual artifacts. The above definition of I, P, and B frames holds for both progressive and interlaced sequences.\n\nThe performance of video codecs is compared to their rate-distortion (R-D) plot. It’s a 2-D curve that shows the distortion produced by the compression at a certain bitrate.\n\nWMV-9 has addressed this problem with the introduction of a variety of techniques listed below:\n\nAdaptive block size transformLimited precision transform-setMotion compensationQuantization and dequantizationAdvanced entropy codingLoop filteringAdvanced B frame codingInterlace codingOverlap smoothingLow-rate toolsFading compensation"
    ]
  },
  "more_information": {
    "description": [
      "The Advanced Systems Format (ASF) is a digital multimedia container designed primarily for storing and transmitting media streams. Microsoft Windows Media Video (WMV) is the compressed video format and Microsoft Windows Media Audio (WMA) is the compressed audio format along with additional metadata in the ASF container developed by Microsoft. Once the WMV or WMA files are encoded with Windows Media Video and Windows Media Audio codecs then they are represented with .asf extension. WMV compresses large files for a better transmission rate over a network while maintaining the quality of the video. WMV is specifically designed to run on all Windows devices. After the standardization by the Society of Motion Picture and Television Engineers (SMPTE), WMV is now considered to be an open standard format."
    ]
  },
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ]
}