{
  "type": "video",
  "subtype": "mpeg4-generic",
  "full": "video/mpeg4-generic",
  "extensions": [],
  "sources": [
    {
      "source": "mime-db",
      "url": "https://www.npmjs.com/package/mime-db"
    },
    {
      "source": "iana",
      "url": "https://www.iana.org/assignments/media-types/media-types.xhtml"
    },
    {
      "source": "apache",
      "url": "https://svn.apache.org/repos/asf/httpd/httpd/trunk/docs/conf/mime.types"
    },
    {
      "source": "nginx",
      "url": "https://hg.nginx.org/nginx/raw-file/default/conf/mime.types"
    },
    {
      "source": "mime-db",
      "url": "https://www.npmjs.com/package/mime-db"
    }
  ],
  "iana": {
    "template_url": "https://www.iana.org/assignments/media-types/video/mpeg4-generic",
    "encoding_considerations": "This MIME subtype is defined for RTP transport only.  System\nbitstreams MUST be generated according to MPEG-4 Systems\nspecifications (ISO/IEC 14496-1).  Video bitstreams MUST be generated\naccording to MPEG-4 Visual specifications (ISO/IEC 14496-2).  Audio\nbitstreams MUST be generated according to MPEG-4 Audio specifications\n(ISO/IEC 14496-3).  The RTP packets MUST be packetized according to\nthe RTP payload format defined in RFC 3640.",
    "security_considerations": "As defined in section 5 of RFC 3640.",
    "interoperability_considerations": "MPEG-4 provides a large and rich set of tools for the coding of\nvisual objects.  For effective implementation of the standard,\nsubsets of the MPEG-4 tool sets have been provided for use in\nspecific applications.  These subsets, called 'Profiles', limit the\nsize of the tool set a decoder is required to implement.  In order to\nrestrict computational complexity, one or more 'Levels' are set for\neach Profile.  A Profile@Level combination allows:\n\n    .  a codec builder to implement only the subset of the standard\n       he needs, while maintaining interworking with other MPEG-4\n       devices that implement the same combination, and\n\n    .  checking whether MPEG-4 devices comply with the standard\n       ('conformance testing').\n\nA stream SHALL be compliant with the MPEG-4 Profile@Level specified\nby the parameter \"profile-level-id\".  Interoperability between a\nsender and a receiver is achieved by specifying the parameter\n\"profile-level-id\" in MIME content.  In the capability\nexchange/announcement procedure, this parameter may mutually be set\nto the same value.",
    "additional_information": "Magic number(s): none\n\nFile extension(s):\nNone.  A file format with the extension .mp4 has been defined for\nMPEG-4 content but is not directly correlated with this MIME type for\nwhich the sole purpose is RTP transport.\n\nMacintosh File Type Code(s): none",
    "intended_usage": "common",
    "template_text": "(RFC 3640 published November 2003, subtype last updated November 2003)\n\nMIME media type name: \"video\" or \"audio\" or \"application\"\n\n\"video\" MUST be used for MPEG-4 Visual streams (ISO/IEC 14496-2) or\nMPEG-4 Systems streams (ISO/IEC 14496-1) that convey information\nneeded for an audio/visual presentation.\n\n\"audio\" MUST be used for MPEG-4 Audio streams (ISO/IEC 14496-3) or\nMPEG-4 Systems streams that convey information needed for an audio\nonly presentation.\n\n\"application\" MUST be used for MPEG-4 Systems streams (ISO/IEC\n14496-1) that serve purposes other than audio/visual presentation,\ne.g., in some cases when MPEG-J (Java) streams are transmitted.\n\nDepending on the required payload configuration, MIME format\nparameters may need to be available to the receiver.  This is done\nusing the parameters described in the next section.  There are\nrequired and optional parameters.\n\nOptional parameters are of two types: general parameters and\nconfiguration parameters.  The configuration parameters are used to\nconfigure the fields in the AU Header section and in the auxiliary\nsection.  The absence of any configuration parameter is equivalent to\nthe associated field set to its default value, which is always zero.\nThe absence of all configuration parameters results in a default\n\"basic\" configuration with an empty AU-header section and an empty\nauxiliary section in each RTP packet.\n\nMIME subtype name: mpeg4-generic\n\nRequired parameters:\n\nMIME format parameters are not case dependent; for clarity however,\nboth upper and lower case are used in the names of the parameters\ndescribed in this specification.\n\n   streamType:\n   The integer value that indicates the type of MPEG-4 stream that is\n   carried; its coding corresponds to the values of the streamType,\n   as defined in Table 9 (streamType Values) in ISO/IEC 14496-1.\n\n   profile-level-id:\n   A decimal representation of the MPEG-4 Profile Level indication.\n   This parameter MUST be used in the capability exchange or session\n   set-up procedure to indicate the MPEG-4 Profile and Level\n   combination of which the relevant MPEG-4 media codec is capable.\n\n   For MPEG-4 Audio streams, this parameter is the decimal value from\n      Table 5 (audioProfileLevelIndication Values) in ISO/IEC 14496-\n      1, indicating which MPEG-4 Audio tool subsets are required to\n      decode the audio stream.\n\n   For MPEG-4 Visual streams, this parameter is the decimal value\n      from Table G-1 (FLC table for profile and level indication) of\n      ISO/IEC 14496-2 [1], indicating which MPEG-4 Visual tool\n      subsets are required to decode the visual stream.\n\n   For BIFS streams, this parameter is the decimal value obtained\n      from (SPLI + 256*GPLI), where:\n      SPLI is the decimal value from Table 4 in ISO/IEC 14496-1 with\n               the applied sceneProfileLevelIndication;\n      GPLI is the decimal value from Table 7 in ISO/IEC 14496-1 with\n         the applied graphicsProfileLevelIndication.\n\n   For MPEG-J streams, this parameter is the decimal value from table\n      13 (MPEGJProfileLevelIndication) in ISO/IEC 14496-1, indicating\n      the profile and level of the MPEG-J stream.\n\n   For OD streams, this parameter is the decimal value from table 3\n      (ODProfileLevelIndication) in ISO/IEC 14496-1, indicating the\n      profile and level of the OD stream.\n\n   For IPMP streams, this parameter has either the decimal value 0,\n      indicating an unspecified profile and level, or a value larger\n      than zero, indicating an MPEG-4 IPMP profile and level as\n      defined in a future MPEG-4 specification.\n\n   For Clock Reference streams and Object Content Info streams, this\n      parameter has the decimal value zero, indicating that profile\n      and level information is conveyed through the OD framework.\n\n   config:\n   A hexadecimal representation of an octet string that expresses the\n   media payload configuration.  Configuration data is mapped onto\n   the hexadecimal octet string in an MSB-first basis.  The first bit\n   of the configuration data SHALL be located at the MSB of the first\n   octet.  In the last octet, if necessary to achieve octet-\n   alignment, up to 7 zero-valued padding bits shall follow the\n   configuration data.\n\n   For MPEG-4 Audio streams, config is the audio object type specific\n      decoder configuration data AudioSpecificConfig(), as defined in\n      ISO/IEC 14496-3.  For Structured Audio, the\n      AudioSpecificConfig() may be conveyed by other means, not\n      defined by this specification.  If the AudioSpecificConfig() is\n      conveyed by other means for Structured Audio, then the config\n      MUST be a quoted empty hexadecimal octet string, as follows:\n      config=\"\".\n\n      Note that a future mode of using this RTP payload format for\n      Structured Audio may define such other means.\n\n   For MPEG-4 Visual streams, config is the MPEG-4 Visual\n      configuration information as defined in subclause 6.2.1, Start\n      codes of ISO/IEC 14496-2.  The configuration information\n      indicated by this parameter SHALL be the same as the\n      configuration information in the corresponding MPEG-4 Visual\n      stream, except for first-half-vbv-occupancy and latter-half-\n      vbv-occupancy, if it exists, which may vary in the repeated\n      configuration information inside an MPEG-4 Visual stream (See\n      6.2.1 Start codes of ISO/IEC 14496-2).\n\n   For BIFS streams, this is the BIFSConfig() information as defined\n      in ISO/IEC 14496-1.  Version 1 of BIFSConfig is defined in\n      section 9.3.5.2, and version 2 is defined in section 9.3.5.3.\n      The MIME format parameter objectType signals the version of\n      BIFSConfig.\n\n   For IPMP streams, this is either a quoted empty hexadecimal octet\n      string, indicating the absence of any decoder configuration\n      information (config=\"\"), or the IPMPConfiguration() as will be\n      defined in a future MPEG-4 IPMP specification.\n\n   For Object Content Info (OCI) streams, this is the\n      OCIDecoderConfiguration() information of the OCI stream, as\n      defined in section 8.4.2.4 in ISO/IEC 14496-1.\n\n   For OD streams, Clock Reference streams and MPEG-J streams, this\n      is a quoted empty hexadecimal octet string (config=\"\"), as no\n      information on the decoder configuration is required.\n\n   mode:\n   The mode in which this specification is used.  The following modes\n   can be signaled:\n\n   mode=generic,\n   mode=CELP-cbr,\n   mode=CELP-vbr,\n   mode=AAC-lbr and\n   mode=AAC-hbr.\n\n   Other modes are expected to be defined in future RFCs.  See also\n   section 3.3.7 and 4.2 of RFC 3640.\n\nOptional general parameters:\n\n   objectType:\n   The decimal value from Table 8 in ISO/IEC 14496-1, indicating the\n   value of the objectTypeIndication of the transported stream.  For\n   BIFS streams, this parameter MUST be present to signal the version\n   of BIFSConfiguration().  Note that objectTypeIndication may signal\n   a non-MPEG-4 stream and that the RTP payload format defined in\n   this document may not be suitable for carrying a stream that is\n   not defined by MPEG-4.  The objectType parameter SHOULD NOT be set\n   to a value that signals a stream that cannot be carried by this\n   payload format.\n\n   constantSize:\n   The constant size in octets of each Access Unit for this stream.\n   The constantSize and the sizeLength parameters MUST NOT be\n   simultaneously present.\n\n   constantDuration:\n   The constant duration of each Access Unit for this stream,\n   measured with the same units as the RTP time stamp.\n\n   maxDisplacement:\n   The decimal representation of the maximum displacement in time of\n   an interleaved AU, as defined in section 3.2.3.3, expressed in\n   units of the RTP time stamp clock.\n\n   This parameter MUST be present when interleaving is applied.\n\n   de-interleaveBufferSize:\n   The decimal representation in number of octets of the size of the\n   de-interleave buffer, described in section 3.2.3.3.  When\n   interleaving, this parameter MUST be present if the calculation of\n   the de-interleave buffer size given in 3.2.3.3 and based on\n   maxDisplacement and rate(max) under-estimates the size of the\n   de-interleave buffer.  If this calculation does not under-estimate\n   the size of the de-interleave buffer, then the\n   de-interleaveBufferSize parameter SHOULD NOT be present.\n\nOptional configuration parameters:\n\n   sizeLength:\n   The number of bits on which the AU-size field is encoded in the\n   AU-header.  The sizeLength and the constantSize parameters MUST\n   NOT be simultaneously present.\n\n   indexLength:\n   The number of bits on which the AU-Index is encoded in the first\n   AU-header.  The default value of zero indicates the absence of the\n   AU-Index field in each first AU-header.\n\n   indexDeltaLength:\n   The number of bits on which the AU-Index-delta field is encoded in\n   any non-first AU-header.  The default value of zero indicates the\n   absence of the AU-Index-delta field in each non-first AU-header.\n\n   CTSDeltaLength:\n   The number of bits on which the CTS-delta field is encoded in the\n   AU-header.\n\n   DTSDeltaLength:\n   The number of bits on which the DTS-delta field is encoded in the\n   AU-header.\n\n   randomAccessIndication:\n   A decimal value of zero or one, indicating whether the RAP-flag is\n   present in the AU-header.  The decimal value of one indicates\n   presence of the RAP-flag, the default value zero indicates its\n   absence.\n\n   streamStateIndication:\n   The number of bits on which the Stream-state field is encoded in\n   the AU-header.  This parameter MAY be present when transporting\n   MPEG-4 system streams, and SHALL NOT be present for MPEG-4 audio\n   and MPEG-4 video streams.\n\n   auxiliaryDataSizeLength:\n   The number of bits that is used to encode the auxiliary-data-size\n   field.\n\nApplications MAY use more parameters, in addition to those defined\nabove.  Each additional parameter MUST be registered with IANA to\nensure that there is not a clash of names.  Each additional parameter\nMUST be accompanied by a specification in the form of an RFC, MPEG\nstandard, or other permanent and readily available reference (the\n\"Specification Required\" policy defined in RFC 2434 [6]).  Receivers\nMUST tolerate the presence of such additional parameters, but these\nparameters SHALL NOT impact the decoding of receivers that comply\nwith this specification.\n\nEncoding considerations:\nThis MIME subtype is defined for RTP transport only.  System\nbitstreams MUST be generated according to MPEG-4 Systems\nspecifications (ISO/IEC 14496-1).  Video bitstreams MUST be generated\naccording to MPEG-4 Visual specifications (ISO/IEC 14496-2).  Audio\nbitstreams MUST be generated according to MPEG-4 Audio specifications\n(ISO/IEC 14496-3).  The RTP packets MUST be packetized according to\nthe RTP payload format defined in RFC 3640.\n\nSecurity considerations:\nAs defined in section 5 of RFC 3640.\n\nInteroperability considerations:\nMPEG-4 provides a large and rich set of tools for the coding of\nvisual objects.  For effective implementation of the standard,\nsubsets of the MPEG-4 tool sets have been provided for use in\nspecific applications.  These subsets, called 'Profiles', limit the\nsize of the tool set a decoder is required to implement.  In order to\nrestrict computational complexity, one or more 'Levels' are set for\neach Profile.  A Profile@Level combination allows:\n\n    .  a codec builder to implement only the subset of the standard\n       he needs, while maintaining interworking with other MPEG-4\n       devices that implement the same combination, and\n\n    .  checking whether MPEG-4 devices comply with the standard\n       ('conformance testing').\n\nA stream SHALL be compliant with the MPEG-4 Profile@Level specified\nby the parameter \"profile-level-id\".  Interoperability between a\nsender and a receiver is achieved by specifying the parameter\n\"profile-level-id\" in MIME content.  In the capability\nexchange/announcement procedure, this parameter may mutually be set\nto the same value.\n\nPublished specification:\nThe specifications for MPEG-4 streams are presented in ISO/IEC\n14496-1, 14496-2, and 14496-3.  The RTP payload format is described\nin RFC 3640.\n\nApplications which use this media type:\nMultimedia streaming and conferencing tools.\n\nAdditional information: none\n\nMagic number(s): none\n\nFile extension(s):\nNone.  A file format with the extension .mp4 has been defined for\nMPEG-4 content but is not directly correlated with this MIME type for\nwhich the sole purpose is RTP transport.\n\nMacintosh File Type Code(s): none\n\nPerson & email address to contact for further information:\nAuthors of RFC 3640, IETF Audio/Video Transport working group.\n\nIntended usage: COMMON\n\nAuthor/Change controller:\nAuthors of RFC 3640, IETF Audio/Video Transport working group.\n"
  },
  "references": [
    {
      "title": "RFC 3640",
      "url": "https://www.rfc-editor.org/rfc/rfc3640.html",
      "kind": "RFC"
    }
  ]
}