{
  "type": "video",
  "subtype": "vc1",
  "full": "video/vc1",
  "extensions": [],
  "sources": [
    {
      "source": "mime-db",
      "url": "https://www.npmjs.com/package/mime-db"
    },
    {
      "source": "iana",
      "url": "https://www.iana.org/assignments/media-types/media-types.xhtml"
    },
    {
      "source": "apache",
      "url": "https://svn.apache.org/repos/asf/httpd/httpd/trunk/docs/conf/mime.types"
    },
    {
      "source": "nginx",
      "url": "https://hg.nginx.org/nginx/raw-file/default/conf/mime.types"
    },
    {
      "source": "mime-db",
      "url": "https://www.npmjs.com/package/mime-db"
    }
  ],
  "iana": {
    "template_url": "https://www.iana.org/assignments/media-types/video/vc1",
    "type_name": "video",
    "subtype_name": "vc1",
    "encoding_considerations": "This media type is framed and contains binary data.",
    "security_considerations": "See Section 7 of RFC 4425.",
    "interoperability_considerations": "None.",
    "applications": "Multimedia streaming and conferencing tools.",
    "additional_information": "None.",
    "template_text": "(per RFC4425)\n\nType name:  video\n\nSubtype name:  vc1\n\nRequired parameters:\n\n      profile:\n         The value is an integer identifying the VC-1 profile.  The\n         following values are defined:\n\n         0: Simple profile\n         1: Main profile\n         3: Advanced profile\n\n         If the profile parameter is used to indicate properties of a\n         coded bit stream, it indicates the VC-1 profile that a\n         decoder has to support when it decodes the bit stream.\n\n         If the profile parameter is used for capability exchange or\n         in a session setup procedure, it indicates the VC-1 profile\n         that the codec supports.\n\n         level:\n         The value is an integer that specifies the level of the VC-1\n         profile.\n\n         For Advanced profile, valid values are 0 through 4, which\n         correspond to levels L0 through L4, respectively.  For\n         Simple and Main profiles, the following values are defined:\n\n         1: Low Level\n         2: Medium Level\n         3: High Level (only valid for Main profile)\n\n         If the level parameter is used to indicate properties of a\n         coded bit stream, it indicates the highest level of the VC-1\n         profile that a decoder has to support when it decodes the\n         bit stream.  Note that support for a level implies support\n         for all numerically lower levels of the given profile.\n\n         If the level parameter is used for capability exchange or in\n         a session setup procedure, it indicates the highest level of\n         the VC-1 profile that the codec supports.  See section 6.3\n         of RFC 4425 for specific rules for how this parameter is\n         used with the SDP Offer/Answer model.\n\nOptional parameters:\n\n      config:\n         The value is a base16 [6] (hexadecimal) representation of an\n         octet string that expresses the decoder initialization\n         parameters.  Decoder initialization parameters are mapped\n         onto the base16 octet string in an MSB-first basis.  The\n         first bit of the decoder initialization parameters MUST be\n         located at the MSB of the first octet.  If the decoder\n         initialization parameters are not multiples of 8 bits, up to\n         7 zero-valued padding bits MUST be added in the last octet\n         to achieve octet alignment.\n\n         For Simple and Main profiles, the decoder initialization\n         parameters are STRUCT_C, as defined in Annex J of SMPTE 421M\n         [1].\n\n         For Advanced profile, the decoder initialization parameters\n         are a sequence layer header directly followed by an entry-\n         point header.  The two headers MUST be in EBDU format,\n         meaning that they must include their Start Codes and must\n         use the encapsulation method defined in Annex E of SMPTE\n         421M [1].\n\n      width:\n         The value is an integer greater than zero, specifying the\n         maximum horizontal size of the coded frames, in luma samples\n         (pixels in the luma picture).\n\n         For Simple and Main profiles, the value SHALL be identical\n         to the actual horizontal size of the coded frames.\n\n         For Advanced profile, the value SHALL be greater than, or\n         equal to, the largest horizontal size of the coded frames.\n\n         If this parameter is not specified, it defaults to the\n         maximum horizontal size allowed by the specified profile and\n         level.\n\n      height:\n         The value is an integer greater than zero, specifying the\n         maximum vertical size of the coded frames, in luma samples\n         (pixels in a progressively coded luma picture).\n\n         For Simple and Main profiles, the value SHALL be identical\n         to the actual vertical size of the coded frames.\n\n         For Advanced profile, the value SHALL be greater than, or\n         equal to, the largest vertical size of the coded frames.\n\n         If this parameter is not specified, it defaults to the\n         maximum vertical size allowed by the specified profile and\n         level.\n\n      bitrate:\n         The value is an integer greater than zero, specifying the\n         peak transmission rate of the coded bit stream in bits per\n         second.  The number does not include the overhead caused by\n         RTP encapsulation, i.e., it does not include the AU headers,\n         or any of the RTP, UDP, or IP headers.\n\n         If this parameter is not specified, it defaults to the\n         maximum bit rate allowed by the specified profile and level.\n         See the values for \"RMax\" in Annex D of SMPTE 421M [1].\n\n      buffer:\n         The value is an integer specifying the leaky bucket size, B,\n         in milliseconds, required to contain a stream transmitted at\n         the transmission rate specified by the bitrate parameter.\n         This parameter is defined in the hypothetical reference\n         decoder model for VC-1, in Annex C of SMPTE 421M [1].\n\n         Note that this parameter relates to the codec bit stream\n         only, and does not account for any buffering time that may\n         be required to compensate for jitter in the network.\n\n         If this parameter is not specified, it defaults to the\n         maximum buffer size allowed by the specified profile and\n         level.  See the values for \"BMax\" and \"RMax\" in Annex D of\n         SMPTE 421M [1].\n\n      framerate:\n         The value is an integer greater than zero, specifying the\n         maximum number of frames per second in the coded bit stream,\n         multiplied by 1000 and rounded to the nearest integer value.\n         For example, 30000/1001 (approximately 29.97) frames per\n         second is represented as 29970.\n\n         This parameter can be used to control resource allocation at\n         the receiver.  For example, a receiver may choose to perform\n         additional post-processing on decoded frames only if the\n         frame rate is expected to be low.  The parameter MUST NOT be\n         used for pacing of the rendering process, since the actual\n         frame rate may differ from the specified value.\n\n         If the parameter is not specified, it defaults to the\n         maximum frame rate allowed by the specified profile and\n         level.\n\n      bpic:\n         This parameter signals that B- and BI-pictures may be\n         present when Advanced profile is used.  If this parameter is\n         present, and B- or BI-pictures may be present in the coded\n         bit stream, this parameter MUST be equal to 1.\n\n         A value of 0 indicates that B- and BI-pictures SHALL NOT be\n         present in the coded bit stream, even if the sequence layer\n         header changes.  Inclusion of this parameter with a value of\n         0 is RECOMMENDED, if neither B- nor BI-pictures are included\n         in the coded bit stream.\n\n         This parameter MUST NOT be used with Simple and Main\n         profiles. For Main profile, the presence of B- and\n         BI-pictures is indicated by the MAXBFRAMES field in STRUCT_C\n         decoder initialization parameter.\n\n         For Advanced profile, if this parameter is not specified, a\n         value of 1 SHALL be assumed.\n\n      mode:\n         The value is an integer specifying the use of the sequence\n         layer header and the entry-point header.  This parameter is\n         only defined for Advanced profile.  The following values are\n         defined:\n\n         0: Both the sequence layer header and the entry-point header\n            may change, and changed headers will be included in the\n            RTP packets.\n         1: The sequence layer header specified in the config\n            parameter never changes.  The rules in section 4.8 of RFC\n            4425 MUST be followed.\n         3: The sequence layer header and the entry-point header\n            specified in the config parameter never change.  The\n            rules in section 4.9 of RFC 4425 MUST be followed.\n\n         If the mode parameter is not specified, a value of 0 SHALL\n         be assumed.  The mode parameter SHOULD be specified if modes\n         1 or 3 apply to the VC-1 bit stream.\n\n      max-width, max-height, max-bitrate, max-buffer, max-framerate:\n         These parameters are defined for use in a capability\n         exchange procedure.  The parameters do not signal properties\n         of the coded bit stream, but rather upper limits or\n         preferred values for the \"width\", \"height\", \"bitrate\",\n         \"buffer\", and \"framerate\" parameters.  Section 6.3 of RFC\n         4425 provides specific rules for how these parameters are\n         used with the SDP Offer/Answer model.\n\n         Receivers that signal support for a given profile and level\n         MUST support the maximum values for these parameters for\n         that profile and level.  For example, a receiver that\n         indicates support for Main profile, Low level, must support\n         a width of 352 luma samples and a height of 288 luma\n         samples, even if this requires scaling the image to fit the\n         resolution of a smaller display device.\n\n         A receiver MAY use any of the max-width, max-height, max-\n         bitrate, max-buffer, and max-framerate parameters to\n         indicate preferred capabilities.  For example, a receiver\n         may choose to specify values for max-width and max-height\n         that match the resolution of its display device, since a bit\n         stream encoded using those parameters would not need to be\n         rescaled.\n\n         If any of the max-width, max-height, max-bitrate, max-\n         buffer, and max-framerate parameters signal a capability\n         that is less than the required capabilities of the signaled\n         profile and level, then the parameter SHALL be interpreted\n         as a preferred value for that capability.\n\n         Any of the parameters MAY also be used to signal\n         capabilities that exceed the required capabilities of the\n         signaled profile and level.  In that case, the parameter\n         SHALL be interpreted as the maximum value that can be\n         supported for that capability.\n\n         When more than one parameter from the set (max-width,\n         max-height, max-bitrate, max-buffer, and max-framerate) is\n         present, all signaled capabilities MUST be supported\n         simultaneously.\n\n         A sender or receiver MUST NOT use these parameters to signal\n         capabilities that meet the requirements of a higher level of\n         the VC-1 profile than that specified in the \"level\"\n         parameter, even if the sender or receiver can support all\n         the properties of the higher level, except if specifying a\n         higher level is not allowed due to other restrictions.  As\n         an example of such a restriction, in the SDP Offer/Answer\n         model, the value of the level parameter that can be used in\n         an Answer is limited by what was specified in the Offer.\n\n      max-width:\n         The value is an integer greater than zero, specifying a\n         horizontal size for the coded frames, in luma samples\n         (pixels in the luma picture).  If the value is less than the\n         maximum horizontal size allowed by the profile and level,\n         then the value specifies the preferred horizontal size.\n         Otherwise, it specifies the maximum horizontal size that is\n         supported.\n\n         If this parameter is not specified, it defaults to the\n         maximum horizontal size allowed by the specified profile and\n         level.\n\n      max-height:\n         The value is an integer greater than zero, specifying a\n         vertical size for the coded frames, in luma samples (pixels\n         in a progressively coded luma picture).  If the value is\n         less than the maximum vertical size allowed by the profile\n         and level, then the value specifies the preferred vertical\n         size.  Otherwise, it specifies the maximum vertical size\n         that is supported.\n\n         If this parameter is not specified, it defaults to the\n         maximum vertical size allowed by the specified profile and\n         level.\n\n      max-bitrate:\n         The value is an integer greater than zero, specifying a peak\n         transmission rate for the coded bit stream in bits per\n         second.  The number does not include the overhead caused by\n         RTP encapsulation, i.e., it does not include the AU headers,\n         or any of the RTP, UDP, or IP headers.\n\n         If the value is less than the maximum bit rate allowed by\n         the profile and level, then the value specifies the\n         preferred bit rate.  Otherwise, it specifies the maximum bit\n         rate that is supported.\n\n         If this parameter is not specified, it defaults to the\n         maximum bit rate allowed by the specified profile and level.\n         See the values for \"RMax\" in Annex D of SMPTE 421M [1].\n\n      max-buffer:\n         The value is an integer specifying a leaky bucket size, B,\n         in milliseconds, required to contain a stream transmitted at\n         the transmission rate specified by the max-bitrate\n         parameter.  This parameter is defined in the hypothetical\n         reference decoder model for VC-1, in Annex C of SMPTE 421M\n         [1].\n\n         Note that this parameter relates to the codec bit stream\n         only and does not account for any buffering time that may be\n         required to compensate for jitter in the network.\n\n         If the value is less than the maximum leaky bucket size\n         allowed by the max-bitrate parameter and the profile and\n         level, then the value specifies the preferred leaky bucket\n         size.  Otherwise, it specifies the maximum leaky bucket size\n         that is supported for the bit rate specified by the max-\n         bitrate parameter.\n\n         If this parameter is not specified, it defaults to the\n         maximum buffer size allowed by the specified profile and\n         level.  See the values for \"BMax\" and \"RMax\" in Annex D of\n         SMPTE 421M [1].\n\n      max-framerate:\n         The value is an integer greater than zero, specifying a\n         number of frames per second for the coded bit stream.  The\n         value is the frame rate multiplied by 1000 and rounded to\n         the nearest integer value.  For example, 30000/1001\n         (approximately 29.97) frames per second is represented as\n         29970.\n\n         If the value is less than the maximum frame rate allowed by\n         the profile and level, then the value specifies the\n         preferred frame rate.  Otherwise, it specifies the maximum\n         frame rate that is supported.\n\n         If the parameter is not specified, it defaults to the\n         maximum frame rate allowed by the specified profile and\n         level.\n\nEncoding considerations:\n         This media type is framed and contains binary data.\n\nSecurity considerations:\n         See Section 7 of RFC 4425.\n\nInteroperability considerations:\n        None.\n\nPublished specification:\n        RFC 4425.\n\nApplications that use this media type:\n        Multimedia streaming and conferencing tools.\n\nAdditional Information:\n        None.\n\nPerson & email address to contact for further information:\n        Anders Klemets <anderskl&microsoft.com>\n        IETF AVT working group.\n\nIntended Usage:\n        COMMON\n\nRestrictions on usage:\n        This media type depends on RTP framing; therefore, it is\n        only defined for transfer via RTP [3].\n\nAuthors:\n        Anders Klemets\n\nChange controller:\n        IETF Audio/Video Transport Working Group delegated from the\n        IESG."
  },
  "references": [
    {
      "title": "RFC 4425",
      "url": "https://www.rfc-editor.org/rfc/rfc4425.html",
      "kind": "RFC"
    }
  ]
}