{
  "slug": "act",
  "extension": "act",
  "name": "ADPCM Compressed Audio",
  "summary": "Learn about .ACT files and view a list of programs that open them.",
  "developer": "Actions Semiconductor",
  "category": "audio",
  "category_slug": "audio",
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ],
  "technical_info": {
    "content": [
      "Many recorders using the ACT system only are doing it for the smallest recording option; if the quality is upped, a separate format, usually WAV, is used, resulting in massively larger documents.\n\nThere are several generations of ACT; as of June 2009, tracks created by subsequent devices just can not be recognized by every free standard music player or converter application, leaving only the bundled MP3 tools.\n\nImage optimization for Web distribution is done with ACT files. Customers can test the picture quality against the generated image databases by increasing or decreasing the number of colors in the CLUT.\n\nBy tapping the Color Table option and picking Load Color Data from the Export for Web dialogue box, Adobe color tables can be uploaded. The /Presets/en_US/Save for Web Settings/Color Tables/ directory contains several preconfigured ACT files that came with the Photoshop system.\n\nAct scripts can be generated solely within Genesis 3D or by transforming other 3D models to the ACT standard using Genesis3D Actor Designer",
      "Various models of Chinese media players (often referred to as S1 MP3 players) and voice recorders can save audio recordings in the ACT format. This lossy format was developed by Actions Semiconductor and is usually a device's lowest-quality recording format. (Audio recorded at higher quality is typically saved as a .WAV file.)",
      "To create an ACT file, users record audio using either a device's built-in microphone or FM radio. They can then play the ACT file on their device or transfer it to their computer, where they can convert it to the WAV format using conversion software included with their device."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open most ACT files with File Viewer Plus (Windows), Logipole Konverter (Windows), or SoX (Linux). However, these programs may not be able to open ACT files created by later devices, which are saved in a different format than previous devices' ACT files."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "You can use File Viewer Plus (Windows), Logipole Konverter (Windows), or SoX (Linux) to convert most ACT files to the .WAV format and other audio formats. However, you may not be able to open or convert ACT files saved in more recent versions of the ACT file format."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "File Viewer Plus",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1415"
      },
      {
        "name": "SoX",
        "url": "https://fileinfo.com/software/sox/sox"
      },
      {
        "name": "Adobe Photoshop 2025",
        "url": "https://fileinfo.com/software/adobe/photoshop"
      },
      {
        "name": "Adobe Illustrator 2025",
        "url": "https://fileinfo.com/software/adobe/illustrator"
      },
      {
        "name": "chUmbaLum sOft MilkShape 3D",
        "url": "https://fileinfo.com/software/chumbalum_soft/milkshape_3d"
      },
      {
        "name": "Autodesk 3ds Max 2023",
        "url": "https://fileinfo.com/software/autodesk/3ds_max"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileformat.com",
      "url": "https://docs.fileformat.com/audio/act/",
      "retrieved_at": "2025-11-02T02:43:26.495Z"
    },
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/act",
      "retrieved_at": "2025-11-02T02:43:26.495Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.495Z"
}