{
  "slug": "apinotes",
  "extension": "apinotes",
  "name": "Swift Objective-C API Note",
  "summary": "Learn about .APINOTES files and view a list of programs that open them.",
  "developer": "Apple",
  "technical_info": {
    "content": [
      "Swift is an Apple-maintained programming language that developers use to create programs for macOS, iOS, tvOS, and watchOS. Developers creating Swift programs may have those programs make API calls to programs written in Objective-C, which is the language Swift replaced.",
      "If an Objective-C API's header does not contain all the information needed for the Swift program to correctly interpret information it receives from the API, developers can annotate the API using an APINOTES file. This file contains YAML-formatted text that defines how and what information a Swift program can receive from the associated Objective-C API.",
      "After a developer creates an APINOTES file, they must place it in the same directory as the Objective-C framework to which it corresponds and update CMakeLists.txt. Then, the next time the developer builds their Swift program, the compiler will load the APINOTES file along with the corresponding framework."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open and edit an APINOTES file in any text or source code editor, such as GitHub Atom, Sublime Text, or Microsoft Visual Studio Code. Source code editors, like the previously mentioned programs, contain tools that make it easier to review and edit the text APINOTES files contain."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "GitHub Atom",
        "url": "https://fileinfo.com/software/github/atom"
      },
      {
        "name": "Sublime Text",
        "url": "https://fileinfo.com/software/sublime_hq/sublime_text"
      },
      {
        "name": "Microsoft Visual Studio Code",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12713&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/apinotes",
      "retrieved_at": "2025-11-02T02:43:26.579Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.579Z"
}