{
  "slug": "arprojpkg",
  "extension": "arprojpkg",
  "name": "Spark AR Project Package",
  "summary": "Learn about .ARPROJPKG files and view a list of programs that open them.",
  "developer": "Facebook",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "Spark AR Studio allows Facebook users to create AR effects that they can apply to Facebook and Instagram videos. For example, a Spark AR Studio user could create a \"bubbles\" effect and then apply the effect to add AR bubbles to a video.",
      "When a user saves a Spark AR Studio project, the program creates a new project directory. This directory contains an ARPROJ file and any assets the user has imported into their project. If a user wants to share their Spark AR Studio project with another user, they can do so by packaging all these files as a single ARPROJPKG file.",
      "Packaging a project zips its ARPROJ and asset files into one compressed file that can be shared over the Internet more easily. Sharing a project as a package also prevents users from accidentally not providing the project's assets. To package a project as an ARPROJPKG file, users select File → Package... from AR Studio's menu."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an ARPROJPKG file in Spark AR Studio (cross-platform). To do so, select File → Open... from the program's menu bar. Keep in mind that you must have a Facebook account to use Spark AR Studio."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12162&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/arprojpkg",
      "retrieved_at": "2025-11-01T22:32:42.330Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.330Z"
}