{
  "slug": "autoplay",
  "extension": "autoplay",
  "name": "AutoPlay Media Studio Project",
  "summary": "Learn about .AUTOPLAY files and view a list of programs that open them.",
  "developer": "Indigo Rose",
  "technical_info": {
    "content": [
      "Developers and content creators across various industries, such as education, marketing, software deployment, and technical documentation, may utilize AutoPlay Media Studio and AUTOPLAY files to create simple, self-contained applications without needing extensive programming knowledge. Once an AUTOPLAY project is complete, a user can export it as a standalone executable or burn it to a CD/DVD for distribution.",
      "AUTOPLAY files contain settings such as window size, page arrangement, scripting logic, and references to multimedia files used in the project. The actual media files (images, videos, audio, .BTN buttons, etc.) are typically stored in a folder named CD_Root, which is saved in the same directory as the AUTOPLAY project file. This structure keeps all project components organized and portable.",
      "NOTE: Version 8 of AutoPlay Media Studio introduced the AUTOPLAY project format. Previous versions were saved as .AM7, .AM6, etc., files with the number related to the version of the software saving the project."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open AUTOPLAY files with Indigo Rose AutoPlay Media Studio in Windows. To open an AUTOPLAY file, select File → Open.",
      "Since AUTOPLAY files are saved in XML format, you can also open them with a plain text or XML editor. However, opening an AUTOPLAY file in this manner will not appear the same as if opening it with AutoPlay Media Studio."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "AutoPlay Media Studio (version 8 and later) can convert AUTOPLAY files to Autoplay Media Studio Exported Project (.APZ) files and Autoplay Media Studio Template (.APT) files. The software can also build AUTOPLAY files as Windows Executable (.EXE) files and Disk Image (.ISO) files."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=6421&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/autoplay_6421.png",
      "alt": "Screenshot of a .autoplay file in Indigo Rose AutoPlay Media Studio 9",
      "caption": "AUTOPLAY file open in Indigo Rose AutoPlay Media Studio 9"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/autoplay",
      "retrieved_at": "2025-11-02T02:43:26.591Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.591Z"
}