{
  "slug": "bea",
  "extension": "bea",
  "name": "Bezel Engine Archive",
  "summary": "Learn about .BEA files and view a list of programs that open them.",
  "developer": "Nintendo",
  "technical_info": {
    "content": [
      "The NintendoWare Bezel Engine is a game engine Nintendo developed and released to make Switch video game development easier for third-party developers. However, both official Nintendo games and third-party games use the Bezel Engine.",
      "Games that use the Bezel Engine store their game assets, such as 3D models, 2D images, and sounds, in BEA archives. For example, the Switch version of Super Mario Party contains 456 BEA archives, each of which includes a subset of the game's models, sound effects, and other assets. Each game's BEA archives are found in the game's Archive folder.",
      "Most gamers will never encounter a BEA file. However, those interested in examining Switch games' structure or modding the games may encounter BEA archives while browsing Bezel Engine games' data.",
      "NOTE: BEA files created for use in a Switch program always include the abbreviation nxonnx32 or nx in their filename, while BEA files created to test a Switch program in Windows always include either the nxonwin32 or nxonwin64 abbreviation."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can use the player-created Bezel Engine Archive Editor (Windows) to examine, extract files from, and insert file into BEA archives."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12311&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/bea_12311.png",
      "alt": "Screenshot of a .bea file in Bezel Engine Archive Editor",
      "caption": "BEA file open in Bezel Engine Archive Editor"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/bea",
      "retrieved_at": "2025-11-02T02:43:26.605Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.605Z"
}