{
  "slug": "bfe",
  "extension": "bfe",
  "name": "Bcrypt Encrypted File",
  "summary": "Learn about .BFE files and view a list of programs that open them.",
  "developer": "Johnny Shelley",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "Bcrypt is a cross-platform file encryption utility that is most popularly used by Linux users. After installing bcrypt, users can enter bcrypt [-orc] [-sn] and a filename in a terminal window to encrypt that file. As part of encrypting the file, users must enter a passphrase. Bcrypt then produces an encrypted copy of the file, saved with the .bfe extension. By default, bcrypt also deletes the original file, though users can disable this feature.",
      "BFE files are encrypted using a variation of the Blowfish cipher, which is a symmetric-key block cipher created in 1993. As such, the key used to encrypt a BFE file is also the key used to decrypt it. Each BFE file contains the key used to decrypt it, hashed to a 448-bit value."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Because BFE files are encrypted, you cannot open them as you would a normal file. To decrypt a BFE file, you must use bcrypt (cross-platform) and the passphrase used to encrypt the file. After you've decrypted the file, you should be able to open it normally."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12199&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/bfe",
      "retrieved_at": "2025-11-01T22:32:42.350Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.350Z"
}