{
  "slug": "biq",
  "extension": "biq",
  "name": "Civilization III: Conquests Scenario",
  "summary": "Learn about .BIQ files and view a list of programs that open them.",
  "developer": "Take-Two Interactive",
  "technical_info": {
    "content": [
      "Civilization, or Civ, is a series of turn-based strategy games in which players attempt to guide a civilization to worldwide dominance. Civilization III, the third game in the series, was released in 2001. Civ 3's second expansion, Conquests, was released in 2003.",
      "Conquests introduced a new feature, fittingly named Conquests, that allowed players to play short, multiplayer-focused scenarios. These scenarios, often referred to as conquests, were set in a specific place and period of history, such as the Rise of Rome, the Fall of Rome, or Japan's Sengoku period. Each conquest was saved as a BIQ file.",
      "Players could use Conquest's scenario editor to create their own BIQ files. The final version of Civ 3, known as Civilization III: Complete, also included the Conquests feature and the Conquest scenario editor."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a BIQ file with Civilization III (Windows, Mac) with the Conquests expansion installed. Note that the Complete edition of Civilization III includes the Conquest expansion.",
      "To load a BIQ file in Civ 3 Conquests or Complete edition, place the file in the game's Conquests/​Conquests directory. Then, open the game and select the conquest your BIQ file contains."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1150&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/biq",
      "retrieved_at": "2025-11-02T02:43:26.610Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.610Z"
}