{
  "slug": "bnl",
  "extension": "bnl",
  "name": "Talking Reading Pen Audio File",
  "summary": "Learn about .BNL files and view a list of programs that open them.",
  "developer": "N/A",
  "technical_info": {
    "content": [
      "Books that are designed to be read with a talking pen contain a number of audio hotspots. When a reader presses a talking pen onto a hotspot (often, the words on a page), the pen plays an associated audio track. That track is drawn from the book's BNL file, which is stored within the talking pen.",
      "Each BNL file includes the audio used with a specific talking book. Usually, readers must tap the cover of a book with their talking pen before they start reading, to confirm that their pen recognizes the book and contains the book's BNL file. If the pen contains the correct BNL file, it will say the book's title.",
      "BNL files used with children's books often contain \"extra\" audio tracks, associated with hotspots other than the words on the books' pages. For example, when reading a book featuring a cow, a child might be able to tap their talking pen on the cow's face to play a \"MOO!\" sound."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You cannot open or play a BNL file on a computer or mobile device. The only way to play a BNL file is to load it into a talking reading pen and \"read\" the book associated with the BNL file. Some talking pens include the Discover Talking Pen and JLB Educational Technology Pen Pal Whizz."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11584&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/bnl",
      "retrieved_at": "2025-11-02T02:43:26.615Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.615Z"
}