{
  "slug": "bsdesign",
  "extension": "bsdesign",
  "name": "Bootstrap Studio Website Design",
  "summary": "Learn about .BSDESIGN files and view a list of programs that open them.",
  "developer": "Zine",
  "technical_info": {
    "content": [
      "Bootstrap Studio is a cross-platform web design program that allows web developers to create, edit, and publish websites using a drag-and-drop interface. When a developer saves an in-progress website in Bootstrap Studio, the program saves the website and all its files (including the HTML, JavaScript, image, and other files used to create the website) in a BSDESIGN file.",
      "To actually publish a website created in Bootstrap Studio, developers must open the site's BSDESIGN file in Bootstrap Studio and select the Publish button found in the program's menu bar. Bootstrap Studio will then convert the BSDESIGN file into a static website that can be published on any web server.",
      "NOTE: If you want to create a copy of a BSDESIGN file, the best way to do so is by opening the file in Bootstrap Studio and saving a renamed copy of the file. Manually creating a copy of a BSDESIGN file can result in errors when you attempt to export or publish a website."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a BSDESIGN file in Bootstrap Studio (cross-platform). To do so, open Bootstrap Studio and select Open from the program's menu bar."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11829&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/bsdesign",
      "retrieved_at": "2025-11-02T02:43:26.622Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.622Z"
}