{
  "slug": "capobundle",
  "extension": "capobundle",
  "name": "Capo Project",
  "summary": "Learn about .CAPOBUNDLE files and view a list of programs that open them.",
  "developer": "SuperMegaUltraGroovy",
  "technical_info": {
    "content": [
      "Capo is an app that guitarists and other musicians use to learn how to play songs. The program allows musicians to import a song saved as an MP3 or other audio file and then either automatically or manually determine what chords or notes the song includes. Musicians can then play along with the song (slowing the song if needed), using the chords and notes they've marked down.",
      "The notation projects Capo users create are saved as CAPOBUNDLE files. Both the macOS and iOS versions of Capo save users' projects as CAPOBUNDLE files. MacOS users can save their CAPOBUNDLE files anywhere on their Mac, while iOS users must save their CAPOBUNDLE files to their iCloud Drive.",
      "The free version of Capo does not save changes users make to CAPOBUNDLE files. It also does not allow users to export the audio a CAPOBUNDLE file contains."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a CAPOBUNDLE file in Capo (Mac, iOS). To open a CAPOBUNDLE file in the macOS version of Capo, open Capo and select File → Open... from the program's menu bar. Then, navigate to and open your CAPOBUNDLE file.",
      "To open a CAPOBUNDLE file in the iOS version of Capo, place the file in the Capo folder in your iCloud Drive. Then, open Capo and select Browse → iCloud Drive → Capo. From there, select and open your CAPOBUNDLE file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12247&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/capobundle_12247.png",
      "alt": "Screenshot of a .capobundle file in Capo 4",
      "caption": "CAPOBUNDLE file open in Capo 4"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/capobundle",
      "retrieved_at": "2025-11-02T02:43:26.634Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.634Z"
}