{
  "slug": "cfb",
  "extension": "cfb",
  "name": "Compound Binary File",
  "summary": "Learn about .CFB files and view a list of programs that open them.",
  "developer": "Microsoft",
  "technical_info": {
    "content": [
      "Microsoft OLE applications, such as Office and Digital Image programs commonly use CFB files. OLE is a framework developed by Microsoft that enables applications to embed and link to documents and other objects. In other words, it enables a user to add data to a document from another application. An example is an image editor sending an image to a word processor.",
      "CFB files are saved in the Compound File Binary Format (CFB or CFBF), a general purpose file format used to store data for OLE applications. It stores data in a file structure similar to the FAT file system and is divided into header, FAT, DIFAT, MiniFAT, Directory, Stream, and Range Lock sectors.",
      "The structure of a CFB file provides efficient access to specific data within the file. For example, a single storage or stream object stored in the file may be accessed without needing to load the entire file. However, CFB files can grow large in size and may cause performance issues if there is not enough storage available.",
      "NOTE: A CFB file is also known as an Object Linking and Embedding (OLE) Compound File (CF) (OLECF)."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10514&b=1"
      },
      {
        "name": "Microsoft Visual Studio 2022",
        "url": "https://fileinfo.com/software/microsoft/visual_studio"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/cfb",
      "retrieved_at": "2025-11-02T02:43:26.643Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.643Z"
}