{
  "slug": "ck3",
  "extension": "ck3",
  "name": "Crusader Kings III Saved Game",
  "summary": "Learn about .CK3 files and view a list of programs that open them.",
  "developer": "Paradox Interactive",
  "technical_info": {
    "content": [
      "Crusader Kings III is a strategy game in which players control a dynasty during the Middle Ages. As the game progresses toward the year 1453, players must earn prestige and continue their dynasty for as long as possible.",
      "When Crusader Kings III saves a player's current game, it stores the saved game data in a CK3 file. If a player manually saves their progress, Crusader Kings III creates a Zip-compressed CK3 file. This archive contains a compressed plain text record of the player's game state. When Crusader Kings III autosaves a player's progress, the resulting CK3 file is saved as an uncompressed plain text file.",
      "Plain text CK3 files, and the plain text gamestate files that compressed CK3 files contain, are comprised of several sections of editable saved game data and metadata. To learn more about these sections and how to edit them, click here."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open and edit plain text CK3 files with Microsoft Notepad, Apple TextEdit, or any other text editor. If your CK3 file is Zip-compressed, you must decompress it (with Apple Archive Utility, 7-Zip, or another Zip-decompression tool) to access the gamestate file it contains. Then, you can open and edit the gamestate file with any text editor.",
      "(To use a gamestate file with Crusader Kings III, you must either repackage it within a compressed CK3 file or rename the gamestate file to use the .ck3 extension.)",
      "To use a CK3 file with Crusader Kings III, place it in the game's save games directory. This directory is usually located at:",
      "~/​Paradox Interactive/​Crusader Kings III/​save games",
      "Then, the next time you start Crusader Kings III, you'll be able to load the saved game your CK3 file contains."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Apple Archive Utility",
        "url": "https://fileinfo.com/software/apple/archive_utility"
      },
      {
        "name": "7-Zip",
        "url": "https://fileinfo.com/software/igor_pavlov/7-zip"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13504&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/ck3",
      "retrieved_at": "2025-11-02T02:43:26.649Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.649Z"
}