{
  "slug": "clkk",
  "extension": "clkk",
  "name": "Clicker Keyboard",
  "summary": "Learn about .CLKK files and view a list of programs that open them.",
  "developer": "Crick Software",
  "technical_info": {
    "content": [
      "Clicker is a child-focused word processor that allows students to write using words, phrases, pictures, and a normal, on-screen keyboard. Optionally, Clicker users (or more likely, teachers and parents) can customize the keyboard that appears in the app, to change where and how certain keys appear. For example, a user can customize a keyboard to group vowels together and show them in the same color, to help a child learn about vowels.",
      "Clicker keyboards are saved as CLKK files. The app includes several default CLKK files, which group letters together in different ways using different key colors. Users can open and edit any of these CLKK files with Clicker, to customize them further. (Before doing so, it's recommended you create a copy of the CLKK file you plan to edit.)"
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a CLKK file with Crick Software Clicker (Windows, Mac). To access Clicker's default Keyboards folder, where its default CLKK files are stored:",
      "Select the Options tab and click Manage.",
      "In the window that appears, select Files.",
      "Click the Keyboards file path to open the folder that contains Clicker's CLKK files.",
      "Double-click any CLKK file in this folder to open it with Clicker and begin editing it. To use a CLKK file with Clicker, place it in this folder. It will then appear for selection in Clicker."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1257&b=1"
      },
      {
        "name": "Crick Software Clicker",
        "url": "https://fileinfo.com/software/crick_software/clicker"
      }
    ]
  },
  "images": [
    {
      "url": "https://assets.file.org/images/fileorg-logo-440x90-4-8b.png",
      "alt": "File.org logo"
    },
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "file.org",
      "url": "https://file.org",
      "retrieved_at": "2025-11-02T02:43:26.371Z"
    },
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/clkk",
      "retrieved_at": "2025-11-02T02:43:26.371Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.371Z"
}