{
  "slug": "codercrypt",
  "extension": "codercrypt",
  "name": "CoderWare Encrypted File",
  "summary": "Learn about .CODERCRYPT files and view a list of programs that open them.",
  "developer": "N/A",
  "technical_info": {
    "content": [
      "In December 2020, cybercriminals uploaded fake beta version of the Cyberpunk 2077 game for Android and distributed it from the \"cyberpunk2077mobiledotcom\" website. The criminals listed the app as Cyberpunk 2077 Mobile (BETA) and designed the website to appear similar to the Google Play store.",
      "The site was not affiliated with Google or the actual developers of Cyberpunk 2077, but many unsuspecting users did not notice and downloaded the app to their Android devices. Once they granted the fake app permission to access their files and completed the installation, the ransomware stored within the app ran, encrypting their files and appending them with the .coderCrypt extension.",
      "When CoderWare ransomware, also known as Cyberpunk 2077 mobile ransomware, runs, it infects your Android device and encrypts your files with the RC4 encryption algorithm. After encrypting the files, the ransomware appends the .coderCrypt extension to their filenames. For example, an example.png file becomes example.png.coderCrypt.",
      "After encrypting your files, the ransomware displays a README.txt message detailing the hostile takeover and includes instructions for how you can access your files via payment. FileInfo recommends you never pay a ransom to decrypt your files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You may be able to decrypt and open files encrypted by the Android version of CoderWare ransomware. The files are encrypted with the RC4 symmetric encryption algorithm, which means you can use the same key to decrypt your files as the key used to encrypt your files.",
      "You can find the key embedded into the source code of the fake mobile app that distributed the malware. Once you retrieve the key, you can use an RC4 decryption tool to decrypt your files. You can also contact an antivirus company, like Kaspersky or Malwarebytes for support.",
      "NOTE: Back up your encrypted files if any data corruption occurs during the decryption process."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12536&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/codercrypt",
      "retrieved_at": "2025-11-02T02:43:26.656Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.656Z"
}