{
  "slug": "crypt10",
  "extension": "crypt10",
  "name": "WhatsApp Encrypted Database File",
  "summary": "Learn about .CRYPT10 files and view a list of programs that open them.",
  "developer": "WhatsApp",
  "category": "database",
  "category_slug": "database",
  "containers": [],
  "related": [
    "cad",
    "afs",
    "art",
    "asc",
    "asm",
    "axm",
    "bdc",
    "catpart",
    "cf2",
    "cir",
    "cpa",
    "dc3",
    "dgn",
    "dst",
    "dwf",
    "dwfx",
    "dwg",
    "dwt",
    "dxb",
    "dxf"
  ],
  "technical_info": {
    "content": [
      "WhatsApp is a common messaging app used worldwide on various devices, including computer and mobile devices running Android and iOS. Among its features, the app provides database encryption to secure your messages.",
      "Throughout its different versions, WhatsApp has encrypted databases with different algorithms. The Android version of WhatsApp encrypted databases (.DB files) and appends a .crypt file extension to the DB file, creating a .db.crypt file.",
      "Additionally, a number follows the extension to signify the version of the algorithm. Besides .crypt10, other extensions include .CRYPT7, .CRYPT8, and .CRYPT12 files.",
      "You can find CRYPT10 database files on the SD card of Android devices with WhatsApp Messenger installed. For example, you can find the CRYPT10 file (or other WhatsApp encrypted database file) in the following location:",
      "/​sdcard/​WhatsApp/​Databases",
      "Additionally, you may find multiple CRYPT10 database files in the \"Databases\" folder, with YYYY-MM-DD dates included in their filenames. WhatsApp adds these dates to signify when the app created the backup files.",
      "You can delete these dated backup files to free up space on your SD card without affecting your WhatsApp messages. However, you should always keep the most recently dated one or two CRYPT10 files if you need to restore your WhatsApp message history."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Without Decryption: You can’t open it directly.With Decryption: Convert it to a readable SQLite .db file.",
      "You can use a CRYPT10 file to migrate or restore your WhatsApp message history on an Android device. To do so, you must rename your most recent CRYPT10 file to msgstore.db.crypt10 before reinstalling WhatsApp, then manually restore your message history when prompted.",
      "Additionally, if you want to decrypt a CRYPT10 database and view the message history it contains, you must first locate your WhatsApp key file, which stores your CRYPT10 file's encryption key. Your key file is stored in the following location:",
      "/​data/​data/​com.whatsapp/​files/​key"
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11729&b=1"
      },
      {
        "name": "WhatsApp Messenger",
        "url": "https://fileinfo.com/software/whatsapp_inc/whatsapp_messenger"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileformat.com",
      "url": "https://docs.fileformat.com/database/crypt10/index.html",
      "retrieved_at": "2025-11-01T22:32:42.259Z"
    },
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/crypt10",
      "retrieved_at": "2025-11-01T22:32:42.259Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.259Z"
}