{
  "slug": "ctbl",
  "extension": "ctbl",
  "name": "CTB-Locker Ransomware Encrypted File",
  "summary": "Learn about .CTBL files and view a list of programs that open them.",
  "developer": "N/A",
  "technical_info": {
    "content": [
      "CTB-Locker ransomware is a type of malware similar to the Cryptolocker and Cryptowall (.AAA) virus utilized by cybercriminals. It first surfaced in July 2014, and is a ransomware-as-a-service (RaaS) offering, which cybercriminals can purchase to deploy attacks. It may attack all types of users but primarily targets the web servers of organizations based in the USA, Italy, Germany, and the Netherlands.",
      "The ransomware is typically distributed via malicious email attachments in the form of Word .DOCX, .DOC, and .DOCM files, or another type of executable file. When you download and open a file attachment the CTB-Locker virus runs on your computer. To prevent attacks like these, never open email messages from unverified senders.",
      "Once introduced to your computer, the ransomware takes your files hostage by encrypting them and adding the .ctbl extension onto the names of your files. Any type of file may be encrypted, such as spreadsheets, videos, pictures, and documents. For example, a spreadsheet.xlsx file becomes spreadsheet.xlsx.ctbl or spreadsheet.xlsx.CTBL.",
      "The virus then generates a DecryptAllFiles.txt file in every folder that stores an infected file, an AllFilesAreLocked.bmp image, an .HTML file. These files are ransom notes that provide information explaining the hostile takeover of your files and how you can recover your files by paying a ransom, typically in Bitcoin."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Unfortunately, you cannot open CTBL files without a CTB-Locker decryptor tool. Currently, there is no decryptor available to effectively restore infected files.",
      "If you have a recent backup of your files, you can perform a System Restore to remove the virus, but any changes made to files after the backup was created will be lost."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11995&b=1"
      },
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/ctbl_13015.png",
      "alt": "Screenshot of a .ctbl file in Microsoft Visual Studio Code",
      "caption": "CTBL file open in Microsoft Visual Studio Code"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/ctbl_13015-2.png",
      "alt": "CTBL file open in Slicer",
      "caption": "CTBL file open in Slicer"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/ctbl",
      "retrieved_at": "2025-11-02T02:43:26.666Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.666Z"
}