{
  "slug": "ddscan",
  "extension": "ddscan",
  "name": "Disk Drill for Mac Recovery Session",
  "summary": "Learn about .DDSCAN files and view a list of programs that open them.",
  "developer": "CleverFiles",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "Disk Drill is a data recovery app that allows users to recover lost files from hard drives, flash drives, and SSD drives. To find lost files, Disk Drill scans a user's selected drives. It then shows the scan results and allows the user to restore any found files.",
      "Every time a user performs a scan, Disk Drill saves that scan's results in a DDSCAN file. Users can also manually create DDSCAN files in the middle of a scan, by pausing the scan and selecting File → Save session as.... Users can load a DDSCAN file to review the associated scan's results or continue a paused scan.",
      "NOTE: Disk Drill for Windows saves recovery sessions as .DDWSCAN files. The Mac version of Disk Drill cannot load recovery sessions created by the Windows version."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a DDSCAN file with the macOS version of CleverFiles Disk Drill. To do so, select File → Open recovery session from the app's menu bar. Then, navigate to and open your DDSCAN file.",
      "To resume a paused scan after loading a DDSCAN file, select the Continue button. Disk Drill will then resume the scan associated with your DDSCAN file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12814&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/ddscan",
      "retrieved_at": "2025-11-01T22:32:42.413Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.413Z"
}