{
  "slug": "diagcab",
  "extension": "diagcab",
  "name": "Troubleshooting Pack Cabinet File",
  "summary": "Learn about .DIAGCAB files and view a list of programs that open them.",
  "developer": "Microsoft",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "WTP includes a wizard that guides you through a series of steps that help you locate and fix problems on your computer. When the diagnosis is complete, you have the option to send diagnostic information over the Internet to a trusted source so that they can help to diagnose and repair your computer.",
      "WTP is used by original equipment manufacturers (OEMs) and independent software vendors (ISVs) to troubleshoot problems experienced by customers. They are also used by system administrators. DIAGCAB files are sometimes posted on websites and downloaded by users. If distributed this way, the creators of the files usually digitally sign them to verify that they are from a trusted source.",
      "DIAGCAB files can be created with the Makecab.exe and Cabarc.exe tools. They can be digitally signed using Signtool.exe. They are run using the Microsoft Support Diagnostic Tool (msdt.exe). To run the DIAGCAB file with MSDT, search “msdt” from the Start menu and select the program from the list of results. Next, enter the passkey (often provided by a Microsoft support professional), then follow the prompts on the screen in order to run the DIAGCAB file.",
      "NOTE: DIAGCAB files were first used in Windows Vista, so if you are running an earlier Windows version, such as Windows XP, Windows will not recognize the file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=5797&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/diagcab",
      "retrieved_at": "2025-11-01T22:32:42.418Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.418Z"
}