{
  "slug": "dmx",
  "extension": "dmx",
  "name": "Source Filmmaker Project",
  "summary": "Learn about .DMX files and view a list of programs that open them.",
  "developer": "Valve",
  "technical_info": {
    "content": [
      "SFM is a free program that Team Fortress 2 enthusiasts can use to create animated movies and still images starring the game's characters. To do so, users first import a Team Fortress 2 map, which serves as the setting for their movie. The user can then import and animate Team Fortress 2 characters and items, add sounds to their movie, and add visual effects to their movie.",
      "When a user saves an in-progress SFM movie project, the project is saved as a DMX file. DMX files are comprised of a sequence of shots, which are themselves comprised of the elements mentioned above. Each DMX file's shot sequence appears as an editable timeline in SFM.",
      "After a user finishes creating their SFM movie, they can export the movie as an .AVI video, or they can export one or more scenes from the movie as .TGA still images (DMX files are also referred to as sessions in SFM's documentation; DMX files and SFM session are the same thing).",
      "NOTE: Valve also uses the .dmx file extension to save other content, such as game characters and items, animations, sounds, and visual effects."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an SFM file in Source Filmmaker (Windows). To do so, select File → Open... from the program's menu bar. Then, navigate to and open your SFM file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=7958&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/dmx",
      "retrieved_at": "2025-11-02T02:43:26.696Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.696Z"
}