{
  "slug": "dpd",
  "extension": "dpd",
  "name": "Ovation Pro Document",
  "summary": "Learn about .DPD files and view a list of programs that open them.",
  "developer": "David Pilling Software",
  "technical_info": {
    "content": [
      "Ovation Pro was a desktop publishing program developed by David Piling Software. The initial version of Ovation Pro, available for RISC OS, was released in 1996. The Windows version was released in 2005. The program is now discontinued, and the Windows version is available online as a free download.",
      "Primarily, Ovation Pro was used to create formatted documents that a user intended to print and share with or send to others. For example, a user might have used Ovation Pro to create and print an advertisement, leaflet, or letter. The text these documents contained could be formatted to use different fonts, sizes, styles, colors, and other formatting. Documents could also contain imported pictures, which users could crop, rotate, and resize in Ovation Pro if needed.",
      "The Windows version of Ovation Pro saved the documents that users created as DPD files. Windows users could also open documents created by the RISC OS version of Ovation Pro in the Windows version, since documents created by both versions of Ovation Pro use the same file format."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a DPD file with Ovation Pro (Windows). After opening Ovation Pro, select File → Open... to navigate to and open your DPD file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=2137&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/dpd_2137.png",
      "alt": "Screenshot of a .dpd file in Ovation Pro",
      "caption": "DPD file open in Ovation Pro"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/dpd",
      "retrieved_at": "2025-11-02T02:43:26.698Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.698Z"
}