{
  "slug": "eot",
  "extension": "eot",
  "name": "Embedded OpenType Font",
  "summary": "Learn about .EOT files and view a list of programs that open them.",
  "developer": "Microsoft",
  "category": "font",
  "category_slug": "font",
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ],
  "technical_info": {
    "content": [
      "The EMBEDDEDFONT structure has underwent three revisions, with addition of additional data at the end of the structure with each revision. The last revision of the EMBEDDEDFONT structure is as depicted below.\n\nData TypeEntry NameDescriptionunsigned longEOTSizeTotal structure length in bytes (including string and font data)unsigned longFontDataSizeLength of the OpenType font (FontData) in bytesunsigned longVersionVersion number of this format - 0x00020002unsigned longFlagsProcessing Flagsbyte[10]FontPANOSEThe PANOSE value for this font - See https://learn.microsoft.com/en-us/typography/opentype/spec/os2#panbyteCharsetIn Windows this is derived from TEXTMETRIC.tmCharSet. This value specifies the character set of the font. DEFAULT_CHARSET (0x01) indicates no preference. - See https://learn.microsoft.com/en-us/windows/win32/api/wingdi/ns-wingdi-textmetricabyteItalicIf the bit for ITALIC is set in OS/2.fsSelection, the value will be 0x01 - See https://learn.microsoft.com/en-us/typography/opentype/spec/os2#fssunsigned longWeightThe weight value for this font - See https://learn.microsoft.com/en-us/typography/opentype/spec/os2#wtcunsigned shortfsTypeType flags that provide information about embedding permissions - See https://learn.microsoft.com/en-us/typography/opentype/spec/os2#fstunsigned shortMagicNumberMagic number for EOT file - 0x504C. Used to check for data corruption.unsigned longUnicodeRange1os/2.UnicodeRange1 (bits 0-31) - See https://learn.microsoft.com/en-us/typography/opentype/spec/os2#urunsigned longUnicodeRange2os/2.UnicodeRange2 (bits 32-63) - See https://learn.microsoft.com/en-us/typography/opentype/spec/os2#urunsigned longUnicodeRange3os/2.UnicodeRange3 (bits 64-95) - See https://learn.microsoft.com/en-us/typography/opentype/spec/os2#urunsigned longUnicodeRange4os/2.UnicodeRange4 (bits 96-127) - See https://learn.microsoft.com/en-us/typography/opentype/spec/os2#urunsigned longCodePageRange1CodePageRange1 (bits 0-31) - See https://learn.microsoft.com/en-us/typography/opentype/spec/os2#cprunsigned longCodePageRange2CodePageRange2 (bits 32-63) - See https://learn.microsoft.com/en-us/typography/opentype/spec/os2#cprunsigned longCheckSumAdjustmenthead.CheckSumAdjustment - See https://learn.microsoft.com/en-us/typography/opentype/spec/headunsigned longReserved1Reserved - must be 0unsigned longReserved2Reserved - must be 0unsigned longReserved3Reserved - must be 0unsigned longReserved4Reserved - must be 0unsigned shortPadding1Padding to maintain long alignment. Padding value must always be set to 0x0000.unsigned shortFamilyNameSizeNumber of bytes used by the FamilyName arraybyteFamilyName[FamilyNameSize]Array of UTF-16 characters the length of FamilyNameSize bytes. This is the English language Font Family string found in the name table of the font (name ID = 1) - See https://learn.microsoft.com/en-us/typography/opentype/spec/nameunsigned shortPadding2Padding value must always be set to 0x0000.unsigned shortStyleNameSizeNumber of bytes used by the StyleNamebyteStyleName[StyleNameSize]Array of UTF-16 characters the length of StyleNameSize bytes. This is the English language Font Subfamily string found in the name table of the font (name ID = 2) - See https://learn.microsoft.com/en-us/typography/opentype/spec/nameunsigned shortPadding3Padding value must always be set to 0x0000.unsigned shortVersionNameSizeNumber of bytes used by the VersionNamebytesVersionName[VersionNameSize]Array of UTF-16 characters the length of VersionNameSize bytes. This is the English language version string found in the name table of the font (name ID = 5) - See https://learn.microsoft.com/en-us/typography/opentype/spec/nameunsigned shortPadding4Padding value must always be set to 0x0000.unsigned shortFullNameSizeNumber of bytes used by the FullNamebyteFullName[FullNameSize]Array of UTF-16 characters the length of FullNameSize bytes. This is the English language full name string found in the name table of the font (name ID = 4) - See https://learn.microsoft.com/en-us/typography/opentype/spec/nameunsigned shortPadding5Padding value must always be set to 0x0000.unsigned shortRootStringSizeNumber of bytes used by the RootString arraybyteRootString[RootStringSize]Array of UTF-16 characters the length of RootStringSize bytes.unsigned longRootStringCheckSumRootString CheckSum value. See algorithm to process RootStringChecksum below.unsigned longEUDCCodePageCodepage value needed for EUDC font support.unsigned shortPadding6Padding value must always be set to 0x0000.unsigned shortSignatureSizeNumber of bytes used by the Signature array. Currently reserved and should be set to 0x0000.byteSignature[SignatureSize]Currently reserved. If the SignatureSize is 0x0000 there is no length to this array.unsigned longEUDCFlagsProcessing flags for the EUDC font. Typical values might be TTEMBED_XORENCRYPTDATA and TTEMBED_TTCOMPRESSED.unsigned longEUDCFontSizeNumber of bytes used by the Signature array.byteEUDCFontData[EUDCFontSize]Number of bytes used for the EUDC font data. If the EUDCFontSize is 0x00000000 there is no length to this array.byteFontData[FontDataSize]The font data for this EOT file. The data may be compressed or XOR encrypted as indicated by the processing flags.",
      "Microsoft created the EOT file format to allow web developers to embed OpenType fonts in webpages, so text would always appear in the correct font online. Developers could use WEFT to transform an existing OpenType font file into an EOT file, which they would then link with one or more webpages. EOT files were compressed, making them faster to load over the web, and included some copyright-protection features, such as subsetting (including only a webpage's needed characters) and encryption.",
      "Internet Explorer is the only browser that ever supported EOT files. EOT files have largely been replaced by .WOFF files, which are web-optimized font files. Microsoft stopped offering WEFT for download in 2019.",
      "NOTE: You can also create EOT files from .TTF files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "EOT files are not meant to be opened. However, you can use eotinfo (cross-platform) to view information about an EOT file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "ExamView",
        "url": "https://file.org/free-download/examview"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1013&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://assets.file.org/images/fileorg-logo-440x90-4-8b.png",
      "alt": "File.org logo"
    },
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "file.org",
      "url": "https://file.org",
      "retrieved_at": "2025-11-02T02:43:26.383Z"
    },
    {
      "source": "fileformat.com",
      "url": "https://docs.fileformat.com/font/eot/",
      "retrieved_at": "2025-11-02T02:43:26.383Z"
    },
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/eot",
      "retrieved_at": "2025-11-02T02:43:26.383Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.383Z"
}