{
  "slug": "epk",
  "extension": "epk",
  "name": "Eaglercraft Package",
  "summary": "Learn about .EPK files and view a list of programs that open them.",
  "developer": "LAX1DUDE",
  "technical_info": {
    "content": [
      "Eaglercraft is a browser-based video game that is based on Minecraft Java Edition. Different versions of Eaglercraft seek to emulate different versions of Minecraft. Players can play Eaglercraft either locally or online, in single-player or multiplayer modes.",
      "All versions of Eaglercraft include a file named assets.epk. This file contains a compiled version of Eaglercraft's game resources. If players want to add custom resources to their instance of Eaglercraft, they can do so by placing the resources in the following directory, and then running epkcompiler/run.bat to include those resources in a new assets.epk file:",
      "eaglercraft-beta-main/​lwjgl-rundir/​resources",
      "Additionally, in Eaglercraft's single-player mode, players can export backups of their worlds as EPK files. This allows players to load worlds again when playing at a different time or share worlds with other players. To back up a world as an EPK file, players select the world on the Select World menu and then click Backup."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can decompile assets.epk and other asset-containing EPK files using ayunWebEPK (Web), to view the assets they contain.",
      "To load an EPK file that contains an Eaglercraft world backup:",
      "Open the single-player version of Eaglercraft.",
      "Select Create New World.",
      "Select Load World Backup.",
      "Navigate to and select your EPK file.",
      "Name your world and select Continue.",
      "The world your EPK file contains will appear in the Select World menu."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12845&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/epk",
      "retrieved_at": "2025-11-02T02:43:26.722Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.722Z"
}