{
  "slug": "esp",
  "extension": "esp",
  "name": "Elder Scrolls or Fallout 4 Plug-in",
  "summary": "Learn about .ESP files and view a list of programs that open them.",
  "developer": "Bethesda Softworks",
  "technical_info": {
    "content": [
      "Bethesda encourages Oblivion, Skyrim, and Fallout 4 players to mod the games if they so desire. To that end, the games each feature the ability to load additional content stored in ESP files. Players can also modify the games using the following file types:",
      "Elder Scrolls Master File (.esm file) - The games' primary data files. ESP files can modify, add to, or reference these files. Players also sometimes modify ESM files directly.",
      "Elder Scrolls Light Master File (.esl file) - These game data files use an optimized, \"lighter\" version of the ESM format, which was introduced with the Fallout 4 patch 1.10 in August 2017.",
      "As the games load, they first load the data contained in their ESM master files. Then, they apply any game modification data you've added in the form of ESP files. This allows the ESP files to override the games' default data and behavior."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can use ESP files to modify various Bethesda Softworks games, including Fallout 4, The Elder Scrolls V: Skyrim, Elder Scrolls V: Skyrim Special Edition (SE), and The Elder Scrolls IV: Oblivion.",
      "You can also view ESP files contents with Bethesda Softworks Creation Kit (Windows) and The Elder Scrolls Construction Set (Windows)."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=7676&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/esp",
      "retrieved_at": "2025-11-02T02:43:26.725Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.725Z"
}