{
  "slug": "express",
  "extension": "express",
  "name": "BlackBerry Express Presentation",
  "summary": "Learn about .EXPRESS files and view a list of programs that open them.",
  "developer": "Research In Motion",
  "technical_info": {
    "content": [
      "BlackBerry Express is a presentation app included on BlackBerry devices released after 2013. It allows users to create, show, and share presentations on their BlackBerry devices, in much the same way Microsoft PowerPoint allows PC users to create, show, and share presentations.",
      "Presentations created by BlackBerry Express are saved as EXPRESS files. No other program can open EXPRESS files. Therefore, since BlackBerry Express is discontinued, you may have trouble opening your EXPRESS file and viewing the presentation it contains."
    ]
  },
  "how_to_open": {
    "instructions": [
      "If you still have access to BlackBerry Express, you can use it to open your EXPRESS file. If you do not have access to BlackBerry Express, and you want to see the data your EXPRESS file contains, you can rename it to use the .tar extension and extract its contents as you would any TAR archive. Each EXPRESS file contains:",
      "A .JSON file that describes the presentation's content",
      "A copy of any images imported into the presentation"
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13085&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/express",
      "retrieved_at": "2025-11-02T02:43:26.730Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.730Z"
}