{
  "slug": "fcm",
  "extension": "fcm",
  "name": "CanvasWorkspace Fabric Cutting Design",
  "summary": "Learn about .FCM files and view a list of programs that open them.",
  "developer": "Brother",
  "technical_info": {
    "content": [
      "Brother CanvasWorkspace is a free program that allows sewing and embroidery enthusiasts to design patterns for use with Brother cutting machines, such as the DC200, CM650W, SDX225, and many others. CanvasWorkspace saves these patterns as .CWPRJ and FCM files. CWPRJ files are editable project files that a user can use to edit an existing pattern. FCM files are typically finished patterns, which are meant to be transferred to a cutting machine.",
      "While CWPRJ files can contain multiple colors and other complex design elements, FCM files contain only simple, black-and-white shapes. That's because the files are intended for use with a cutting machine, which uses only each shape's outline. However, you can open an FCM file in Brother CanvasWorkspace, to view the shapes it contains and transfer it to a cutting machine.",
      "You can convert existing .SVG files into FCM files, for use with a Brother cutting machine. To do so:",
      "Open CanvasWorkspace and select File → Import from Your Computer ....",
      "Navigate to and open your SVG file.",
      "Your SVG file will then open in CanvasWorkspace. Edit your file as needed, and then select File → Export/Transfer FCM file... to export the file as an FCM file."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an FCM file in Brother CanvasWorkspace (cross-platform). To do so, select File → Import from Your Computer... from the program's menu bar. Then, navigate to your FCM file and select Open.",
      "NOTE: If your FCM file is stored on your cutting machine, and your cutting machine is connected to your PC, instead select File → Import from Your Computer....",
      "To transfer an FCM file to your Brother cutting machine:",
      "Connect a USB flash drive to your PC.",
      "Open your FCM file in Brother CanvasWorkspace.",
      "Select File → Export/Transfer FCM file....",
      "Select Export FCM File.",
      "Save the FCM file to your USB flash drive.",
      "Disconnect your USB flash drive from your PC. Then, connect it to your Brother cutting machine.",
      "You can now load your FCM file on your Brother cutting machine."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12372&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/fcm_12372.png",
      "alt": "Screenshot of a .fcm file in Brother CanvasWorkspace 2",
      "caption": "FCM file open in Brother CanvasWorkspace 2"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/fcm",
      "retrieved_at": "2025-11-02T02:43:26.737Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.737Z"
}