{
  "slug": "fmw",
  "extension": "fmw",
  "name": "FME Workbench Workspace File",
  "summary": "Learn about .FMW files and view a list of programs that open them.",
  "developer": "Safe Software",
  "technical_info": {
    "content": [
      "FME Workbench is part of the FME Desktop suite, which Safe Software released in 1996. The primary users are professionals in geographic information systems (GIS), urban planning, environmental management, and data integration fields. The software can input data from various sources, including relational databases, text files, and specialized formats, making it popular among GIS analysts, data engineers, and software developers who deal with spatial data or need to integrate data from diverse sources.",
      "FMW files store all the configurations needed for spatial data processing and integration tasks, which users can modify within the FME Workbench interface. For example, users can specify datasets or database connections from which data will be extracted, set spatial data transformation rules, and specify output settings about where and how to save the processed data. By default, FMW files are saved in the user's My Documents/​My FME Workspaces location.",
      "NOTE: Because FME Workbench can extract, transform, and load (ETL) data from various formats, users often refer to it as a spatial ETL tool."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open FMW files with the FME Workbench toll included with the FME Desktop suite in Windows. To open an FMW file with FME Workbench, select File → Open Workspace."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=5590&b=1"
      },
      {
        "name": "Safe Software FME Desktop",
        "url": "https://fileinfo.com/software/safe_software/fme_desktop"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/fmw",
      "retrieved_at": "2025-11-02T02:43:26.748Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.748Z"
}