{
  "slug": "ga",
  "extension": "ga",
  "name": "Genetic Art Image Parameters",
  "summary": "Learn about .GA files and view a list of programs that open them.",
  "developer": "Softology",
  "technical_info": {
    "content": [
      "Fractals are complex geometric patterns that are self-similar across different scales. They are created by repeating a simple process forever in an ongoing loop. Visions of Chaos is a free fractal art generator that allows users to create and share fractal-based art.",
      "Visions of Chaos includes many unique fractal generation tools, referred to as modes. One of Visions of Chaos's modes is named Genetics, a sub-mode of which is Genetic Art. The Genetic Art tool uses GA files as the parameters from which it generates fractals. GA files are simple text-based files that include a reference to a genetic art rule, image options, and gene character offsets.",
      "Users can create their own copies of Visions of Chaos's GA files by clicking the Save button that appears in the Genetic Art 1 Settings window. By default, Visions of Chaos saves these files to the Documents/​Visions of Chaos/​Data directory.",
      "NOTE: Additional genetic art image parameters are saved with the .ga2 and .ga3 extensions. GA2 and GA3 files are used with Visions of Chaos's Genetic Art 2 and Genetic Art 3 modes, respectively."
    ]
  },
  "how_to_open": {
    "instructions": [
      "If you want to edit the text a GA file contains, you can do so by opening it in any text editor, such as Microsoft Notepad (Windows) or GitHub Atom (cross-platform). If you want to use a GA file with Visions of Chaos (Windows), you can do so by placing the file in your Documents/​Visions of Chaos/​Data directory. You'll then be able to select the file in the Genetic Art 1 Settings window (Mode → Genetic Art → Genetic Art 1), after selecting My Files from the window's dropdown menu."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "GitHub Atom",
        "url": "https://fileinfo.com/software/github/atom"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12151&b=1"
      },
      {
        "name": "GNU Emacs",
        "url": "https://fileinfo.com/software/gnu/emacs"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Vim",
        "url": "https://fileinfo.com/software/vim/vim"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/ga_12151.png",
      "alt": "Screenshot of a .ga file in Softology Visions of Chaos",
      "caption": "GA file open in Softology Visions of Chaos"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/ga",
      "retrieved_at": "2025-11-02T02:43:26.762Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.762Z"
}