{
  "slug": "gb4",
  "extension": "gb4",
  "name": "Geekbench 4 Pro Results",
  "summary": "Learn about .GB4 files and view a list of programs that open them.",
  "developer": "Primate Labs",
  "technical_info": {
    "content": [
      "Geekbench 4 Pro is a program that allows PC users to perform benchmarking tests. These tests tell the user how well their computer's CPU and GPU are performing. After a user runs a test, Geekbench 4 Pro outputs the results as a series of scores, with higher scores being better.",
      "Users can manually save their Geekbench 4 Pro results as GB4 files by:",
      "In the GUI version of Geekbench 4 Pro, selecting File → Save as....",
      "In the command-line version of Geekbench 4 Pro, using the geekbench4 --save command.",
      "This allows the user to load and review the results in Geekbench 4 Pro at a later date.",
      "Users can also choose to export their results as .CSV, .HTML, .JSON, and .TXT files, by selecting File → Export As... or using the --export command."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a GB4 file in the paid version of Geekbench 4 Pro (cross-platform). (You cannot open a GB4 file in any other version of Geekbench Pro.) To do so, open the GUI version of Geekbench 4 Pro and select File → Open.... Then, navigate to and select your GB4 file. The results your GB4 file contains will appear in Geekbench 4 Pro.",
      "If you do not have access to Geekbench 4 Pro, you can also open your GB4 file in any text editor, such as Microsoft Notepad (Windows) or Apple TextEdit (Mac). This will allow you to view the plain text used to show your test results in Geekbench 4 Pro."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12235&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/gb4",
      "retrieved_at": "2025-11-02T02:43:26.764Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.764Z"
}