{
  "slug": "gdz",
  "extension": "gdz",
  "name": "GEDZip Genealogy Data File",
  "summary": "Learn about .GDZ files and view a list of programs that open them.",
  "developer": "FamilySearch",
  "technical_info": {
    "content": [
      "In the 1980s, The Church of Jesus Christ of Latter-day Saints (The Church) released the first version of the GEDCOM format, which is a universal format genealogists use to exchange data across genealogy programs. Over the next three decades, The Church and various genealogy-minded developers collaborated to improve upon the GEDCOM format. In 2021, FamilySearch, the family history arm of The Church, released version 7.0 of GEDCOM, which included the specification for building a GEDZip utility.",
      "When implemented in genealogy software, GEDZip's primary function is to allow users to bundle historical pictures and other files with their existing FamilySearch GEDCOM / GED genealogy data files. To do this, software that includes GEDZip zips the GEDCOM / GED file and media files together into a GDZ file. The GDZ file is a Zip archive that can be decompressed and, in the future, read by a variety of genealogy applications, allowing professional and amateur genealogists to import, review, and save their genealogical data and historical documents using one file."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Because GDZ files are Zip-compressed, you can decompress them with any Zip decompression tool, such as Corel WinZip (Windows), Apple Archive Utility (Mac), and B1 Free Archiver (cross-platform). (You may need to rename the file's extension to .zip to decompress it.) Then, you can access the FamilySearch GEDCOM / GED file and media files your GDZ file contains.",
      "In the future, genealogy applications, such as RootsMagic (Windows, Mac), Ancestral Author (Windows, Mac), MyHeritage Family Tree Builder (Windows, Mac), and GeneWeb (cross-platform), and online genealogy databases, such as Ancestry.com and FamilySearch.org, will likely support importing GDZ files. For now, you should manually decompress your GDZ file as described above. Then, you will be able to use your genealogy application to import the files your GDZ file contains."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Corel WinZip",
        "url": "https://fileinfo.com/software/corel/winzip"
      },
      {
        "name": "Apple Archive Utility",
        "url": "https://fileinfo.com/software/apple/archive_utility"
      },
      {
        "name": "B1 Free Archiver",
        "url": "https://fileinfo.com/software/catalina_group/b1_free_archiver"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11944&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/gdz",
      "retrieved_at": "2025-11-02T02:43:26.769Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.769Z"
}