{
  "slug": "gob",
  "extension": "gob",
  "name": "Jedi Engine Package",
  "summary": "Learn about .GOB files and view a list of programs that open them.",
  "developer": "LucasArts",
  "technical_info": {
    "content": [
      "The Jedi Engine is a 3D game engine LucasArts developed in the early 1990s, primarily for use in Star Wars: Dark Forces (1995), a first-person shooter set in the Star Wars universe. LucasArts later reused and adapted the Jedi Engine for other titles, most notably Outlaws (1997), a western-themed shooter.",
      "The game engine uses various proprietary file formats, including GOB, for storing bundled game assets. Now, the game engine is no longer used in modern game development, but it has become a target for modding communities interested in editing levels, textures, and audio in the Star Wars: Dark Forces and Outlaws games.",
      "NOTE: GOB files are similar in function to the .PAK and .WAD game archive formats."
    ]
  },
  "how_to_open": {
    "instructions": [
      "GOB files are not meant to be opened. Instead, the game built with Jedi Engine references the files to load the assets they contain.",
      "While players typically don’t interact with GOB files, game modders and developers may use special tools to extract or modify them, creating custom content or troubleshooting game assets. For example, they may use SLADE to preview and edit the contents of a GOB file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13809&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/gob",
      "retrieved_at": "2025-11-02T02:43:26.776Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.776Z"
}