{
  "slug": "gtxml",
  "extension": "gtxml",
  "name": "GT Designer Zip File",
  "summary": "Learn about .GTXML files and view a list of programs that open them.",
  "developer": "StudioCoast",
  "technical_info": {
    "content": [
      "GT Designer Advanced is a utility bundled with StudioCoast vMix. You can create titles and lower-third graphics with GT Designer Advanced, then import them into vMix to be displayed during a production, such as a streamed demonstration, sporting event, newscast, or sermon.",
      "To create a GTXML file with GT Designer, select File → Save As and choose \"GT XML\" from the format dropdown menu. After saving the title, GT Designer creates a GTXML file to store the title or lower-third graphic information. The GTXML file is a working file, which means you can close the file, re-open it, then continue modifying the title or lower-third graphic.",
      "You can also save a title or lower-third graphic created by GT Designer as a .GTZIP file, which stores its information in a Zip-compressed package. GTZIP files store all of the information that makes up the title or graphic, which includes imported images. GTXML files only store references to images imported in the title or graphic, which means they are typically smaller in size than GTZIP files. However, if you need to share your title or graphic with other GT Designer users you should save it as a GTZIP file since all of the assets included are saved in the file."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open GTXML files with StudioCoast GT Designer (included with the vMix download) in Windows. You can also edit the file with GT Designer. To open a GTXML file with GT Designer, select File → Open.",
      "You can also open a GTXML file with StudioCoast vMix in Windows. To open a GTXML file with vMix, select Add Input → Title, click Browse, then choose the GTXML file you would like to open.",
      "NOTE: Since GTXML files are saved in plain text you can open them with a text editor, such as Microsoft Notepad (Windows) or Apple TextEdit (macOS)."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12352&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/gtxml_12352.png",
      "alt": "Screenshot of a .gtxml file in StudioCoast GT Designer Advanced 2",
      "caption": "GTXML file open in StudioCoast GT Designer Advanced 2"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/gtxml",
      "retrieved_at": "2025-11-02T02:43:26.785Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.785Z"
}