{
  "slug": "i7",
  "extension": "i7",
  "name": "Inform 7 Source Code File",
  "summary": "Learn about .I7 files and view a list of programs that open them.",
  "developer": "Graham Nelson",
  "technical_info": {
    "content": [
      "IF programs are similar to video games in that they provide an environment that you can interact with by typing text commands. These programs are also similar to fictional stories since they feature a consistent storyline that you can progress through as you play.",
      "Inform is a free tool utilized to create and compile IF programs that you can share with other users. You can define your playable IF program in an I7 source code file, then, compile it with Inform 7 into a playable file, such as a .GBLORB or .ZBLORB file.",
      "You can create an I7 file with any text editor. When you save the file, save it with the .i7 file extension. If this option is not provided, you may need to save the file as a .TXT file with the text editor, then manually change the .txt file extension to .i7.",
      "NOTE: I7 source code files were introduced with the release of Inform 7, replacing .INF source code files used by previous versions of Inform. However, I7 files are more commonly saved as .NI files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an I7 file with Inform 7, then compile it by selecting \"Go!\" from the user interface.",
      "Since I7 files are saved in plain text, you can also open and edit them with a plain text or source code editor. Microsoft Notepad (Windows) and Apple TextEdit (macOS) are text editors bundled with their respective operating systems that you can use to open I7 files. Also, Microsoft Visual Studio Code (multiplatform) is a useful source code editor that can view and edit I7 files."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11778&b=1"
      },
      {
        "name": "Microsoft Visual Studio Code",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/i7_11778.png",
      "alt": "Screenshot of a .i7 file in Microsoft Visual Studio Code 1.51",
      "caption": "I7 file open in Microsoft Visual Studio Code 1.51"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/i7",
      "retrieved_at": "2025-11-02T02:43:26.806Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.806Z"
}