{
  "slug": "ift",
  "extension": "ift",
  "name": "Interfile Transfer File",
  "summary": "Learn about .IFT files and view a list of programs that open them.",
  "developer": "TPC",
  "technical_info": {
    "content": [
      "The Turku PET Centre in Finland develops TPC programs, which help researchers study metabolism, blood flow, receptor binding, and other physiological processes using PET imaging. Examples of TPC tools include iftadd, which adds key-value pairs to an IFT file, and iftvalc, which performs arithmetic calculations on values in an IFT file.",
      "The primary function of IFT files is to store input parameters for TPC programs, allowing researchers to automate analyses and avoid manual data entry. Examples of input parameters include scan settings, region definitions, and kinetic modeling options. Additionally, IFT files may store analysis results, including computed values, statistical outputs, or modeling data, which users can later reload, review, or process further.",
      "NOTE: The \"Interfile Transfer\" name comes from \"Interfile headers,\" which store standardized metadata in PET imaging. IFT files function similarly to Interfile headers, which is why the names are similar."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open IFT files with various tools included with the TPC software suite.",
      "Since IFT files store plain text, you can open and edit them with any text editor, including Microsoft Notepad (Windows), Apple TextEdit (macOS), and gedit (Linux)."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "gedit",
        "url": "https://fileinfo.com/software/gedit/gedit"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13784&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/ift",
      "retrieved_at": "2025-11-02T02:43:26.815Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.815Z"
}