{
  "slug": "iqm",
  "extension": "iqm",
  "name": "Inter-Quake Model",
  "summary": "Learn about .IQM files and view a list of programs that open them.",
  "developer": "Lee Salzman",
  "technical_info": {
    "content": [
      "Lee Salzman, also known as \"eihrul,\" developed the IQM format to provide an efficient, modern alternative to older model formats, such as MD5 and MD3. The format is also open and well-documented, encouraging use in community-driven or independent projects.",
      "Developers and modders use IQM files (and related .IQE files) when building or modifying game assets, since the format supports skeletal animation and efficient rendering. While IQM is less common in large commercial engines, it remains a common choice for smaller game engines, hobbyist developers, and open-source gaming communities. Users may export IQM files from various 3D modeling apps, including Blender."
    ]
  },
  "how_to_open": {
    "instructions": [
      "IQM files are not meant to be opened. Instead, IQM files are included in the game's or app's data package (alongside textures, maps, and other assets), and the game engine then loads the IQM file directly to render and animate models during gameplay.",
      "While players typically don't interact with IQM files themselves, modders and developers may open or replace them to change in-game characters, weapons, or objects. For example, you can open IQM files with various tools, such as the IQM model viewer (provided by the format creator) or with Blender, which supports IQM through community plugins and scripts."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Blender",
        "url": "https://fileinfo.com/software/blender/blender"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13866&b=1"
      },
      {
        "name": "Cube 2: Sauerbraten",
        "url": "https://fileinfo.com/software/cube_2_sauerbraten/cube_2_sauerbraten"
      },
      {
        "name": "Blender with IQM plugin",
        "url": "https://fileinfo.com/software/blender/blender"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/iqm",
      "retrieved_at": "2025-11-02T02:43:26.825Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.825Z"
}