{
  "slug": "iqp",
  "extension": "iqp",
  "name": ".IQP",
  "summary": "Learn about .IQP files and view a list of programs that open them.",
  "developer": "IntelliQuilter",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13509&b=1"
      }
    ]
  },
  "how_to_open": {
    "instructions": [
      "In Windows, you can open IQP files with The StiQ, IntelliQuilter's paid IQP editor, or IntelliQView, IntelliQuilter's free IQP viewer. Both programs are available from IntelliQuilter's website. (You must own an IntelliQuilter system to use The StiQ.)",
      "To use an IQP file with the IntelliQuilter tablet:",
      "Plug a USB flash drive into your computer.",
      "If your flash drive does not already have a directory named patterns, create one.",
      "Transfer your IQP file to the patterns directory.",
      "Eject your USB drive.",
      "From your IntelliQuilter tablet's main menu, select Load Patterns.",
      "Connect your USB drive to your IntelliQuilter tablet.",
      "Your IntelliQuilter tablet will then import your IQP file, allowing you to access the file from the Downloads section of your pattern catalog.",
      "NOTE: IntelliQuilter always imports all IQP files stored in the patterns directory. If you don't delete IQP files from the patterns directory between imports, this can result in IntelliQuilter importing multiple copies of the same pattern. To prevent this, delete IQP files from your USB drive after importing them."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/iqp",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T20:11:15.127Z"
    }
  ],
  "last_updated": "2025-11-01T20:11:15.127Z"
}