{
  "slug": "kma",
  "extension": "kma",
  "name": "Correlate Archive File",
  "summary": "Learn about .KMA files and view a list of programs that open them.",
  "developer": "Correlate",
  "technical_info": {
    "content": [
      "Correlate is a program that allows you to organize your files by creating shortcuts. It is available as a web program, which enables you to organize your files from different cloud storage services such as Google Drive, Dropbox, and OneDrive, as well as links to websites or text from notes.",
      "Correlate is also available as a Windows desktop program called \"Correlate Client,\" which is for users that want to organize their files in Windows. This program allows you to organize your files into a structured document by dragging and dropping a file into the document and creating a dynamic link, or shortcut, to the file instead of physically moving or duplicating it. For example, if you are creating a marketing strategy and want to organize all the related files in one place, you can drag and drop the files into the marketing strategy document, which are transformed into links that you can click to open the related file.",
      "Correlate Client creates the KMA file to archive a document of links. To create a KMA file, select File → Save As then select \"Correlate Archives (*.kma)\" from the \"Save as type\" dropdown list. To open a KMA file, select File → Open.",
      "NOTE: Correlate Client is also known as \"Correlate K-Map Desktop.\""
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10625&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/kma_10625.jpg",
      "alt": "Screenshot of a .kma file in Correlate Client",
      "caption": "KMA file open in Correlate Client"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/kma",
      "retrieved_at": "2025-11-02T02:43:26.859Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.859Z"
}