{
  "slug": "kmt",
  "extension": "kmt",
  "name": "Mario Kart Wii Kart Mission Table",
  "summary": "Learn about .KMT files and view a list of programs that open them.",
  "developer": "Nintendo",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "In 2017, a YouTuber with the screen name MrBean35000vr discovered Mario Kart Wii's incomplete Mission Mode. This game mode, which functions similarly to Mario Kart DS's Mission Mode, would have allowed players to complete a series of 64 predesigned, timed challenges.",
      "With some effort, MrBean35000vr and the Mario Kart Wii community were able to implement a functioning version of Mario Kart Wii's Mission Mode. To do so, they had to create a replacement for the file mission_single.kmt, which Mario Kart Wii would have used to load missions. This file is not present on the Mario Kart Wii game disc, but the Mario Kart community was able to analyze the game's remaining Mission Mode processes and learn how mission_single.kmt was intended to function. They then created their own versions of mission_single.kmt, which can be used to load a variety of fan-created missions into Mario Kart Wii's Mission Mode, unlocking a previously unfinished feature."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Those who want to design missions for Mario Kart Wii's Mission Mode can open and edit KMT files in KMT Manager (Windows), a fan-created Mario Kart Wii mission creation and editing application."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11941&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/kmt",
      "retrieved_at": "2025-11-01T22:32:42.578Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.578Z"
}