{
  "slug": "kpmap",
  "extension": "kpmap",
  "name": "Newer Super Mario Bros. Wii World Map",
  "summary": "Learn about .KPMAP files and view a list of programs that open them.",
  "developer": "Newer Team, Treeki, and Tempus",
  "technical_info": {
    "content": [
      "Gamers who have homebrew-enabled their Wii or use the Dolphin emulator can download and play Newer Super Mario Bros. Wii. Because Newer Super Mario Bros. Wii is an unofficial sequel, players can open, examine, and modify many of its game files if they so choose.",
      "KPMAP files are map files that Newer Super Mario Bros. Wii uses to show the game's overall map and world maps to players. These maps allow players to travel from level to level within the game. If players are content with Newer Super Mario Bros. Wii's level structure, they do not have to open or edit the game's KPMAP files. However, those who are interested in modding Newer Super Mario Bros. Wii can use the Koopatlas Map Editor, a tool created and published in tandem with Newer Super Mario Bros. Wii, to edit KPMAP files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open and edit a KPMAP file in Koopatlas Map Editor (Windows). To do so, select File → Open from the program's menu bar. You may have to download additional resources, such as tilesets, before you can open a KPMAP file in Koopatlas Map Editor.",
      "To use a KPMAP file as a Newer Super Mario Bros. Wii world map, you must save the file as a KPBIN file, compress it using ntcompress, and then replace the corresponding KPBIN.LH file in Newer Super Mario Bros. Wii's Maps directory."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12062&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/kpmap",
      "retrieved_at": "2025-11-02T02:43:26.861Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.861Z"
}