{
  "slug": "kts",
  "extension": "kts",
  "name": "Kotlin Script",
  "summary": "Learn about .KTS files and view a list of programs that open them.",
  "developer": "JetBrains",
  "technical_info": {
    "content": [
      "Kotlin is a statically-typed programming language developed by JetBrains. JetBrains developed the Kotlin language to alleviate some of the common issues that arise in Java development. Most popularly, Kotlin is used to develop Android applications, as it is Google's preferred Android development language.",
      "Developers creating Kotlin programs can create and include Kotlin scripts in those programs. These scripts are saved as KTS files. In addition to being referenced and run within Kotlin programs, developers can run KTS files independently. To run a script using the Kotlin compiler, a developer can use the command kotlinc -script filename.kts. Otherwise, the developer can run their script from within Jetbrains IntelliJ IDEA or Google Android Studio.",
      "NOTE: Kotlin source code files that do not contain a Kotlin script are saved as .KT files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a KTS file in any text or source code editor. However, it is best to open a KTS file in Jetbrains IntelliJ IDEA (cross-platform) or Google Android Studio (cross-platform). These programs display KTS files' syntax correctly, and they also allow you to run the script a KTS file contains."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Google Android Studio",
        "url": "https://fileinfo.com/software/google/android_studio"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12313&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/kts_12313.png",
      "alt": "Screenshot of a .kts file in Microsoft Visual Studio Code",
      "caption": "KTS file open in Microsoft Visual Studio Code"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/kts",
      "retrieved_at": "2025-11-02T02:43:26.863Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.863Z"
}