{
  "slug": "l01",
  "extension": "l01",
  "name": "EnCase Logical Evidence File",
  "summary": "Learn about .L01 files and view a list of programs that open them.",
  "developer": "Guidance Software",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "OpenText Encase Forensic is a digital forensics program used to retrieve and review data from PCs, smartphones, and other electronic devices. Forensic analysts can save the entirety of the data they retrieve from a device as an E01 file, and they can save subsets of that data as L01 files. For example, if only a few retrieved documents are relevant to the analyst's investigation, they can save those documents in an L01 file, so they don't have to continually load and parse through irrelevant information.",
      "Optionally, analysts can choose to include only a file's filename in an L01 file. In that case, the analyst must still open the related E01 file to view the file. Analysts can also hash L01 files, so they and other parties can verify the files' contents are unaltered.",
      "NOTE: The .LX01 format replaced the L01 format. OpenText acquired Guidance Software in 2017."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an L01 file in OpenText EnCase Forensic (Windows). Doing so allows you to view the files and other information the L01 file contains."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=8367&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/l01",
      "retrieved_at": "2025-11-01T22:32:42.582Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.582Z"
}