{
  "slug": "lilocked",
  "extension": "lilocked",
  "name": "Lilocked Ransomware Encrypted File",
  "summary": "Learn about .LILOCKED files and view a list of programs that open them.",
  "developer": "N/A",
  "technical_info": {
    "content": [
      "The purpose of the Lilocked ransomware is to target Linux-based web servers and exploit flaws in software running on the servers, most notably defunct Exim software. After the virus gains root access, it takes files on the servers hostage and forces the server administrators to pay the perpetrator to unlock the files.",
      "The ransomware takes files on the web server hostage by encrypting them and appending the .lilocked extension onto the extensions of the files. For example, a sample.css file becomes sample.css.lilocked.",
      "The ransomware typically does not encrypt server system files, only web-related files, such as .HTML, .CSS, .PHP, and .JS files. After encrypting the files, the virus generates a ransom note (#README.lilocked) in each folder on the server to inform the server administrators about the takeover.",
      "NOTE: LILOCKED files became prevalent in July 2019."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Currently, there is no program available to effectively open or restore LILOCKED files on a server. However, the administrator can restore the server from a previous backup to remove infected files and the Lilocked virus."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11361&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/lilocked",
      "retrieved_at": "2025-11-02T02:43:26.873Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.873Z"
}