{
  "slug": "litematic",
  "extension": "litematic",
  "name": "Minecraft Litematica Schematic",
  "summary": "Learn about .LITEMATIC files and view a list of programs that open them.",
  "developer": "Masady",
  "technical_info": {
    "content": [
      "Minecraft is a 3D sandbox construction game. The game allows players to use various unofficial add-ons and mods to enhance their gameplay. The Litematica includes most of the features available with the old Schematica and also provides some new capabilities.",
      "Litematica's main capability is that it can display a schematic of an area with information on how to build it (e.g., where to place the blocks) and highlights missing, extra, or wrongly placed blocks. When you create a schematic of a selected area with Litematica, the mod saves it as a LITEMATIC file."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open and edit LITEMATIC files with Litematica (multiplatform). The app allows players to create, export, and import LITEMATIC files from within Minecraft Java Edition.",
      "To open a LITEMATIC file, you must install the Litematica mod, then place the LITEMATIC file in the \"schematics\" folder in the \".minecraft\" folder. Then, click the Load Schematics option in the Litematica screen in Minecraft to load the schematic saved in the LITEMATIC file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12863&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/litematic",
      "retrieved_at": "2025-11-02T02:43:26.874Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.874Z"
}