{
  "slug": "lmbake",
  "extension": "lmbake",
  "name": "Godot Engine LightMap Bake Binary",
  "summary": "Learn about .LMBAKE files and view a list of programs that open them.",
  "developer": "Godot",
  "technical_info": {
    "content": [
      "Godot Engine is a free video game development engine that allows developers to create 2D and 3D games. Each game is comprised of a series of scenes, which are themselves comprised of a series of nodes representing different in-game elements.",
      "One of the nodes developers can add to a Godot Engine scene is BakedLightmap. The BakedLightmap node allows developers to add indirect and direct lighting to a scene. Developers then \"bake\" their scene's lighting, compiling it for use in their scene. If a developer is saving their scene as a text-based TSCN file, Godot Engine will compile the developer's lighting in a separate LMBAKE file. This avoids bloating the developer's TSCN file with encoded, binary data."
    ]
  },
  "how_to_open": {
    "instructions": [
      "LMBAKE files are not meant to be opened or edited manually. If you want to view the data an LMBAKE file contains, you should open the corresponding .GODOT file in Godot Engine (cross-platform) and then edit the scene that uses your LMBAKE file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12276&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/lmbake",
      "retrieved_at": "2025-11-02T02:43:26.875Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.875Z"
}