{
  "slug": "lmsp",
  "extension": "lmsp",
  "name": "LEGO MINDSTORMS Scratch Program",
  "summary": "Learn about .LMSP files and view a list of programs that open them.",
  "developer": "The LEGO Group",
  "technical_info": {
    "content": [
      "LEGO Education EV3 Classroom is a cross-platform application that allows students to create programs for use with the EV3 Intelligent Brick. The EV3 Intelligent Brick is a miniature, programmable computer that students use to control LEGO robots, which are built from the LEGO MINDSTORMS Education EV3 Core Set.",
      "Programs that students create using EV3 Classroom are saved as LMSP files. In EV3 Classroom, the code that LMSP files contain appears as blocks, which students can drag and drop to change the functions their program includes. After a student has finished editing the program their LMSP file contains, they can install the file on their EV3 Intelligent Brick. They can then attach the Brick to a LEGO robot designed to execute their program and watch as the robot performs the functions their program contains.",
      "NOTE: LMSP files are Zip-compressed files that contain an .SB3, .SVG, and .jsn file. Students will likely never have to decompress an LMSP file, but doing so and examining the file's decompressed contents could be a valuable educational exercise."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open LMSP files in LEGO Education EV3 Classroom (cross-platform). To do so, select File → Open File from the program's menu bar. Then, navigate to and open your LMSP file.",
      "To install an LMSP file on your EV3 Intelligent Brick, you must pair the Brick with your computer. You can do this by turning on the Brick's Bluetooth or connecting it to your computer using a USB cable and then pressing the connect button found in LEGO Education EV3 Classroom. Then, follow the instructions included with EV3 Classroom to install your LMSP file on your EV3 Intelligent Brick."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12012&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/lmsp_12012.png",
      "alt": "Screenshot of a .lmsp file in LEGO Education EV3 Classroom 1.1",
      "caption": "LMSP file open in LEGO Education EV3 Classroom 1.1"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/lmsp",
      "retrieved_at": "2025-11-02T02:43:26.876Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.876Z"
}