{
  "slug": "lsl",
  "extension": "lsl",
  "name": "LiveSplit Layout",
  "summary": "Learn about .LSL files and view a list of programs that open them.",
  "developer": "LiveSplit",
  "technical_info": {
    "content": [
      "Speedrunners use LiveSplit to track how quickly they complete video games, sections of video games, and/or specific in-game challenges. They can then compare their times with other speedrunners' times, to see if they've set a new record.",
      "When a speedrunner first opens LiveSplit, the program appears as a simple black box with a white timer. Typically, speedrunners spruce up LiveSplit's appearance by editing the program's layout. For example, a speedrunner might add a title for their speedrun, show the titles of their splits (which are often loaded from an .LSS file), and change LiveSplit's size and background color.",
      "To edit LiveSplit's layout, speedrunners right-click in the program and select Edit Layout.... The program's Layout Editor then appears. After a speedrunner has finished editing LiveSplit's layout, they can save their custom layout by right-clicking in the program and selecting Save Layout or Save Layout As.... The layout will then be saved as an LSL file, which a speedrunner can reload the next time they open LiveSplit.",
      "NOTE: LSL files may contain references to .ASL files, which are LiveSplit Auto Splitter Scripts."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To open an LSL file in LiveSplit, right-click in the program and select Open Layout → From File.... Then, navigate to and select your LSL file. LiveSplit will then apply the layout settings your LSL file contains.",
      "If necessary, you can also open an LSL file in any text editor, such as Microsoft Notepad (Windows), Apple TextEdit (Mac), or GitHub Atom (cross-platform), to edit the XML text it contains. For example, you might want to open and edit your LSL file in a text editor to update a path to an ASL file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "GitHub Atom",
        "url": "https://fileinfo.com/software/github/atom"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12133&b=1"
      },
      {
        "name": "GNU Emacs",
        "url": "https://fileinfo.com/software/gnu/emacs"
      },
      {
        "name": "Vim",
        "url": "https://fileinfo.com/software/vim/vim"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/lsl_12133.png",
      "alt": "Screenshot of a .lsl file in LiveSplit",
      "caption": "LSL file open in LiveSplit"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/lsl",
      "retrieved_at": "2025-11-02T02:43:26.882Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.882Z"
}