{
  "slug": "ltc",
  "extension": "ltc",
  "name": "Luminar Template Collection",
  "summary": "Learn about .LTC files and view a list of programs that open them.",
  "developer": "Skylum Software",
  "technical_info": {
    "content": [
      "Luminar is a photo editor developed by Skylum Software. It is available for Windows and macOS. The program has been available in various versions, including Luminar AI and Luminar Neo.",
      "Both Luminar AI and Neo allow users to install template collections saved as LTC files. These collections contain multiple Luminar templates, which photographers can use to quickly and automatically adjust photos to certain preset specifications.",
      "For example, an LTC file might include five related Luminar templates, which are meant to be used with landscape photographs. One of those templates might contain a set of preset edits optimized for sharpening foggy landscape photos."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an LTC file with Luminar AI or Luminar Neo (Windows, Mac). To do so, select File → Add Luminar AI/Neo Template Collection. Then, navigate to and open your LTC file. The templates your LTC file contains will then appear in Luminar's Templates tab."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13182&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/ltc",
      "retrieved_at": "2025-11-02T02:43:26.883Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.883Z"
}