{
  "slug": "mcq",
  "extension": "mcq",
  "name": "VirusScan Quarantined Data",
  "summary": "Learn about .MCQ files and view a list of programs that open them.",
  "developer": "McAfee",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "McAfee VirusScan allows users to scan their computers' files for viruses. It is available as a standalone product and included in several McAfee computer security bundles, including McAfee LiveSafe, McAfee AntiVirus Plus, and McAfee Total Protection.",
      "When VirusScan detects an infected file (or a file it believes is infected), it first attempts to \"clean\" the file and remove the virus. If it cannot remove the virus, it allows the user to either delete or quarantine the file. If a user chooses to quarantine the file, VirusScan encrypts the file, moves it to a secure folder, and renames it to use the .mcq extension.",
      "Users can review their list of quarantined files in McAfee VirusScan. If a user determines a quarantined file is not infected, they can use VirusScan to restore the file. Otherwise, they can permanently delete the file."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can use McAfee VirusScan (Windows, Mac) to restore an MCQ file to its original state and location or to permanently delete the file. To manage your quarantined files, find the Quarantined Items or Quarantine section of your McAfee antivirus product. Click Restore to restore a quarantined item or Delete to permanently delete a quarantined item."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12978&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/mcq",
      "retrieved_at": "2025-11-01T22:32:42.609Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.609Z"
}