{
  "slug": "mobileconfig",
  "extension": "mobileconfig",
  "name": "Apple Mobile Configuration File",
  "summary": "Learn about .MOBILECONFIG files and view a list of programs that open them.",
  "developer": "Apple",
  "technical_info": {
    "content": [
      "MOBILECONFIG files are typically hosted by a remote profile service, which communicates with the Apple device to configure and register it. When transmitted, MOBILECONFIG files can be digitally signed so the information is sent securely.",
      "Mobile configuration files can be used to manage and deploy settings to a large number of devices. In the past, administrators could create MOBILECONFIG files using the iPhone Configuration Utility, which was available for both Mac and Windows platforms. However, administrators now create and deploy MOBILECONFIG files using Apple Configurator 2 for macOS."
    ]
  },
  "how_to_open": {
    "instructions": [
      "IT administrators can open, edit, and create MOBILECONFIG files in Apple Configurator 2 for macOS.",
      "If you are an iOS device user, and you have received a MOBILECONFIG file that you want to install on your device, you must:",
      "Download the file to your device. After you do, a Profile Downloaded message will appear to confirm your download.",
      "Open the Settings app.",
      "Select Profile Downloaded.",
      "You will see a description of what your MOBILECONFIG file contains. To install the file, select Install."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=5100&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/mobileconfig",
      "retrieved_at": "2025-11-02T02:43:26.917Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.917Z"
}