{
  "slug": "mod",
  "extension": "mod",
  "name": "Music Module File",
  "summary": "Learn about .MOD files and view a list of programs that open them.",
  "developer": "Karsten Obarski",
  "category": "audio",
  "category_slug": "audio",
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ],
  "technical_info": {
    "content": [
      "A MOD file pattern is actually designed in a sequencer user interface as a table with one column per channel, So this table has four columns (one for each Amiga hardware channel. Each column has 64 rows).\n\nA cell in the table can cause one of the following actions to happen on its column’s channel when its row’s time is reached:\n\nStart an instrument playing a new note in this channel at a given volume, possibly with a special effect applied on itChange the volume or special effect being applied to the current noteChange pattern flow; jump to a specific song or pattern position or loop inside a patternDo nothing; any existing note playing in this channel will continue to play\n\nAn instrument is a single sample along with an optional specification of which portion of the sample can be repeated to hold a solid note.",
      "Karsten Obarski initially developed the Amiga module format and released it with the Ultimate Soundtracker software for the Commodore Amiga system in 1987. As music trackers began supporting the format, especially on PCs in the 1990s, other developers released variations of the MOD format.",
      "Initially, the MOD format only supported four audio channels and sixteen instruments. However, recent MOD variations have increased the number of supported channels to 32 and supported instruments to 31.",
      "The sound samples within a module are assigned to different tracks and are played back according to the notes in the score. A MOD module also includes a list that tells the application playing the module the order the patterns are to be played.",
      "NOTE: MOD files may be created by various MOD trackers, including FastTracker, StarTrekker, Noise Tracker, MilkyTracker, and Cog."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a MOD file with various audio players, such as Nullsoft Winamp (Windows), VideoLAN VLC media player (multiplatform), Schism Tracker (multiplatform), and MikMod (multiplatform). Unfortunately, some audio players that support MOD files may no longer be developed and not work on modern operating systems.",
      "On an Android device, you can play MOD files with Smarper Amiga Mod Player for Android, and on iOS devices, you can use PureModPlay or VividTracker to play MOD files."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "Several audio players, such as MilkyTracker (Windows) and Cog (macOS), can convert MOD music module files to other formats.",
      "For example, MilkyTracker can convert MOD files to the WAVE Audio (.WAV) and Fasttracker 2 Extended Module (.XM) formats."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Cog",
        "url": "https://fileinfo.com/software/cog/cog"
      },
      {
        "name": "Nullsoft Winamp",
        "url": "https://fileinfo.com/software/nullsoft/winamp"
      },
      {
        "name": "VideoLAN VLC media player",
        "url": "https://fileinfo.com/software/videolan/vlc_media_player"
      },
      {
        "name": "Schism Tracker",
        "url": "https://fileinfo.com/software/schism_tracker/schism_tracker"
      },
      {
        "name": "MikMod",
        "url": "https://fileinfo.com/software/mikmod/mikmod"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=410&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/mod_410.png",
      "alt": "Screenshot of a .mod file in VideoLAN VLC media player 3",
      "caption": "MOD file open in VideoLAN VLC media player 3"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/mod_12286.png",
      "alt": "Screenshot of a .mod file in Microsoft Visual Studio Code",
      "caption": "MOD file open in Microsoft Visual Studio Code"
    }
  ],
  "sources": [
    {
      "source": "fileformat.com",
      "url": "https://docs.fileformat.com/audio/mod/",
      "retrieved_at": "2025-11-02T02:43:26.525Z"
    },
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/mod",
      "retrieved_at": "2025-11-02T02:43:26.525Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.525Z"
}