{
  "slug": "nsmp",
  "extension": "nsmp",
  "name": "Nord Sample",
  "summary": "Learn about .NSMP files and view a list of programs that open them.",
  "developer": "Nord",
  "technical_info": {
    "content": [
      "Using Nord Sample Editor, Nord keyboard owners can create their own instruments for use with their keyboards. To do so, they import or record audio files and then map segments of those audio files to specific keyboard keys. They can also edit various properties associated with each mapped audio sample.",
      "After a musician saves their Nord Sample Editor project (as an NSMPPROJ file), the program automatically creates an associated NSMP file. The musician can use Nord Sample Editor's MANAGER... button to transfer this file to their Nord keyboard (provided their keyboard is connected to their computer).",
      "NOTE: Different versions of Nord Sample Editor save NSMP files with slightly different file extensions. For example, version 3 NSMP files are saved with the .nsmp3 extension."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To transfer an NSMP file to a Nord keyboard:",
      "Connect your keyboard to your computer.",
      "Open the NSMP file's related NSMPPROJ file in Nord Sample Editor.",
      "Click MANAGER.",
      "Send your NSMP file to your keyboard.",
      "You can then use the instrument the NSMP file contains as you would any other Nord keyboard instrument."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13390&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/nsmp",
      "retrieved_at": "2025-11-02T02:43:26.957Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.957Z"
}