{
  "slug": "nsz",
  "extension": "nsz",
  "name": "Compressed Nintendo Submission Package",
  "summary": "Learn about .NSZ files and view a list of programs that open them.",
  "developer": "nicoboss",
  "technical_info": {
    "content": [
      "Custom Nintendo Switch operating systems, such as SX OS and Atmosphere, and Nintendo Switch emulators, such as yuzu and Ryujinx, allow players to play games saved as NSP files. However, NSP files can be quite large, so players sometimes have difficulty sharing them with one another.",
      "To solve this issue, nicoboss and other members of the Nintendo Switch community developed the NSZ file format. Using the nsz compression program, Switch players can compress large NSP files into smaller NSZ archives. They can then share these archives with other players, who can decompress the archives using nsz and open or install the resulting NSP file. Some custom Switch firmware, such as Awoo-Installer and GoldBricks, allow players to install NSZ files without decompressing them first."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can use nsz to decompress an NSZ archive into an NSP file. Then, you can install or open the resulting NSP file using the custom Nintendo Switch firmware or emulator of your choice. You can also install NSZ files directly using Awoo-Installer or GoldBricks."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11648&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/nsz",
      "retrieved_at": "2025-11-02T02:43:26.958Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.958Z"
}