{
  "slug": "ols",
  "extension": "ols",
  "name": "Microsoft Office List Shortcut",
  "summary": "Learn about .OLS files and view a list of programs that open them.",
  "developer": "Microsoft",
  "technical_info": {
    "content": [
      "Microsoft Publisher is a desktop publishing program that is part of the Microsoft Office suite. While using Publisher to create and publish documents, you can perform a mail (or email) merge. This allows you to import a mailing (or email) list and personalize your document for each person on the list (for example, by adding that person's name and address or a unique greeting).",
      "As part of performing a mail merge, you must import a recipient list. Recipient lists can be imported from files saved in any of the following formats:",
      "Microsoft Outlook contacts lists",
      "Microsoft Excel worksheets",
      "Microsoft Word tables",
      "Microsoft Access database tables",
      "Text files saved in the .CSV format",
      "After you finish performing your mail merge, Microsoft Publisher will ask whether you want to save a shortcut to your imported recipient list, to make the list easier to select in the future. If you choose to save a shortcut, Publisher will create an OLS file, which links to your recipient list. The next time you perform a mail merge, you will be able to select this shortcut to more easily import the linked recipient list."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To use an OLS file to add a recipient list to a Publisher mail or email merge, select Mailings → Select Recipients → Use Existing List. Publisher will show you a list of your existing OLS files, from which you can select."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12710&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/ols",
      "retrieved_at": "2025-11-02T02:43:26.971Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.971Z"
}