{
  "slug": "osz",
  "extension": "osz",
  "name": "osu! Beatmap File",
  "summary": "Learn about .OSZ files and view a list of programs that open them.",
  "developer": "peppy",
  "technical_info": {
    "content": [
      "While osu! is the most popular game that utilizes OSZ files, enthusiastic rhythm gamers have created additional takes on osu!, including:",
      "opsu!, an open-source osu! client available for Windows, macOS, Linux, and Android",
      "McOsu, a free VR-enabled osu! variant that is available on Steam",
      "Each of those games uses OSZ files. osu! is available only on Windows, so if you do not have a Windows PC, you may need to open your OSZ file in one of the programs listed above."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open OSZ files with various programs, including osu!, opsu!, and Project Outfox. To open an OSZ file with osu!:",
      "Drag your OSZ file into the game window. osu! will then decompress the file and add it to the game's Songs folder, making it available for use within osu!",
      "In opsu!, browse to your OSZ file's location and import it. You can also download additional OSZ files from within opsu!",
      "In McOsu, add your OSZ file to the folder you use as your Songs folder, rename the file to use the .zip extension, and then unzip the ZIP file. The beatmap will then be available within McOsu",
      "You can also view the contents of an OSZ file by unzipping the file with a decompression tool such as Corel WinZip, 7-Zip, or Apple Archive Utility. This will, among other things, allow you to play the MP3 file contained within an OSZ file using your favorite media player."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Corel WinZip",
        "url": "https://fileinfo.com/software/corel/winzip"
      },
      {
        "name": "7-Zip",
        "url": "https://fileinfo.com/software/igor_pavlov/7-zip"
      },
      {
        "name": "Apple Archive Utility",
        "url": "https://fileinfo.com/software/apple/archive_utility"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=4290&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/osz_4290-2.png",
      "alt": "Screenshot of a .osz file in opsu!",
      "caption": "OSZ file open in opsu!"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/osz",
      "retrieved_at": "2025-11-02T02:43:26.977Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.977Z"
}