{
  "slug": "pfile",
  "extension": "pfile",
  "name": "Rights Management Protected File",
  "summary": "Learn about .PFILE files and view a list of programs that open them.",
  "developer": "Microsoft",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "AIP, formerly known as Microsoft Rights Management (RMS), is a data security system businesses use to control file access. Only authorized users can open a file when AIP encrypts it.",
      "AIP may encrypt files in various formats, including PFILE, .PPDF, PTXT, or PJPG. PPDF, PTXT, and PJPG files store read-only documents or images, while PFILE files retain their original format, and users can edit them if permissions allow.",
      "You might encounter a PFILE file if:",
      "Your organization uses AIP for file protection. For example, if your document originates from a work or school account, your organization may have policies that automatically protect specific files when a user moves outside a secure environment.",
      "You receive a PFILE as an email attachment from someone using AIP. For example, your friend may use AIP to protect their files, and they share a document encrypted as a PFILE with you.",
      "Your Microsoft Office document has a sensitivity label applied (e.g., \"Confidential\" or \"Internal Use\"). For example, Word may convert your DOCX file to a PFILE when you copy or share it outside the designated domain or security group.",
      "NOTE: Microsoft rebranded AIP as Purview Information Protection in April 2022, when it unified its data governance and protection products under the Microsoft Purview brand. While AIP is now considered part of Microsoft Purview Information Protection, many of its features and functionality remain the same."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a PFILE with Microsoft Azure Information Protection Viewer, which is part of Microsoft Purview Information Protection in Windows. You can also open a PFILE with Microsoft RMS Sharing in macOS. You'll likely need to sign in with an authorized username, password, or other credentials to access the file in both apps."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10458&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/pfile",
      "retrieved_at": "2025-11-01T22:32:42.686Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.686Z"
}