{
  "slug": "pixil",
  "extension": "pixil",
  "name": "Pixilart Project",
  "summary": "Learn about .PIXIL files and view a list of programs that open them.",
  "developer": "Pixilart",
  "technical_info": {
    "content": [
      "You can create various types of art with Pixilart, such as icons, gaming sprites, and animations. After completing your drawing, you can then share it with other users in the Pixelart online community, as well as customize objects, such as mugs, shirts, and phone cases with the artwork.",
      "The Pixil format is the primary format used to save drawings with Pixilart. When you save your drawing as a PIXIL file, you can close it, then re-open it for further editing.",
      "To create a PIXIL file and save it on your computer, select FILE → SAVE AS PIXIL and name the file. Your web browser will then download and save the PIXIL file in your downloads folder. The PIXIL file bears the same name as what you just named it.",
      "Pixilart also allows you to export your drawing as a .PNG image or .GIF animation. To do this, select FILE → DOWNLOAD, choose your settings and format, then click SAVE DRAWING."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a PIXIL file with Pixilart. To open a PIXIL file with Pixilart that has been saved on your computer, select FILE → OPEN PIXIL, navigate to the PIXIL file on your computer, then click Open to upload the file to the Pixilart web application."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11819&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/pixil_11819.png",
      "alt": "Screenshot of a .pixil file in Pixilart",
      "caption": "PIXIL file open in Pixilart"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/pixil",
      "retrieved_at": "2025-11-02T02:43:27.000Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.000Z"
}