{
  "slug": "pkpass",
  "extension": "pkpass",
  "name": "Apple Wallet Pass",
  "summary": "Learn about .PKPASS files and view a list of programs that open them.",
  "developer": "Apple",
  "category": "other",
  "mime": [
    "application/vnd.apple.pkpass"
  ],
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "Apple Wallet is an iOS and watchOS app that iPhone, iPad, and Apple Watch users use to, among other things, store electronic copies of tickets, passes, and coupons on their iDevices. These copies are saved and downloaded as PKPASS files. In Apple Wallet, the information a PKPASS file contains appears as an infocard, which typically includes a QR code that can be scanned to verify a user's pass.",
      "While PKPASS files are primarily intended to be stored on iDevices and imported into Apple Wallet, you can view the files' contents on other devices. PKPASS files are simply .ZIP files that contain images, pass formatting information, and a digital signature used to authenticate a user's pass. (You can learn more about PKPASS files' contents here.) If you want to view these constituent files, rename your PKPASS file to use the .zip extension and then open it using any Zip decompression program.",
      "NOTE: Apple Wallet was previously known as Apple Passbook. Apple Passbook also used PKPASS files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a PKPASS file by sending it to an iPhone, iPad, or Apple Watch that has Apple Wallet installed and then tapping the file. Your iDevice will then allow you to add the PKPASS file to your Apple Wallet, where the file will appear as a pass.",
      "Also, Android users can use Google Wallet or Above Mobile Limited PassWallet to open and manage PKPASS files on their devices."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Adobe Acrobat",
        "url": "https://file.org/free-download/adobe-acrobat"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=8235&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://assets.file.org/images/fileorg-logo-440x90-4-8b.png",
      "alt": "File.org logo"
    },
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "file.org",
      "url": "https://file.org",
      "retrieved_at": "2025-11-01T22:32:42.198Z"
    },
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/pkpass",
      "retrieved_at": "2025-11-01T22:32:42.198Z"
    },
    {
      "source": "filext.com",
      "retrieved_at": "2025-11-01T22:32:42.198Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.198Z"
}