{
  "slug": "ps2",
  "extension": "ps2",
  "name": "PCSX2 Memory Card",
  "summary": "Learn about .PS2 files and view a list of programs that open them.",
  "developer": "PCSX2",
  "technical_info": {
    "content": [
      "When players save an in-progress game on a PlayStation 2, the system saves the game data to a removable memory card. Typically, PS2 memory cards can store up to 8 MB of saved game data. (This is enough space for roughly 15 saved games.)",
      "PCSX2 and AetherSX2 use PS2 files to replicate the functionality of PS2 memory cards. Players can use menu options to create new PS2 files and load existing PS2 files. After loading a PS2 file into a memory card slot and starting their emulator, players can access the PS2 file's data just as they would a standard PS2 memory card's data (from the PS2's Browser screen).",
      "NOTE: Sharkport, a PS2 data transfer accessory, stores players' saved games as files that use the .ps2 extension. These files are not the same as PCSX2 PS2 files. Thus, if your PS2 file does not work with PCSX2 or AetherSX2, it may be a Sharkport PS2 file."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can load a PS2 file into PCSX2 (Windows, Linux) to use the saved game data the file contains. To load a PS2 file with PCSX2:",
      "Place the file in PCSX2's memcards directory.",
      "Open PCSX2 and select Config → Memory Cards.",
      "In the MemoryCard Manager window, drag your PS2 file to a PS2 port.",
      "The next time you boot your BIOS, the virtual memory card your PS2 file contains will appear in PCSX2.",
      "You can also open PS2 files with AetherSX2 on Android devices, but the app is discontinued. To load a PS2 file with AetherSX2:",
      "Open AetherSX2's hamburger menu.",
      "Select Import Memory Card.",
      "Navigate to and load your PS2 file.",
      "The next time you boot your BIOS, the virtual memory card your PS2 file contains will appear in AetherSX2.",
      "Additionally, you can use mymc in Windows to view, manage, or convert the saved game data a PS2 file stores."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "You can use mymc to convert the saved game data a PS2 file contains to the following formats:",
      ".PSU - EMS PS2 Memory Adapter Save",
      "MAX - MAX Drive PS2 Save"
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=6661&b=1"
      },
      {
        "name": "PCSX2",
        "url": "https://fileinfo.com/software/pcsx2/pcsx2"
      },
      {
        "name": "Microsoft Windows",
        "url": "https://fileinfo.com/software/microsoft/windows"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/ps2",
      "retrieved_at": "2025-11-02T02:43:27.020Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.020Z"
}