{
  "slug": "pth",
  "extension": "pth",
  "name": "PyTorch Model",
  "summary": "Learn about .PTH files and view a list of programs that open them.",
  "developer": "Meta",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "PyTorch is a Python-based machine learning library that allows developers to create machine learning models. Developers save PyTorch models using the torch.save(model, PATH) command. Typically, PyTorch models are saved as .PT or PTH files.",
      "PTH files are meant to be used to perform a task. For example, many image upscaling applications use the algorithms that PTH files contain to increase an image's size while retaining its original quality. Typically, these applications will allow you to select and import a PTH file and use the file to perform a task."
    ]
  },
  "how_to_open": {
    "instructions": [
      "PTH files are not meant to be opened. Instead, they are meant to be integrated or imported into an application, where they can be trained further or used to perform a task.",
      "Developers using PyTorch (multiplatform) can load a PTH file using the model = torch.load(PATH) command. Users attempting to import a PTH file into an application should follow that application's instructions for importing a PTH file. For example, Cupscale (Windows) users can import a PTH file using the application's Model 1 and Model 2 selection boxes."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12159&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/pth",
      "retrieved_at": "2025-11-01T22:32:42.708Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.708Z"
}