{
  "slug": "pvmp",
  "extension": "pvmp",
  "name": "Parallels Packed Virtual Machine",
  "summary": "Learn about .PVMP files and view a list of programs that open them.",
  "developer": "Parallels",
  "technical_info": {
    "content": [
      "Parallels Desktop for Mac is virtualization software that allows Mac users to run other operating systems, including Windows, Linux, Android, and additional versions of macOS. When you create a virtual machine (VM) in Parallels Desktop, the program saves it as a PVM file, which is a macOS package that contains the VM's files and settings.",
      "If you want to move a VM to another computer, you can compress it into a PVMP file. A PVMP file is a packed version of a PVM file that reduces its size, making it easier to transfer. This feature is available only in the Pro and Business Editions of Parallels Desktop for Mac.",
      "To create a PVMP file, first shut down your VM. Then, in Control Center, right-click the VM and select Prepare for Transfer. Parallels Desktop will compress the VM, and the resulting PVMP file will be saved in the same location as the original PVM file."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a PVMP file with Parallels Desktop for Mac in macOS. To open a PVMP file in the folder you set as the default location for storing virtual machines (Parallels default location is Macintosh HD/​Users/​[username]/​Documents/​Parallels/​), select File → Open in Parallels Desktop for Mac, and select the PVMP file.",
      "If the virtual machine (VM) is listed as \"Package\" in the Parallels Desktop for Mac Control Center, you can double-click it to unpackage it or right-click the VM and select Open Package."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Parallels Desktop for Mac",
        "url": "https://fileinfo.com/software/parallels/desktop_for_mac"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12867&b=1"
      },
      {
        "name": "Parallels Desktop for Mac 26",
        "url": "https://fileinfo.com/software/parallels/desktop_for_mac"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/pvmp_12867.png",
      "alt": "Screenshot of a .pvmp file in Parallels Desktop for Mac 26",
      "caption": "PVMP file open in Parallels Desktop for Mac 26"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/pvmp",
      "retrieved_at": "2025-11-02T02:43:27.027Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.027Z"
}