{
  "slug": "pxz",
  "extension": "pxz",
  "name": "Pixlr Zipped Layered Image",
  "summary": "Learn about .PXZ files and view a list of programs that open them.",
  "developer": "Inmagine",
  "technical_info": {
    "content": [
      "Pixlr is a primarily web-based suite of image editing applications that graphic designers and photographers use to create and edit images. Pixlr is similar to Adobe Photoshop, except that Pixlr's web version functions entirely within a user's web browser.",
      "If a user wants to save an in-progress Pixlr project to their PC or mobile device, they can save the project as a PXZ file. Saving the project as a PXZ file preserves the layer-based edits the user has made to the image, such as adding text, adjustments, filters, masks, and additional images. This allows the user to continue editing those layers in the future. In contrast, saving a Pixlr project as a .JPG, .PNG., or .WEBP file flattens the image to a single layer.",
      "Each PXZ file is a Zip archive that includes all the files Pixlr uses to load and show layer-based images to users. PXZ files typically contain:",
      ".WEBP copies of every image the project contains, as well as a WEBP preview and thumbnail of the project as a whole",
      "A .JSON file that describes the project's name, type, size, and layers",
      ".WOFF files that specify what font(s) the project uses",
      ".SVG files that describe shapes added to the project",
      "Until early 2021, Pixlr saved layer-based images as PXD files. While Pixlr users can still load PXD files in Pixlr, Pixlr now saves all layer-based images in the PXZ format.",
      "NOTE: Autodesk acquired Pixlr in 2011, then Inmagine acquired Pixlr from Autodesk in 2017."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open PXZ files with Pixlr X or Pixlr E (Web, Windows, Mac). To open a PXZ file in the web version of Pixlr X or Pixlr E:",
      "In your web browser, navigate to https://pixlr.com and select either Pixlr X or Pixlr E from the website's menu bar. Novice image editors should select Pixlr X, while expert editors should select Pixlr E.",
      "Select Open Image.",
      "Navigate to and open your PXZ file.",
      "You can also open PXZ files with Chasys Draw IES in Windows.",
      "Since PXZ files are Zip-compressed, you can extract their contents with a Zip decompression tool. Corel WinZip (Windows), Apple Archive Utility (Mac), and B1 Free Archiver are several options for decompressing your PXZ file and extracting the WEBP images and other files it contains."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Corel WinZip",
        "url": "https://fileinfo.com/software/corel/winzip"
      },
      {
        "name": "Apple Archive Utility",
        "url": "https://fileinfo.com/software/apple/archive_utility"
      },
      {
        "name": "B1 Free Archiver",
        "url": "https://fileinfo.com/software/catalina_group/b1_free_archiver"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11955&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/pxz_11955.png",
      "alt": "Screenshot of a .pxz file in Pixlr E",
      "caption": "PXZ file open in Pixlr E"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/pxz",
      "retrieved_at": "2025-11-02T02:43:27.031Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.031Z"
}