{
  "slug": "qbw",
  "extension": "qbw",
  "name": "QuickBooks for Windows Company File",
  "summary": "Learn about .QBW files and view a list of programs that open them.",
  "developer": "Intuit",
  "technical_info": {
    "content": [
      "Intuit QuickBooks is popular accounting program available both online and for Windows and Mac PCs. When getting started with QuickBooks, users first create a company file. QuickBooks uses this file to store information about the user's company, the entities with which the company does business, and the company's financial transactions.",
      "The Windows version of QuickBooks saves users' company files as QBW files. By default, users' QBW files are stored in the following location:",
      "C:/​Users/​Public/​Public Documents/​Intuit/​QuickBooks/​Company Files",
      "Users can open a QBW file in QuickBooks to view or edit that company's data. They can also use QuickBooks to back up a QBW file, producing a .QBB file. (To open a QBW file in QuickBooks, change its extension to .qbw and then open it as you would normally.)",
      "NOTE: QuickBooks for Mac saves company files as QBYYYY files, where YYYY is the year of the version that created the company file. For example, QuickBooks for Mac 2019 saves company files as QB2019 files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a QBW file with Intuit QuickBooks for Windows. To do so, select File → Open or Restore Company... → Open a company file. Then, follow the on-screen prompts to open your QBW file."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "You can use QuickBooks for Windows to convert a QBW file to a QuickBooks for Mac company file. To do so, follow the conversion instructions detailed in Intuit's official documentation."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=825&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/qbw",
      "retrieved_at": "2025-11-02T02:43:27.036Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.036Z"
}