{
  "slug": "qlv",
  "extension": "qlv",
  "name": "QGIS layerVersion Save File",
  "summary": "Learn about .QLV files and view a list of programs that open them.",
  "developer": "Enrico Ferreguti",
  "technical_info": {
    "content": [
      "QGIS is used by various amateur and professional users to create, edit, visualize, and publish geospatial information. The \"layerVersion\" plugin was developed by Enrico Ferreguti to provide a way to take \"snapshots\" of edits made to layers in QGIS.",
      "The plugin features a minimal user interface. When installed in QGIS, it adds an item under the Vector menu and adds two buttons to the QGIS interface (\"Save layer versions\" and \"Load layer versions\").",
      "When you save your edits for the first time, the plugin creates a QLV file to store the data. When you save them again, the plugin writes over the QLV file.",
      "After saving the QLV file, you can share it with other users that are utilizing the same geospatial database to apply edits to the layers in their QGIS .QGS Project files. Keep in mind that they need to have the \"layerVersion\" plugin installed."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open QLV files with QGIS as long as the \"layerVersion\" plugin is installed. When you load the QLV file the edits stored in the file are replicated on your layers as long as the connected database is consistent.",
      "Since QLV files are saved in XML format, you can also open a QLV file with an XML or text editor to view the contents. Keep in mind that the contents will not appear the same as if they were being viewed with QGIS."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11685&b=1"
      },
      {
        "name": "Microsoft XML Notepad",
        "url": "https://fileinfo.com/software/microsoft/xml_notepad"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/qlv",
      "retrieved_at": "2025-11-02T02:43:27.038Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.038Z"
}