{
  "slug": "real",
  "extension": "real",
  "name": "Aero Experience",
  "summary": "Learn about .REAL files and view a list of programs that open them.",
  "developer": "Adobe Systems",
  "technical_info": {
    "content": [
      "Adobe Aero is an iOS, macOS, and Windows application that allows users to design, animate, experience, and share AR scenes. For example, an iPad user can use Adobe Aero to create a 3D animation of a rocket taking off. The user can then use their iPad's camera to superimpose their rocket animation over an image of their kitchen table and record a movie of the rocket taking off within their kitchen.",
      "The AR scenes users create in Adobe Aero can include 3D images, 2D images, animations, and audio files. When a user wants to save their scene and share it with other Adobe Aero users, they can export the scene as a REAL file.",
      "In the iOS version of Adobe Aero, you can export an experience by selecting Share → Export as → Aero Experience (.real). In the macOS and Windows versions of Adobe Aero, you can export an experience by selecting File → Export from the program's menu bar."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a REAL file in Adobe Aero (iOS, macOS, Windows). To open a REAL file in Adobe Aero for iOS, go to the app's Home screen, select the Import and Open button, and then navigate to and open your REAL file. To open a REAL file in Adobe Aero for macOS and Windows, select File → Import from the program's menu bar, and then navigate to and open your REAL file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12033&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/real_12033.png",
      "alt": "Screenshot of a .real file in Adobe Aero 0.1",
      "caption": "REAL file open in Adobe Aero 0.1"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/real",
      "retrieved_at": "2025-11-02T02:43:27.051Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.051Z"
}