{
  "slug": "rsdk",
  "extension": "rsdk",
  "name": "Retro SDK Archive",
  "summary": "Learn about .RSDK files and view a list of programs that open them.",
  "developer": "SEGA",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "Christian Whitehead initially created the Retro Engine, and SEGA later acquired it to use it in official remakes of classic Sonic the Hedgehog titles. Whitehead designed the engine to replicate the appearance of 2D retro games while supporting modern features and hardware. Additionally, Whitehead also developed the RSDK format to be flexible and efficient in handling complex game data across different platforms and game versions.",
      "RSDK files are typically ZIP-compressed, with the structure and contents varying depending on the version of the Retro Engine the game uses. For example, Sonic CD uses an early version of the format (RSDKv1), while Sonic Mania uses RSDKv5, and newer games like Penny’s Big Breakaway use RSDKv6.",
      "Most players never interact with RSDK files directly. However, modders may extract and modify content from RSDK archives to create new levels, reskin characters, or change game music and sound effects, extending the life of Retro Engine games within the fan community."
    ]
  },
  "how_to_open": {
    "instructions": [
      "RSDK files are not meant to be opened. Instead, the game packaged with the RSDK file automatically references it to load the game content it stores for gameplay purposes.",
      "Game modders may extract RSDK archives to customize game assets or create fan-made content. For example, you can use rsdkunpack and Sonic Mania RSDKv5 Tools to view, modify, or replace game assets in RSDK archives. However, because of the differences in RSDK formats, tools designed to unpack one version may not work with another."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11011&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/rsdk",
      "retrieved_at": "2025-11-01T22:32:42.744Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.744Z"
}