{
  "slug": "sdoc",
  "extension": "sdoc",
  "name": "Samsung Notes Note",
  "summary": "Learn about .SDOC files and view a list of programs that open them.",
  "developer": "Samsung",
  "technical_info": {
    "content": [
      "Samsung Notes is a note-taking app installed on some Samsung smartphones, such as the Samsung Galaxy Note and S7, and other devices. Before 2020, when a user saved a note in Samsung Notes, the note was saved as an SDOC file. Contrary to what you might expect, SDOC files are not text files. Instead, they are Zip-compressed archives that contain the text, image, and other files that make up a note.",
      "In 2020, Samsung replaced the SDOC format with the .SDOCX format. Now, when users open SDOC files in Samsung Notes, the app automatically converts those files into SDOCX files. Users can also manually convert their SDOC files to SDOCX files using the Old format notes → Convert option available in Samsung Notes' settings menu."
    ]
  },
  "how_to_open": {
    "instructions": [
      "On Samsung devices, you can open SDOC files with Samsung Notes. You can also use Notes' Share function to share your SDOC files with Google Drive, which will allow you to open your notes on other Samsung devices.",
      "If you do not have access to Samsung Notes, you can rename your SDOC file to a .ZIP file, decompress it, and view its contents as you would any Zip archive. This will allow you to access the text and media contained within your note and manually reconstruct the note if necessary."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "If you want to share a note you created in Samsung Notes with someone else or open the note outside Samsung Notes, you can covert the note to a .PDF or .DOCX file. To convert an SDOC note to another file format:",
      "Open Samsung Notes and open the note you want to convert to another format.",
      "Select the More options (three vertical dots) menu. Then, select Save as file.",
      "Select the format in which you want to save your note (such as PDF file or Microsoft Word file). Then, specify what location your file should be saved in and select Save."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10932&b=1"
      },
      {
        "name": "7-Zip",
        "url": "https://fileinfo.com/software/igor_pavlov/7-zip"
      },
      {
        "name": "Apple Archive Utility",
        "url": "https://fileinfo.com/software/apple/archive_utility"
      },
      {
        "name": "Microsoft Word with IRM add-on",
        "url": "https://fileinfo.com/software/microsoft/word"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/sdoc",
      "retrieved_at": "2025-11-02T02:43:27.090Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.090Z"
}