{
  "slug": "service",
  "extension": "service",
  "name": "Systemd Service Unit File",
  "summary": "Learn about .SERVICE files and view a list of programs that open them.",
  "developer": "Lennart Poettering and Kay Sievers",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "systemd organizes everything it manages into \"units,\" and a SERVICE file is a type of \"unit\" file. The .service extension tells systemd that the file describes a service, and other unit files may use different extensions, such as .socket for sockets or .target for target groups. System administrators and software packages use SERVICE files to control system services consistently across distributions that use systemd.",
      "By default, system-installed SERVICE files are stored in the following location:",
      "/​lib/​systemd/​system/​",
      "Custom or overridden SERVICE files that an administrator creates are stored in the following location:",
      "/​etc/​systemd/​system/​",
      "NOTE: Many Linux distributions use systemd as their init system, including Red Hat Enterprise Linux, Fedora, CentOS, Ubuntu, Arch Linux, Mageia, and CoreOS."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open and view SERVICE files with any text editor since they are plain text, but you should only edit them when necessary. Most users manage services using systemd commands such as systemctl start, systemctl stop, and systemctl status rather than modifying the files directly.",
      "If you need to change a service's behavior, do not edit the original file in /​lib/​systemd/​system/​. Instead, copy the file to /​etc/​systemd/​system/​, make your changes there, and run systemctl daemon-reload to apply them. This process preserves your customizations during system updates and package upgrades."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10516&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/service",
      "retrieved_at": "2025-11-01T22:32:42.762Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.762Z"
}