{
  "slug": "sketch",
  "extension": "sketch",
  "name": "Sketch Drawing",
  "summary": "Learn about .SKETCH files and view a list of programs that open them.",
  "developer": "Sketch B.V.",
  "technical_info": {
    "content": [
      "Graphic designers use Sketch to design iOS and Android app icons, as well as mobile and web application UIs. Designers create icon and UI mock-ups by drawing using Sketch's vector, pencil, shape, and slice tools. Sketch also includes fill, border, shadow, gradient, blur, mask, and text tools that designers can use to edit and add to their drawings.",
      "When a designer saves a Sketch document locally, the document is saved as a SKETCH file. After a designer finishes their design, they can export the images their SKETCH file contains as .PNG or .PDF files, so users who do not have Sketch can view the design.",
      "NOTE: In Sketch for Mac, designers can save SKETCH documents to web Sketch workspaces, which are used with the web version of Sketch. Sketch for Web does not allow designers to open SKETCH files stored on their local machine, but it does allow designers to download web documents as SKETCH files, so they can open the files in Sketch for Mac."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a SKETCH file in Sketch (Mac). To do so, select File → Open Local Document... from Sketch's menu bar. Then, navigate to and open your SKETCH file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=6540&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/sketch_6540.png",
      "alt": "Screenshot of a .sketch file in Sketch B.V. Sketch 75",
      "caption": "SKETCH file open in Sketch B.V. Sketch 75"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/sketch",
      "retrieved_at": "2025-11-02T02:43:27.104Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.104Z"
}