{
  "slug": "streamdeckaudio",
  "extension": "streamdeckaudio",
  "name": "Stream Deck Audio",
  "summary": "Learn about .STREAMDECKAUDIO files and view a list of programs that open them.",
  "developer": "Elgato",
  "technical_info": {
    "content": [
      "The Elgato Stream Deck is a peripheral device that allows streamers to automate or streamline basic streaming tasks, such as going live, switching windows, or playing music or sound effects. It comes with associated software that, among other things, allows users to access the Stream Deck Store.",
      "From the Stream Deck Store, users can download sound effects and music saved as STREAMDECKAUDIO files. These files are .WAV files that have been modified slightly, such that they work with only the Stream Deck. Thus, you cannot play STREAMDECKAUDIO files in media players (unless you convert them to normal WAV files, as described below)."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can use the Elgato Stream Deck's associated software to open STREAMDECKAUDIO files and associate them with buttons on your Stream Deck. To do so:",
      "Open the Stream Deck app (with your Stream Deck connected to your PC).",
      "Drag the Play Audio action onto a key.",
      "In the Action Property Inspector (which appears below your Stream Deck profile), select the Choose... button.",
      "Browse to and select your STREAMDECKAUDIO file.",
      "Then, finish filling out the fields in the Action Property Inspector. After you do, you'll be able to play your STREAMDECKAUDIO file from your Elgato Stream Deck."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "You can use Stream Deck Audio Deobfuscator (Windows) to convert STREAMDECKAUDIO files to the .WAV (WAVE Audio) format, and vice versa. Note that Stream Deck Audio Deobfuscator is an unofficial, third-party application."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13344&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/streamdeckaudio_13344.png",
      "alt": "Screenshot of a .streamdeckaudio file in Elgato Stream Deck",
      "caption": "STREAMDECKAUDIO file open in Elgato Stream Deck"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/streamdeckaudio",
      "retrieved_at": "2025-11-02T02:43:27.127Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.127Z"
}