{
  "slug": "tax2015",
  "extension": "tax2015",
  "name": "TurboTax 2015 Tax Return",
  "summary": "Learn about .TAX2015 files and view a list of programs that open them.",
  "developer": "Intuit",
  "technical_info": {
    "content": [
      "TurboTax can import data from a previous tax return into a new TAX2015 document. For example, you can select \"Transfer Return\" when prompted at the beginning of the tax return process. If you want to import data from a 2014 TurboTax return, select the file with the .TAX2014 extension. You can import data from TaxACT and H&R Block Tax files as well.",
      "TAX2015 file are saved by the desktop version of TurboTax (for both Mac and Windows). However, they may also be exported from TurboTax Online. To export a TAX2015 file from TurboTax Online, click \"Tools,\" then select \"Save your 2015 return to your computer.\" You can then open the return in the desktop version of TurboTax.",
      "Once you have completed your return in TurboTax, you can either print and mail the tax forms or file the 2015 tax return electronically. The \"e-file\" process is free for federal returns, but is usually a fee to file the state return electronically.",
      "NOTE: Most TAX2015 files are created in 2016 since annual tax returns are filed for the previous year."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10126&b=1"
      },
      {
        "name": "Intuit TurboTax",
        "url": "https://fileinfo.com/software/intuit/turbotax"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/tax2015",
      "retrieved_at": "2025-11-02T02:43:27.142Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.142Z"
}