{
  "slug": "template",
  "extension": "template",
  "name": "Pages Template",
  "summary": "Learn about .TEMPLATE files and view a list of programs that open them.",
  "developer": "Apple",
  "technical_info": {
    "content": [
      "Apple Pages is the default word processor included with macOS. It allows users to create reports, posters, resumes, brochures, and other documents.",
      "Optionally, Pages users can save a document they've created as a Pages template, to make it easier to create similar documents in the future. For example, if a user has created a heavily-formatted brochure, they may want to save that brochure as a Pages template. Then, instead of creating new brochures from scratch, the user can open their template to get started more quickly.",
      "Pages saves document templates as TEMPLATE files. Primarily, users encounter these templates on Pages' Choose a Template screen, when creating a new document. There, Pages shows its default TEMPLATE files, as well as any templates a user has created.",
      "To save a Pages document that you are working on as a Pages template:",
      "Select File → Save as Template....",
      "Select Add to Template Chooser to add the template to your My Templates list.",
      "Alternatively, you can select Save... to save the template to your computer as a TEMPLATE file. You may want to do this if, for example, you want to transfer and use the template in Pages on a device that is not connected to your iCloud account."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To open a TEMPLATE file on a device with Apple Pages installed, either double-click (macOS) or tap (iOS) the file. Apple Pages will then ask whether you want to add the template to your Template Chooser, so you can select it from My Templates in the future, or just create a single new document using the template."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "After opening a TEMPLATE file in the macOS version of Apple Pages, you can convert the document it contains to any of the following formats (by selecting File → Export):",
      ".DOCX, .DOC - Microsoft Word Document",
      ".PDF - Portable Document Format",
      ".EPUB - Open eBook",
      ".RTF, .RTFD - Rich Text Format",
      ".TXT - Plain Text",
      "Pages '09 Document",
      "In the iCloud version of Pages, you can convert the document a TEMPLATE file contains to PDF, DOCX, or EPUB, by selecting the ... button and then Download a Copy...."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Apple Pages",
        "url": "https://fileinfo.com/software/apple/pages"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=5502&b=1"
      },
      {
        "name": "Jigdo",
        "url": "https://www.einval.com/~steve/software/jigdo/"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/template_5502.png",
      "alt": "Screenshot of a .template file in Apple Pages",
      "caption": "TEMPLATE file open in Apple Pages"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/template",
      "retrieved_at": "2025-11-02T02:43:27.148Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.148Z"
}