{
  "slug": "tmap",
  "extension": "tmap",
  "name": "TissUUmaps Project",
  "summary": "Learn about .TMAP files and view a list of programs that open them.",
  "developer": "TissUUmaps Team",
  "technical_info": {
    "content": [
      "Researchers use TissUUmaps to visualize and analyze data from tissue samples. The program was created by a group at Uppsala University in Sweden, and it is available for download online.",
      "To create a TissUUmaps project, researchers first load one or more images saved in one of the program's supported whole slide image formats (such as .TIF, .VMU, .SCN, or .SVSLIDE). They can then apply filters, add markers, and draw regions on each image, to aid them in performing their analysis.",
      "At any time, a user can save their current TissUUmap project as a TMAP file. This file contains a JSON record of the project's imported images, layers and layer properties, filters, regions, and associated plug-ins (plug-ins used while creating the project). The user can later load this file to resume working on their project."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a TMAP file with TissUUmaps (multiplatform). To do so, select File → Open from the program's menu bar. Then, navigate to and select your TMAP file. Note that for your project to appear correctly in TissUUmaps, you must also possess the images the project uses, and they must be stored in the location(s) specified in your TMAP file.",
      "You can also open a TMAP file with Microsoft Visual Studio Code (multiplatform), GitHub Atom (multiplatform), or any other text editor, to view the plain text data it contains."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Microsoft Visual Studio Code",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      },
      {
        "name": "GitHub Atom",
        "url": "https://fileinfo.com/software/github/atom"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13016&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/tmap_13016.png",
      "alt": "Screenshot of a .tmap file in Microsoft Visual Studio Code",
      "caption": "TMAP file open in Microsoft Visual Studio Code"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/tmap",
      "retrieved_at": "2025-11-02T02:43:27.157Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.157Z"
}