{
  "slug": "tmod",
  "extension": "tmod",
  "name": ".TMOD",
  "summary": "Learn about .TMOD files and view a list of programs that open them.",
  "developer": "The tModLoader Team",
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10582&b=1"
      }
    ]
  },
  "how_to_open": {
    "instructions": [
      "To load TMOD files in Terraria, download tModLoader, which is a modding API client used to build and distribute mods for Terraria. After downloading tModLoader, extract the contents in the .ZIP archive to the Terraria installation folder. If you purchased Terraria from Steam, it is most likely located in the following directory:",
      "C:\\​Program Files (x86)\\​Steam\\​SteamApps\\​common\\​Terraria",
      "Then, open Terraria. If tModLoader is correctly installed, Terraria will check for available mods. To download a mod, select \"Mod Browser\" from the main menu, choose a mod, and download the mod. The mod is stored in a TMOD file so once the download is complete, the TMOD file will be present in your \"Mods\" folder in the following location in Windows:",
      "C:\\​Users\\​[username]\\​Documents\\​My Games\\​Terraria\\​Modloader\\​Mods",
      "You can also open the location of your TMOD files from the Terraria main menu by clicking \"Mods\" in the main menu, then selecting \"Open Mods Folder,\" which will display the location of your mods. If you want to install another user's mod, copy the TMOD file and save it in your \"Mods\" folder.",
      "The mods you install are disabled by default. To activate your mods, select \"Mods\" from the main menu in Terraria, choose the mod, then click \"Click to Enable.\"",
      "To extract a TMOD file, select \"Mods\" in the main menu of Terraria, click the \"I\" button surrounded by a box, and then select \"Extract.\" The contents, which may include music, sprite, and configuration files, are then extracted to the following directory where you can access them:",
      "C:\\​Users\\​[username]\\​Documents\\​My Games\\​Terraria\\​Modloader\\​Modreader",
      "NOTE: tModLoader is compatible with Terraria 1.3 and later."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "url": "https://fileinfo.com/extension/tmod",
      "source": "fileinfo.com",
      "retrieved_at": "2025-11-01T20:11:15.330Z"
    }
  ],
  "last_updated": "2025-11-01T20:11:15.330Z"
}