{
  "slug": "tnfp",
  "extension": "tnfp",
  "name": "Tonfotos People Information Database",
  "summary": "Learn about .TNFP files and view a list of programs that open them.",
  "developer": "Andrey Isaev",
  "technical_info": {
    "content": [
      "Andrey Isaev developed Tonfotos to simplify the browsing of extensive collections of photos by making them more searchable based on when and where they were taken, the people appearing in the photos, and other types of unique information. When you tag people in photos, Tonfotos creates a TNFP file to store the information you add about the people.",
      "To tag people in photos, thus storing the information in the TNFP file, open the information panel, click the face of a person, and select This is ... → New person. Tonfotos then creates a new person in the \"People\" section of the app and stores the information in the TNFP file.",
      "NOTE: For Tonfotos to create a TNFP file to store people's information, you need to enable the app by selecting File → Library Locations..., choose the location, then check the \"Store dossier of people\" to the on position. Tonfotos saves the TNFP file next to the photos in the root folder of the photo archive."
    ]
  },
  "how_to_open": {
    "instructions": [
      "TNFP files are not meant to be opened. Instead, Tonfotos references the information in the database to organize and display photos based on people's information in the photo browser."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13530&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/tnfp_13530.png",
      "alt": "Screenshot of a .tnfp file in Tonfotos 1",
      "caption": "TNFP file open in Tonfotos 1"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/tnfp",
      "retrieved_at": "2025-11-02T02:43:27.159Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.159Z"
}