{
  "slug": "tnl",
  "extension": "tnl",
  "name": "Super Mario Maker Course Thumbnail",
  "summary": "Learn about .TNL files and view a list of programs that open them.",
  "developer": "Nintendo",
  "technical_info": {
    "content": [
      "Super Mario Maker is an official Super Mario level creator available for the Wii U. It allows players to create, play, and share Super Mario levels (commonly referred to as courses) with others.",
      "Super Mario Maker saves each of a player's courses in its own specific directory, on their Wii U's hard drive. Most players will never encounter these directories, but modders and other Super Mario Maker enthusiasts can use various utilities to extract and view their Super Mario Maker save data. When they do, they'll see each course saved in its own directory (named course###), which includes the following files:",
      "A CDT file that contains most of the course's data",
      "A BWV file that contains the course's music",
      "Two TNL files that contain course thumbnails",
      "Each TNL file is a .JPG file that includes a proprietary 8-byte file header. If you remove this header, you can view the thumbnail the TNL file contains as you would any JPG file."
    ]
  },
  "how_to_open": {
    "instructions": [
      "While TNL files are not meant to be opened outside Super Mario Maker, you can view the images they contain. To do so:",
      "Use a hex editor, text editor, or the tnl_conv.py script linked below to remove your TNL file's proprietary header.",
      "Rename your TNL file to use the .jpg extension.",
      "Open the renamed file as you would any JPG file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13479&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/tnl",
      "retrieved_at": "2025-11-02T02:43:27.160Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.160Z"
}