{
  "slug": "tno",
  "extension": "tno",
  "name": "TI-Nspire Operating System File",
  "summary": "Learn about .TNO files and view a list of programs that open them.",
  "developer": "Texas Instruments",
  "technical_info": {
    "content": [
      "The TI-Nspire is a graphing calculator used by middle school, high school, and college students. It allows students to plot functions, analyze numerical data, solve complex equations, and perform other mathematical operations.",
      "Periodically, Texas Instruments releases updates for the TI-Nspire's operating system. Students (or their teachers) can use the TI-Nspire's associated desktop software, available for Windows and macOS, to update the calculator's operating system. To do so, they must first download the latest updates, saved as a TNO file, from Texas Instruments' website. Then, they can use the TI-Nspire Software to apply the updates the TNO file contains (as described in the TI-Nspire's guidebook)."
    ]
  },
  "how_to_open": {
    "instructions": [
      "When you use the TI-Nspire Software to update your TI-Nspire's operating system, the software will ask you to select a handheld OS file. At that point, select your TNO file, and then click Install OS. The software will then install the updates your TNO file contains to your calculator."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13513&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/tno",
      "retrieved_at": "2025-11-02T02:43:27.160Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.160Z"
}