{
  "slug": "tpk",
  "extension": "tpk",
  "name": "Tizen Package",
  "summary": "Learn about .TPK files and view a list of programs that open them.",
  "developer": "Samsung",
  "technical_info": {
    "content": [
      "Tizen is a Linux-based operating system most notably used on Samsung Galaxy and Gear smartwatches. Developers who want to create Tizen applications for Galaxy and Gear smartwatches (including watch faces) can do so using Galaxy Watch Studio. Developers who want to create applications for other Tizen devices can do so using Tizen Studio or Tizen extensions for other IDEs, such as Microsoft Visual Studio.",
      "After a developer finishes creating a Tizen application, they must build that program into a TPK, or Tizen package, file. They can then install the TPK file on an appropriate device and run the app it contains. For example, if the TPK file contains a Galaxy Watch face, the developer can deploy it to a Galaxy Watch using Galaxy Watch Studio."
    ]
  },
  "how_to_open": {
    "instructions": [
      "TPK files are meant to be installed and run on appropriate Samsung mobile and smart devices. You can use Galaxy Watch Studio, Tizen Studio, or Microsoft Visual Studio with the Visual Studio Tools for Tizen extension to deploy TPK files to various Samsung devices. These tools also contain a Tizen Emulator, which allows you to run the app your TPK file contains on your PC."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Microsoft Visual Studio",
        "url": "https://fileinfo.com/software/microsoft/visual_studio"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10371&b=1"
      },
      {
        "name": "Microsoft Visual Studio with Visual Studio Tools for Tizen extension",
        "url": "https://fileinfo.com/software/microsoft/visual_studio"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/tpk",
      "retrieved_at": "2025-11-02T02:43:27.162Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.162Z"
}