{
  "slug": "tpz",
  "extension": "tpz",
  "name": "Godot Engine Export Template Archive",
  "summary": "Learn about .TPZ files and view a list of programs that open them.",
  "developer": "Godot",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "When Godot Engine was originally released, it did not come with any export features so developers would have to manually build and compile the appropriate binaries for their target platforms. As a fix to the solution, developers using Godot Engine must download the export templates before they can export their projects to the appropriate package format for the Windows, macOS, Linux, Android, and HTML5 platforms.",
      "The export templates are optimized versions of the game engine without the pre-compiled editing tools for each platform. They consist of folders and files in a TPZ archive that is simply a renamed .ZIP file.",
      "The TPZ file can be downloaded in a web browser by clicking the \"EXPORT TEMPLATES\" link from the \"Download\" page on the Godot website. To install the TPZ file in Godot Engine, select Settings → Install Export Templates, then select the TPZ file. The archive can also be downloaded directly to Godot Engine by selecting Editor → Manage Export Templates, then clicking Download.",
      "Since TPZ files are renamed ZIP files, you can extract and view the contents in the file by renaming the .tpz extension to .zip. Then, extract the contents using a ZIP decompression program, such as Microsoft File Explorer, Apple Archive Utility, or Corel WinZip."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11345&b=1"
      },
      {
        "name": "Calibre",
        "url": "https://fileinfo.com/software/calibre/calibre"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/tpz",
      "retrieved_at": "2025-11-01T22:32:42.814Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.814Z"
}