{
  "slug": "uf2",
  "extension": "uf2",
  "name": "USB Flashing Format",
  "summary": "Learn about .UF2 files and view a list of programs that open them.",
  "developer": "Microsoft",
  "technical_info": {
    "content": [
      "Microsoft MakeCode is a free, open-source platform that allows students to create block- and JavaScript-based programs for use in microcontrollers. For example, students can create their own video games using the MakeCode editor found at arcade.makecode.com. They can then download that video game as a UF2 file, transfer the file to their microcontroller-based video game console, and play the game on their microcontroller.",
      "To transfer a UF2 file to a microcontroller, developers plug their microcontroller into their PC's USB drive. Their PC then recognizes the microcontroller as a flash drive, allowing the developer to drag their UF2 file to the microcontroller and install their MakeCode program."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a UF2 file in one of Microsoft MakeCode's many UF2 editors (Web). The editor you want to open your UF2 file in will likely depend on what type of program the file contains. For example, if your UF2 file was created in the editor available at maker.makecode.com, you should likely open your file in that editor. All Microsoft MakeCode UF2 editors are linked at the UF2 file format's GitHub page.",
      "To install the program a UF2 file contains on a microcontroller, you must first connect the microcontroller to your computer via a USB cable. Your computer should then recognize the microcontroller as a flash drive. After your microcontroller appears as a selectable drive, drag your UF2 file to the drive."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11832&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/uf2_11832.png",
      "alt": "Screenshot of a .uf2 file in Microsoft MakeCode Arcade",
      "caption": "UF2 file open in Microsoft MakeCode Arcade"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/uf2",
      "retrieved_at": "2025-11-02T02:43:27.176Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.176Z"
}