{
  "slug": "vao-patch",
  "extension": "vao-patch",
  "name": "Assetto Corsa Custom Shading File",
  "summary": "Learn about .VAO-PATCH files and view a list of programs that open them.",
  "developer": "N/A",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "Assetto Corsa is an Italian racing simulator that supports VR accessories. Enthusiastic Assetto Corsa players have created several custom applications that allow them to modify and enhance the game, including applications that allow them to add additional shading and lighting effects to tracks and cars. These effects are saved in VAO-PATCH files.",
      "VAO stands for vertex ambient occlusion, which is a technique that can be used to improve shading and lighting effects in games. Players can create VAO-PATCH files using CustomTracksBakery or optiXBakery, load the file into Assetto Corsa using the player-created Content Manager, and apply them to tracks and cars using the Custom Shaders Patch."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To apply a VAO-PATCH file to an Assetto Corsa track or car, you must have installed the player-created Content Manager and the Custom Shaders Patch. Then, you must place your VAO-PATCH file in Assetto Corsa's assettocorsa/​extension/​vao-patches directory. After you do, the VAO patches should be selectable from the Custom Shader Patch's TRACKS VAO menu. For more detailed instructions, refer to this player-created guide."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11907&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/vao-patch",
      "retrieved_at": "2025-11-01T22:32:42.839Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.839Z"
}