{
  "slug": "vbt",
  "extension": "vbt",
  "name": "VidBatch Task List",
  "summary": "Learn about .VBT files and view a list of programs that open them.",
  "developer": "High Motion Software",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "VidBatch is a free Windows program that allows users to resize, watermark, and convert large batches of videos at the same time. For example, if a professional videographer wanted to add a watermark to a large set of videos, they could load the videos in ImBatch, create a task to add the watermark, and then run the task to automatically add the watermark to all their videos.",
      "If a VidBatch user knows they'll want to run a set of tasks on additional videos in the future, they can save their current task list as a VBT file. The user can then load and run the VBT file while processing other videos. For example, if the videographer referenced above knew they wanted to apply their watermark to additional videos in the future, they could save their watermarking task as a VBT file. Then, they could load and run the file whenever they process videos in VidBatch, to quickly add their watermark.",
      "NOTE: VBT files are plain text files that contain a VidBatch task list formatted using XML. If you do not have access to VidBatch but want to view the task list a VBT file contains, you can open the file in any text editor."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a VBT file in VidBatch (Windows). To do so, select the Folder button that appears in VidBatch's toolbar. Then, navigate to and open your VBT file. The tasks your VBT file contains will appear in VidBatch's task list."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12256&b=1"
      },
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Vim",
        "url": "https://fileinfo.com/software/vim/vim"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/vbt_12256.png",
      "alt": "Screenshot of a .vbt file in High Motion Software VidBatch",
      "caption": "VBT file open in High Motion Software VidBatch"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/vbt",
      "retrieved_at": "2025-11-01T22:32:42.840Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.840Z"
}