{
  "slug": "voom",
  "extension": "voom",
  "name": "VOOM Ransomware Encrypted File",
  "summary": "Learn about .VOOM files and view a list of programs that open them.",
  "developer": "N/A",
  "technical_info": {
    "content": [
      "In March 2022, some PC users began reporting their computers had been infected by VOOM ransomware, which is a variant of STOP ransomware. This malware encrypts a user's files (most notably, pictures and documents) and appends them with the .voom extension. It then produces a plain text ransom note named _readme.txt in every folder that contains an infected file.",
      "The ransom note contains an explanation of what has happened to the user's files, as well as how the user can pay a ransom to decrypt their files. The ransom message asks for a ransom of $980, unless the user contacts the ransomer in the first 72 hours after infection, in which case the ransom is halved to $490.",
      "VOOM ransomware is most commonly distributed in programs that appear to be legitimate but are actually adware and malware bundles. If you recently downloaded and installed an unverified program, that may be how VOOM ransomware infected your computer."
    ]
  },
  "how_to_open": {
    "instructions": [
      "If your computer has been infected by VOOM ransomware, the best option to restore your files to their original state is likely to perform a System Restore. Note that performing a System Restore will cause you to lose any data created in the interval between now and your last restore point. Therefore, you may want to back up any data and files created since your last restore point."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12649&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/voom",
      "retrieved_at": "2025-11-02T02:43:27.200Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.200Z"
}