{
  "slug": "vrcw",
  "extension": "vrcw",
  "name": "VRChat World",
  "summary": "Learn about .VRCW files and view a list of programs that open them.",
  "developer": "Unity Technologies",
  "technical_info": {
    "content": [
      "Released in 2017, VRChat allows users to travel to unique worlds and socialize with each other using VR headsets, microphones, and custom avatars. VRChat users can do almost anything, including host virtual dance parties, run Dungeons and Dragons sessions, or explore simulated mountain passes, within a VRChat world.",
      "VRChat world developers create worlds using the Unity game development engine and VRChat's SDK. When a developer has finished creating their world, they can upload it to VRChat as a private world, for use with their friends, or a public world, which will then become available to anyone who uses VRChat. In the process, the world is saved as a VRCW file.",
      "VRChat's developers and community test user-submitted worlds in the VRChat Community Labs, before releasing them to the general public. As of 2020, VRChat users had created over 50,000 worlds.",
      "NOTE: Sometimes, VRChat users steal and re-upload other users' worlds, claiming them as their own creations. This practice is generally frowned upon."
    ]
  },
  "how_to_open": {
    "instructions": [
      "VRCW files are not meant to be manually opened. However, you can extract a VRCW file's assets using Assets Bundle Extractor, uTinyRipper, or DevX-GameRecovery. You can then import those assets into Unity to use them while creating your own VRChat world.",
      "After you've finished editing your VRChat world in Unity, you can upload it to VRChat for use as a VRChat world. To do so, open the VRChat SDK Build Control Panel (VRChat SDK → Show Control Panel → Builder) in Unity. Then select Publish New Build and follow the on-screen instructions to upload your world. (This process will transform your world into a VRCW file.)",
      "To access your VRChat worlds from within VRChat, open the Worlds Menu and select the Mine tab. Your uploaded worlds will appear within the Worlds Menu."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11609&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/vrcw",
      "retrieved_at": "2025-11-02T02:43:27.203Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.203Z"
}