{
  "slug": "wdmon",
  "extension": "wdmon",
  "name": "Wireless Diagnostics Monitor File",
  "summary": "Learn about .WDMON files and view a list of programs that open them.",
  "developer": "Apple",
  "category": "other",
  "containers": [],
  "related": [],
  "technical_info": {
    "content": [
      "Users typically utilize Wireless Diagnostics when they are experiencing difficulties performing Internet-related tasks, such as browsing the web, streaming content, or sending and receiving emails while connected to a Wi-Fi router. After collecting network performance data with Wireless Diagnostics, a user can analyze the data himself or share the results with an IT specialist.",
      "The information stored in a WDMON file is displayed as a graph in Wireless Diagnostics. It includes measurements of the following types of information:",
      "Rate - Transmission rate over time in megabits per second (Mbps).",
      "Quality - Signal-to-noise ratio over time in decibels (dB), with lower quality numbers resulting in devices disconnecting from the router.",
      "Signal - Signal (RSSI) and noise measurements over time, with high signal and low noise measurements indicating optimal performance.",
      "To create a WDMON file with Wireless Diagnostics follow these steps:",
      "Select Window → Performance.",
      "Leave the window open as the program collects data.",
      "Select File → Close.",
      "After closing the window the WDMON file will appear on the desktop."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can only open WDMON data files with Apple Wireless Diagnostics in macOS. To open a WDMON file with Wireless Diagnostics, select File → Open. Alternatively, you can also double-click the WDMON file and it will open automatically in Wireless Diagnostics if the file type is associated with the program."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11563&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/wdmon_11563.png",
      "alt": "Screenshot of a .wdmon file in Apple Wireless Diagnostics 1",
      "caption": "WDMON file open in Apple Wireless Diagnostics 1"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/wdmon",
      "retrieved_at": "2025-11-01T22:32:42.866Z"
    }
  ],
  "last_updated": "2025-11-01T22:32:42.866Z"
}