{
  "slug": "wmv",
  "extension": "wmv",
  "name": "Windows Media Video",
  "summary": "Learn about .WMV files and view a list of programs that open them.",
  "developer": "Microsoft",
  "category": "video",
  "category_slug": "video",
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ],
  "technical_info": {
    "content": [
      "WMV-9 has an 8 bit 4:2:0 internal color format. Like all other popular video compression standards MPEG-1 and H.261, WMV-9 uses a block-based motion compensation and spatial transform scheme. In general, we can say that these standards perform block-by-block motion compensation from the previous reconstructed frame with the help of a 2-D quantity called the motion vector (MV) to signal spatial displacement. The current block is formed with the help of predicting the values from the same size previous reconstructed frame which is displaced from the current position by the motion vector. Eventually, the residual error is calculated as the difference between the motion-compensated predicted block and the actual block. This residual error is transformed using a linear energy-compacting transform then quantized and entropy coded.\n\nQuantized transform coefficients are entropy decoded, de-quantized, and inverse transformed to produce an approximation of the residual error on the decoder side, which is then added to the motion-compensated prediction to generate the reconstruction. The high-level description of the codec is shown in the following image.\n\nThe rest of the section will discuss the new improvements in WMV-9 which differentiate it from the rest of the video coding solutions like MPEG standards. WMV-9 has intra (I), predicted (P), and bi-directionally predicted (B) frames. Intra frames are those which are coded independently and have no dependence on other frames. Predicted frames are frames that depend on one frame in the past. Decoding of a predicted frame can occur only after all reference frames prior to the current frame starting from the most recent (I) frame have been decoded. B frames are frames that have two references—one in the temporal past and one in the temporal future. B frames are transmitted subsequent to their references, which means that B frames are sent out of order to ensure that their references are available at the time of decoding. B frames in WMV-9 are not used as a reference for subsequent frames. This places B frames outside of the decoding loop, allowing shortcuts to be taken during the decoding of B frames without drift or long-term visual artifacts. The above definition of I, P, and B frames holds for both progressive and interlaced sequences.\n\nThe performance of video codecs is compared to their rate-distortion (R-D) plot. It’s a 2-D curve that shows the distortion produced by the compression at a certain bitrate.\n\nWMV-9 has addressed this problem with the introduction of a variety of techniques listed below:\n\nAdaptive block size transformLimited precision transform-setMotion compensationQuantization and dequantizationAdvanced entropy codingLoop filteringAdvanced B frame codingInterlace codingOverlap smoothingLow-rate toolsFading compensation",
      "In 1999, Microsoft introduced the WMV video codec (along with the WMV Screen and WMV Image codecs) as part of the Windows Media framework. The WMV codec is the most well-known codec of the three and is utilized to compress .ASF videos, transforming them into WMV files.",
      "Due to the popularity of Windows, the WMV format became one of the most common video formats in the 2000s. It could be streamed over the Internet and played with various media players, commonly those bundled with Windows.",
      "In addition, YouTube allows users to upload WMV videos, and Windows Media Player's default video file format is WMV. Also, some users may encounter DRM-enabled WMV files downloaded via a commercial video service that they can only play on the device that downloaded it.",
      "However, as Windows Media Player's popularity has waned, and as developers have created cross-platform video file formats that rival WMV files' compression ratio, WMV files have fallen out of favor. As a result, MPEG-4 Video (.MP4) files are now much more popular than WMV files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a WMV file with various media players. In Windows, you can play a WMV video with the bundled Microsoft Media Player and Microsoft Movies & TV players.",
      "Other applications that open WMV files in Windows, macOS, and Linux include VideoLAN VLC media player, Eltima Elmedia Player, and Kodi.",
      "If you do not want to download a program to open a WMV file, you can upload it to Google Drive and view the video in a web browser. If you are a mobile user, you can open WMV files with J2 Interactive MX Player (Android), Videolabs VLC (Android), olimsoft OPlayer (iOS), and VideoLAN VLC for Mobile (iOS)."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "Several video conversion tools, including VideoLAN VLC media player, HandBrake, and Xilisoft Video Converter Ultimate, can convert WMV files to other formats.",
      "For example, VLC media player can convert WMV files to the following video formats:",
      ".MP4 - MPEG-4 Video",
      ".WEBM - WebM Video",
      ".TS - Video Transport Stream",
      ".ASF - Advanced Systems Format"
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Bitberry File Opener",
        "url": "https://www.bitberry.com/file-opener/"
      },
      {
        "name": "Any Video Converter Professional",
        "url": "https://file.org/free-download/any-video-converter-professional"
      },
      {
        "name": "Switch Sound File Converter",
        "url": "https://file.org/free-download/switch-sound-file-converter"
      },
      {
        "name": "PowerDVD",
        "url": "https://file.org/free-download/powerdvd"
      },
      {
        "name": "Free File Converter",
        "url": "https://file.org/free-download/free-file-converter"
      },
      {
        "name": "Any Video Converter",
        "url": "https://file.org/free-download/any-video-converter"
      },
      {
        "name": "VLC Media Player",
        "url": "https://file.org/free-download/videolan-vlc-media-player"
      },
      {
        "name": "GOM Player",
        "url": "https://file.org/free-download/gom-player"
      },
      {
        "name": "RealPlayer",
        "url": "https://file.org/free-download/realplayer"
      },
      {
        "name": "Winamp",
        "url": "https://file.org/free-download/winamp"
      },
      {
        "name": "KMPlayer",
        "url": "https://file.org/free-download/kmplayer"
      },
      {
        "name": "IrfanView",
        "url": "https://file.org/free-download/irfanview"
      },
      {
        "name": "Microsoft Media Player",
        "url": "https://fileinfo.com/software/microsoft/media_player"
      },
      {
        "name": "VideoLAN VLC media player",
        "url": "https://fileinfo.com/software/videolan/vlc_media_player"
      },
      {
        "name": "Eltima Elmedia Player",
        "url": "https://fileinfo.com/software/eltima/elmedia_player"
      },
      {
        "name": "Kodi",
        "url": "https://fileinfo.com/software/xbmc_foundation/kodi"
      },
      {
        "name": "Google Drive",
        "url": "https://fileinfo.com/software/google/drive"
      },
      {
        "name": "J2 Interactive MX Player",
        "url": "https://fileinfo.com/software/j2_interactive/mx_player_for_android"
      },
      {
        "name": "Videolabs VLC",
        "url": "https://fileinfo.com/software/videolabs/vlc_for_android"
      },
      {
        "name": "olimsoft OPlayer",
        "url": "https://fileinfo.com/software/olimsoft/oplayer"
      }
    ]
  },
  "images": [
    {
      "url": "https://assets.file.org/images/fileorg-logo-440x90-4-8b.png",
      "alt": "File.org logo"
    },
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/wmv_117.png",
      "alt": "Screenshot of a .wmv file in VideoLAN VLC media player",
      "caption": "WMV file open in VideoLAN VLC media player"
    }
  ],
  "sources": [
    {
      "source": "file.org",
      "url": "https://file.org",
      "retrieved_at": "2025-11-02T02:43:26.477Z"
    },
    {
      "source": "fileformat.com",
      "url": "https://docs.fileformat.com/video/wmv/",
      "retrieved_at": "2025-11-02T02:43:26.477Z"
    },
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/wmv",
      "retrieved_at": "2025-11-02T02:43:26.477Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.477Z"
}