{
  "slug": "wncry",
  "extension": "wncry",
  "name": "Wana Decrypt0r 2.0 Encrypted File",
  "summary": "Learn about .WNCRY files and view a list of programs that open them.",
  "developer": "N/A",
  "technical_info": {
    "content": [
      "Wana Decrypt0r 2.0 is an updated version of WannaCry (WCry) ransomware. This virus encrypts your files and appends the .wncry extension to them, producing files that look something like filename.docx.wncry. The encryption prevents you from opening the files.",
      "The virus then produces a .TXT ransom note explaining what has happened to your files, as well as how you can pay a ransom to decrypt them. (FileInfo recommends you never pay a ransom to decrypt your files.)",
      "Wana Decrypt0r 2.0 is primarily spread via emails designed to trick a victim into opening a malicious email attachment. The virus is also sometimes spread through fake system updates and torrent websites."
    ]
  },
  "how_to_open": {
    "instructions": [
      "While some WNCRY decryption tools exist, they do not work reliably. The best way to restore your WNCRY files is to perform a system restore on your PC or load uninfected versions of your files from a backup. If you cannot restore your files using a system restore or backup, you may want to try the WNCRY decryption tools linked below."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10567&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/wncry",
      "retrieved_at": "2025-11-02T02:43:27.225Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.225Z"
}