{
  "slug": "xcz",
  "extension": "xcz",
  "name": "Compressed NX Card Image",
  "summary": "Learn about .XCZ files and view a list of programs that open them.",
  "developer": "nicoboss",
  "technical_info": {
    "content": [
      "Custom Nintendo Switch operating systems, such as Atmosphere, and Nintendo Switch emulators, such as yuzu and Ryujinx, allow players to load and play games saved as XCI files. (Provided players also have access to the master keys associated with the files.) However, XCI files often have quite large file sizes, so players sometimes have difficulty sharing XCI files with each other.",
      "To circumvent this issue, nicoboss and other members of the Nintendo Switch community developed the XCZ file format. Using the nsz compression program, Switch players can compress large XCI files into smaller XCZ files. They can share the XCZ files with other players (who can use nsz to restore the files to their original state)."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can use nsz (multiplatform) or Switch Army Knife (Windows) to convert an XCZ file back into an .XCI file. You can then use the XCI file with custom Switch firmware and Switch emulators as you would normally."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13543&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/xcz",
      "retrieved_at": "2025-11-02T02:43:27.247Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.247Z"
}