{
  "slug": "xd",
  "extension": "xd",
  "name": "Adobe XD Document",
  "summary": "Learn about .XD files and view a list of programs that open them.",
  "developer": "Adobe Systems",
  "category": "web",
  "category_slug": "web",
  "related": [
    "3d",
    "3d2",
    "3dm",
    "3ds",
    "3ds-to-dae",
    "3ds-to-dwg",
    "3ds-to-fbx",
    "3ds-to-glb",
    "3ds-to-gltf",
    "3ds-to-obj",
    "3ds-to-pdf",
    "3ds-to-ply",
    "3ds-to-stl",
    "3ds-to-usdz",
    "3mf",
    "3mf-to-3ds",
    "3mf-to-dae",
    "3mf-to-glb",
    "3mf-to-html",
    "3mf-to-obj"
  ],
  "technical_info": {
    "content": [
      "Adobe XD is a design application that UI and UX designers use to prototype website and mobile application frontends. XD allows designers to create basic wireframes and more finalized mockups, which simulate the pages of a website or screens of a mobile application. Each page or screen is typically placed on its own XD artboard.",
      "Designers can use a variety of tools to animate their artboards and link them together. This allows designers to simulate the interactions users will have with a website or application. For example, a designer can place a Log In button on one artboard and link that button to an artboard prototyping their app's Login screen. Then, when the designer opens their prototype in XD's Preview mode, they can click the Log In button to be taken to the Login screen.",
      "XD files are most often used to refine a website or mobile application's UI before developers start developing the site or app. For example, a UI designer might use an XD file to present a proposed website design and workflow to their web development team. Developers often use the assets (images, fonts, and other elements) included in XD files during the development process, to ensure the website or application they create matches their UI designer's prototype."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an XD file in Adobe XD (cross-platform). To do so, select File → Open from Your Computer... from the program's menu bar. Then, navigate to and open your XD file.",
      "Those who do not have access to Adobe XD can open XD files in PSDETCH (web), Photopea (web), or Bohemian Coding Sketch (Mac) to view the artboards and elements their XD file contains.",
      "To convert an XD file to a .PNG, .SVG, .PDF, or .JPG file, you can:",
      "Open your XD file in Adobe XD.",
      "Select File → Export → All Artboards.... from the program's menu bar.",
      "Select the format in which you want to export your artboards. Then, select Export All Artboards."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12017&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/xd_12017.png",
      "alt": "Screenshot of a .xd file in Adobe XD 38.1",
      "caption": "XD file open in Adobe XD 38.1"
    }
  ],
  "sources": [
    {
      "source": "fileformat.com",
      "url": "https://docs.fileformat.com/web/xd/",
      "retrieved_at": "2025-11-02T02:43:26.540Z"
    },
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/xd",
      "retrieved_at": "2025-11-02T02:43:26.540Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:26.540Z"
}