{
  "slug": "xlk",
  "extension": "xlk",
  "name": "Microsoft Excel Backup File",
  "summary": "Learn about .XLK files and view a list of programs that open them.",
  "developer": "Microsoft",
  "technical_info": {
    "content": [
      "Microsoft Excel is a widely-used spreadsheet application that is part of the Microsoft Office suite. It provides a large number of tools for organizing, manipulating, and visualizing data.",
      "When working on spreadsheets with a lot of data it is a good idea to create backups of your data. While Excel provides the AutoRecover feature in case the application crashes, it is important to have backups of your work in case you are no longer able to open the original file or you want to archive the data.",
      "Excel automatically creates an XLK backup of your file when you save a file in the application with the \"Always create backup\" option selected. To turn this option on or off in Excel:",
      "Select Tools → General Options... in the Save As dialog when saving a file",
      "Check the \"Always create backup\" option to create the XLK backup file or uncheck it to stop Excel from creating a backup file",
      "Click OK, choose your save location for the file, and click Save",
      "Excel creates the XLK file in the same location as the location of the file you are saving. However, it does not create the XLK file until you save the original file and it is always one save behind the original file.",
      "Also, Excel names it as Backup of, and then the name of the original file. For example, an XLK backup for a file named Example Spreadsheet.xlsx is named Backup of Example Spreadsheet.xlk."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open XLK files with Microsoft Excel in Windows and macOS. To open an XLK file, select File → Open, navigate to the XLK file, and click Open. After opening the file in Excel, you can save it in a different format, such as XLSX, XLS, .XLSM, or .XLSB.",
      "You can also open XLK files with OpenOffice Calc (cross-platform). However, the application may not fully support the formatting of the spreadsheet."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Microsoft Office",
        "url": "https://fileinfo.com/software/microsoft/office"
      },
      {
        "name": "Microsoft Excel",
        "url": "https://fileinfo.com/software/microsoft/excel"
      },
      {
        "name": "OpenOffice Calc",
        "url": "https://fileinfo.com/software/apache/openoffice"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=476&b=1"
      },
      {
        "name": "Microsoft Excel 365",
        "url": "https://fileinfo.com/software/microsoft/excel"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/xlk",
      "retrieved_at": "2025-11-02T02:43:27.250Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.250Z"
}