{
  "slug": "ytt",
  "extension": "ytt",
  "name": "YouTube Timed Text File",
  "summary": "Learn about .YTT files and view a list of programs that open them.",
  "developer": "YouTube",
  "technical_info": {
    "content": [
      "The YTT format is used internally by YouTube to add stylized subtitle text to videos played on YouTube. Some subtitle features supported by the YTT format, include text coloring and transparency, glowing text or drop shadow text, text positioning, font styles, background appearance, and karaoke timing.",
      "Users who publish videos to YouTube can manually enter subtitle text directly in the YouTube Studio dashboard on YouTube or they can upload a subtitle file, such as an .SRT, .SUB, .LRC, .RT, .SMI, or .VTT file. However, only the text is displayed when using one of these methods, not the applied styles.",
      "To add subtitles with stylized text, users convert subtitle files, such as .ASS files created with Aegisub subtitle software, to YTT files with the YTSubConverter program. To do this, open the supported subtitle file in YTSubConverter and click Convert to create the YTT file. Then, upload the YTT file through the YouTube Studio dashboard to add it to a video.",
      "Since the YTT format is not meant for public use, YTT files are rather obscure. Therefore, you will most likely only encounter a YTT file if you create the file or if the file is shared with you by another YouTube user looking to add stylized text.",
      "NOTE: Subtitle styles configured in YTT files may appear differently in the various types of YouTube apps, such as web, Android, and iOS."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11389&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/ytt",
      "retrieved_at": "2025-11-02T02:43:27.266Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.266Z"
}