{
  "slug": "yyp",
  "extension": "yyp",
  "name": "GameMaker Studio 2 Project",
  "summary": "Learn about .YYP files and view a list of programs that open them.",
  "developer": "YoYo Games",
  "technical_info": {
    "content": [
      "GameMaker Studio 2 is a multiplatform video game development engine published by YoYo Games. It allows developers to create 2D video games, via drag-and-drop programming and the GameMaker scripting language.",
      "Each GameMaker Studio 2 development project is saved in its own project-specific directory. Project directories contain a YYP file and several sub-directories, in which the project's sprites, sounds, settings, rooms, and other data files reside.",
      "To open a project in GameMaker Studio 2, users select and open that project's YYP file. GameMaker Studio 2 then uses the references the YYP file contains to load the project and its assets. (Thus, if you have moved or deleted an asset, your project may not open correctly.)",
      "In some cases, you may need to replace a missing or corrupted YYP file, so you can open your game project in GameMaker Studio 2. The program YYP Maker can generate a new YYP file for a GameMaker Studio 2 development project, provided you have access to that project's directory and all its included sub-directories and assets.",
      "NOTE: In version 2.3, GameMaker began saving YYP files in an updated format. Thus, YYP files created by versions 2.3 and above of GameMaker cannot be opened in versions 2.2 and below."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a YYP file (and its associated GameMaker Studio project) with YoYo Games GameMaker (formerly known as GameMaker Studio 2). To do so, open GameMaker and select the Open button located on the program's Start Page. Then, navigate to and open your YYP file.",
      "If necessary, you can also open a YYP file with Microsoft Visual Studio Code or any other text editor. Doing so will allow you to view the project metadata and references your YYP file contains."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Microsoft Visual Studio Code",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13507&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/yyp",
      "retrieved_at": "2025-11-02T02:43:27.266Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.266Z"
}