{
  "slug": "zbt",
  "extension": "zbt",
  "name": "Zbots Bots Discord Bot",
  "summary": "Learn about .ZBT files and view a list of programs that open them.",
  "developer": "Zbots Bots",
  "technical_info": {
    "content": [
      "Discord is a text, voice, and video chat program that provides gamers and other social communities with a place to hang out online. Discord contains a series of public and private servers organized by topic, which users can join to chat with their friends, host a virtual game night, or discuss specialized subjects.",
      "Advanced users can create and add bots to their Discord servers. These bots perform various functions, such as automatically welcoming new members to a server, moderating content, and rewarding a server's most active members. Zbots Bots is a company that develops and sells Discord bots. The company provides a copy of the code their bots contain to their clients; the copies are saved as ZBT files.",
      "Because ZBT files do not contain the token used to authorize a Zbots Bots Discord bot, you cannot use a ZBT file alone to host and run the bot the file describes. You can, however, copy the ZBT file's code and use it while creating your own Discord bot."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a ZBT file in any text or source code editor. Doing so will allow you to view and edit the code your ZBT file contains. Source code editors, such as Microsoft Visual Studio Code (cross-platform), contain tools that will help you edit your ZBT file more efficiently."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Microsoft Visual Studio Code",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12279&b=1"
      },
      {
        "name": "GitHub Atom",
        "url": "https://fileinfo.com/software/github/atom"
      },
      {
        "name": "GNU Emacs",
        "url": "https://fileinfo.com/software/gnu/emacs"
      },
      {
        "name": "Vim",
        "url": "https://fileinfo.com/software/vim/vim"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/zbt",
      "retrieved_at": "2025-11-02T02:43:27.267Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.267Z"
}