{
  "slug": "zdoc",
  "extension": "zdoc",
  "name": "Zoho Writer Shortcut",
  "summary": "Learn about .ZDOC files and view a list of programs that open them.",
  "developer": "Zoho",
  "technical_info": {
    "content": [
      "Zoho is an Indian software company that specializes in providing cloud-based business and productivity tools. This tool suite includes Zoho Writer, a cloud-based word processing application, and Zoho WorkDrive (formerly Docs), a file management application.",
      "Optionally, users can sync their Zoho WorkDrive files to their PC, using the WorkDrive Sync or WorkDrive TrueSync desktop applications. When they do, their Zoho Writer documents (and other Zoho Office documents) are not actually saved to their desktop PC. Instead, the WorkDrive Sync apps create a set of ZDOC files. These files contain shortcuts that WorkDrive Sync uses to open corresponding Writer documents online (when a user double-clicks a ZDOC file).",
      "Because ZDOC files contain only a shortcut to a document, and not the document itself, sharing them with another user will not give that user access to the document. If you want to share a Zoho Writer document with another user, use the Share button found within Zoho Writer. Additionally, moving or copying a ZDOC file outside Sync or TrueSync will break the shortcut it contains."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To open the Zoho Writer document to which a ZDOC file points, double-click the ZDOC file from within Zoho WorkDrive Sync or WorkDrive TrueSync. If the shortcut the ZDOC file contains is valid, the associated document will open in Zoho Writer."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13345&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/zdoc",
      "retrieved_at": "2025-11-02T02:43:27.268Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.268Z"
}