{
  "slug": "zwi",
  "extension": "zwi",
  "name": "Zipped Wiki Article",
  "summary": "Learn about .ZWI files and view a list of programs that open them.",
  "developer": "S.V. Chekanov",
  "technical_info": {
    "content": [
      "S.V. Chekanov developed and implemented the ZWI format in 2021 in the SandBox portal for the HandWiki encyclopedia. Other programs, including the DokuWiki open-source wiki app and Encycloreader web app, also adopted support for the format to allow users to transfer wiki articles more easily.",
      "ZWI files consist of various files in a Zip-compressed archive. The files typically include:",
      "An article.wikitext or article.dokuwiki file - Stores wikitext for the article's final version.",
      "An article.html file - HTML version of the article (including the headers) for viewing with a web browser.",
      "An article.xhtml file (optional) - Contains the HTML portion with the article content (without headers, navigation, etc.).",
      "An article.tex file (optional) - Stores the article in the LaTeX file format.",
      "Various .JSON files - Includes metadata.json (stores information about the article, such as editors and revisions), media.json (stores a list of linked images from the article, and optional signature.json and plugins.json files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open ZWI files with various wiki sites, such as HandWiki and Encyclosphere (developed by the Knowledge Standards Foundation). The open-source app DokuWiki can also open ZWI files.",
      "Since ZWI files are Zip-compressed, you can open them with a zip-compression utility, such as Windows File Explorer, Apple Archive Utility (Mac), or Corel WinZip (Windows). You may need to rename the .zwi file extension to .zip for the decompression utility to recognize the format."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Apple Archive Utility",
        "url": "https://fileinfo.com/software/apple/archive_utility"
      },
      {
        "name": "Corel WinZip",
        "url": "https://fileinfo.com/software/corel/winzip"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13622&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/zwi",
      "retrieved_at": "2025-11-02T02:43:27.274Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.274Z"
}