{
  "slug": "~",
  "extension": "~",
  "name": "Yandex Partially Downloaded File",
  "summary": "Learn about .~ files and view a list of programs that open them.",
  "developer": "Yandex",
  "technical_info": {
    "content": [
      "Yandex is a Russian technology company that provides various services and software, including a search engine and a web browser. The Yandex web browser is available for Windows, Mac, Linux, Android, and iOS devices.",
      "When a Yandex browser user downloads a file from the internet, they may see a ~ file in their Downloads folder. This file contains the portion of the file that Yandex has downloaded so far. If the user pauses the download or the download is interrupted, the ~ file will remain in the user's Downloads folder. Otherwise, the Yandex browser will automatically replace the .~ file extension with the downloaded file's actual extension after the download finishes.",
      "NOTE: ~ files are similar to the .CRDOWNLOAD, .DOWNLOAD, and .PART download placeholder files created by other web browsers."
    ]
  },
  "how_to_open": {
    "instructions": [
      "~ files (tilde files) are not meant to be opened. If your ~ file represents a paused or interrupted download, you can double-click or double-tap the file to resume that download (provided you have the Yandex browser installed).",
      "However, if you cannot resume your download, you may still be able to recover the partially downloaded file your ~ file contains. To do so, rename your ~ file to the actual extension (e.g., rename an .MP4 file with the .mp4 file extension) and then attempt to open the file with an appropriate program."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13525&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ],
  "sources": [
    {
      "source": "fileinfo.com",
      "url": "https://fileinfo.com/extension/~",
      "retrieved_at": "2025-11-02T02:43:27.274Z"
    }
  ],
  "last_updated": "2025-11-02T02:43:27.274Z"
}