{
  "type": "multipart",
  "subtype": "header-set",
  "full": "multipart/header-set",
  "extensions": [],
  "sources": [
    {
      "source": "mime-db",
      "url": "https://www.npmjs.com/package/mime-db"
    },
    {
      "source": "iana",
      "url": "https://www.iana.org/assignments/media-types/media-types.xhtml"
    },
    {
      "source": "apache",
      "url": "https://svn.apache.org/repos/asf/httpd/httpd/trunk/docs/conf/mime.types"
    },
    {
      "source": "nginx",
      "url": "https://hg.nginx.org/nginx/raw-file/default/conf/mime.types"
    },
    {
      "source": "mime-db",
      "url": "https://www.npmjs.com/package/mime-db"
    }
  ],
  "iana": {
    "template_url": "https://www.iana.org/assignments/media-types/multipart/header-set",
    "encoding_considerations": "Security considerations:        See separate section in the\n                                document.\n\nPublished specification:        Contained in the following\n                                section.",
    "security_considerations": "document.\n\nPublished specification:        Contained in the following\n                                section.",
    "template_text": "Internet Draft                              Silicon Graphics, Inc.\nExpiration <4/94>                                   5 October 1993\n                                \n                                \n                                \n                                \n                                \n                    MIME Multipart/Header-Set\n\n\n                 draft-crocker-headerset-00.txt\n                                \n                                                                \n\n\n\nSTATUS OF THIS MEMO\n\nThis document is an Internet Draft.  Internet Drafts are working\ndocuments of the Internet Engineering Task Force (IETF), its\nAreas, and its Working Groups.  (Note that other groups may also\ndistribute working documents as Internet Drafts).\n\nInternet Drafts are draft documents valid for a maximum of six\nmonths. Internet Drafts may be updated, replaced, or obsolete by\nother documents at any time.  It is not appropriate is use\nInternet Drafts as reference material or to cite them other than\nas a \"working draft\" or \"work in progress.\"\n\nPlease check the Internet Draft abstract listing contained in the\nIETF Shadow Directories (cd internet-drafts) to learn the current\nstatus of this or any other Internet Draft.\n\n\n\nSUMMARY\n\nData often are aggregated with an initial set of descriptor\ninformation, followed by some number of user data portions.  This\nspecification formalizes the occurrences of such aggregations as\na MIME Multipart Content-type.  It is intended that MIME\nprocessors which are aware of the Header-Set construct will be\nable to process the user data portions, even when they do not\nunderstand the specific header (or descriptor) information which\nbegins the set.\n\n\n\n\nD. Crocker                                                       1\n\n\nInternet Draft        Multipart/Header-Set    (Expiration:  4/94)\n\n\nTABLE OF CONTENTS\n\n1.        INTRODUCTION\n2.        Header-Set Content-Subtype Usage in MIME\n3.        Header-Set Specification\n4.        Header-Set Examples\n7.        REFERENCES\n8.        SECURITY CONSIDERATIONS\n9.        ACKNOWLEDGMENTS\n10.       CONTACT\n\n\n\n1.  INTRODUCTION\n\nData often are aggregated with an initial set of descriptor\ninformation, followed by some number of user data portions.  Such\naggregations derive from a specialized environment, such as a\nparticular operating system file structure, or a tailored\ncommunication environment, such as privacy enhanced mail.  In\nparticular, one portion of the data contains all of the data\nspecial to that environment and the remainder is regular user-\ndata, possibly of a type registered within MIME [BORE92].\n\nThis specification formalizes the occurrences of such\naggregations as a MIME Multipart Content-type.  It dictates that\nthe descriptor header information shall occur as the first MIME\nbody-part at the beginning of the Multipart set, and is then\nfollowed by one or more MIME body-parts containing user data.\n\nIt is intended that MIME processors which are aware of the Header-\nSet construct will be able to process the user data portions,\neven when they do not understand the specific header (or\ndescriptor) information which begins the set.  As an example, a\nrecipient on one operating system may still be able to identify\nand process the user-data portion(s) even when the specific\nheader descriptor is intended for an entirely different and\nunrelated operating system.  In addition, specifications for MIME\nusage which conform to this model will not need to define two\nMIME types, one for the Multipart containing \"bucket\" and one for\nthe specific Application label to distinguish the portion\ncontaining application-specific data.\n\n\n\n\nD. Crocker                                                       2\n\n\nInternet Draft        Multipart/Header-Set    (Expiration:  4/94)\n\n\n2.  Header-Set Content-Subtype Usage in MIME\n\nHeader-set information is specified by:\n\nMIME type name:                 MULTIPART\n\nMIME subtype name:              HEADER-SET\n\nRequired parameters:            Any pertaining to MULTIPART/Mixed\n\nOptional parameters:            Any pertaining to MULTIPART/Mixed\n\nEncoding considerations:        none\n\nSecurity considerations:        See separate section in the\n                                document.\n\nPublished specification:        Contained in the following\n                                section.\n\nRationale:\n       \n       Permits recipients to process user-data even when they\n       cannot process the more specialized header descriptor\n       information.  Also, reduces the number of registered MIME\n       Content-types, since those which conform to this model\n       need to register only an Application sub-type and are not\n       also required to register a Multipart subtype.\n\nContact-info:                   See Contact section, below.\n\nDetail specific to MIME-based usage:\n       \n       Provides for a MULTIPART MIME body-part which declares\n       that the first sub-part in the MULTIPART shall contain a\n       header which provides descriptive information about the\n       one or more remaining sub-parts in that MULTIPART.  It is\n       expected that the first sub-part will typically be an\n       Content-type:Application sub-type.\n\n\n\n3.  Header-Set Specification\n\nA MIME Content-Type:Multipart/Header-Set body part is a distinct\nsection of a message and contains two, or more, sub-parts within\nin.  The first sub-part is the header and any following sub-parts\ncompose the set of user data associated with that header.\n\nD. Crocker                                                       3\n\n\nInternet Draft        Multipart/Header-Set    (Expiration:  4/94)\n\n\nTypically, the header sub-part will be a registered Content-\nType:Application sub-type, but this is not required.\n\nThe Content-Type:Application subtype will declare the \"context\"\nand base of interpretation for processing the MULTIPART body-part\nin its entirety.  However, the user data body-parts may also be\nprocessed separately, to the extent that the receiver understands\nthe individual MIME subparts.\n\n\n\n4.  Header-Set Examples\n\nAssume that a user is sending data from the FOO file system, with\nits file-system specific information registered as\nApplication/Filesys-FOO, and the user data containing US-ASCII\ntext:\n\n\nTo:\nSubject:\nFrom:\nDate:\nMime-Version: 1.00\nContent-Type: MULTIPART/HEADER-SET; boundary=Boundary-1\n\n--Boundary-1\nContent-Type:    APPLICATION/Filesys-FOO\n\n(Descriptive information specific to the FOO file system's\nstorage of the following user data.)\n\n--Boundary-1\nContent-Type:    TEXT/plain\n\n(Regular text user-data)\n\n--Boundary-1--\n\n\n7.  REFERENCES\n\n[BORE92]    Borenstein, N. & Freed, N., \"MIME\n            (Multipurpose Internet Mail Extensions):  Mechanisms\n            for specifying and describing the format of Internet\n            Message Bodies.  March, 1992, Network Information\n            Center, RFC 1341.\n\n\nD. Crocker                                                       4\n\n\nInternet Draft        Multipart/Header-Set    (Expiration:  4/94)\n\n\n8.  SECURITY CONSIDERATIONS\n\nSpecific header parts may contain security-related information.\nTo the extent that Header-set facilitates the transmission of\noperating-system sensitive data, it may open a door for easier\nrelaxation of security rules than is intended either by the\nsender or the administrator of the sender's system.\n\n\n\n9.   ACKNOWLEDGMENTS\n\nHeader-Set developed from the continuing 882ext working group\ndiscussions.\n\n\n\n10.  CONTACT\n\nname:     David H. Crocker;\nwork      <email:  dcrocker&sgi.com;\n          org:     Silicon Graphics, Inc.;\n          street:  2011 N. Shoreline Blvd.;\n          box:     7311;\n          geo:     Mountain View / CA / US;    code: 94039-7311;\n          phone:   +1 415 390 1804;          fax: +1 415 962 8404>\n\n\nD. Crocker                                                       5\n\n\n"
  },
  "references": []
}