{
  "type": "multipart",
  "subtype": "signed",
  "full": "multipart/signed",
  "extensions": [],
  "sources": [
    {
      "source": "mime-db",
      "url": "https://www.npmjs.com/package/mime-db"
    },
    {
      "source": "iana",
      "url": "https://www.iana.org/assignments/media-types/media-types.xhtml"
    },
    {
      "source": "apache",
      "url": "https://svn.apache.org/repos/asf/httpd/httpd/trunk/docs/conf/mime.types"
    },
    {
      "source": "nginx",
      "url": "https://hg.nginx.org/nginx/raw-file/default/conf/mime.types"
    },
    {
      "source": "mime-db",
      "url": "https://www.npmjs.com/package/mime-db"
    }
  ],
  "iana": {
    "template_url": "https://www.iana.org/assignments/media-types/multipart/signed",
    "template_text": "(per RFC1847)\n\n(1)  MIME type name: multipart\n\n(2)  MIME subtype name: signed\n\n(3)  Required parameters: boundary, protocol, and micalg\n\n(4)  Optional parameters: none\n\n(5)  Security considerations: Must be treated as opaque while in\n     transit\n\nThe multipart/signed content type contains exactly two body parts.\nThe first body part is the body part over which the digital signature\nwas created, including its MIME headers.  The second body part\ncontains the control information necessary to verify the digital\nsignature.  The first body part may contain any valid MIME content\ntype, labeled accordingly.  The second body part is labeled according\nto the value of the protocol parameter.\n\nThe attribute token for the protocol parameter is \"protocol\", i.e.,\n\n parameter := \"protocol\" \"=\" value\n\nThe value token is comprised of the type and sub-type tokens of the\nContent-Type: header of the second body part, i.e.,\n\n value := <\"> type \"/\" subtype <\">\n\nwhere the type and subtype tokens are defined by the MIME [2]\nspecification.  The semantics of the protocol parameter are defined\naccording to its value.\n\nThe attribute token for the micalg parameter is \"micalg\", i.e.,\n\n parameter := \"micalg\" \"=\" value\n\nThe Message Integrity Check (MIC) is the name given to the quantity\ncomputed over the body part with a message digest or hash function,\nin support of the digital signature service.  Valid value tokens are\ndefined by the specification for the value of the protocol parameter.\nThe value may be a comma (\",\") separated list of tokens, indicating\nthe use of multiple MIC algorithms.  As a result, the comma (\",\")\ncharacter is explicitly excluded from the list of characters that may\nbe included in a token used as a value of the micalg parameter.  If\nmultiple MIC algorithms are specified, the purpose and use of the\nmultiple algorithms is defined by the protocol.  If the MIC algorithm\nis also specified in the control information and the value there does\nnot agree with the value in this parameter, it must be treated as an\nerror.\n\n NOTE: The presence of the micalg parameter on the\n multipart/signed content type header is explicitly intended to\n support one-pass processing.  MIME implementations may locate\n the second body part by inputting the first body part and\n computing the specified MIC values until the boundary\n identifying the second body part is found.\n\nThe entire contents of the multipart/signed container must be treated\nas opaque while it is in transit from an originator to a recipient.\nIntermediate message transfer agents must not alter the content of a\nmultipart/signed in any way, including, but not limited to, changing\nthe content transfer encoding of the body part or any of its\nencapsulated body parts.\n\nThe signature in a multipart/signed only applies to the material that\nis actually within the multipart/signed object.  In particular, it\ndoes not apply to any enclosing message material, nor does it apply\nto entities that are referenced (e.g. via a MIME message/external-\nbody) by rather than included in the signed content.\n\nWhen creating a multipart/signed body part, the following sequence of\nsteps describes the processing necessary.  It must be emphasized that\nthese steps are descriptive, not prescriptive, and in no way impose\nrestrictions or requirements on implementations of this\nspecification.\n\n(1)  The content of the body part to be protected is prepared\n     according to a local convention.  The content is then\n     transformed into a MIME body part in canonical MIME format,\n     including an appropriate set of MIME headers.\n\n     In addition, if the multipart/signed object is EVER to be\n     transferred over the standard Internet SMTP infrastructure, the\n     resulting MIME body is constrained to 7 bits -- that is, the use\n     of material requiring either 8bit or binary\n     content-transfer-encoding is NOT allowed.  Such 8bit or binary\n     material MUST be encoded using either the quoted-printable or\n     base64 encodings.\n\n     This requirement exists because it is not generally possible,\n     given the current characteristics of Internet SMTP, for a\n     message originator to guarantee that a message will travel only\n     along paths capable of carrying 8bit or binary material.\n\n     SMTP clients normally have the option of either converting the\n     message to eliminate the use of 8bit or binary encoding or\n     returning a nondelivery notification to the originator.\n     However, conversion is not viable in the case of signed objects\n     since conversion would necessarily invalidate the signature.\n     This leaves a nondelivery notification as the only available\n     option, which is not acceptable.\n\n(2)  The body part (headers and content) to be digitally signed is\n     prepared for signature according to the value of the protocol\n     parameter.  The MIME headers of the signed body part are\n     included in the signature to protect the integrity of the MIME\n     labeling of the data that is signed.\n\n(3)  The prepared body part is made available to the signature creation\n     process according to a local convention.  The signature creation\n     process must make available to a MIME implementation two data\n     streams: the control information necessary to verify the\n     signature, which the MIME implementation will place in the second\n     body part and label according to the value of the protocol\n     parameter, and the digitally signed body part, which the MIME\n     implementation will use as the first body part.\n\nWhen receiving a multipart/signed body part, the following sequence\nof steps describes the processing necessary to verify the signature\nor signatures.  It must be emphasized that these steps are\ndescriptive, not prescriptive, and in no way impose restrictions or\nrequirements on implementations of this specification.\n\n(1)  The first body part and the control information in the second body\n     part must be prepared for the signature verification process\n     according to the value of the protocol parameter.\n\n(2)  The prepared body parts must be made available to the signature\n     verification process according to a local convention.  The\n     signature verification process must make available to the MIME\n     implementation the result of the signature verification and the\n     body part that was digitally signed.\n\n         NOTE: The result of the signature verification is likely to\n         include a testament of the success or failure of the\n         verification.  Also, in the usual case, the body part\n         returned after signature verification will be the same as\n         the body part that was received.  We do not insist that\n         this be the case to allow for protocols that may modify the\n         body part during the signature processing.\n\n(3)  The result of the signature verification process is made available\n     to the user and the MIME implementation continues processing with\n     the verified body part, i.e., the body part returned by the\n     signature verification process.\n\nThe following example is an illustration of a multipart/signed body\npart.  It is necessarily incomplete since the control information is\ndefined by the security protocol, which must be specified in a\nseparate document.\n\n Content-Type: multipart/signed; protocol=\"TYPE/STYPE\";\n         micalg=\"MICALG\"; boundary=\"Signed Boundary\"\n\n --Signed Boundary\n Content-Type: text/plain; charset=\"us-ascii\"\n\n This is some text to be signed although it could be\n any type of data, labeled accordingly, of course.\n\n --Signed Boundary\n Content-Type: TYPE/STYPE\n\n CONTROL INFORMATION for protocol \"TYPE/STYPE\" would be here\n\n --Signed Boundary--"
  },
  "references": []
}