[
  {
    "id": "av1",
    "role": "decoder",
    "content": "AOMedia Video 1 (AV1) decoder.\n\n## Options\n\n\n\n- operating_point\nSelect an operating point of a scalable AV1 bitstream (0 - 31). Default is 0."
  },
  {
    "id": "hevc",
    "role": "decoder",
    "content": "HEVC (AKA ITU-T H.265 or ISO/IEC 23008-2) decoder.\n\nThe decoder supports MV-HEVC multiview streams with at most two views. Views to\nbe output are selected by supplying a list of view IDs to the decoder (the\nview_ids option). This option may be set either statically before\ndecoder init, or from the `get_format()` callback - useful for the case\nwhen the view count or IDs change dynamically during decoding.\n\nOnly the base layer is decoded by default.\n\nNote that if you are using the `ffmpeg` CLI tool, you should be using view\nspecifiers as documented in its manual, rather than the options documented here.\n\n## Options\n\n\n\n- view_ids (MV-HEVC)\nSpecify a list of view IDs that should be output. This option can also be set to\na single '-1', which will cause all views defined in the VPS to be decoded and\noutput.\n\n- view_ids_available (MV-HEVC)\nThis option may be read by the caller to retrieve an array of view IDs available\nin the active VPS. The array is empty for single-layer video.\n\nThe value of this option is guaranteed to be accurate when read from the\n`get_format()` callback. It may also be set at other times (e.g. after\nopening the decoder), but the value is informational only and may be incorrect\n(e.g. when the stream contains multiple distinct VPS NALUs).\n\n- view_pos_available (MV-HEVC)\nThis option may be read by the caller to retrieve an array of view positions\n(left, right, or unspecified) available in the active VPS, as\n`AVStereo3DView` values. When the array is available, its elements apply to\nthe corresponding elements of view_ids_available, i.e.\n`view_pos_available[i]` contains the position of view with ID\n`view_ids_available[i]`.\n\nSame validity restrictions as for view_ids_available apply to\nthis option."
  },
  {
    "id": "rawvideo",
    "role": "decoder",
    "content": "Raw video decoder.\n\nThis decoder decodes rawvideo streams.\n\n## Options\n\n\n- top top_field_first\nSpecify the assumed field type of the input video.\n\n- -1\nthe video is assumed to be progressive (default)\n- 0\nbottom-field-first is assumed\n- 1\ntop-field-first is assumed"
  },
  {
    "id": "libdav1d",
    "role": "decoder",
    "content": "dav1d AV1 decoder.\n\nlibdav1d allows libavcodec to decode the AOMedia Video 1 (AV1) codec.\nRequires the presence of the libdav1d headers and library during configuration.\nYou need to explicitly configure the build with `--enable-libdav1d`.\n\n## Options\n\nThe following options are supported by the libdav1d wrapper.\n\n\n\n- max_frame_delay\nSet max amount of frames the decoder may buffer internally. The default value is 0\n(autodetect).\n\n- filmgrain\nApply film grain to the decoded video if present in the bitstream. Defaults to the\ninternal default of the library.\nThis option is deprecated and will be removed in the future. See the global option\n`export_side_data` to export Film Grain parameters instead of applying it.\n\n- oppoint\nSelect an operating point of a scalable AV1 bitstream (0 - 31). Defaults to the\ninternal default of the library.\n\n- alllayers\nOutput all spatial layers of a scalable AV1 bitstream. The default value is false."
  },
  {
    "id": "libdavs2",
    "role": "decoder",
    "content": "AVS2-P2/IEEE1857.4 video decoder wrapper.\n\nThis decoder allows libavcodec to decode AVS2 streams with davs2 library."
  },
  {
    "id": "libuavs3d",
    "role": "decoder",
    "content": "AVS3-P2/IEEE1857.10 video decoder.\n\nlibuavs3d allows libavcodec to decode AVS3 streams.\nRequires the presence of the libuavs3d headers and library during configuration.\nYou need to explicitly configure the build with `--enable-libuavs3d`.\n\n## Options\n\nThe following option is supported by the libuavs3d wrapper.\n\n\n\n- frame_threads\nSet amount of frame threads to use during decoding. The default value is 0 (autodetect)."
  },
  {
    "id": "libxevd",
    "role": "decoder",
    "content": "eXtra-fast Essential Video Decoder (XEVD) MPEG-5 EVC decoder wrapper.\n\nThis decoder requires the presence of the libxevd headers and library\nduring configuration. You need to explicitly configure the build with\n--enable-libxevd.\n\nThe xevd project website is at https://github.com/mpeg5/xevd.\n\n## Options\n\nThe following options are supported by the libxevd wrapper.\nThe xevd-equivalent options or values are listed in parentheses for easy migration.\n\nTo get a more accurate and extensive documentation of the libxevd options,\ninvoke the command  `xevd_app --help` or consult the libxevd documentation.\n\n\n- threads (*threads*)\nForce to use a specific number of threads"
  },
  {
    "id": "QSV",
    "role": "decoder",
    "content": "The family of Intel QuickSync Video decoders (VC1, MPEG-2, H.264, HEVC,\nJPEG/MJPEG, VP8, VP9, AV1, VVC).\n\n## 107\n\nThe following options are supported by all qsv decoders.\n\n\n\n- async_depth\nInternal parallelization depth, the higher the value the higher the latency.\n\n- gpu_copy\nA GPU-accelerated copy between video and system memory\n \n- default\n- on\n- off\n\n\n\n\n## 403\nExtra options for hevc_qsv.\n\n\n\n- load_plugin\nA user plugin to load in an internal session\n \n- none\n- hevc_sw\n- hevc_hw\n\n\n- load_plugins\nA :-separate list of hexadecimal plugin UIDs to load in an internal session"
  },
  {
    "id": "v210",
    "role": "decoder",
    "content": "Uncompressed 4:2:2 10-bit decoder.\n\n## Options\n\n\n\n- custom_stride\nSet the line size of the v210 data in bytes. The default value is 0\n(autodetect). You can use the special -1 value for a strideless v210 as seen in\nBOXX files."
  },
  {
    "id": "ac3",
    "role": "decoder",
    "content": "AC-3 audio decoder.\n\nThis decoder implements part of ATSC A/52:2010 and ETSI TS 102 366, as well as\nthe undocumented RealAudio 3 (a.k.a. dnet).\n\n## 146\n\n\n\n- -drc_scale value\nDynamic Range Scale Factor. The factor to apply to dynamic range values\nfrom the AC-3 stream. This factor is applied exponentially. The default value is 1.\nThere are 3 notable scale factor ranges:\n\n- drc_scale == 0\nDRC disabled. Produces full range audio.\n- 0 < drc_scale <= 1\nDRC enabled.  Applies a fraction of the stream DRC value.\nAudio reproduction is between full range and full compression.\n- drc_scale > 1\nDRC enabled. Applies drc_scale asymmetrically.\nLoud sounds are fully compressed.  Soft sounds are enhanced."
  },
  {
    "id": "flac",
    "role": "decoder",
    "content": "FLAC audio decoder.\n\nThis decoder aims to implement the complete FLAC specification from Xiph.\n\n## 97\n\n\n\n- -use_buggy_lpc\nThe lavc FLAC encoder used to produce buggy streams with high lpc values\n(like the default value). This option makes it possible to decode such streams\ncorrectly by using lavc's old buggy lpc logic for decoding."
  },
  {
    "id": "ffwavesynth",
    "role": "decoder",
    "content": "Internal wave synthesizer.\n\nThis decoder generates wave patterns according to predefined sequences. Its\nuse is purely internal and the format of the data it accepts is not publicly\ndocumented."
  },
  {
    "id": "libcelt",
    "role": "decoder",
    "content": "libcelt decoder wrapper.\n\nlibcelt allows libavcodec to decode the Xiph CELT ultra-low delay audio codec.\nRequires the presence of the libcelt headers and library during configuration.\nYou need to explicitly configure the build with `--enable-libcelt`."
  },
  {
    "id": "libgsm",
    "role": "decoder",
    "content": "libgsm decoder wrapper.\n\nlibgsm allows libavcodec to decode the GSM full rate audio codec. Requires\nthe presence of the libgsm headers and library during configuration. You need\nto explicitly configure the build with `--enable-libgsm`.\n\nThis decoder supports both the ordinary GSM and the Microsoft variant."
  },
  {
    "id": "libilbc",
    "role": "decoder",
    "content": "libilbc decoder wrapper.\n\nlibilbc allows libavcodec to decode the Internet Low Bitrate Codec (iLBC)\naudio codec. Requires the presence of the libilbc headers and library during\nconfiguration. You need to explicitly configure the build with\n`--enable-libilbc`.\n\n## Options\n\nThe following option is supported by the libilbc wrapper.\n\n\n- enhance\n\nEnable the enhancement of the decoded audio when set to 1. The default\nvalue is 0 (disabled)."
  },
  {
    "id": "libmpeghdec",
    "role": "decoder",
    "content": "libmpeghdec decoder wrapper.\n\nlibmpeghdec allows libmpeghdec to decode the MPEG-H 3D audio codec.\nRequires the presence of the libmpeghdec headers and library during\nconfiguration. You need to explicitly configure the build with\n`--enable-libmpeghdec --enable-nonfree`."
  },
  {
    "id": "libopencore-amrnb",
    "role": "decoder",
    "content": "libopencore-amrnb decoder wrapper.\n\nlibopencore-amrnb allows libavcodec to decode the Adaptive Multi-Rate\nNarrowband audio codec. Using it requires the presence of the\nlibopencore-amrnb headers and library during configuration. You need to\nexplicitly configure the build with `--enable-libopencore-amrnb`.\n\nAn FFmpeg native decoder for AMR-NB exists, so users can decode AMR-NB\nwithout this library."
  },
  {
    "id": "libopencore-amrwb",
    "role": "decoder",
    "content": "libopencore-amrwb decoder wrapper.\n\nlibopencore-amrwb allows libavcodec to decode the Adaptive Multi-Rate\nWideband audio codec. Using it requires the presence of the\nlibopencore-amrwb headers and library during configuration. You need to\nexplicitly configure the build with `--enable-libopencore-amrwb`.\n\nAn FFmpeg native decoder for AMR-WB exists, so users can decode AMR-WB\nwithout this library."
  },
  {
    "id": "libopus",
    "role": "decoder",
    "content": "libopus decoder wrapper.\n\nlibopus allows libavcodec to decode the Opus Interactive Audio Codec.\nRequires the presence of the libopus headers and library during\nconfiguration. You need to explicitly configure the build with\n`--enable-libopus`.\n\nAn FFmpeg native decoder for Opus exists, so users can decode Opus\nwithout this library."
  },
  {
    "id": "libaribb24",
    "role": "decoder",
    "content": "ARIB STD-B24 caption decoder.\n\nImplements profiles A and C of the ARIB STD-B24 standard.\n\n## 91\n\n\n\n- -aribb24-base-path path\nSets the base path for the libaribb24 library. This is utilized for reading of\nconfiguration files (for custom unicode conversions), and for dumping of\nnon-text symbols as images under that location.\n\nUnset by default.\n\n- -aribb24-skip-ruby-text boolean\nTells the decoder wrapper to skip text blocks that contain half-height ruby\ntext.\n\nEnabled by default."
  },
  {
    "id": "libaribcaption",
    "role": "decoder",
    "content": "Yet another ARIB STD-B24 caption decoder using external libaribcaption\nlibrary.\n\nImplements profiles A and C of the Japanese ARIB STD-B24 standard,\nBrazilian ABNT NBR 15606-1, and Philippines version of ISDB-T.\n\nRequires the presence of the libaribcaption headers and library\n(https://github.com/xqq/libaribcaption) during configuration.\nYou need to explicitly configure the build with `--enable-libaribcaption`.\nIf both libaribb24 and libaribcaption are enabled, libaribcaption\ndecoder precedes.\n\n## 523\n\n\n\n- -sub_type subtitle_type\nSpecifies the format of the decoded subtitles.\n\n \n- bitmap\nGraphical image.\n- ass\nASS formatted text.\n- text\nSimple text based output without formatting.\n\n\nThe default is ass as same as libaribb24 decoder.\nSome present players (e.g., mpv) expect ASS format for ARIB caption.\n\n- -caption_encoding encoding_scheme\nSpecifies the encoding scheme of input subtitle text.\n\n \n- auto\nAutomatically detect text encoding (default).\n- jis\n8bit-char JIS encoding defined in ARIB STD B24.\nThis encoding used in Japan for ISDB captions.\n- utf8\nUTF-8 encoding defined in ARIB STD B24.\nThis encoding is used in Philippines for ISDB-T captions.\n- latin\nLatin character encoding defined in ABNT NBR 15606-1.\nThis encoding is used in South America for SBTVD / ISDB-Tb captions.\n\n\n- -font font_name[,font_name2,...]\nSpecify comma-separated list of font family names to be used for bitmap\nor ass type subtitle rendering.\nOnly first font name is used for ass type subtitle.\n\nIf not specified, use internally defined default font family.\n\n- -ass_single_rect boolean\nARIB STD-B24 specifies that some captions may be displayed at different\npositions at a time (multi-rectangle subtitle).\nSince some players (e.g., old mpv) can't handle multiple ASS rectangles\nin a single AVSubtitle, or multiple ASS rectangles of indeterminate duration\nwith the same start timestamp, this option can change the behavior so that\nall the texts are displayed in a single ASS rectangle.\n\nThe default is false.\n\nIf your player cannot handle AVSubtitles with multiple ASS rectangles properly,\nset this option to true or define ASS_SINGLE_RECT=1 to change\ndefault behavior at compilation.\n\n- -force_outline_text boolean\nSpecify whether always render outline text for all characters regardless of\nthe indication by character style.\n\nThe default is false.\n\n- -outline_width number (0.0 - 3.0)\nSpecify width for outline text, in dots (relative).\n\nThe default is 1.5.\n\n- -ignore_background boolean\nSpecify whether to ignore background color rendering.\n\nThe default is false.\n\n- -ignore_ruby boolean\nSpecify whether to ignore rendering for ruby-like (furigana) characters.\n\nThe default is false.\n\n- -replace_drcs boolean\nSpecify whether to render replaced DRCS characters as Unicode characters.\n\nThe default is true.\n\n- -replace_msz_ascii boolean\nSpecify whether to replace MSZ (Middle Size; half width) fullwidth\nalphanumerics with halfwidth alphanumerics.\n\nThe default is true.\n\n- -replace_msz_japanese boolean\nSpecify whether to replace some MSZ (Middle Size; half width) fullwidth\njapanese special characters with halfwidth ones.\n\nThe default is true.\n\n- -replace_msz_glyph boolean\nSpecify whether to replace MSZ (Middle Size; half width) characters\nwith halfwidth glyphs if the fonts supports it.\nThis option works under FreeType or DirectWrite renderer\nwith Adobe-Japan1 compliant fonts.\ne.g., IBM Plex Sans JP, Morisawa BIZ UDGothic, Morisawa BIZ UDMincho,\nYu Gothic, Yu Mincho, and Meiryo.\n\nThe default is true.\n\n- -canvas_size image_size\nSpecify the resolution of the canvas to render subtitles to; usually, this\nshould be frame size of input video.\nThis only applies when `-subtitle_type` is set to bitmap.\n\nThe libaribcaption decoder assumes input frame size for bitmap rendering as below:\n\n- PROFILE_A : 1440 x 1080 with SAR (PAR) 4:3\n- PROFILE_C : 320 x 180 with SAR (PAR) 1:1\n enumerate\n\nIf actual frame size of input video does not match above assumption,\nthe rendered captions may be distorted.\nTo make the captions undistorted, add `-canvas_size` option to specify\nactual input video size.\n\nNote that the `-canvas_size` option is not required for video with\ndifferent size but same aspect ratio.\nIn such cases, the caption will be stretched or shrunk to actual video size\nif `-canvas_size` option is not specified.\nIf `-canvas_size` option is specified with different size,\nthe caption will be stretched or shrunk as specified size with calculated SAR.\n\n\n\n## 4743\n\nDisplay MPEG-TS file with ARIB subtitle by `ffplay` tool:\n\nffplay -sub_type bitmap MPEG.TS\n example\n\nDisplay MPEG-TS file with input frame size 1920x1080 by `ffplay` tool:\n\nffplay -sub_type bitmap -canvas_size 1920x1080 MPEG.TS\n example\n\nEmbed ARIB subtitle in transcoded video:\n\nffmpeg -sub_type bitmap -i src.m2t -filter_complex \"[0:v][0:s]overlay\" -vcodec h264 dest.mp4\n example"
  },
  {
    "id": "dvbsub",
    "role": "decoder",
    "content": "## Options\n\n\n- compute_clut\n\n- -2\nCompute clut once if no matching CLUT is in the stream.\n- -1\nCompute clut if no matching CLUT is in the stream.\n- 0\nNever compute CLUT\n- 1\nAlways compute CLUT and override the one provided in the stream.\n\n- dvb_substream\nSelects the dvb substream, or all substreams if -1 which is default."
  },
  {
    "id": "dvdsub",
    "role": "decoder",
    "content": "This codec decodes the bitmap subtitles used in DVDs; the same subtitles can\nalso be found in VobSub file pairs and in some Matroska files.\n\n## Options\n\n\n- palette\nSpecify the global palette used by the bitmaps. When stored in VobSub, the\npalette is normally specified in the index file; in Matroska, the palette is\nstored in the codec extra-data in the same format as in VobSub. In DVDs, the\npalette is stored in the IFO file, and therefore not available when reading\nfrom dumped VOB files.\n\nThe format for this option is a string containing 16 24-bits hexadecimal\nnumbers (without 0x prefix) separated by commas, for example `0d00ee,\nee450d, 101010, eaeaea, 0ce60b, ec14ed, ebff0b, 0d617a, 7b7b7b, d1d1d1,\n7b2a0e, 0d950c, 0f007b, cf0dec, cfa80c, 7c127b`.\n\n- ifo_palette\nSpecify the IFO file from which the global palette is obtained.\n(experimental)\n\n- forced_subs_only\nOnly decode subtitle entries marked as forced. Some titles have forced\nand non-forced subtitles in the same track. Setting this flag to `1`\nwill only keep the forced subtitles. Default value is `0`."
  },
  {
    "id": "libzvbi-teletext",
    "role": "decoder",
    "content": "Libzvbi allows libavcodec to decode DVB teletext pages and DVB teletext\nsubtitles. Requires the presence of the libzvbi headers and library during\nconfiguration. You need to explicitly configure the build with\n`--enable-libzvbi`.\n\n## Options\n\n\n- txt_page\nList of teletext page numbers to decode. Pages that do not match the specified\nlist are dropped. You may use the special `*` string to match all pages,\nor `subtitle` to match all subtitle pages.\nDefault value is *.\n- txt_default_region\nSet default character set used for decoding, a value between 0 and 87 (see\nETS 300 706, Section 15, Table 32). Default value is -1, which does not\noverride the libzvbi default. This option is needed for some legacy level 1.0\ntransmissions which cannot signal the proper charset.\n- txt_chop_top\nDiscards the top teletext line. Default value is 1.\n- txt_format\nSpecifies the format of the decoded subtitles.\n\n- bitmap\nThe default format, you should use this for teletext pages, because certain\ngraphics and colors cannot be expressed in simple text or even ASS.\n- text\nSimple text based output without formatting.\n- ass\nFormatted ASS output, subtitle pages and teletext pages are returned in\ndifferent styles, subtitle pages are stripped down to text, but an effort is\nmade to keep the text alignment and the formatting.\n\n- txt_left\nX offset of generated bitmaps, default is 0.\n- txt_top\nY offset of generated bitmaps, default is 0.\n- txt_chop_spaces\nChops leading and trailing spaces and removes empty lines from the generated\ntext. This option is useful for teletext based subtitles where empty spaces may\nbe present at the start or at the end of the lines or empty lines may be\npresent between the subtitle lines because of double-sized teletext characters.\nDefault value is 1.\n- txt_duration\nSets the display duration of the decoded teletext pages or subtitles in\nmilliseconds. Default value is -1 which means infinity or until the next\nsubtitle event comes.\n- txt_transparent\nForce transparent background of the generated teletext bitmaps. Default value\nis 0 which means an opaque background.\n- txt_opacity\nSets the opacity (0-255) of the teletext background. If\ntxt_transparent is not set, it only affects characters between a start\nbox and an end box, typically subtitles. Default value is 0 if\ntxt_transparent is set, 255 otherwise."
  },
  {
    "id": "aac",
    "role": "encoder",
    "content": "Advanced Audio Coding (AAC) encoder.\n\nThis encoder is the default AAC encoder, natively implemented into FFmpeg.\n\n## Options\n\n\n- b\nSet bit rate in bits/s. Setting this automatically activates constant bit rate\n(CBR) mode. If this option is unspecified it is set to 128kbps.\n\n- q\nSet quality for variable bit rate (VBR) mode. This option is valid only using\nthe ffmpeg command-line tool. For library interface users, use\nglobal_quality.\n\n- cutoff\nSet cutoff frequency. If unspecified will allow the encoder to dynamically\nadjust the cutoff to improve clarity on low bitrates.\n\n- aac_coder\nSet AAC encoder coding method. Possible values:\n\n \n- twoloop\nTwo loop searching (TLS) method. This is the default method.\n\nThis method first sets quantizers depending on band thresholds and then tries\nto find an optimal combination by adding or subtracting a specific value from\nall quantizers and adjusting some individual quantizer a little.  Will tune\nitself based on whether aac_is, aac_ms and aac_pns\nare enabled.\n\n- anmr\nAverage noise to mask ratio (ANMR) trellis-based solution.\n\nThis is an experimental coder which currently produces a lower quality, is more\nunstable and is slower than the default twoloop coder but has potential.\nCurrently has no support for the aac_is or aac_pns options.\nNot currently recommended.\n\n- fast\nConstant quantizer method.\n\nUses a cheaper version of twoloop algorithm that doesn't try to do as many\nclever adjustments. Worse with low bitrates (less than 64kbps), but is better\nand much faster at higher bitrates.\n\n\n\n- aac_ms\nSets mid/side coding mode. The default value of \"auto\" will automatically use\nM/S with bands which will benefit from such coding. Can be forced for all bands\nusing the value \"enable\", which is mainly useful for debugging or disabled using\n\"disable\".\n\n- aac_is\nSets intensity stereo coding tool usage. By default, it's enabled and will\nautomatically toggle IS for similar pairs of stereo bands if it's beneficial.\nCan be disabled for debugging by setting the value to \"disable\".\n\n- aac_pns\nUses perceptual noise substitution to replace low entropy high frequency bands\nwith imperceptible white noise during the decoding process. By default, it's\nenabled, but can be disabled for debugging purposes by using \"disable\".\n\n- aac_tns\nEnables the use of a multitap FIR filter which spans through the high frequency\nbands to hide quantization noise during the encoding process and is reverted\nby the decoder. As well as decreasing unpleasant artifacts in the high range\nthis also reduces the entropy in the high bands and allows for more bits to\nbe used by the mid-low bands. By default it's enabled but can be disabled for\ndebugging by setting the option to \"disable\".\n\n- aac_ltp\nEnables the use of the long term prediction extension which increases coding\nefficiency in very low bandwidth situations such as encoding of voice or\nsolo piano music by extending constant harmonic peaks in bands throughout\nframes. This option is implied by profile:a aac_low.\nUse in conjunction with -ar to decrease the samplerate.\n\n- profile\nSets the encoding profile, possible values:\n\n \n- aac_low\nThe default, AAC \"Low-complexity\" profile. Is the most compatible and produces\ndecent quality.\n\n- mpeg2_aac_low\nEquivalent to `-profile:a aac_low -aac_pns 0`. PNS was introduced with the\nMPEG4 specifications.\n\n- aac_ltp\nLong term prediction profile, is enabled by and will enable the aac_ltp\noption. Introduced in MPEG4.\n\n\nIf this option is unspecified it is set to aac_low."
  },
  {
    "id": "ac3",
    "role": "encoder",
    "content": "AC-3 audio encoders.\n\nThese encoders implement part of ATSC A/52:2010 and ETSI TS 102 366.\n\nThe ac3 encoder uses floating-point math, while the ac3_fixed\nencoder only uses fixed-point integer math. This does not mean that one is\nalways faster, just that one or the other may be better suited to a\nparticular system. The ac3_fixed encoder is not the default codec for\nany of the output formats, so it must be specified explicitly using the option\n`-acodec ac3_fixed` in order to use it.\n\n## 506\n\nThe AC-3 metadata options are used to set parameters that describe the audio,\nbut in most cases do not affect the audio encoding itself. Some of the options\ndo directly affect or influence the decoding and playback of the resulting\nbitstream, while others are just for informational purposes. A few of the\noptions will add bits to the output stream that could otherwise be used for\naudio data, and will thus affect the quality of the output. Those will be\nindicated accordingly with a note in the option list below.\n\nThese parameters are described in detail in several publicly-available\ndocuments.\n\n- http://www.atsc.org/cms/standards/a_52-2010.pdf,A/52:2010 - Digital Audio Compression (AC-3) (E-AC-3) Standard\n- http://www.atsc.org/cms/standards/a_54a_with_corr_1.pdf,A/54 - Guide to the Use of the ATSC Digital Television Standard\n- http://www.dolby.com/uploadedFiles/zz-_Shared_Assets/English_PDFs/Professional/18_Metadata.Guide.pdf,Dolby Metadata Guide\n- http://www.dolby.com/uploadedFiles/zz-_Shared_Assets/English_PDFs/Professional/46_DDEncodingGuidelines.pdf,Dolby Digital Professional Encoding Guidelines\n itemize\n\n Metadata Control Options\n\n\n\n- -per_frame_metadata boolean\nAllow Per-Frame Metadata. Specifies if the encoder should check for changing\nmetadata for each frame.\n\n- 0\nThe metadata values set at initialization will be used for every frame in the\nstream. (default)\n- 1\nMetadata values can be changed before encoding each frame.\n\n\n\n\n Downmix Levels\n\n\n\n- -center_mixlev level\nCenter Mix Level. The amount of gain the decoder should apply to the center\nchannel when downmixing to stereo. This field will only be written to the\nbitstream if a center channel is present. The value is specified as a scale\nfactor. There are 3 valid values:\n\n- 0.707\nApply -3dB gain\n- 0.595\nApply -4.5dB gain (default)\n- 0.500\nApply -6dB gain\n\n\n- -surround_mixlev level\nSurround Mix Level. The amount of gain the decoder should apply to the surround\nchannel(s) when downmixing to stereo. This field will only be written to the\nbitstream if one or more surround channels are present. The value is specified\nas a scale factor.  There are 3 valid values:\n\n- 0.707\nApply -3dB gain\n- 0.500\nApply -6dB gain (default)\n- 0.000\nSilence Surround Channel(s)\n\n\n\n\n Audio Production Information\nAudio Production Information is optional information describing the mixing\nenvironment.  Either none or both of the fields are written to the bitstream.\n\n\n\n- -mixing_level number\nMixing Level. Specifies peak sound pressure level (SPL) in the production\nenvironment when the mix was mastered. Valid values are 80 to 111, or -1 for\nunknown or not indicated. The default value is -1, but that value cannot be\nused if the Audio Production Information is written to the bitstream. Therefore,\nif the `room_type` option is not the default value, the `mixing_level`\noption must not be -1.\n\n- -room_type type\nRoom Type. Describes the equalization used during the final mixing session at\nthe studio or on the dubbing stage. A large room is a dubbing stage with the\nindustry standard X-curve equalization; a small room has flat equalization.\nThis field will not be written to the bitstream if both the `mixing_level`\noption and the `room_type` option have the default values.\n\n- 0\n notindicated\nNot Indicated (default)\n- 1\n large\nLarge Room\n- 2\n small\nSmall Room\n\n\n\n\n Other Metadata Options\n\n\n\n- -copyright boolean\nCopyright Indicator. Specifies whether a copyright exists for this audio.\n\n- 0\n off\nNo Copyright Exists (default)\n- 1\n on\nCopyright Exists\n\n\n- -dialnorm value\nDialogue Normalization. Indicates how far the average dialogue level of the\nprogram is below digital 100% full scale (0 dBFS). This parameter determines a\nlevel shift during audio reproduction that sets the average volume of the\ndialogue to a preset level. The goal is to match volume level between program\nsources. A value of -31dB will result in no volume level change, relative to\nthe source volume, during audio reproduction. Valid values are whole numbers in\nthe range -31 to -1, with -31 being the default.\n\n- -dsur_mode mode\nDolby Surround Mode. Specifies whether the stereo signal uses Dolby Surround\n(Pro Logic). This field will only be written to the bitstream if the audio\nstream is stereo. Using this option does NOT mean the encoder will actually\napply Dolby Surround processing.\n\n- 0\n notindicated\nNot Indicated (default)\n- 1\n off\nNot Dolby Surround Encoded\n- 2\n on\nDolby Surround Encoded\n\n\n- -original boolean\nOriginal Bit Stream Indicator. Specifies whether this audio is from the\noriginal source and not a copy.\n\n- 0\n off\nNot Original Source\n- 1\n on\nOriginal Source (default)\n\n\n\n\n## 5386\nThe extended bitstream options are part of the Alternate Bit Stream Syntax as\nspecified in Annex D of the A/52:2010 standard. It is grouped into 2 parts.\nIf any one parameter in a group is specified, all values in that group will be\nwritten to the bitstream.  Default values are used for those that are written\nbut have not been specified.  If the mixing levels are written, the decoder\nwill use these values instead of the ones specified in the `center_mixlev`\nand `surround_mixlev` options if it supports the Alternate Bit Stream\nSyntax.\n\n Extended Bitstream Information - Part 1\n\n\n\n- -dmix_mode mode\nPreferred Stereo Downmix Mode. Allows the user to select either Lt/Rt\n(Dolby Surround) or Lo/Ro (normal stereo) as the preferred stereo downmix mode.\n\n- 0\n notindicated\nNot Indicated (default)\n- 1\n ltrt\nLt/Rt Downmix Preferred\n- 2\n loro\nLo/Ro Downmix Preferred\n\n\n- -ltrt_cmixlev level\nLt/Rt Center Mix Level. The amount of gain the decoder should apply to the\ncenter channel when downmixing to stereo in Lt/Rt mode.\n\n- 1.414\nApply +3dB gain\n- 1.189\nApply +1.5dB gain\n- 1.000\nApply 0dB gain\n- 0.841\nApply -1.5dB gain\n- 0.707\nApply -3.0dB gain\n- 0.595\nApply -4.5dB gain (default)\n- 0.500\nApply -6.0dB gain\n- 0.000\nSilence Center Channel\n\n\n- -ltrt_surmixlev level\nLt/Rt Surround Mix Level. The amount of gain the decoder should apply to the\nsurround channel(s) when downmixing to stereo in Lt/Rt mode.\n\n- 0.841\nApply -1.5dB gain\n- 0.707\nApply -3.0dB gain\n- 0.595\nApply -4.5dB gain\n- 0.500\nApply -6.0dB gain (default)\n- 0.000\nSilence Surround Channel(s)\n\n\n- -loro_cmixlev level\nLo/Ro Center Mix Level. The amount of gain the decoder should apply to the\ncenter channel when downmixing to stereo in Lo/Ro mode.\n\n- 1.414\nApply +3dB gain\n- 1.189\nApply +1.5dB gain\n- 1.000\nApply 0dB gain\n- 0.841\nApply -1.5dB gain\n- 0.707\nApply -3.0dB gain\n- 0.595\nApply -4.5dB gain (default)\n- 0.500\nApply -6.0dB gain\n- 0.000\nSilence Center Channel\n\n\n- -loro_surmixlev level\nLo/Ro Surround Mix Level. The amount of gain the decoder should apply to the\nsurround channel(s) when downmixing to stereo in Lo/Ro mode.\n\n- 0.841\nApply -1.5dB gain\n- 0.707\nApply -3.0dB gain\n- 0.595\nApply -4.5dB gain\n- 0.500\nApply -6.0dB gain (default)\n- 0.000\nSilence Surround Channel(s)\n\n\n\n\n Extended Bitstream Information - Part 2\n\n\n\n- -dsurex_mode mode\nDolby Surround EX Mode. Indicates whether the stream uses Dolby Surround EX\n(7.1 matrixed to 5.1). Using this option does NOT mean the encoder will actually\napply Dolby Surround EX processing.\n\n- 0\n notindicated\nNot Indicated (default)\n- 1\n on\nDolby Surround EX Off\n- 2\n off\nDolby Surround EX On\n\n\n- -dheadphone_mode mode\nDolby Headphone Mode. Indicates whether the stream uses Dolby Headphone\nencoding (multi-channel matrixed to 2.0 for use with headphones). Using this\noption does NOT mean the encoder will actually apply Dolby Headphone\nprocessing.\n\n- 0\n notindicated\nNot Indicated (default)\n- 1\n on\nDolby Headphone Off\n- 2\n off\nDolby Headphone On\n\n\n- -ad_conv_type type\nA/D Converter Type. Indicates whether the audio has passed through HDCD A/D\nconversion.\n\n- 0\n standard\nStandard A/D Converter (default)\n- 1\n hdcd\nHDCD A/D Converter\n\n\n\n\n## 8732\n\n\n\n- -stereo_rematrixing boolean\nStereo Rematrixing. Enables/Disables use of rematrixing for stereo input. This\nis an optional AC-3 feature that increases quality by selectively encoding\nthe left/right channels as mid/side. This option is enabled by default, and it\nis highly recommended that it be left as enabled except for testing purposes.\n\n- cutoff frequency\nSet lowpass cutoff frequency. If unspecified, the encoder selects a default\ndetermined by various other encoding parameters.\n\n\n\n## 9276\n\nThese options are only valid for the floating-point encoder and do not exist\nfor the fixed-point encoder due to the corresponding features not being\nimplemented in fixed-point.\n\n\n\n- -channel_coupling boolean\nEnables/Disables use of channel coupling, which is an optional AC-3 feature\nthat increases quality by combining high frequency information from multiple\nchannels into a single channel. The per-channel high frequency information is\nsent with less accuracy in both the frequency and time domains. This allows\nmore bits to be used for lower frequencies while preserving enough information\nto reconstruct the high frequencies. This option is enabled by default for the\nfloating-point encoder and should generally be left as enabled except for\ntesting purposes or to increase encoding speed.\n\n- -1\n auto\nSelected by Encoder (default)\n- 0\n off\nDisable Channel Coupling\n- 1\n on\nEnable Channel Coupling\n\n\n- -cpl_start_band number\nCoupling Start Band. Sets the channel coupling start band, from 1 to 15. If a\nvalue higher than the bandwidth is used, it will be reduced to 1 less than the\ncoupling end band. If auto is used, the start band will be determined by\nthe encoder based on the bit rate, sample rate, and channel layout. This option\nhas no effect if channel coupling is disabled.\n\n- -1\n auto\nSelected by Encoder (default)\n\n\n\n\nflac"
  },
  {
    "id": "flac",
    "role": "encoder",
    "content": "FLAC (Free Lossless Audio Codec) Encoder\n\n## Options\n\nThe following options are supported by FFmpeg's flac encoder.\n\n\n- compression_level\nSets the compression level, which chooses defaults for many other options\nif they are not set explicitly. Valid values are from 0 to 12, 5 is the\ndefault.\n\n- frame_size\nSets the size of the frames in samples per channel.\n\n- lpc_coeff_precision\nSets the LPC coefficient precision, valid values are from 1 to 15, 15 is the\ndefault.\n\n- lpc_type\nSets the first stage LPC algorithm\n \n- none\nLPC is not used\n\n- fixed\nfixed LPC coefficients\n\n- levinson\n\n- cholesky\n\n\n- lpc_passes\nNumber of passes to use for Cholesky factorization during LPC analysis\n\n- min_partition_order\nThe minimum partition order\n\n- max_partition_order\nThe maximum partition order\n\n- prediction_order_method\n \n- estimation\n- 2level\n- 4level\n- 8level\n- search\nBruteforce search\n- log\n\n\n- ch_mode\nChannel mode\n \n- auto\nThe mode is chosen automatically for each frame\n- indep\nChannels are independently coded\n- left_side\n- right_side\n- mid_side\n\n\n- exact_rice_parameters\nChooses if rice parameters are calculated exactly or approximately.\nif set to 1 then they are chosen exactly, which slows the code down slightly and\nimproves compression slightly.\n\n- multi_dim_quant\nMulti Dimensional Quantization. If set to 1 then a 2nd stage LPC algorithm is\napplied after the first stage to finetune the coefficients. This is quite slow\nand slightly improves compression.\n\n\n\nopusenc"
  },
  {
    "id": "opus",
    "role": "encoder",
    "content": "Opus encoder.\n\nThis is a native FFmpeg encoder for the Opus format. Currently, it's in development and\nonly implements the CELT part of the codec. Its quality is usually worse and at best\nis equal to the libopus encoder.\n\n## Options\n\n\n- b\nSet bit rate in bits/s. If unspecified it uses the number of channels and the layout\nto make a good guess.\n\n- opus_delay\nSets the maximum delay in milliseconds. Lower delays than 20ms will very quickly\ndecrease quality.\n\n\nlibfdk-aac-enc"
  },
  {
    "id": "libfdk_aac",
    "role": "encoder",
    "content": "libfdk-aac AAC (Advanced Audio Coding) encoder wrapper.\n\nThe libfdk-aac library is based on the Fraunhofer FDK AAC code from\nthe Android project.\n\nRequires the presence of the libfdk-aac headers and library during\nconfiguration. You need to explicitly configure the build with\n`--enable-libfdk-aac`. The library is also incompatible with GPL,\nso if you allow the use of GPL, you should configure with\n`--enable-gpl --enable-nonfree --enable-libfdk-aac`.\n\nThis encoder has support for the AAC-HE profiles.\n\nVBR encoding, enabled through the vbr or flags\n+qscale options, is experimental and only works with some\ncombinations of parameters.\n\nSupport for encoding 7.1 audio is only available with libfdk-aac 0.1.3 or\nhigher.\n\nFor more information see the fdk-aac project at\nhttp://sourceforge.net/p/opencore-amr/fdk-aac/.\n\n## Options\n\nThe following options are mapped on the shared FFmpeg codec options.\n\n\n- b\nSet bit rate in bits/s. If the bitrate is not explicitly specified, it\nis automatically set to a suitable value depending on the selected\nprofile.\n\nIn case VBR mode is enabled the option is ignored.\n\n- ar\nSet audio sampling rate (in Hz).\n\n- channels\nSet the number of audio channels.\n\n- flags +qscale\nEnable fixed quality, VBR (Variable Bit Rate) mode.\nNote that VBR is implicitly enabled when the vbr value is\npositive.\n\n- cutoff\nSet cutoff frequency. If not specified (or explicitly set to 0) it\nwill use a value automatically computed by the library. Default value\nis 0.\n\n- profile\nSet audio profile.\n\nThe following profiles are recognized:\n \n- aac_low\nLow Complexity AAC (LC)\n\n- aac_he\nHigh Efficiency AAC (HE-AAC)\n\n- aac_he_v2\nHigh Efficiency AAC version 2 (HE-AACv2)\n\n- aac_ld\nLow Delay AAC (LD)\n\n- aac_eld\nEnhanced Low Delay AAC (ELD)\n\n\nIf not specified it is set to aac_low.\n\n\nThe following are private options of the libfdk_aac encoder.\n\n\n- afterburner\nEnable afterburner feature if set to 1, disabled if set to 0. This\nimproves the quality but also the required processing power.\n\nDefault value is 1.\n\n- eld_sbr\nEnable SBR (Spectral Band Replication) for ELD if set to 1, disabled\nif set to 0.\n\nDefault value is 0.\n\n- eld_v2\nEnable ELDv2 (LD-MPS extension for ELD stereo signals) for ELDv2 if set to 1,\ndisabled if set to 0.\n\nNote that option is available when fdk-aac version (AACENCODER_LIB_VL0.AACENCODER_LIB_VL1.AACENCODER_LIB_VL2) > (4.0.0).\n\nDefault value is 0.\n\n- signaling\nSet SBR/PS signaling style.\n\nIt can assume one of the following values:\n \n- default\nchoose signaling implicitly (explicit hierarchical by default,\nimplicit if global header is disabled)\n\n- implicit\nimplicit backwards compatible signaling\n\n- explicit_sbr\nexplicit SBR, implicit PS signaling\n\n- explicit_hierarchical\nexplicit hierarchical signaling\n\n\nDefault value is default.\n\n- latm\nOutput LATM/LOAS encapsulated data if set to 1, disabled if set to 0.\n\nDefault value is 0.\n\n- header_period\nSet StreamMuxConfig and PCE repetition period (in frames) for sending\nin-band configuration buffers within LATM/LOAS transport layer.\n\nMust be a 16-bits non-negative integer.\n\nDefault value is 0.\n\n- vbr\nSet VBR mode, from 1 to 5. 1 is lowest quality (though still pretty\ngood) and 5 is highest quality. A value of 0 will disable VBR, and CBR\n(Constant Bit Rate) is enabled.\n\nCurrently only the aac_low profile supports VBR encoding.\n\nVBR modes 1-5 correspond to roughly the following average bit rates:\n\n \n- 1\n32 kbps/channel\n- 2\n40 kbps/channel\n- 3\n48-56 kbps/channel\n- 4\n64 kbps/channel\n- 5\nabout 80-96 kbps/channel\n\n\nDefault value is 0.\n\n- frame_length\nSet the audio frame length in samples. Default value is the internal\ndefault of the library. Refer to the library's documentation for information\nabout supported values.\n\n\n## 3799\n\n\n- Use ffmpeg to convert an audio file to VBR AAC in an M4A (MP4)\ncontainer:\n\nffmpeg -i input.wav -codec:a libfdk_aac -vbr 3 output.m4a\n example\n\n- Use ffmpeg to convert an audio file to CBR 64k kbps AAC, using the\nHigh-Efficiency AAC profile:\n\nffmpeg -i input.wav -c:a libfdk_aac -profile:a aac_he -b:a 64k output.m4a\n example\n itemize\n\nliblc3-enc"
  },
  {
    "id": "liblc3",
    "role": "encoder",
    "content": "liblc3 LC3 (Low Complexity Communication Codec) encoder wrapper.\n\nRequires the presence of the liblc3 headers and library during configuration.\nYou need to explicitly configure the build with `--enable-liblc3`.\n\nThis encoder has support for the Bluetooth SIG LC3 codec for the LE Audio\nprotocol, and the following features of LC3plus:\n\n- Frame duration of 2.5 and 5ms.\n- High-Resolution mode, 48 KHz, and 96 kHz sampling rates.\n itemize\n\nFor more information see the liblc3 project at\nhttps://github.com/google/liblc3.\n\n## Options\n\nThe following options are mapped on the shared FFmpeg codec options.\n\n\n- b bitrate\nSet the bit rate in bits/s. This will determine the fixed size of the encoded\nframes, for a selected frame duration.\n\n- ar frequency\nSet the audio sampling rate (in Hz).\n\n- channels\nSet the number of audio channels.\n\n- frame_duration\nSet the audio frame duration in milliseconds. Default value is 10ms.\nAllowed frame durations are 2.5ms, 5ms, 7.5ms and 10ms.\nLC3 (Bluetooth LE Audio), allows 7.5ms and 10ms; and LC3plus 2.5ms, 5ms\nand 10ms.\n\nThe 10ms frame duration is available in LC3 and LC3 plus standard.\nIn this mode, the produced bitstream can be referenced either as LC3 or LC3plus.\n\n- high_resolution boolean\nEnable the high-resolution mode if set to 1. The high-resolution mode is\navailable with all LC3plus frame durations and for a sampling rate of 48 KHz,\nand 96 KHz.\n\nThe encoder automatically turns off this mode at lower sampling rates and\nactivates it at 96 KHz.\n\nThis mode should be preferred at high bitrates. In this mode, the audio\nbandwidth is always up to the Nyquist frequency, compared to LC3 at 48 KHz,\nwhich limits the bandwidth to 20 KHz.\n\n\nlibmp3lame"
  },
  {
    "id": "libmp3lame",
    "role": "encoder",
    "content": "LAME (Lame Ain't an MP3 Encoder) MP3 encoder wrapper.\n\nRequires the presence of the libmp3lame headers and library during\nconfiguration. You need to explicitly configure the build with\n`--enable-libmp3lame`.\n\nSee libshine for a fixed-point MP3 encoder, although with a\nlower quality.\n\n## Options\n\nThe following options are supported by the libmp3lame wrapper. The\nlame-equivalent of the options are listed in parentheses.\n\n\n- b (*-b*)\nSet bitrate expressed in bits/s for CBR or ABR. LAME `bitrate` is\nexpressed in kilobits/s.\n\n- q (*-V*)\nSet constant quality setting for VBR. This option is valid only\nusing the ffmpeg command-line tool. For library interface\nusers, use global_quality.\n\n- compression_level (*-q*)\nSet algorithm quality. Valid arguments are integers in the 0-9 range,\nwith 0 meaning highest quality but slowest, and 9 meaning fastest\nwhile producing the worst quality.\n\n- cutoff (*--lowpass*)\nSet lowpass cutoff frequency. If unspecified, the encoder dynamically\nadjusts the cutoff.\n\n- reservoir\nEnable use of bit reservoir when set to 1. Default value is 1. LAME\nhas this enabled by default, but can be overridden by use\n--nores option.\n\n- joint_stereo (*-m j*)\nEnable the encoder to use (on a frame by frame basis) either L/R\nstereo or mid/side stereo. Default value is 1.\n\n- abr (*--abr*)\nEnable the encoder to use ABR when set to 1. The lame\n--abr sets the target bitrate, while this options only\ntells FFmpeg to use ABR still relies on b to set bitrate.\n\n- copyright (*-c*)\nSet MPEG audio copyright flag when set to 1. The default value is 0\n(disabled).\n\n- original (*-o*)\nSet MPEG audio original flag when set to 1. The default value is 1\n(enabled)."
  },
  {
    "id": "libopencore-amrnb",
    "role": "encoder",
    "content": "OpenCORE Adaptive Multi-Rate Narrowband encoder.\n\nRequires the presence of the libopencore-amrnb headers and library during\nconfiguration. You need to explicitly configure the build with\n`--enable-libopencore-amrnb --enable-version3`.\n\nThis is a mono-only encoder. Officially it only supports 8000Hz sample rate,\nbut you can override it by setting strict to unofficial or\nlower.\n\n## Options\n\n\n\n- b\nSet bitrate in bits per second. Only the following bitrates are supported,\notherwise libavcodec will round to the nearest valid bitrate.\n\n\n- 4750\n- 5150\n- 5900\n- 6700\n- 7400\n- 7950\n- 10200\n- 12200\n\n\n- dtx\nAllow discontinuous transmission (generate comfort noise) when set to 1. The\ndefault value is 0 (disabled)."
  },
  {
    "id": "libopus",
    "role": "encoder",
    "content": "libopus Opus Interactive Audio Codec encoder wrapper.\n\nRequires the presence of the libopus headers and library during\nconfiguration. You need to explicitly configure the build with\n`--enable-libopus`.\n\n## 204\n\nMost libopus options are modelled after the opusenc utility from\nopus-tools. The following is an option mapping chart describing options\nsupported by the libopus wrapper, and their opusenc-equivalent\nin parentheses.\n\n\n\n- b (*bitrate*)\nSet the bit rate in bits/s.  FFmpeg's b option is\nexpressed in bits/s, while opusenc's bitrate in\nkilobits/s.\n\n- vbr (*vbr*, *hard-cbr*, and *cvbr*)\nSet VBR mode. The FFmpeg vbr option has the following\nvalid arguments, with the opusenc equivalent options\nin parentheses:\n\n \n- off (*hard-cbr*)\nUse constant bit rate encoding.\n\n- on (*vbr*)\nUse variable bit rate encoding (the default).\n\n- constrained (*cvbr*)\nUse constrained variable bit rate encoding.\n\n\n- compression_level (*comp*)\nSet encoding algorithm complexity. Valid options are integers in\nthe 0-10 range. 0 gives the fastest encodes but lower quality, while 10\ngives the highest quality but slowest encoding. The default is 10.\n\n- frame_duration (*framesize*)\nSet maximum frame size, or duration of a frame in milliseconds. The\nargument must be exactly the following: 2.5, 5, 10, 20, 40, 60. Smaller\nframe sizes achieve lower latency but less quality at a given bitrate.\nSizes greater than 20ms are only interesting at fairly low bitrates.\nThe default is 20ms.\n\n- packet_loss (*expect-loss*)\nSet expected packet loss percentage. The default is 0.\n\n- fec (*n/a*)\nEnable inband forward error correction. packet_loss must be non-zero\nto take advantage - frequency of FEC 'side-data' is proportional to expected packet loss.\nDefault is disabled.\n\n- application (N.A.)\nSet intended application type. Valid options are listed below:\n\n \n- voip\nFavor improved speech intelligibility.\n- audio\nFavor faithfulness to the input (the default).\n- lowdelay\nRestrict to only the lowest delay modes by disabling voice-optimized\nmodes.\n\n\n- cutoff (N.A.)\nSet cutoff bandwidth in Hz. The argument must be exactly one of the\nfollowing: 4000, 6000, 8000, 12000, or 20000, corresponding to\nnarrowband, mediumband, wideband, super wideband, and fullband\nrespectively. The default is 0 (cutoff disabled). Note that libopus\nforces a wideband cutoff for bitrates < 15 kbps, unless CELT-only\n(application set to lowdelay) mode is used.\n\n- mapping_family (*mapping_family*)\nSet channel mapping family to be used by the encoder. The default value of -1\nuses mapping family 0 for mono and stereo inputs, and mapping family 1\notherwise. The default also disables the surround masking and LFE bandwidth\noptimizations in libopus, and requires that the input contains 8 channels or\nfewer.\n\nOther values include 0 for mono and stereo, 1 for surround sound with masking\nand LFE bandwidth optimizations, and 255 for independent streams with an\nunspecified channel layout.\n\n- apply_phase_inv (N.A.) (requires libopus >= 1.2)\nIf set to 0, disables the use of phase inversion for intensity stereo,\nimproving the quality of mono downmixes, but slightly reducing normal stereo\nquality. The default is 1 (phase inversion enabled).\n\n\n\nlibshine"
  },
  {
    "id": "libshine",
    "role": "encoder",
    "content": "Shine Fixed-Point MP3 encoder wrapper.\n\nShine is a fixed-point MP3 encoder. It has a far better performance on\nplatforms without an FPU, e.g. armel CPUs, and some phones and tablets.\nHowever, as it is more targeted on performance than quality, it is not on par\nwith LAME and other production-grade encoders quality-wise. Also, according to\nthe project's homepage, this encoder may not be free of bugs as the code was\nwritten a long time ago and the project was dead for at least 5 years.\n\nThis encoder only supports stereo and mono input. This is also CBR-only.\n\nThe original project (last updated in early 2007) is at\nhttp://sourceforge.net/projects/libshine-fxp/. We only support the\nupdated fork by the Savonet/Liquidsoap project at https://github.com/savonet/shine.\n\nRequires the presence of the libshine headers and library during\nconfiguration. You need to explicitly configure the build with\n`--enable-libshine`.\n\nSee also libmp3lame.\n\n## Options\n\nThe following options are supported by the libshine wrapper. The\nshineenc-equivalent of the options are listed in parentheses.\n\n\n- b (*-b*)\nSet bitrate expressed in bits/s for CBR. shineenc -b option\nis expressed in kilobits/s."
  },
  {
    "id": "libtwolame",
    "role": "encoder",
    "content": "TwoLAME MP2 encoder wrapper.\n\nRequires the presence of the libtwolame headers and library during\nconfiguration. You need to explicitly configure the build with\n`--enable-libtwolame`.\n\n## Options\n\nThe following options are supported by the libtwolame wrapper. The\ntwolame-equivalent options follow the FFmpeg ones and are in\nparentheses.\n\n\n- b (*-b*)\nSet bitrate expressed in bits/s for CBR. twolame b\noption is expressed in kilobits/s. Default value is 128k.\n\n- q (*-V*)\nSet quality for experimental VBR support. Maximum value range is\nfrom -50 to 50, useful range is from -10 to 10. The higher the\nvalue, the better the quality. This option is valid only using the\nffmpeg command-line tool. For library interface users,\nuse global_quality.\n\n- mode (*--mode*)\nSet the mode of the resulting audio. Possible values:\n\n \n- auto\nChoose mode automatically based on the input. This is the default.\n- stereo\nStereo\n- joint_stereo\nJoint stereo\n- dual_channel\nDual channel\n- mono\nMono\n\n\n- psymodel (*--psyc-mode*)\nSet psychoacoustic model to use in encoding. The argument must be\nan integer between -1 and 4, inclusive. The higher the value, the\nbetter the quality. The default value is 3.\n\n- energy_levels (*--energy*)\nEnable energy levels extensions when set to 1. The default value is\n0 (disabled).\n\n- error_protection (*--protect*)\nEnable CRC error protection when set to 1. The default value is 0\n(disabled).\n\n- copyright (*--copyright*)\nSet MPEG audio copyright flag when set to 1. The default value is 0\n(disabled).\n\n- original (*--original*)\nSet MPEG audio original flag when set to 1. The default value is 0\n(disabled)."
  },
  {
    "id": "libvo-amrwbenc",
    "role": "encoder",
    "content": "VisualOn Adaptive Multi-Rate Wideband encoder.\n\nRequires the presence of the libvo-amrwbenc headers and library during\nconfiguration. You need to explicitly configure the build with\n`--enable-libvo-amrwbenc --enable-version3`.\n\nThis is a mono-only encoder. Officially it only supports 16000Hz sample\nrate, but you can override it by setting strict to\nunofficial or lower.\n\n## Options\n\n\n\n- b\nSet bitrate in bits/s. Only the following bitrates are supported, otherwise\nlibavcodec will round to the nearest valid bitrate.\n\n \n- 6600\n- 8850\n- 12650\n- 14250\n- 15850\n- 18250\n- 19850\n- 23050\n- 23850\n\n\n- dtx\nAllow discontinuous transmission (generate comfort noise) when set to 1. The\ndefault value is 0 (disabled)."
  },
  {
    "id": "libvorbis",
    "role": "encoder",
    "content": "libvorbis encoder wrapper.\n\nRequires the presence of the libvorbisenc headers and library during\nconfiguration. You need to explicitly configure the build with\n`--enable-libvorbis`.\n\n## Options\n\nThe following options are supported by the libvorbis wrapper. The\noggenc-equivalent of the options are listed in parentheses.\n\nTo get a more accurate and extensive documentation of the libvorbis\noptions, consult the libvorbisenc's and oggenc's documentations.\nSee http://xiph.org/vorbis/,\nhttp://wiki.xiph.org/Vorbis-tools, and oggenc(1).\n\n\n- b (*-b*)\nSet bitrate expressed in bits/s for ABR. oggenc -b is\nexpressed in kilobits/s.\n\n- q (*-q*)\nSet constant quality setting for VBR. The value should be a float\nnumber in the range of -1.0 to 10.0. The higher the value, the better\nthe quality. The default value is 3.0.\n\nThis option is valid only using the ffmpeg command-line tool.\nFor library interface users, use global_quality.\n\n- cutoff (*--advanced-encode-option lowpass_frequency=N*)\nSet cutoff bandwidth in Hz, a value of 0 disables cutoff. oggenc's\nrelated option is expressed in kHz. The default value is 0 (cutoff\ndisabled).\n\n- minrate (*-m*)\nSet minimum bitrate expressed in bits/s. oggenc -m is\nexpressed in kilobits/s.\n\n- maxrate (*-M*)\nSet maximum bitrate expressed in bits/s. oggenc -M is\nexpressed in kilobits/s. This only has effect on ABR mode.\n\n- iblock (*--advanced-encode-option impulse_noisetune=N*)\nSet noise floor bias for impulse blocks. The value is a float number from\n-15.0 to 0.0. A negative bias instructs the encoder to pay special attention\nto the crispness of transients in the encoded audio. The tradeoff for better\ntransient response is a higher bitrate.\n\n\n\nmjpegenc"
  },
  {
    "id": "mjpeg",
    "role": "encoder",
    "content": "Motion JPEG encoder.\n\n## Options\n\n\n- huffman\nSet the huffman encoding strategy. Possible values:\n\n \n- default\nUse the default huffman tables. This is the default strategy.\n\n- optimal\nCompute and use optimal huffman tables.\n\n\n\n\nwavpackenc"
  },
  {
    "id": "wavpack",
    "role": "encoder",
    "content": "WavPack lossless audio encoder.\n\n## Options\n\nThe equivalent options for wavpack command line utility are listed in\nparentheses.\n\n Shared options\n\nThe following shared options are effective for this encoder. Only special notes\nabout this particular encoder will be documented here. For the general meaning\nof the options, see codec-options,,the Codec Options chapter.\n\n\n- frame_size (*--blocksize*)\nFor this encoder, the range for this option is between 128 and 131072. Default\nis automatically decided based on sample rate and number of channel.\n\nFor the complete formula of calculating default, see\nlibavcodec/wavpackenc.c.\n\n- compression_level (*-f*, *-h*, *-hh*, and *-x*)\n\n\n Private options\n\n\n- joint_stereo (*-j*)\nSet whether to enable joint stereo. Valid values are:\n\n \n- on (*1*)\nForce mid/side audio encoding.\n- off (*0*)\nForce left/right audio encoding.\n- auto\nLet the encoder decide automatically.\n\n\n- optimize_mono\nSet whether to enable optimization for mono. This option is only effective for\nnon-mono streams. Available values:\n\n \n- on\nenabled\n- off\ndisabled"
  },
  {
    "id": "a64_multi",
    "role": "encoder",
    "content": "A64 / Commodore 64 multicolor charset encoder. `a64_multi5` is extended with 5th color (colram)."
  },
  {
    "id": "Cinepak",
    "role": "encoder",
    "content": "Cinepak aka CVID encoder.\nCompatible with Windows 3.1 and vintage MacOS.\n\n## Options\n\n\n- g integer\nKeyframe interval.\nA keyframe is inserted at least every `-g` frames, sometimes sooner.\n\n- q:v integer\nQuality factor. Lower is better. Higher gives lower bitrate.\nThe following table lists bitrates when encoding akiyo_cif.y4m for various values of `-q:v` with `-g 100`:\n\n\n- `-q:v 1` 1918 kb/s\n- `-q:v 2` 1735 kb/s\n- `-q:v 4` 1500 kb/s\n- `-q:v 10` 1041 kb/s\n- `-q:v 20` 826 kb/s\n- `-q:v 40` 553 kb/s\n- `-q:v 100` 394 kb/s\n- `-q:v 200` 312 kb/s\n- `-q:v 400` 266 kb/s\n- `-q:v 1000` 237 kb/s\n\n\n- max_extra_cb_iterations integer\nMax extra codebook recalculation passes, more is better and slower.\n\n- skip_empty_cb boolean\nAvoid wasting bytes, ignore vintage MacOS decoder.\n\n- max_strips integer\n min_strips integer\nThe minimum and maximum number of strips to use.\nWider range sometimes improves quality.\nMore strips is generally better quality but costs more bits.\nFewer strips tend to yield more keyframes.\nVintage compatible is 1..3.\n\n- strip_number_adaptivity integer\nHow much number of strips is allowed to change between frames.\nHigher is better but slower.\n\n\n\nffv1"
  },
  {
    "id": "ffv1",
    "role": "encoder",
    "content": "FFv1 Encoder\n\n## Options\n\nThe following options are supported by FFmpeg's FFv1 encoder.\n\n\n- context\nSets the context size, 0 (default) is small, 1 is big.\n\n- coder\nSet the coder,\n \n- rice\nGolomb rice coder\n- range_def\nRange coder with default table\n- range_tab\nRange coder with custom table\n\n\n- slicecrc\n-1 (default, automatic), 1 use crc with zero initial and final state, 2 use crc with non zero initial and final state\n\n- qtable\n \n- default\ndefault, automatic\n- 8bit\nuse 8bit default\n- greater8bit\nuse >8bit default\n\n\n- remap_optimizer\n0 - 5, default 3, how much effort the encoder puts into optimizing the remap table."
  },
  {
    "id": "GIF",
    "role": "encoder",
    "content": "GIF image/animation encoder.\n\n## Options\n\n\n- gifflags integer\nSets the flags used for GIF encoding.\n\n\n- offsetting\nEnables picture offsetting.\n\nDefault is enabled.\n\n- transdiff\nEnables transparency detection between frames.\n\nDefault is enabled.\n\n\n\n- gifimage integer\nEnables encoding one full GIF image per frame, rather than an animated GIF.\n\nDefault value is 0.\n\n- global_palette integer\nWrites a palette to the global GIF header where feasible.\n\nIf disabled, every frame will always have a palette written, even if there\nis a global palette supplied.\n\nDefault value is 1."
  },
  {
    "id": "Hap",
    "role": "encoder",
    "content": "Vidvox Hap video encoder.\n\n## Options\n\n\n- format integer\nSpecifies the Hap format to encode.\n\n\n- hap\n- hap_alpha\n- hap_q\n\n\nDefault value is hap.\n\n- chunks integer\nSpecifies the number of chunks to split frames into, between 1 and 64. This\npermits multithreaded decoding of large frames, potentially at the cost of\ndata-rate. The encoder may modify this value to divide frames evenly.\n\nDefault value is 1.\n\n- compressor integer\nSpecifies the second-stage compressor to use. If set to none,\nchunks will be limited to 1, as chunked uncompressed frames offer no\nbenefit.\n\n\n- none\n- snappy\n\n\nDefault value is snappy."
  },
  {
    "id": "jpeg2000",
    "role": "encoder",
    "content": "The native jpeg 2000 encoder is lossy by default, the `-q:v`\noption can be used to set the encoding quality. Lossless encoding\ncan be selected with `-pred 1`.\n\n## Options\n\n\n- format integer\nCan be set to either `j2k` or `jp2` (the default) that\nmakes it possible to store non-rgb pix_fmts.\n\n- tile_width integer\nSets tile width. Range is 1 to 1073741824. Default is 256.\n\n- tile_height integer\nSets tile height. Range is 1 to 1073741824. Default is 256.\n\n- pred integer\nAllows setting the discrete wavelet transform (DWT) type\n\n- dwt97int (Lossy)\n- dwt53 (Lossless)\n\nDefault is `dwt97int`\n\n- sop boolean\nEnable this to add SOP marker at the start of each packet. Disabled by default.\n\n- eph boolean\nEnable this to add EPH marker at the end of each packet header. Disabled by default.\n\n- prog integer\nSets the progression order to be used by the encoder.\nPossible values are:\n\n- lrcp\n- rlcp\n- rpcl\n- pcrl\n- cprl\n\nSet to `lrcp` by default.\n\n- layer_rates string\nBy default, when this option is not used, compression is done using the quality metric.\nThis option allows for compression using compression ratio. The compression ratio for each\nlevel could be specified. The compression ratio of a layer `l` species the what ratio of\ntotal file size is contained in the first `l` layers.\n\nExample usage:\n\n\nffmpeg -i input.bmp -c:v jpeg2000 -layer_rates \"100,10,1\" output.j2k\n example\n\nThis would compress the image to contain 3 layers, where the data contained in the\nfirst layer would be compressed by 1000 times, compressed by 100 in the first two layers,\nand shall contain all data while using all 3 layers."
  },
  {
    "id": "librav1e",
    "role": "encoder",
    "content": "rav1e AV1 encoder wrapper.\n\nRequires the presence of the rav1e headers and library during configuration.\nYou need to explicitly configure the build with `--enable-librav1e`.\n\n## Options\n\n\n- qmax\nSets the maximum quantizer to use when using bitrate mode.\n\n- qmin\nSets the minimum quantizer to use when using bitrate mode.\n\n- qp\nUses quantizer mode to encode at the given quantizer (0-255).\n\n- speed\nSelects the speed preset (0-10) to encode with.\n\n- tiles\nSelects how many tiles to encode with.\n\n- tile-rows\nSelects how many rows of tiles to encode with.\n\n- tile-columns\nSelects how many columns of tiles to encode with.\n\n- rav1e-params\nSet rav1e options using a list of key=value pairs separated\nby \":\". See rav1e --help for a list of options.\n\nFor example to specify librav1e encoding options with -rav1e-params:\n\n\nffmpeg -i input -c:v librav1e -b:v 500K -rav1e-params speed=5:low_latency=true output.mp4\n example"
  },
  {
    "id": "libaom-av1",
    "role": "encoder",
    "content": "libaom AV1 encoder wrapper.\n\nRequires the presence of the libaom headers and library during\nconfiguration.  You need to explicitly configure the build with\n`--enable-libaom`.\n\n## Options\n\nThe wrapper supports the following standard libavcodec options:\n\n\n\n- b\nSet bitrate target in bits/second.  By default this will use\nvariable-bitrate mode.  If maxrate and minrate are\nalso set to the same value then it will use constant-bitrate mode,\notherwise if crf is set as well then it will use\nconstrained-quality mode.\n\n- g keyint_min\nSet key frame placement.  The GOP size sets the maximum distance between\nkey frames; if zero the output stream will be intra-only.  The minimum\ndistance is ignored unless it is the same as the GOP size, in which case\nkey frames will always appear at a fixed interval.  Not set by default,\nso without this option the library has completely free choice about\nwhere to place key frames.\n\n- qmin qmax\nSet minimum/maximum quantisation values.  Valid range is from 0 to 63\n(warning: this does not match the quantiser values actually used by AV1\n- divide by four to map real quantiser values to this range).  Defaults\nto min/max (no constraint).\n\n- minrate maxrate bufsize rc_init_occupancy\nSet rate control buffering parameters.  Not used if not set - defaults\nto unconstrained variable bitrate.\n\n- threads\nSet the number of threads to use while encoding.  This may require the\ntiles or row-mt options to also be set to actually\nuse the specified number of threads fully. Defaults to the number of\nhardware threads supported by the host machine.\n\n- profile\nSet the encoding profile.  Defaults to using the profile which matches\nthe bit depth and chroma subsampling of the input.\n\n\n\nThe wrapper also has some specific options:\n\n\n\n- cpu-used\nSet the quality/encoding speed tradeoff.  Valid range is from 0 to 8,\nhigher numbers indicating greater speed and lower quality.  The default\nvalue is 1, which will be slow and high quality.\n\n- auto-alt-ref\nEnable use of alternate reference frames.  Defaults to the internal\ndefault of the library.\n\n- arnr-max-frames (*frames*)\nSet altref noise reduction max frame count. Default is -1.\n\n- arnr-strength (*strength*)\nSet altref noise reduction filter strength. Range is -1 to 6. Default is -1.\n\n- aq-mode (*aq-mode*)\nSet adaptive quantization mode. Possible values:\n\n \n- none (*0*)\nDisabled.\n\n- variance (*1*)\nVariance-based.\n\n- complexity (*2*)\nComplexity-based.\n\n- cyclic (*3*)\nCyclic refresh.\n\n\n- tune (*tune*)\nSet the distortion metric the encoder is tuned with. Default is `psnr`.\n\n \n- psnr (*0*)\n\n- ssim (*1*)\n\n\n- lag-in-frames\nSet the maximum number of frames which the encoder may keep in flight\nat any one time for lookahead purposes.  Defaults to the internal\ndefault of the library.\n\n- error-resilience\nEnable error resilience features:\n\n- default\nImprove resilience against losses of whole frames.\n\nNot enabled by default.\n\n- crf\nSet the quality/size tradeoff for constant-quality (no bitrate target)\nand constrained-quality (with maximum bitrate target) modes. Valid\nrange is 0 to 63, higher numbers indicating lower quality and smaller\noutput size.  Only used if set; by default only the bitrate target is\nused.\n\n- static-thresh\nSet a change threshold on blocks below which they will be skipped by\nthe encoder.  Defined in arbitrary units as a nonnegative integer,\ndefaulting to zero (no blocks are skipped).\n\n- drop-threshold\nSet a threshold for dropping frames when close to rate control bounds.\nDefined as a percentage of the target buffer - when the rate control\nbuffer falls below this percentage, frames will be dropped until it\nhas refilled above the threshold.  Defaults to zero (no frames are\ndropped).\n\n- denoise-noise-level (*level*)\nAmount of noise to be removed for grain synthesis. Grain synthesis is disabled if\nthis option is not set or set to 0.\n\n- denoise-block-size (*pixels*)\nBlock size used for denoising for grain synthesis. If not set, AV1 codec\nuses the default value of 32.\n\n- undershoot-pct (*pct*)\nSet datarate undershoot (min) percentage of the target bitrate. Range is -1 to 100.\nDefault is -1.\n\n- overshoot-pct (*pct*)\nSet datarate overshoot (max) percentage of the target bitrate. Range is -1 to 1000.\nDefault is -1.\n\n- minsection-pct (*pct*)\nMinimum percentage variation of the GOP bitrate from the target bitrate. If minsection-pct\nis not set, the libaomenc wrapper computes it as follows: `(minrate * 100 / bitrate)`.\nRange is -1 to 100. Default is -1 (unset).\n\n- maxsection-pct (*pct*)\nMaximum percentage variation of the GOP bitrate from the target bitrate. If maxsection-pct\nis not set, the libaomenc wrapper computes it as follows: `(maxrate * 100 / bitrate)`.\nRange is -1 to 5000. Default is -1 (unset).\n\n- frame-parallel (*boolean*)\nEnable frame parallel decodability features. Default is true.\n\n- tiles\nSet the number of tiles to encode the input video with, as columns x\nrows.  Larger numbers allow greater parallelism in both encoding and\ndecoding, but may decrease coding efficiency.  Defaults to the minimum\nnumber of tiles required by the size of the input video (this is 1x1\n(that is, a single tile) for sizes up to and including 4K).\n\n- tile-columns tile-rows\nSet the number of tiles as log2 of the number of tile rows and columns.\nProvided for compatibility with libvpx/VP9.\n\n- row-mt (Requires libaom >= 1.0.0-759-g90a15f4f2)\nEnable row based multi-threading. Disabled by default.\n\n- enable-cdef (*boolean*)\nEnable Constrained Directional Enhancement Filter. The libaom-av1\nencoder enables CDEF by default.\n\n- enable-restoration (*boolean*)\nEnable Loop Restoration Filter. Default is true for libaom-av1.\n\n- enable-global-motion (*boolean*)\nEnable the use of global motion for block prediction. Default is true.\n\n- enable-intrabc (*boolean*)\nEnable block copy mode for intra block prediction. This mode is\nuseful for screen content. Default is true.\n\n- enable-rect-partitions (*boolean*) (Requires libaom >= v2.0.0)\nEnable rectangular partitions. Default is true.\n\n- enable-1to4-partitions (*boolean*) (Requires libaom >= v2.0.0)\nEnable 1:4/4:1 partitions. Default is true.\n\n- enable-ab-partitions (*boolean*) (Requires libaom >= v2.0.0)\nEnable AB shape partitions. Default is true.\n\n- enable-angle-delta (*boolean*) (Requires libaom >= v2.0.0)\nEnable angle delta intra prediction. Default is true.\n\n- enable-cfl-intra (*boolean*) (Requires libaom >= v2.0.0)\nEnable chroma predicted from luma intra prediction. Default is true.\n\n- enable-filter-intra (*boolean*) (Requires libaom >= v2.0.0)\nEnable filter intra predictor. Default is true.\n\n- enable-intra-edge-filter (*boolean*) (Requires libaom >= v2.0.0)\nEnable intra edge filter. Default is true.\n\n- enable-smooth-intra (*boolean*) (Requires libaom >= v2.0.0)\nEnable smooth intra prediction mode. Default is true.\n\n- enable-paeth-intra (*boolean*) (Requires libaom >= v2.0.0)\nEnable paeth predictor in intra prediction. Default is true.\n\n- enable-palette (*boolean*) (Requires libaom >= v2.0.0)\nEnable palette prediction mode. Default is true.\n\n- enable-flip-idtx (*boolean*) (Requires libaom >= v2.0.0)\nEnable extended transform type, including FLIPADST_DCT, DCT_FLIPADST,\nFLIPADST_FLIPADST, ADST_FLIPADST, FLIPADST_ADST, IDTX, V_DCT, H_DCT,\nV_ADST, H_ADST, V_FLIPADST, H_FLIPADST. Default is true.\n\n- enable-tx64 (*boolean*) (Requires libaom >= v2.0.0)\nEnable 64-pt transform. Default is true.\n\n- reduced-tx-type-set (*boolean*) (Requires libaom >= v2.0.0)\nUse reduced set of transform types. Default is false.\n\n- use-intra-dct-only (*boolean*) (Requires libaom >= v2.0.0)\nUse DCT only for INTRA modes. Default is false.\n\n- use-inter-dct-only (*boolean*) (Requires libaom >= v2.0.0)\nUse DCT only for INTER modes. Default is false.\n\n- use-intra-default-tx-only (*boolean*) (Requires libaom >= v2.0.0)\nUse Default-transform only for INTRA modes. Default is false.\n\n- enable-ref-frame-mvs (*boolean*) (Requires libaom >= v2.0.0)\nEnable temporal mv prediction. Default is true.\n\n- enable-reduced-reference-set (*boolean*) (Requires libaom >= v2.0.0)\nUse reduced set of single and compound references. Default is false.\n\n- enable-obmc (*boolean*) (Requires libaom >= v2.0.0)\nEnable obmc. Default is true.\n\n- enable-dual-filter (*boolean*) (Requires libaom >= v2.0.0)\nEnable dual filter. Default is true.\n\n- enable-diff-wtd-comp (*boolean*) (Requires libaom >= v2.0.0)\nEnable difference-weighted compound. Default is true.\n\n- enable-dist-wtd-comp (*boolean*) (Requires libaom >= v2.0.0)\nEnable distance-weighted compound. Default is true.\n\n- enable-onesided-comp (*boolean*) (Requires libaom >= v2.0.0)\nEnable one sided compound. Default is true.\n\n- enable-interinter-wedge (*boolean*) (Requires libaom >= v2.0.0)\nEnable interinter wedge compound. Default is true.\n\n- enable-interintra-wedge (*boolean*) (Requires libaom >= v2.0.0)\nEnable interintra wedge compound. Default is true.\n\n- enable-masked-comp (*boolean*) (Requires libaom >= v2.0.0)\nEnable masked compound. Default is true.\n\n- enable-interintra-comp (*boolean*) (Requires libaom >= v2.0.0)\nEnable interintra compound. Default is true.\n\n- enable-smooth-interintra (*boolean*) (Requires libaom >= v2.0.0)\nEnable smooth interintra mode. Default is true.\n\n- aom-params\nSet libaom options using a list of key=value pairs separated\nby \":\". For a list of supported options, see aomenc --help under the\nsection \"AV1 Specific Options\".\n\nFor example to specify libaom encoding options with -aom-params:\n\n\nffmpeg -i input -c:v libaom-av1 -b:v 500K -aom-params tune=psnr:enable-tpl-model=1 output.mp4\n example"
  },
  {
    "id": "liboapv",
    "role": "encoder",
    "content": "Advanced Professional Video codec encoder wrapper.\n\nThis encoder requires the presence of the liboapv headers and library\nduring configuration. You need to explicitly configure the build with\n--enable-liboapv.\n\n NOTE\nMany liboapv encoder options are mapped to FFmpeg global codec options,\nwhile unique encoder options are provided through private options.\n float\n\nThe apv project website is at https://github.com/AcademySoftwareFoundation/openapv.\n\n## Options\n\nThe following options are supported by the liboapv wrapper.\n\n NOTE\nTo get a more extensive documentation of the liboapv options, consult the\nliboapv documentation.\n float\n\n\n- preset\nSet the quality-speed tradeoff [fastest, fast, medium, slow, placebo, default]\n\n- qp\nSet the quantization parameter value for CQP rate control mode.\n\n- oapv-params (*parse_apv_params*)\nSet liboapvenc options using a list of key=value pairs separated\nby \":\". See the liboapv encoder user guide for a list of accepted parameters."
  },
  {
    "id": "libsvtav1",
    "role": "encoder",
    "content": "SVT-AV1 encoder wrapper.\n\nRequires the presence of the SVT-AV1 headers and library during configuration.\nYou need to explicitly configure the build with `--enable-libsvtav1`.\n\n## Options\n\n\n- profile\nSet the encoding profile.\n \n- main\n- high\n- professional\n\n\n- level\nSet the operating point level. For example: '4.0'\n\n- hielevel\nSet the Hierarchical prediction levels.\n \n- 3level\n- 4level\nThis is the default.\n\n\n- tier\nSet the operating point tier.\n \n- main\nThis is the default.\n- high\n\n\n- qmax\nSet the maximum quantizer to use when using a bitrate mode.\n\n- qmin\nSet the minimum quantizer to use when using a bitrate mode.\n\n- crf\nConstant rate factor value used in crf rate control mode (0-63).\n\n- qp\nSet the quantizer used in cqp rate control mode (0-63).\n\n- sc_detection\nEnable scene change detection.\n\n- la_depth\nSet number of frames to look ahead (0-120).\n\n- preset\nSet the quality-speed tradeoff, in the range 0 to 13.  Higher values are\nfaster but lower quality.\n\n- tile_rows\nSet log2 of the number of rows of tiles to use (0-6).\n\n- tile_columns\nSet log2 of the number of columns of tiles to use (0-4).\n\n- svtav1-params\nSet SVT-AV1 options using a list of key=value pairs separated\nby \":\". See the SVT-AV1 encoder user guide for a list of accepted parameters."
  },
  {
    "id": "libjxl",
    "role": "encoder",
    "content": "libjxl JPEG XL encoder wrapper.\n\nRequires the presence of the libjxl headers and library during\nconfiguration. You need to explicitly configure the build with\n`--enable-libjxl`.\n\n## Options\n\nThe libjxl wrapper supports the following options:\n\n\n\n- distance\nSet the target Butteraugli distance. This is a quality setting: lower\ndistance yields higher quality, with distance=1.0 roughly comparable to\nlibjpeg Quality 90 for photographic content. Setting distance=0.0 yields\ntrue lossless encoding. Valid values range between 0.0 and 15.0, and sane\nvalues rarely exceed 5.0. Setting distance=0.1 usually attains\ntransparency for most input. The default is 1.0.\n\n- effort\nSet the encoding effort used. Higher effort values produce more consistent\nquality and usually produces a better quality/bpp curve, at the cost of\nmore CPU time required. Valid values range from 1 to 9, and the default is 7.\n\n- modular\nForce the encoder to use Modular mode instead of choosing automatically. The\ndefault is to use VarDCT for lossy encoding and Modular for lossless. VarDCT\nis generally superior to Modular for lossy encoding but does not support\nlossless encoding."
  },
  {
    "id": "libkvazaar",
    "role": "encoder",
    "content": "Kvazaar H.265/HEVC encoder.\n\nRequires the presence of the libkvazaar headers and library during\nconfiguration. You need to explicitly configure the build with\n--enable-libkvazaar.\n\n## Options\n\n\n\n- b\nSet target video bitrate in bit/s and enable rate control.\n\n- kvazaar-params\nSet kvazaar parameters as a list of name=value pairs separated\nby commas (,). See kvazaar documentation for a list of options."
  },
  {
    "id": "libopenh264",
    "role": "encoder",
    "content": "Cisco libopenh264 H.264/MPEG-4 AVC encoder wrapper.\n\nThis encoder requires the presence of the libopenh264 headers and\nlibrary during configuration. You need to explicitly configure the\nbuild with `--enable-libopenh264`. The library is detected using\npkg-config.\n\nFor more information about the library see\nhttp://www.openh264.org.\n\n## Options\n\nThe following FFmpeg global options affect the configurations of the\nlibopenh264 encoder.\n\n\n- b\nSet the bitrate (as a number of bits per second).\n\n- g\nSet the GOP size.\n\n- maxrate\nSet the max bitrate (as a number of bits per second).\n\n- flags +global_header\nSet global header in the bitstream.\n\n- slices\nSet the number of slices, used in parallelized encoding. Default value\nis 0. This is only used when slice_mode is set to\nfixed.\n\n- loopfilter\nEnable loop filter, if set to 1 (automatically enabled). To disable\nset a value of 0.\n\n- profile\nSet profile restrictions. If set to the value of main enable\nCABAC (set the `SEncParamExt.iEntropyCodingModeFlag` flag to 1).\n\n- max_nal_size\nSet maximum NAL size in bytes.\n\n- allow_skip_frames\nAllow skipping frames to hit the target bitrate if set to 1."
  },
  {
    "id": "libtheora",
    "role": "encoder",
    "content": "libtheora Theora encoder wrapper.\n\nRequires the presence of the libtheora headers and library during\nconfiguration. You need to explicitly configure the build with\n`--enable-libtheora`.\n\nFor more information about the libtheora project see\nhttp://www.theora.org/.\n\n## Options\n\nThe following global options are mapped to internal libtheora options\nwhich affect the quality and the bitrate of the encoded stream.\n\n\n- b\nSet the video bitrate in bit/s for CBR (Constant Bit Rate) mode.  In\ncase VBR (Variable Bit Rate) mode is enabled this option is ignored.\n\n- flags\nUsed to enable constant quality mode (VBR) encoding through the\nqscale flag, and to enable the `pass1` and `pass2`\nmodes.\n\n- g\nSet the GOP size.\n\n- global_quality\nSet the global quality as an integer in lambda units.\n\nOnly relevant when VBR mode is enabled with `flags +qscale`. The\nvalue is converted to QP units by dividing it by `FF_QP2LAMBDA`,\nclipped in the [0 - 10] range, and then multiplied by 6.3 to get a\nvalue in the native libtheora range [0-63]. A higher value corresponds\nto a higher quality.\n\n- q\nEnable VBR mode when set to a non-negative value, and set constant\nquality value as a double floating point value in QP units.\n\nThe value is clipped in the [0-10] range, and then multiplied by 6.3\nto get a value in the native libtheora range [0-63].\n\nThis option is valid only using the ffmpeg command-line\ntool. For library interface users, use global_quality.\n\n\n## 1469\n\n\n- Set maximum constant quality (VBR) encoding with ffmpeg:\n\nffmpeg -i INPUT -codec:v libtheora -q:v 10 OUTPUT.ogg\n example\n\n- Use ffmpeg to convert a CBR 1000 kbps Theora video stream:\n\nffmpeg -i INPUT -codec:v libtheora -b:v 1000k OUTPUT.ogg\n example\n itemize"
  },
  {
    "id": "libvpx",
    "role": "encoder",
    "content": "VP8/VP9 format supported through libvpx.\n\nRequires the presence of the libvpx headers and library during configuration.\nYou need to explicitly configure the build with `--enable-libvpx`.\n\n## Options\n\nThe following options are supported by the libvpx wrapper. The\nvpxenc-equivalent options or values are listed in parentheses\nfor easy migration.\n\nTo reduce the duplication of documentation, only the private options\nand some others requiring special attention are documented here. For\nthe documentation of the undocumented generic options, see\ncodec-options,,the Codec Options chapter.\n\nTo get more documentation of the libvpx options, invoke the command\nffmpeg -h encoder=libvpx, ffmpeg -h encoder=libvpx-vp9 or\nvpxenc --help. Further information is available in the libvpx API\ndocumentation.\n\n\n\n- b (*target-bitrate*)\nSet bitrate in bits/s. Note that FFmpeg's b option is\nexpressed in bits/s, while vpxenc's target-bitrate is in\nkilobits/s.\n\n- g (*kf-max-dist*)\n\n- keyint_min (*kf-min-dist*)\n\n- qmin (*min-q*)\nMinimum (Best Quality) Quantizer.\n\n- qmax (*max-q*)\nMaximum (Worst Quality) Quantizer.\nCan be changed per-frame.\n\n- bufsize (*buf-sz*, *buf-optimal-sz*)\nSet ratecontrol buffer size (in bits). Note vpxenc's options are\nspecified in milliseconds, the libvpx wrapper converts this value as follows:\n`buf-sz = bufsize * 1000 / bitrate`,\n`buf-optimal-sz = bufsize * 1000 / bitrate * 5 / 6`.\n\n- rc_init_occupancy (*buf-initial-sz*)\nSet number of bits which should be loaded into the rc buffer before decoding\nstarts. Note vpxenc's option is specified in milliseconds, the libvpx\nwrapper converts this value as follows:\n`rc_init_occupancy * 1000 / bitrate`.\n\n- undershoot-pct\nSet datarate undershoot (min) percentage of the target bitrate.\n\n- overshoot-pct\nSet datarate overshoot (max) percentage of the target bitrate.\n\n- skip_threshold (*drop-frame*)\n\n- qcomp (*bias-pct*)\n\n- maxrate (*maxsection-pct*)\nSet GOP max bitrate in bits/s. Note vpxenc's option is specified as a\npercentage of the target bitrate, the libvpx wrapper converts this value as\nfollows: `(maxrate * 100 / bitrate)`.\n\n- minrate (*minsection-pct*)\nSet GOP min bitrate in bits/s. Note vpxenc's option is specified as a\npercentage of the target bitrate, the libvpx wrapper converts this value as\nfollows: `(minrate * 100 / bitrate)`.\n\n- minrate, maxrate, b *end-usage=cbr*\n`(minrate == maxrate == bitrate)`.\n\n- crf (*end-usage=cq*, *cq-level*)\n\n- tune (*tune*)\n \n- psnr (*psnr*)\n- ssim (*ssim*)\n\n\n- quality, deadline (*deadline*)\n \n- best\nUse best quality deadline. Poorly named and quite slow, this option should be\navoided as it may give worse quality output than good.\n- good\nUse good quality deadline. This is a good trade-off between speed and quality\nwhen used with the cpu-used option.\n- realtime\nUse realtime quality deadline.\n\n\n- speed, cpu-used (*cpu-used*)\nSet quality/speed ratio modifier. Higher values speed up the encode at the cost\nof quality.\n\n- nr (*noise-sensitivity*)\n\n- static-thresh\nSet a change threshold on blocks below which they will be skipped by the\nencoder.\n\n- slices (*token-parts*)\nNote that FFmpeg's slices option gives the total number of partitions,\nwhile vpxenc's token-parts is given as\n`log2(partitions)`.\n\n- max-intra-rate\nSet maximum I-frame bitrate as a percentage of the target bitrate. A value of 0\nmeans unlimited.\n\n- force_key_frames\n`VPX_EFLAG_FORCE_KF`\n\n- Alternate reference frame related\n\n- auto-alt-ref\nEnable use of alternate reference frames (2-pass only).\nValues greater than 1 enable multi-layer alternate reference frames (VP9 only).\n- arnr-maxframes\nSet altref noise reduction max frame count.\n- arnr-type\nSet altref noise reduction filter type: backward, forward, centered.\n- arnr-strength\nSet altref noise reduction filter strength.\n- rc-lookahead, lag-in-frames (*lag-in-frames*)\nSet number of frames to look ahead for frametype and ratecontrol.\n- min-gf-interval\nSet minimum golden/alternate reference frame interval (VP9 only).\n\n\n- error-resilient\nEnable error resiliency features.\n\n- sharpness integer\nIncrease sharpness at the expense of lower PSNR.\nThe valid range is [0, 7].\n\n- ts-parameters\nSets the temporal scalability configuration using a :-separated list of\nkey=value pairs. For example, to specify temporal scalability parameters\nwith `ffmpeg`:\n\nffmpeg -i INPUT -c:v libvpx -ts-parameters ts_number_layers=3:\\\nts_target_bitrate=250,500,1000:ts_rate_decimator=4,2,1:\\\nts_periodicity=4:ts_layer_id=0,2,1,2:ts_layering_mode=3 OUTPUT\n example\nBelow is a brief explanation of each of the parameters, please\nrefer to `struct vpx_codec_enc_cfg` in `vpx/vpx_encoder.h` for more\ndetails.\n\n- ts_number_layers\nNumber of temporal coding layers.\n- ts_target_bitrate\nTarget bitrate for each temporal layer (in kbps).\n(bitrate should be inclusive of the lower temporal layer).\n- ts_rate_decimator\nFrame rate decimation factor for each temporal layer.\n- ts_periodicity\nLength of the sequence defining frame temporal layer membership.\n- ts_layer_id\nTemplate defining the membership of frames to temporal layers.\n- ts_layering_mode\n(optional) Selecting the temporal structure from a set of pre-defined temporal layering modes.\nCurrently supports the following options.\n\n- 0\nNo temporal layering flags are provided internally,\nrelies on flags being passed in using `metadata` field in `AVFrame`\nwith following keys.\n\n- vp8-flags\nSets the flags passed into the encoder to indicate the referencing scheme for\nthe current frame.\nRefer to function `vpx_codec_encode` in `vpx/vpx_encoder.h` for more\ndetails.\n- temporal_id\nExplicitly sets the temporal id of the current frame to encode.\n\n- 2\nTwo temporal layers. 0-1...\n- 3\nThree temporal layers. 0-2-1-2...; with single reference frame.\n- 4\nSame as option \"3\", except there is a dependency between\nthe two temporal layer 2 frames within the temporal period.\n\n\n\n- VP8-specific options\n\n- screen-content-mode\nScreen content mode, one of: 0 (off), 1 (screen), 2 (screen with more aggressive rate control).\n\n\n- VP9-specific options\n\n- lossless\nEnable lossless mode.\n- tile-columns\nSet number of tile columns to use. Note this is given as\n`log2(tile_columns)`. For example, 8 tile columns would be requested by\nsetting the tile-columns option to 3.\n- tile-rows\nSet number of tile rows to use. Note this is given as `log2(tile_rows)`.\nFor example, 4 tile rows would be requested by setting the tile-rows\noption to 2.\n- frame-parallel\nEnable frame parallel decodability features.\n- aq-mode\nSet adaptive quantization mode (0: off (default), 1: variance 2: complexity, 3:\ncyclic refresh, 4: equator360).\n- colorspace *color-space*\nSet input color space. The VP9 bitstream supports signaling the following\ncolorspaces:\n\n- rgb *sRGB*\n- bt709 *bt709*\n- unspecified *unknown*\n- bt470bg *bt601*\n- smpte170m *smpte170*\n- smpte240m *smpte240*\n- bt2020_ncl *bt2020*\n\n- row-mt boolean\nEnable row based multi-threading.\n- tune-content\nSet content type: default (0), screen (1), film (2).\n- corpus-complexity\nCorpus VBR mode is a variant of standard VBR where the complexity distribution\nmidpoint is passed in rather than calculated for a specific clip or chunk.\n\nThe valid range is [0, 10000]. 0 (default) uses standard VBR.\n- enable-tpl boolean\nEnable temporal dependency model.\n- ref-frame-config\nUsing per-frame metadata, set members of the structure `vpx_svc_ref_frame_config_t` in `vpx/vp8cx.h` to fine-control referencing schemes and frame buffer management.\n@*Use a :-separated list of key=value pairs.\nFor example,\n\nav_dict_set(&av_frame->metadata, \"ref-frame-config\", \\\n\"rfc_update_buffer_slot=7:rfc_lst_fb_idx=0:rfc_gld_fb_idx=1:rfc_alt_fb_idx=2:rfc_reference_last=0:rfc_reference_golden=0:rfc_reference_alt_ref=0\");\n example\n\n- rfc_update_buffer_slot\nIndicates the buffer slot number to update\n- rfc_update_last\nIndicates whether to update the LAST frame\n- rfc_update_golden\nIndicates whether to update GOLDEN frame\n- rfc_update_alt_ref\nIndicates whether to update ALT_REF frame\n- rfc_lst_fb_idx\nLAST frame buffer index\n- rfc_gld_fb_idx\nGOLDEN frame buffer index\n- rfc_alt_fb_idx\nALT_REF frame buffer index\n- rfc_reference_last\nIndicates whether to reference LAST frame\n- rfc_reference_golden\nIndicates whether to reference GOLDEN frame\n- rfc_reference_alt_ref\nIndicates whether to reference ALT_REF frame\n- rfc_reference_duration\nIndicates frame duration\n\n\n\n\n\nFor more information about libvpx see:\nhttp://www.webmproject.org/"
  },
  {
    "id": "libvvenc",
    "role": "encoder",
    "content": "VVenC H.266/VVC encoder wrapper.\n\nThis encoder requires the presence of the libvvenc headers and library\nduring configuration. You need to explicitly configure the build with\n--enable-libvvenc.\n\nThe VVenC project website is at\nhttps://github.com/fraunhoferhhi/vvenc.\n\n## 278\n\nVVenC supports only 10-bit color spaces as input. But the internal (encoded)\nbit depth can be set to 8-bit or 10-bit at runtime.\n\n## Options\n\n\n- b\nSets target video bitrate.\n\n- g\nSet the GOP size. Currently support for g=1 (Intra only) or default.\n\n- preset\nSet the VVenC preset.\n\n- levelidc\nSet level idc.\n\n- tier\nSet vvc tier.\n\n- qp\nSet constant quantization parameter.\n\n- subopt boolean\nSet subjective (perceptually motivated) optimization. Default is 1 (on).\n\n- bitdepth8 boolean\nSet 8bit coding mode instead of using 10bit. Default is 0 (off).\n\n- period\nset (intra) refresh period in seconds.\n\n- vvenc-params\nSet vvenc options using a list of key=value couples separated\nby \":\". See vvencapp --fullhelp or vvencFFapp --fullhelp for a list of options.\n\nFor example, the options might be provided as:\n\n\nintraperiod=64:decodingrefreshtype=idr:poc0idr=1:internalbitdepth=8\n example\n\nFor example the encoding options might be provided with -vvenc-params:\n\n\nffmpeg -i input -c:v libvvenc -b 1M -vvenc-params intraperiod=64:decodingrefreshtype=idr:poc0idr=1:internalbitdepth=8 output.mp4\n example"
  },
  {
    "id": "libwebp",
    "role": "encoder",
    "content": "libwebp WebP Image encoder wrapper\n\nlibwebp is Google's official encoder for WebP images. It can encode in either\nlossy or lossless mode. Lossy images are essentially a wrapper around a VP8\nframe. Lossless images are a separate codec developed by Google.\n\n## 257\n\nCurrently, libwebp only supports YUV420 for lossy and RGB for lossless due\nto limitations of the format and libwebp. Alpha is supported for either mode.\nBecause of API limitations, if RGB is passed in when encoding lossy or YUV is\npassed in for encoding lossless, the pixel format will automatically be\nconverted using functions from libwebp. This is not ideal and is done only for\nconvenience.\n\n## Options\n\n\n\n- -lossless boolean\nEnables/Disables use of lossless mode. Default is 0.\n\n- -compression_level integer\nFor lossy, this is a quality/speed tradeoff. Higher values give better quality\nfor a given size at the cost of increased encoding time. For lossless, this is\na size/speed tradeoff. Higher values give smaller size at the cost of increased\nencoding time. More specifically, it controls the number of extra algorithms\nand compression tools used, and varies the combination of these tools. This\nmaps to the method option in libwebp. The valid range is 0 to 6.\nDefault is 4.\n\n- -quality float\nFor lossy encoding, this controls image quality. For lossless encoding, this\ncontrols the effort and time spent in compression.\nRange is 0 to 100. Default is 75.\n\n- -preset type\nConfiguration preset. This does some automatic settings based on the general\ntype of the image.\n\n- none\nDo not use a preset.\n- default\nUse the encoder default.\n- picture\nDigital picture, like portrait, inner shot\n- photo\nOutdoor photograph, with natural lighting\n- drawing\nHand or line drawing, with high-contrast details\n- icon\nSmall-sized colorful images\n- text\nText-like"
  },
  {
    "id": "libx264",
    "role": "encoder",
    "content": "x264 H.264/MPEG-4 AVC encoder wrapper.\n\nThis encoder requires the presence of the libx264 headers and library\nduring configuration. You need to explicitly configure the build with\n`--enable-libx264`.\n\nlibx264 supports an impressive number of features, including 8x8 and\n4x4 adaptive spatial transform, adaptive B-frame placement, CAVLC/CABAC\nentropy coding, interlacing (MBAFF), lossless mode, psy optimizations\nfor detail retention (adaptive quantization, psy-RD, psy-trellis).\n\nMany libx264 encoder options are mapped to FFmpeg global codec\noptions, while unique encoder options are provided through private\noptions. Additionally the x264opts and x264-params\nprivate options allows one to pass a list of key=value tuples as accepted\nby the libx264 `x264_param_parse` function.\n\nThe x264 project website is at\nhttp://www.videolan.org/developers/x264.html.\n\nThe libx264rgb encoder is the same as libx264, except it accepts packed RGB\npixel formats as input instead of YUV.\n\n## 993\n\nx264 supports 8- to 10-bit color spaces. The exact bit depth is controlled at\nx264's configure time.\n\n## Options\n\nThe following options are supported by the libx264 wrapper. The\nx264-equivalent options or values are listed in parentheses\nfor easy migration.\n\nTo reduce the duplication of documentation, only the private options\nand some others requiring special attention are documented here. For\nthe documentation of the undocumented generic options, see\ncodec-options,,the Codec Options chapter.\n\nTo get a more accurate and extensive documentation of the libx264\noptions, invoke the command x264 --fullhelp or consult\nthe libx264 documentation.\n\nIn the list below, note that the x264 option name is shown\nin parentheses after the libavcodec corresponding name, in case there\nis a direct mapping.\n\n\n- b (*bitrate*)\nSet bitrate in bits/s. Note that FFmpeg's b option is\nexpressed in bits/s, while x264's bitrate is in\nkilobits/s.\n\n- bf (*bframes*)\nNumber of B-frames between I and P-frames\n\n- g (*keyint*)\nMaximum GOP size\n\n- qmin (*qpmin*)\nMinimum quantizer scale\n\n- qmax (*qpmax*)\nMaximum quantizer scale\n\n- qdiff (*qpstep*)\nMaximum difference between quantizer scales\n\n- qblur (*qblur*)\nQuantizer curve blur\n\n- qcomp (*qcomp*)\nQuantizer curve compression factor\n\n- refs (*ref*)\nNumber of reference frames each P-frame can use. The range is 0-16.\n\n- level (*level*)\nSet the `x264_param_t.i_level_idc` value in case the value is\npositive, it is ignored otherwise.\n\nThis value can be set using the `AVCodecContext` API (e.g. by\nsetting the `AVCodecContext` value directly), and is specified as\nan integer mapped on a corresponding level (e.g. the value 31 maps\nto H.264 level IDC \"3.1\", as defined in the `x264_levels`\ntable). It is ignored when set to a non positive value.\n\nAlternatively it can be set as a private option, overriding the value\nset in `AVCodecContext`, and in this case must be specified as\nthe level IDC identifier (e.g. \"3.1\"), as defined by H.264 Annex A.\n\n- sc_threshold (*scenecut*)\nSets the threshold for the scene change detection.\n\n- trellis (*trellis*)\nPerforms Trellis quantization to increase efficiency. Enabled by default.\n\n- nr (*nr*)\nNoise reduction\n\n- me_range (*merange*)\nMaximum range of the motion search in pixels.\n\n- me_method (*me*)\nSet motion estimation method. Possible values in the decreasing order\nof speed:\n\n \n- dia (*dia*)\n- epzs (*dia*)\nDiamond search with radius 1 (fastest). epzs is an alias for\ndia.\n- hex (*hex*)\nHexagonal search with radius 2.\n- umh (*umh*)\nUneven multi-hexagon search.\n- esa (*esa*)\nExhaustive search.\n- tesa (*tesa*)\nHadamard exhaustive search (slowest).\n\n\n- forced-idr\nNormally, when forcing a I-frame type, the encoder can select any type\nof I-frame. This option forces it to choose an IDR-frame.\n\n- subq (*subme*)\nSub-pixel motion estimation method.\n\n- b_strategy (*b-adapt*)\nAdaptive B-frame placement decision algorithm. Use only on first-pass.\n\n- keyint_min (*min-keyint*)\nMinimum GOP size.\n\n- coder\nSet entropy encoder. Possible values:\n\n \n- ac\nEnable CABAC.\n\n- vlc\nEnable CAVLC and disable CABAC. It generates the same effect as\nx264's --no-cabac option.\n\n\n- cmp\nSet full pixel motion estimation comparison algorithm. Possible values:\n\n \n- chroma\nEnable chroma in motion estimation.\n\n- sad\nIgnore chroma in motion estimation. It generates the same effect as\nx264's --no-chroma-me option.\n\n\n- threads (*threads*)\nNumber of encoding threads.\n\n- thread_type\nSet multithreading technique. Possible values:\n\n \n- slice\nSlice-based multithreading. It generates the same effect as\nx264's --sliced-threads option.\n- frame\nFrame-based multithreading.\n\n\n- flags\nSet encoding flags. It can be used to disable closed GOP and enable\nopen GOP by setting it to `-cgop`. The result is similar to\nthe behavior of x264's --open-gop option.\n\n- rc_init_occupancy (*vbv-init*)\nInitial VBV buffer occupancy\n\n- preset (*preset*)\nSet the encoding preset.\n\n- tune (*tune*)\nSet tuning of the encoding params.\n\n- profile (*profile*)\nSet profile restrictions.\n\n- fastfirstpass\nEnable fast settings when encoding first pass, when set to 1. When set\nto 0, it has the same effect of x264's\n--slow-firstpass option.\n\n- crf (*crf*)\nSet the quality for constant quality mode.\n\n- crf_max (*crf-max*)\nIn CRF mode, prevents VBV from lowering quality beyond this point.\n\n- qp (*qp*)\nSet constant quantization rate control method parameter.\n\n- aq-mode (*aq-mode*)\nSet AQ method. Possible values:\n\n \n- none (*0*)\nDisabled.\n\n- variance (*1*)\nVariance AQ (complexity mask).\n\n- autovariance (*2*)\nAuto-variance AQ (experimental).\n\n\n- aq-strength (*aq-strength*)\nSet AQ strength, reduce blocking and blurring in flat and textured areas.\n\n- psy\nUse psychovisual optimizations when set to 1. When set to 0, it has the\nsame effect as x264's --no-psy option.\n\n- psy-rd (*psy-rd*)\nSet strength of psychovisual optimization, in\npsy-rd:psy-trellis format.\n\n- rc-lookahead (*rc-lookahead*)\nSet number of frames to look ahead for frametype and ratecontrol.\n\n- weightb\nEnable weighted prediction for B-frames when set to 1. When set to 0,\nit has the same effect as x264's --no-weightb option.\n\n- weightp (*weightp*)\nSet weighted prediction method for P-frames. Possible values:\n\n \n- none (*0*)\nDisabled\n- simple (*1*)\nEnable only weighted refs\n- smart (*2*)\nEnable both weighted refs and duplicates\n\n\n- ssim (*ssim*)\nEnable calculation and printing SSIM stats after the encoding.\n\n- intra-refresh (*intra-refresh*)\nEnable the use of Periodic Intra Refresh instead of IDR frames when set\nto 1.\n\n- avcintra-class (*class*)\nConfigure the encoder to generate AVC-Intra.\nValid values are 50, 100 and 200\n\n- bluray-compat (*bluray-compat*)\nConfigure the encoder to be compatible with the bluray standard.\nIt is a shorthand for setting \"bluray-compat=1 force-cfr=1\".\n\n- b-bias (*b-bias*)\nSet the influence on how often B-frames are used.\n\n- b-pyramid (*b-pyramid*)\nSet method for keeping of some B-frames as references. Possible values:\n\n \n- none (*none*)\nDisabled.\n- strict (*strict*)\nStrictly hierarchical pyramid.\n- normal (*normal*)\nNon-strict (not Blu-ray compatible).\n\n\n- mixed-refs\nEnable the use of one reference per partition, as opposed to one\nreference per macroblock when set to 1. When set to 0, it has the\nsame effect as x264's --no-mixed-refs option.\n\n- 8x8dct\nEnable adaptive spatial transform (high profile 8x8 transform)\nwhen set to 1. When set to 0, it has the same effect as\nx264's --no-8x8dct option.\n\n- fast-pskip\nEnable early SKIP detection on P-frames when set to 1. When set\nto 0, it has the same effect as x264's\n--no-fast-pskip option.\n\n- aud (*aud*)\nEnable use of access unit delimiters when set to 1.\n\n- mbtree\nEnable use macroblock tree ratecontrol when set to 1. When set\nto 0, it has the same effect as x264's\n--no-mbtree option.\n\n- deblock (*deblock*)\nSet loop filter parameters, in alpha:beta form.\n\n- cplxblur (*cplxblur*)\nSet fluctuations reduction in QP (before curve compression).\n\n- partitions (*partitions*)\nSet partitions to consider as a comma-separated list of values.\nPossible values in the list:\n\n \n- p8x8\n8x8 P-frame partition.\n- p4x4\n4x4 P-frame partition.\n- b8x8\n4x4 B-frame partition.\n- i8x8\n8x8 I-frame partition.\n- i4x4\n4x4 I-frame partition.\n(Enabling p4x4 requires p8x8 to be enabled. Enabling\ni8x8 requires adaptive spatial transform (8x8dct\noption) to be enabled.)\n- none (*none*)\nDo not consider any partitions.\n- all (*all*)\nConsider every partition.\n\n\n- direct-pred (*direct*)\nSet direct MV prediction mode. Possible values:\n\n \n- none (*none*)\nDisable MV prediction.\n- spatial (*spatial*)\nEnable spatial predicting.\n- temporal (*temporal*)\nEnable temporal predicting.\n- auto (*auto*)\nAutomatically decided.\n\n\n- slice-max-size (*slice-max-size*)\nSet the limit of the size of each slice in bytes. If not specified\nbut RTP payload size (ps) is specified, that is used.\n\n- stats (*stats*)\nSet the file name for multi-pass stats.\n\n- nal-hrd (*nal-hrd*)\nSet signal HRD information (requires vbv-bufsize to be set).\nPossible values:\n\n \n- none (*none*)\nDisable HRD information signaling.\n- vbr (*vbr*)\nVariable bit rate.\n- cbr (*cbr*)\nConstant bit rate (not allowed in MP4 container).\n\n\n- x264opts opts\n- x264-params opts\nOverride the x264 configuration using a :-separated list of key=value\noptions.\n\nThe argument for both options is a list of key=value\ncouples separated by \":\". With x264opts the value can be\nomitted, and the value `1` is assumed in that case.\n\nFor filter and psy-rd options values that use \":\" as a\nseparator themselves, use \",\" instead. They accept it as well since\nlong ago but this is kept undocumented for some reason.\n\nFor example, the options might be provided as:\n\nlevel=30:bframes=0:weightp=0:cabac=0:ref=1:vbv-maxrate=768:vbv-bufsize=2000:analyse=all:me=umh:no-fast-pskip=1:subq=6:8x8dct=0:trellis=0\n example\n\nFor example to specify libx264 encoding options with ffmpeg:\n\nffmpeg -i foo.mpg -c:v libx264 -x264opts keyint=123:min-keyint=20 -an out.mkv\n example\n\nTo get the complete list of the libx264 options, invoke the command\nx264 --fullhelp or consult the libx264 documentation.\n\n- a53cc boolean\nImport closed captions (which must be ATSC compatible format) into output.\nOnly the mpeg2 and h264 decoders provide these. Default is 1 (on).\n\n- udu_sei boolean\nImport user data unregistered SEI if available into output. Default is 0 (off).\n\n- mb_info boolean\nSet mb_info data through AVFrameSideData, only useful when used from the\nAPI. Default is 0 (off).\n\n\nEncoding ffpresets for common usages are provided so they can be used with the\ngeneral presets system (e.g. passing the pre option)."
  },
  {
    "id": "libx265",
    "role": "encoder",
    "content": "x265 H.265/HEVC encoder wrapper.\n\nThis encoder requires the presence of the libx265 headers and library\nduring configuration. You need to explicitly configure the build with\n--enable-libx265.\n\n## Options\n\n\n- b\nSets target video bitrate.\n\n- bf\n\n- g\nSet the GOP size.\n\n- keyint_min\nMinimum GOP size.\n\n- refs\nNumber of reference frames each P-frame can use. The range is from 1-16.\n\n- preset\nSet the x265 preset.\n\n- tune\nSet the x265 tune parameter.\n\n- profile\nSet profile restrictions.\n\n- crf\nSet the quality for constant quality mode.\n\n- qp\nSet constant quantization rate control method parameter.\n\n- qmin\nMinimum quantizer scale.\n\n- qmax\nMaximum quantizer scale.\n\n- qdiff\nMaximum difference between quantizer scales.\n\n- qblur\nQuantizer curve blur\n\n- qcomp\nQuantizer curve compression factor\n\n- i_qfactor\n\n- b_qfactor\n\n- forced-idr\nNormally, when forcing a I-frame type, the encoder can select any type\nof I-frame. This option forces it to choose an IDR-frame.\n\n- udu_sei boolean\nImport user data unregistered SEI if available into output. Default is 0 (off).\n\n- x265-params\nSet x265 options using a list of key=value couples separated\nby \":\". See x265 --help for a list of options.\n\nFor example to specify libx265 encoding options with -x265-params:\n\n\nffmpeg -i input -c:v libx265 -x265-params crf=26:psy-rd=1 output.mp4\n example"
  },
  {
    "id": "libxavs2",
    "role": "encoder",
    "content": "xavs2 AVS2-P2/IEEE1857.4 encoder wrapper.\n\nThis encoder requires the presence of the libxavs2 headers and library\nduring configuration. You need to explicitly configure the build with\n--enable-libxavs2.\n\nThe following standard libavcodec options are used:\n\n- b / bit_rate\n- g / gop_size\n- bf / max_b_frames\n itemize\n\nThe encoder also has its own specific options:\n## Options\n\n\n- lcu_row_threads\nSet the number of parallel threads for rows from 1 to 8 (default 5).\n\n- initial_qp\nSet the xavs2 quantization parameter from 1 to 63 (default 34). This is\nused to set the initial qp for the first frame.\n\n- qp\nSet the xavs2 quantization parameter from 1 to 63 (default 34). This is\nused to set the qp value under constant-QP mode.\n\n- max_qp\nSet the max qp for rate control from 1 to 63 (default 55).\n\n- min_qp\nSet the min qp for rate control from 1 to 63 (default 20).\n\n- speed_level\nSet the Speed level from 0 to 9 (default 0). Higher is better but slower.\n\n- log_level\nSet the log level from -1 to 3 (default 0). -1: none, 0: error,\n1: warning, 2: info, 3: debug.\n\n- xavs2-params\nSet xavs2 options using a list of key=value couples separated\nby \":\".\n\nFor example to specify libxavs2 encoding options with -xavs2-params:\n\n\nffmpeg -i input -c:v libxavs2 -xavs2-params RdoqLevel=0 output.avs2\n example"
  },
  {
    "id": "libxeve",
    "role": "encoder",
    "content": "eXtra-fast Essential Video Encoder (XEVE) MPEG-5 EVC encoder wrapper.\nThe xeve-equivalent options or values are listed in parentheses for easy migration.\n\nThis encoder requires the presence of the libxeve headers and library\nduring configuration. You need to explicitly configure the build with\n--enable-libxeve.\n\n NOTE\nMany libxeve encoder options are mapped to FFmpeg global codec options,\nwhile unique encoder options are provided through private options.\nAdditionally the xeve-params private options allows one to pass a list\nof key=value tuples as accepted by the libxeve `parse_xeve_params` function.\n float\n\nThe xeve project website is at https://github.com/mpeg5/xeve.\n\n## Options\n\nThe following options are supported by the libxeve wrapper.\nThe xeve-equivalent options or values are listed in parentheses for easy migration.\n\n NOTE\nTo reduce the duplication of documentation, only the private options\nand some others requiring special attention are documented here. For\nthe documentation of the undocumented generic options, see\ncodec-options,,the Codec Options chapter.\n float\n\n NOTE\nTo get a more accurate and extensive documentation of the libxeve options,\ninvoke the command  `xeve_app --help` or consult the libxeve documentation.\n float\n\n\n- b (*bitrate*)\nSet target video bitrate in bits/s.\nNote that FFmpeg's b option is expressed in bits/s, while xeve's bitrate is in kilobits/s.\n\n- bf (*bframes*)\nSet the maximum number of B frames (1,3,7,15).\n\n- g (*keyint*)\nSet the GOP size (I-picture period).\n\n- preset (*preset*)\nSet the xeve preset.\nSet the encoder preset value to determine encoding speed [fast, medium, slow, placebo]\n\n- tune (*tune*)\nSet the encoder tune parameter [psnr, zerolatency]\n\n- profile (*profile*)\nSet the encoder profile [0: baseline; 1: main]\n\n- crf (*crf*)\nSet the quality for constant quality mode.\nConstant rate factor <10..49> [default: 32]\n\n- qp (*qp*)\nSet constant quantization rate control method parameter.\nQuantization parameter qp <0..51> [default: 32]\n\n- threads (*threads*)\nForce to use a specific number of threads"
  },
  {
    "id": "libxvid",
    "role": "encoder",
    "content": "Xvid MPEG-4 Part 2 encoder wrapper.\n\nThis encoder requires the presence of the libxvidcore headers and library\nduring configuration. You need to explicitly configure the build with\n`--enable-libxvid --enable-gpl`.\n\nThe native `mpeg4` encoder supports the MPEG-4 Part 2 format, so\nusers can encode to this format without this library.\n\n## Options\n\nThe following options are supported by the libxvid wrapper. Some of\nthe following options are listed but are not documented, and\ncorrespond to shared codec options. See codec-options,,the Codec\nOptions chapter for their documentation. The other shared options\nwhich are not listed have no effect for the libxvid encoder.\n\n\n- b\n\n- g\n\n- qmin\n\n- qmax\n\n- mpeg_quant\n\n- threads\n\n- bf\n\n- b_qfactor\n\n- b_qoffset\n\n- flags\nSet specific encoding flags. Possible values:\n\n \n\n- mv4\nUse four motion vector by macroblock.\n\n- aic\nEnable high quality AC prediction.\n\n- gray\nOnly encode grayscale.\n\n- qpel\nEnable quarter-pixel motion compensation.\n\n- cgop\nEnable closed GOP.\n\n- global_header\nPlace global headers in extradata instead of every keyframe.\n\n\n\n- gmc\nEnable the use of global motion compensation (GMC).  Default is 0\n(disabled).\n\n- me_quality\nSet motion estimation quality level. Possible values in decreasing order of\nspeed and increasing order of quality:\n\n \n- 0\nUse no motion estimation (default).\n\n- 1, 2\nEnable advanced diamond zonal search for 16x16 blocks and half-pixel\nrefinement for 16x16 blocks.\n\n- 3, 4\nEnable all of the things described above, plus advanced diamond zonal\nsearch for 8x8 blocks and half-pixel refinement for 8x8 blocks, also\nenable motion estimation on chroma planes for P and B-frames.\n\n- 5, 6\nEnable all of the things described above, plus extended 16x16 and 8x8\nblocks search.\n\n\n- mbd\nSet macroblock decision algorithm. Possible values in the increasing\norder of quality:\n\n \n- simple\nUse macroblock comparing function algorithm (default).\n\n- bits\nEnable rate distortion-based half pixel and quarter pixel refinement for\n16x16 blocks.\n\n- rd\nEnable all of the things described above, plus rate distortion-based\nhalf pixel and quarter pixel refinement for 8x8 blocks, and rate\ndistortion-based search using square pattern.\n\n\n- lumi_aq\nEnable lumi masking adaptive quantization when set to 1. Default is 0\n(disabled).\n\n- variance_aq\nEnable variance adaptive quantization when set to 1. Default is 0\n(disabled).\n\nWhen combined with lumi_aq, the resulting quality will not\nbe better than any of the two specified individually. In other\nwords, the resulting quality will be the worse one of the two\neffects.\n\n- trellis\nSet rate-distortion optimal quantization.\n\n- ssim\nSet structural similarity (SSIM) displaying method. Possible values:\n\n \n- off\nDisable displaying of SSIM information.\n\n- avg\nOutput average SSIM at the end of encoding to stdout. The format of\nshowing the average SSIM is:\n\n\nAverage SSIM: %f\n example\n\nFor users who are not familiar with C, %f means a float number, or\na decimal (e.g. 0.939232).\n\n- frame\nOutput both per-frame SSIM data during encoding and average SSIM at\nthe end of encoding to stdout. The format of per-frame information\nis:\n\n\n       SSIM: avg: %1.3f min: %1.3f max: %1.3f\n example\n\nFor users who are not familiar with C, %1.3f means a float number\nrounded to 3 digits after the dot (e.g. 0.932).\n\n\n\n- ssim_acc\nSet SSIM accuracy. Valid options are integers within the range of\n0-4, while 0 gives the most accurate result and 4 computes the\nfastest."
  },
  {
    "id": "MediaCodec",
    "role": "encoder",
    "content": "MediaCodec encoder wrapper enables hardware-accelerated video encoding on\nAndroid device. It supports H.264, H.265 (HEVC), VP8, VP9, MPEG-4, and AV1\nencoding (whether works or not is device dependent).\n\nAndroid provides two sets of APIs: Java MediaCodec and NDK MediaCodec. The\nMediaCodec encoder wrapper supports both. Note that the NDK MediaCodec API\noperates without requiring JVM, but may fail to function outside the JVM\nenvironment due to dependencies on system framework services, particularly\nafter Android 15.\n\n\n- ndk_codec boolean\nUse the NDK-based MediaCodec API instead of the Java API. Enabled by default\nif `av_jni_get_java_vm()` return NULL.\n\n- ndk_async boolean\nUse NDK MediaCodec in async mode. Async mode has less overhead than poll in a\nloop in sync mode. The drawback of async mode is AV_CODEC_FLAG_GLOBAL_HEADER\ndoesn't work (use extract_extradata bsf when necessary). It doesn't work and\nwill be disabled automatically on devices below Android 8.0.\n\n- codec_name string\nA codec type can have multiple implementations on a single device, this option\nspecify which backend to use (via MediaCodec createCodecByName API). It's NULL\nby default, and encoder is created by createEncoderByType.\n\n- bitrate_mode integer\n\nPossible values:\n \n- cq\nConstant quality mode\n- vbr\nVariable bitrate mode\n- cbr\nConstant bitrate mode\n- cbr_fd\nConstant bitrate mode with frame drops\n\n\n- pts_as_dts boolean\nUse PTS as DTS. This is a workaround since MediaCodec API doesn't provide\ndecoding timestamp. It is enabled automatically if B frame is 0.\n\n- operating_rate integer\nThe desired operating rate that the codec will need to operate at, zero for\nunspecified. This is used for cases like high-speed/slow-motion video capture,\nwhere the video encoder format contains the target playback rate (e.g. 30fps),\nbut the component must be able to handle the high operating capture rate (e.g.\n240fps). This rate will be used by codec for resource planning and setting the\noperating points.\n\n- qp_i_min integer\nMinimum quantization parameter for I frame.\n- qp_p_min integer\nMinimum quantization parameter for P frame.\n- qp_b_min integer\nMinimum quantization parameter for B frame.\n- qp_i_max integer\nMaximum quantization parameter for I frame.\n- qp_p_max integer\nMaximum quantization parameter for P frame.\n- qp_b_max integer\nMaximum quantization parameter for B frame."
  },
  {
    "id": "MediaFoundation",
    "role": "encoder",
    "content": "This provides wrappers to encoders (both audio and video) in the\nMediaFoundation framework. It can access both SW and HW encoders.\nVideo encoders can take input in either of nv12 or yuv420p form\n(some encoders support both, some support only either - in practice,\nnv12 is the safer choice, especially among HW encoders)."
  },
  {
    "id": "Microsoft",
    "role": "encoder",
    "content": "Microsoft RLE aka MSRLE encoder.\nOnly 8-bit palette mode supported.\nCompatible with Windows 3.1 and Windows 95.\n\n## Options\n\n\n- g integer\nKeyframe interval.\nA keyframe is inserted at least every `-g` frames, sometimes sooner."
  },
  {
    "id": "mpeg2",
    "role": "encoder",
    "content": "MPEG-2 video encoder.\n\n## Options\n\n\n- profile\nSelect the mpeg2 profile to encode:\n\n \n- 422\n- high\n- ss\nSpatially Scalable\n- snr\nSNR Scalable\n- main\n- simple\n\n\n- level\nSelect the mpeg2 level to encode:\n\n \n- high\n- high1440\n- main\n- low\n\n\n- seq_disp_ext integer\nSpecifies if the encoder should write a sequence_display_extension to the\noutput.\n\n- -1\n auto\nDecide automatically to write it or not (this is the default) by checking if\nthe data to be written is different from the default or unspecified values.\n- 0\n never\nNever write it.\n- 1\n always\nAlways write it.\n\n- video_format integer\nSpecifies the video_format written into the sequence display extension\nindicating the source of the video pictures. The default is unspecified,\ncan be component, pal, ntsc, secam or mac.\nFor maximum compatibility, use component.\n- a53cc boolean\nImport closed captions (which must be ATSC compatible format) into output.\nDefault is 1 (on)."
  },
  {
    "id": "png",
    "role": "encoder",
    "content": "PNG image encoder.\n\n## Options\n\n\n- compression_level\nSets the compression level, from 0 to 9(default)\n\n\n## 105\n\n\n- dpi integer\nSet physical density of pixels, in dots per inch, unset by default\n- dpm integer\nSet physical density of pixels, in dots per meter, unset by default\n- pred method\nSet prediction method (none, sub, up, avg, paeth, mixed), default is paeth"
  },
  {
    "id": "ProRes",
    "role": "encoder",
    "content": "Apple ProRes encoder.\n\nFFmpeg contains 2 ProRes encoders, the prores-aw and prores-ks encoder.\nThe used encoder can be chosen with the `-vcodec` option.\n\n## 155\n\n\n- profile integer\nSelect the ProRes profile to encode\n \n- proxy\n- lt\n- standard\n- hq\n- 4444\n- 4444xq\n\n\n- quant_mat integer\nSelect quantization matrix.\n \n- auto\n- default\n- proxy\n- lt\n- standard\n- hq\n\nIf set to auto, the matrix matching the profile will be picked.\nIf not set, the matrix providing the highest quality, default, will be\npicked.\n\n- bits_per_mb integer\nHow many bits to allot for coding one macroblock. Different profiles use\nbetween 200 and 2400 bits per macroblock, the maximum is 8000.\n\n- mbs_per_slice integer\nNumber of macroblocks in each slice (1-8); the default value (8)\nshould be good in almost all situations.\n\n- vendor string\nOverride the 4-byte vendor ID.\nA custom vendor ID like apl0 would claim the stream was produced by\nthe Apple encoder.\n\n- alpha_bits integer\nSpecify number of bits for alpha component.\nPossible values are 0, 8 and 16.\nUse 0 to disable alpha plane coding.\n\n\n\n## 1206\n\nIn the default mode of operation the encoder has to honor frame constraints\n(i.e. not produce frames with size bigger than requested) while still making\noutput picture as good as possible.\nA frame containing a lot of small details is harder to compress and the encoder\nwould spend more time searching for appropriate quantizers for each slice.\n\nSetting a higher bits_per_mb limit will improve the speed.\n\nFor the fastest encoding speed set the qscale parameter (4 is the\nrecommended value) and do not set a size constraint."
  },
  {
    "id": "QSV",
    "role": "encoder",
    "content": "The family of Intel QuickSync Video encoders (MPEG-2, H.264, HEVC, JPEG/MJPEG,\nVP9, AV1)\n\n## 91\nThe ratecontrol method is selected as follows:\n \n- When global_quality is specified, a quality-based mode is used.\nSpecifically this means either\n \n- CQP - constant quantizer scale, when the qscale codec flag is\nalso set (the -qscale ffmpeg option).\n\n- LA_ICQ - intelligent constant quality with lookahead, when the\nlook_ahead option is also set.\n\n- ICQ -- intelligent constant quality otherwise. For the ICQ modes, global\nquality range is 1 to 51, with 1 being the best quality.\n itemize\n\n- Otherwise when the desired average bitrate is specified with the b\noption, a bitrate-based mode is used.\n \n- LA - VBR with lookahead, when the look_ahead option is specified.\n\n- VCM - video conferencing mode, when the vcm option is set.\n\n- CBR - constant bitrate, when maxrate is specified and equal to\nthe average bitrate.\n\n- VBR - variable bitrate, when maxrate is specified, but is higher\nthan the average bitrate.\n\n- AVBR - average VBR mode, when maxrate is not specified, both\navbr_accuracy and avbr_convergence are set to non-zero. This\nmode is available for H264 and HEVC on Windows.\n itemize\n\n- Otherwise the default ratecontrol method CQP is used.\n itemize\n\nNote that depending on your system, a different mode than the one you specified\nmay be selected by the encoder. Set the verbosity level to verbose or\nhigher to see the actual settings used by the QSV runtime.\n\n## 1714\nAdditional libavcodec global options are mapped to MSDK options as follows:\n\n\n- g/gop_size -> GopPicSize\n\n- bf/max_b_frames+1 -> GopRefDist\n\n- rc_init_occupancy/rc_initial_buffer_occupancy ->\nInitialDelayInKB\n\n- slices -> NumSlice\n\n- refs -> NumRefFrame\n\n- b_strategy/b_frame_strategy -> BRefType\n\n- cgop/CLOSED_GOP codec flag -> GopOptFlag\n\n- For the CQP mode, the i_qfactor/i_qoffset and\nb_qfactor/b_qoffset set the difference between QPP and QPI,\nand QPP and QPB respectively.\n\n- Setting the coder option to the value vlc will make the H.264\nencoder use CAVLC instead of CABAC.\n\n itemize\n\n## 2550\nFollowing options are used by all qsv encoders.\n\n\n- async_depth\nSpecifies how many asynchronous operations an application performs\nbefore the application explicitly synchronizes the result. If zero,\nthe value is not specified.\n\n- preset\nThis option itemizes a range of choices from veryfast (best speed) to veryslow\n(best quality).\n \n- veryfast\n- faster\n- fast\n- medium\n- slow\n- slower\n- veryslow\n\n\n- forced_idr\nForcing I frames as IDR frames.\n\n- low_power\nFor encoders set this flag to ON to reduce power consumption and GPU usage.\n\n\n## 3147\nFollowing options can be used during qsv encoding.\n\n\n- global_quality\n- i_quant_factor\n- i_quant_offset\n- b_quant_factor\n- b_quant_offset\nSupported in h264_qsv and hevc_qsv.\nChange these value to reset qsv codec's qp configuration.\n\n- max_frame_size\nSupported in h264_qsv and hevc_qsv.\nChange this value to reset qsv codec's MaxFrameSize configuration.\n\n- gop_size\nChange this value to reset qsv codec's gop configuration.\n\n- int_ref_type\n- int_ref_cycle_size\n- int_ref_qp_delta\n- int_ref_cycle_dist\nSupported in h264_qsv and hevc_qsv.\nChange these value to reset qsv codec's Intra Refresh configuration.\n\n- qmax\n- qmin\n- max_qp_i\n- min_qp_i\n- max_qp_p\n- min_qp_p\n- max_qp_b\n- min_qp_b\nSupported in h264_qsv.\nChange these value to reset qsv codec's max/min qp configuration.\n\n- low_delay_brc\nSupported in h264_qsv, hevc_qsv and av1_qsv.\nChange this value to reset qsv codec's low_delay_brc configuration.\n\n- framerate\nChange this value to reset qsv codec's framerate configuration.\n\n- bit_rate\n- rc_buffer_size\n- rc_initial_buffer_occupancy\n- rc_max_rate\nChange these value to reset qsv codec's bitrate control configuration.\n\n- pic_timing_sei\nSupported in h264_qsv and hevc_qsv.\nChange this value to reset qsv codec's pic_timing_sei configuration.\n\n- qsv_params\nSet QSV encoder parameters as a colon-separated list of key-value pairs.\n\nThe qsv_params should be formatted as `key1=value1:key2=value2:...`.\n\nThese parameters are passed directly to the underlying Intel Quick Sync Video (QSV) encoder using the MFXSetParameter function.\n\nExample:\n\nffmpeg -i input.mp4 -c:v h264_qsv -qsv_params \"CodingOption1=1:CodingOption2=2\" output.mp4\n example\n\nThis option allows fine-grained control over various encoder-specific settings provided by the QSV encoder.\n\n\n## 5115\nThese options are used by h264_qsv\n\n\n- extbrc\nExtended bitrate control.\n\n- recovery_point_sei\nSet this flag to insert the recovery point SEI message at the beginning of every\nintra refresh cycle.\n\n- rdo\nEnable rate distortion optimization.\n\n- max_frame_size\nMaximum encoded frame size in bytes.\n\n- max_frame_size_i\nMaximum encoded frame size for I frames in bytes. If this value is set as larger\nthan zero, then for I frames the value set by max_frame_size is ignored.\n\n- max_frame_size_p\nMaximum encoded frame size for P frames in bytes. If this value is set as larger\nthan zero, then for P frames the value set by max_frame_size is ignored.\n\n- max_slice_size\nMaximum encoded slice size in bytes.\n\n- bitrate_limit\nToggle bitrate limitations.\nModifies bitrate to be in the range imposed by the QSV encoder. Setting this\nflag off may lead to violation of HRD conformance. Mind that specifying bitrate\nbelow the QSV encoder range might significantly affect quality. If on this\noption takes effect in non CQP modes: if bitrate is not in the range imposed\nby the QSV encoder, it will be changed to be in the range.\n\n- mbbrc\nSetting this flag enables macroblock level bitrate control that generally\nimproves subjective visual quality. Enabling this flag may have negative impact\non performance and objective visual quality metric.\n\n- low_delay_brc\nSetting this flag turns on or off LowDelayBRC feature in qsv plugin, which provides\nmore accurate bitrate control to minimize the variance of bitstream size frame\nby frame. Value: -1-default 0-off 1-on\n\n- adaptive_i\nThis flag controls insertion of I frames by the QSV encoder. Turn ON this flag\nto allow changing of frame type from P and B to I.\n\n- adaptive_b\nThis flag controls changing of frame type from B to P.\n\n- p_strategy\nEnable P-pyramid: 0-default 1-simple 2-pyramid(bf need to be set to 0).\n\n- b_strategy\nThis option controls usage of B frames as reference.\n\n- dblk_idc\nThis option disable deblocking. It has value in range 0~2.\n\n- cavlc\nIf set, CAVLC is used; if unset, CABAC is used for encoding.\n\n- vcm\nVideo conferencing mode, please see ratecontrol method.\n\n- idr_interval\nDistance (in I-frames) between IDR frames.\n\n- pic_timing_sei\nInsert picture timing SEI with pic_struct_syntax element.\n\n- single_sei_nal_unit\nPut all the SEI messages into one NALU.\n\n- max_dec_frame_buffering\nMaximum number of frames buffered in the DPB.\n\n- look_ahead\nUse VBR algorithm with look ahead.\n\n- look_ahead_depth\nDepth of look ahead in number frames.\n\n- look_ahead_downsampling\nDownscaling factor for the frames saved for the lookahead analysis.\n \n- unknown\n- auto\n- off\n- 2x\n- 4x\n\n\n- int_ref_type\nSpecifies intra refresh type. The major goal of intra refresh is improvement of\nerror resilience without significant impact on encoded bitstream size caused by\nI frames. The SDK encoder achieves this by encoding part of each frame in\nrefresh cycle using intra MBs. none means no refresh. vertical means\nvertical refresh, by column of MBs. horizontal means horizontal refresh,\nby rows of MBs. slice means horizontal refresh by slices without\noverlapping. In case of slice, in_ref_cycle_size is ignored. To enable\nintra refresh, B frame should be set to 0.\n\n- int_ref_cycle_size\nSpecifies number of pictures within refresh cycle starting from 2. 0 and 1 are\ninvalid values.\n\n- int_ref_qp_delta\nSpecifies QP difference for inserted intra MBs. This is signed value in\n[-51, 51] range if target encoding bit-depth for luma samples is 8 and this\nrange is [-63, 63] for 10 bit-depth or [-75, 75] for 12 bit-depth respectively.\n\n- int_ref_cycle_dist\nDistance between the beginnings of the intra-refresh cycles in frames.\n\n- profile\n \n- unknown\n- baseline\n- main\n- high\n\n\n- a53cc\nUse A53 Closed Captions (if available).\n\n- aud\nInsert the Access Unit Delimiter NAL.\n\n- mfmode\nMulti-Frame Mode.\n \n- off\n- auto\n\n\n- repeat_pps\nRepeat pps for every frame.\n\n- max_qp_i\nMaximum video quantizer scale for I frame.\n\n- min_qp_i\nMinimum video quantizer scale for I frame.\n\n- max_qp_p\nMaximum video quantizer scale for P frame.\n\n- min_qp_p\nMinimum video quantizer scale for P frame.\n\n- max_qp_b\nMaximum video quantizer scale for B frame.\n\n- min_qp_b\nMinimum video quantizer scale for B frame.\n\n- scenario\nProvides a hint to encoder about the scenario for the encoding session.\n \n- unknown\n- displayremoting\n- videoconference\n- archive\n- livestreaming\n- cameracapture\n- videosurveillance\n- gamestreaming\n- remotegaming\n\n\n- avbr_accuracy\nAccuracy of the AVBR ratecontrol (unit of tenth of percent).\n\n- avbr_convergence\nConvergence of the AVBR ratecontrol (unit of 100 frames)\n\nThe parameters avbr_accuracy and avbr_convergence are for the\naverage variable bitrate control (AVBR) algorithm.\nThe algorithm focuses on overall encoding quality while meeting the specified\nbitrate, target_bitrate, within the accuracy range avbr_accuracy,\nafter a avbr_Convergence period. This method does not follow HRD and the\ninstant bitrate is not capped or padded.\n\n- skip_frame\nUse per-frame metadata \"qsv_skip_frame\" to skip frame when encoding. This option\ndefines the usage of this metadata.\n \n- no_skip\nFrame skipping is disabled.\n- insert_dummy\nEncoder inserts into bitstream frame where all macroblocks are encoded as\nskipped.\n- insert_nothing\nSimilar to insert_dummy, but encoder inserts nothing into bitstream. The skipped\nframes are still used in brc. For example, gop still include skipped frames, and\nthe frames after skipped frames will be larger in size.\n- brc_only\nskip_frame metadata indicates the number of missed frames before the current\nframe.\n\n\n\n\n## 11081\nThese options are used by hevc_qsv\n\n\n- extbrc\nExtended bitrate control.\n\n- recovery_point_sei\nSet this flag to insert the recovery point SEI message at the beginning of every\nintra refresh cycle.\n\n- rdo\nEnable rate distortion optimization.\n\n- max_frame_size\nMaximum encoded frame size in bytes.\n\n- max_frame_size_i\nMaximum encoded frame size for I frames in bytes. If this value is set as larger\nthan zero, then for I frames the value set by max_frame_size is ignored.\n\n- max_frame_size_p\nMaximum encoded frame size for P frames in bytes. If this value is set as larger\nthan zero, then for P frames the value set by max_frame_size is ignored.\n\n- max_slice_size\nMaximum encoded slice size in bytes.\n\n- mbbrc\nSetting this flag enables macroblock level bitrate control that generally\nimproves subjective visual quality. Enabling this flag may have negative impact\non performance and objective visual quality metric.\n\n- low_delay_brc\nSetting this flag turns on or off LowDelayBRC feature in qsv plugin, which provides\nmore accurate bitrate control to minimize the variance of bitstream size frame\nby frame. Value: -1-default 0-off 1-on\n\n- adaptive_i\nThis flag controls insertion of I frames by the QSV encoder. Turn ON this flag\nto allow changing of frame type from P and B to I.\n\n- adaptive_b\nThis flag controls changing of frame type from B to P.\n\n- p_strategy\nEnable P-pyramid: 0-default 1-simple 2-pyramid(bf need to be set to 0).\n\n- b_strategy\nThis option controls usage of B frames as reference.\n\n- dblk_idc\nThis option disable deblocking. It has value in range 0~2.\n\n- idr_interval\nDistance (in I-frames) between IDR frames.\n \n- begin_only\nOutput an IDR-frame only at the beginning of the stream.\n\n\n- load_plugin\nA user plugin to load in an internal session.\n \n- none\n- hevc_sw\n- hevc_hw\n\n\n- load_plugins\nA :-separate list of hexadecimal plugin UIDs to load in\nan internal session.\n\n- look_ahead_depth\nDepth of look ahead in number frames, available when extbrc option is enabled.\n\n- profile\nSet the encoding profile (scc requires libmfx >= 1.32).\n\n \n- unknown\n- main\n- main10\n- mainsp\n- rext\n- scc\n\n\n- tier\nSet the encoding tier (only level >= 4 can support high tier).\nThis option only takes effect when the level option is specified.\n\n \n- main\n- high\n\n\n- gpb\n1: GPB (generalized P/B frame)\n\n0: regular P frame.\n\n- tile_cols\nNumber of columns for tiled encoding.\n\n- tile_rows\nNumber of rows for tiled encoding.\n\n- aud\nInsert the Access Unit Delimiter NAL.\n\n- pic_timing_sei\nInsert picture timing SEI with pic_struct_syntax element.\n\n- transform_skip\nTurn this option ON to enable transformskip. It is supported on platform equal\nor newer than ICL.\n\n- int_ref_type\nSpecifies intra refresh type. The major goal of intra refresh is improvement of\nerror resilience without significant impact on encoded bitstream size caused by\nI frames. The SDK encoder achieves this by encoding part of each frame in\nrefresh cycle using intra MBs. none means no refresh. vertical means\nvertical refresh, by column of MBs. horizontal means horizontal refresh,\nby rows of MBs. slice means horizontal refresh by slices without\noverlapping. In case of slice, in_ref_cycle_size is ignored. To enable\nintra refresh, B frame should be set to 0.\n\n- int_ref_cycle_size\nSpecifies number of pictures within refresh cycle starting from 2. 0 and 1 are\ninvalid values.\n\n- int_ref_qp_delta\nSpecifies QP difference for inserted intra MBs. This is signed value in\n[-51, 51] range if target encoding bit-depth for luma samples is 8 and this\nrange is [-63, 63] for 10 bit-depth or [-75, 75] for 12 bit-depth respectively.\n\n- int_ref_cycle_dist\nDistance between the beginnings of the intra-refresh cycles in frames.\n\n- max_qp_i\nMaximum video quantizer scale for I frame.\n\n- min_qp_i\nMinimum video quantizer scale for I frame.\n\n- max_qp_p\nMaximum video quantizer scale for P frame.\n\n- min_qp_p\nMinimum video quantizer scale for P frame.\n\n- max_qp_b\nMaximum video quantizer scale for B frame.\n\n- min_qp_b\nMinimum video quantizer scale for B frame.\n\n- scenario\nProvides a hint to encoder about the scenario for the encoding session.\n \n- unknown\n- displayremoting\n- videoconference\n- archive\n- livestreaming\n- cameracapture\n- videosurveillance\n- gamestreaming\n- remotegaming\n\n\n- avbr_accuracy\nAccuracy of the AVBR ratecontrol (unit of tenth of percent).\n\n- avbr_convergence\nConvergence of the AVBR ratecontrol (unit of 100 frames)\n\nThe parameters avbr_accuracy and avbr_convergence are for the\naverage variable bitrate control (AVBR) algorithm.\nThe algorithm focuses on overall encoding quality while meeting the specified\nbitrate, target_bitrate, within the accuracy range avbr_accuracy,\nafter a avbr_Convergence period. This method does not follow HRD and the\ninstant bitrate is not capped or padded.\n\n- skip_frame\nUse per-frame metadata \"qsv_skip_frame\" to skip frame when encoding. This option\ndefines the usage of this metadata.\n \n- no_skip\nFrame skipping is disabled.\n- insert_dummy\nEncoder inserts into bitstream frame where all macroblocks are encoded as\nskipped.\n- insert_nothing\nSimilar to insert_dummy, but encoder inserts nothing into bitstream. The skipped\nframes are still used in brc. For example, gop still include skipped frames, and\nthe frames after skipped frames will be larger in size.\n- brc_only\nskip_frame metadata indicates the number of missed frames before the current\nframe.\n\n\n\n\n## 16840\nThese options are used by mpeg2_qsv\n\n- profile\n \n- unknown\n- simple\n- main\n- high\n\n\n\n## 16968\nThese options are used by vp9_qsv\n\n- profile\n \n- unknown\n- profile0\n- profile1\n- profile2\n- profile3\n\n\n- tile_cols\nNumber of columns for tiled encoding (requires libmfx >= 1.29).\n\n- tile_rows\nNumber of rows for tiled encoding (requires libmfx  >= 1.29).\n\n\n## 17277\nThese options are used by av1_qsv (requires libvpl).\n\n- profile\n \n- unknown\n- main\n\n\n- tile_cols\nNumber of columns for tiled encoding.\n\n- tile_rows\nNumber of rows for tiled encoding.\n\n- adaptive_i\nThis flag controls insertion of I frames by the QSV encoder. Turn ON this flag\nto allow changing of frame type from P and B to I.\n\n- adaptive_b\nThis flag controls changing of frame type from B to P.\n\n- b_strategy\nThis option controls usage of B frames as reference.\n\n- extbrc\nExtended bitrate control.\n\n- look_ahead_depth\nDepth of look ahead in number frames, available when extbrc option is enabled.\n\n- low_delay_brc\nSetting this flag turns on or off LowDelayBRC feature in qsv plugin, which provides\nmore accurate bitrate control to minimize the variance of bitstream size frame\nby frame. Value: -1-default 0-off 1-on\n\n- max_frame_size\nSet the allowed max size in bytes for each frame. If the frame size exceeds\nthe limitation, encoder will adjust the QP value to control the frame size.\nInvalid in CQP rate control mode.\n\n- max_frame_size_i\nMaximum encoded frame size for I frames in bytes. If this value is set as larger\nthan zero, then for I frames the value set by max_frame_size is ignored.\n\n- max_frame_size_p\nMaximum encoded frame size for P frames in bytes. If this value is set as larger\nthan zero, then for P frames the value set by max_frame_size is ignored."
  },
  {
    "id": "snow",
    "role": "encoder",
    "content": "## Options\n\n\n- iterative_dia_size\ndia size for the iterative motion estimation"
  },
  {
    "id": "VAAPI",
    "role": "encoder",
    "content": "Wrappers for hardware encoders accessible via VAAPI.\n\nThese encoders only accept input in VAAPI hardware surfaces.  If you have input\nin software frames, use the hwupload filter to upload them to the GPU.\n\nThe following standard libavcodec options are used:\n\n- g / gop_size\n- bf / max_b_frames\n- profile\n\nIf not set, this will be determined automatically from the format of the input\nframes and the profiles supported by the driver.\n- level\n- b / bit_rate\n- maxrate / rc_max_rate\n- bufsize / rc_buffer_size\n- rc_init_occupancy / rc_initial_buffer_occupancy\n- compression_level\n\nSpeed / quality tradeoff: higher values are faster / worse quality.\n- q / global_quality\n\nSize / quality tradeoff: higher values are smaller / worse quality.\n- qmin\n- qmax\n- i_qfactor / i_quant_factor\n- i_qoffset / i_quant_offset\n- b_qfactor / b_quant_factor\n- b_qoffset / b_quant_offset\n- slices\n itemize\n\nAll encoders support the following options:\n\n- low_power\nSome drivers/platforms offer a second encoder for some codecs intended to use\nless power than the default encoder; setting this option will attempt to use\nthat encoder.  Note that it may support a reduced feature set, so some other\noptions may not be available in this mode.\n\n- idr_interval\nSet the number of normal intra frames between full-refresh (IDR) frames in\nopen-GOP mode.  The intra frames are still IRAPs, but will not include global\nheaders and may have non-decodable leading pictures.\n\n- b_depth\nSet the B-frame reference depth.  When set to one (the default), all B-frames\nwill refer only to P- or I-frames.  When set to greater values multiple layers\nof B-frames will be present, frames in each layer only referring to frames in\nhigher layers.\n\n- async_depth\nMaximum processing parallelism. Increase this to improve single channel\nperformance. This option doesn't work if driver doesn't implement vaSyncBuffer\nfunction. Please make sure there are enough hw_frames allocated if a large\nnumber of async_depth is used.\n\n- max_frame_size\nSet the allowed max size in bytes for each frame. If the frame size exceeds\nthe limitation, encoder will adjust the QP value to control the frame size.\nInvalid in CQP rate control mode.\n\n- rc_mode\nSet the rate control mode to use.  A given driver may only support a subset of\nmodes.\n\nPossible modes:\n\n- auto\nChoose the mode automatically based on driver support and the other options.\nThis is the default.\n- CQP\nConstant-quality.\n- CBR\nConstant-bitrate.\n- VBR\nVariable-bitrate.\n- ICQ\nIntelligent constant-quality.\n- QVBR\nQuality-defined variable-bitrate.\n- AVBR\nAverage variable bitrate.\n\n\n- blbrc\nEnable block level rate control, which assigns different bitrate block by block.\nInvalid for CQP mode.\n\n\n\nEach encoder also has its own specific options:\n\n\n- av1_vaapi\nprofile sets the value of *seq_profile*.\ntier sets the value of *seq_tier*.\nlevel sets the value of *seq_level_idx*.\n\n\n- tiles\nSet the number of tiles to encode the input video with, as columns x rows.\n(default is auto, which means use minimal tile column/row number).\n- tile_groups\nSet tile groups number. All the tiles will be distributed as evenly as possible to\neach tile group. (default is 1).\n\n\n- h264_vaapi\nprofile sets the value of *profile_idc* and the *constraint_set*_flag*s.\nlevel sets the value of *level_idc*.\n\n\n- coder\nSet entropy encoder (default is *cabac*).  Possible values:\n\n \n- ac\n- cabac\nUse CABAC.\n\n- vlc\n- cavlc\nUse CAVLC.\n\n\n- aud\nInclude access unit delimiters in the stream (not included by default).\n\n- sei\nSet SEI message types to include.\nSome combination of the following values:\n \n- identifier\nInclude a *user_data_unregistered* message containing information about\nthe encoder.\n- timing\nInclude picture timing parameters (*buffering_period* and\n*pic_timing* messages).\n- recovery_point\nInclude recovery points where appropriate (*recovery_point* messages).\n\n\n\n\n- hevc_vaapi\nprofile and level set the values of\n*general_profile_idc* and *general_level_idc* respectively.\n\n\n- aud\nInclude access unit delimiters in the stream (not included by default).\n\n- tier\nSet *general_tier_flag*.  This may affect the level chosen for the stream\nif it is not explicitly specified.\n\n- sei\nSet SEI message types to include.\nSome combination of the following values:\n \n- hdr\nInclude HDR metadata if the input frames have it\n(*mastering_display_colour_volume* and *content_light_level*\nmessages).\n\n\n- tiles\nSet the number of tiles to encode the input video with, as columns x rows.\nLarger numbers allow greater parallelism in both encoding and decoding, but\nmay decrease coding efficiency.\n\n\n\n- mjpeg_vaapi\nOnly baseline DCT encoding is supported.  The encoder always uses the standard\nquantisation and huffman tables - global_quality scales the standard\nquantisation table (range 1-100).\n\nFor YUV, 4:2:0, 4:2:2 and 4:4:4 subsampling modes are supported.  RGB is also\nsupported, and will create an RGB JPEG.\n\n\n- jfif\nInclude JFIF header in each frame (not included by default).\n- huffman\nInclude standard huffman tables (on by default).  Turning this off will save\na few hundred bytes in each output frame, but may lose compatibility with some\nJPEG decoders which don't fully handle MJPEG.\n\n\n- mpeg2_vaapi\nprofile and level set the value of *profile_and_level_indication*.\n\n- vp8_vaapi\nB-frames are not supported.\n\nglobal_quality sets the *q_idx* used for non-key frames (range 0-127).\n\n\n- loop_filter_level\n- loop_filter_sharpness\nManually set the loop filter parameters.\n\n\n- vp9_vaapi\nglobal_quality sets the *q_idx* used for P-frames (range 0-255).\n\n\n- loop_filter_level\n- loop_filter_sharpness\nManually set the loop filter parameters.\n\n\nB-frames are supported, but the output stream is always in encode order rather than display\norder.  If B-frames are enabled, it may be necessary to use the vp9_raw_reorder\nbitstream filter to modify the output stream to display frames in the correct order.\n\nOnly normal frames are produced - the vp9_superframe bitstream filter may be\nrequired to produce a stream usable with all decoders."
  },
  {
    "id": "vbn",
    "role": "encoder",
    "content": "Vizrt Binary Image encoder.\n\nThis format is used by the broadcast vendor Vizrt for quick texture streaming.\nAdvanced features of the format such as LZW compression of texture data or\ngeneration of mipmaps are not supported.\n\n## Options\n\n\n- format string\nSets the texture compression used by the VBN file. Can be dxt1,\ndxt5 or raw. Default is dxt5."
  },
  {
    "id": "vc2",
    "role": "encoder",
    "content": "SMPTE VC-2 (previously BBC Dirac Pro). This codec was primarily aimed at\nprofessional broadcasting but since it supports yuv420, yuv422 and yuv444 at\n8 (limited range or full range), 10 or 12 bits, this makes it suitable for\nother tasks which require low overhead and low compression (like screen\nrecording).\n\n## Options\n\n\n\n- b\nSets target video bitrate. Usually that's around 1:6 of the uncompressed\nvideo bitrate (e.g. for 1920x1080 50fps yuv422p10 that's around 400Mbps). Higher\nvalues (close to the uncompressed bitrate) turn on lossless compression mode.\n\n- field_order\nEnables field coding when set (e.g. to tt - top field first) for interlaced\ninputs. Should increase compression with interlaced content as it splits the\nfields and encodes each separately.\n\n- wavelet_depth\nSets the total amount of wavelet transforms to apply, between 1 and 5 (default).\nLower values reduce compression and quality. Less capable decoders may not be\nable to handle values of wavelet_depth over 3.\n\n- wavelet_type\nSets the transform type. Currently only 5_3 (LeGall) and 9_7\n(Deslauriers-Dubuc)\nare implemented, with 9_7 being the one with better compression and thus\nis the default.\n\n- slice_width\n- slice_height\nSets the slice size for each slice. Larger values result in better compression.\nFor compatibility with other more limited decoders use slice_width of\n32 and slice_height of 8.\n\n- tolerance\nSets the undershoot tolerance of the rate control system in percent. This is\nto prevent an expensive search from being run.\n\n- qm\nSets the quantization matrix preset to use by default or when wavelet_depth\nis set to 5\n \n- default\nUses the default quantization matrix from the specifications, extended with\nvalues for the fifth level. This provides a good balance between keeping detail\nand omitting artifacts.\n\n- flat\nUse a completely zeroed out quantization matrix. This increases PSNR but might\nreduce perception. Use in bogus benchmarks.\n\n- color\nReduces detail but attempts to preserve color at extremely low bitrates.\n itemize"
  },
  {
    "id": "dvbsub",
    "role": "encoder",
    "content": "This codec encodes the bitmap subtitle format that is used in DVB\nbroadcasts and recordings. The bitmaps are typically embedded in a\ncontainer such as MPEG-TS as a separate stream.\n\n## Options\n\n\n- min_bpp integer (2, 4, or 8)\nSet a minimum bits-per-pixel value for the subtitle color lookup tables.\n\nDVB supports 2, 4, and 8 bits-per-pixel color lookup tables.  This\noption enables forcing a particular bits-per-pixel value regardless of\nthe number of colors.  Since not all players support or properly\nsupport 2 bits-per-pixel, this value defaults to 4."
  },
  {
    "id": "dvdsub",
    "role": "encoder",
    "content": "This codec encodes the bitmap subtitle format that is used in DVDs.\nTypically they are stored in VOBSUB file pairs (*.idx + *.sub),\nand they can also be used in Matroska files.\n\n## Options\n\n\n- palette\nSpecify the global palette used by the bitmaps.\n\nThe format for this option is a string containing 16 24-bits hexadecimal\nnumbers (without 0x prefix) separated by commas, for example `0d00ee,\nee450d, 101010, eaeaea, 0ce60b, ec14ed, ebff0b, 0d617a, 7b7b7b, d1d1d1,\n7b2a0e, 0d950c, 0f007b, cf0dec, cfa80c, 7c127b`.\n\n- even_rows_fix\nWhen set to 1, enable a work-around that makes the number of pixel rows\neven in all subtitles.  This fixes a problem with some players that\ncut off the bottom row if the number is odd.  The work-around just adds\na fully transparent row if needed.  The overhead is low, typically\none byte per subtitle on average.\n\nBy default, this work-around is disabled."
  },
  {
    "id": "lrc",
    "role": "encoder",
    "content": "This codec encodes the LRC lyrics format.\n\n## Options\n\n\n- precision\nSpecify the precision of the fractional part of the timestamp. Time base is\ndetermined based on this value.\n\nDefaults to 2 for centiseconds."
  }
]