{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/%23%23",
  "slug": "%23%23",
  "extension": "%23%23",
  "name": ".## File Extension",
  "type_name": "Encrypt Easy Encrypted File",
  "summary": "Learn about .## files and view a list of programs that open them.",
  "developer": "Baltsoft Software",
  "more_information": {
    "description": [
      "A ## file is an encrypted file created by Baltsoft Software Encrypt Easy. It contains a document, image, or other file that a user encrypted to prevent others from opening it. Only a user who knows the password used to encrypt a ## file can open it."
    ]
  },
  "technical_info": {
    "content": [
      "Encrypt Easy is an encryption program that allows you to password-protect sensitive files. This prevents other users from opening the files and viewing their contents. For example, you might use Encrypt Easy to encrypt a .TXT document that contains your online banking credentials, so others cannot open it.",
      "When Encrypt Easy encrypts a file, it saves that file with the .## extension. This allows Encrypt Easy users to easily recognize files they've encrypted."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a ## file with Baltsoft Software Encrypt Easy (Windows), provided you know the password used to encrypt the file. After installing Encrypt Easy, right-click your ## file and open it with Encrypt Easy. Doing so will cause the Encrypt Easy decryption window to appear.",
      "In the Encrypt Easy window, select the Show password checkbox and then enter the password used to encrypt your ## file in the Password Box: field. Then, click Ok to decrypt your file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13035&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}