{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/002",
  "slug": "002",
  "extension": "002",
  "name": ".002 File Extension",
  "type_name": "Split Archive Part 2",
  "summary": "Learn about .002 files and view a list of programs that open them.",
  "developer": "N/A",
  "more_information": {
    "description": [
      "A 002 file is the second part of a split archive, which was likely created by a file archiving utility such as 7-Zip. It should be accompanied by a .001 file, and it may also be accompanied by a .003, .004, and other .### files. To access the files a 002 file contains, you must possess all pieces of the split archive."
    ]
  },
  "technical_info": {
    "content": [
      "In most cases, compressing and combining files into an archive reduces those files' size to the point where users can easily email them, upload them to the internet, or otherwise share them with others. However, if an archive has a large file size, users may still have difficulty sharing that archive with others. In these cases, users may split their archive into several smaller files, which can then be shared and recombined to access the file(s) they contain.",
      "For example, a user sharing hundreds of image files online may package those images into an archive and then split that archive into several pieces. Other users who want to access those images can then download each piece of the archive and use an archive utility to extract the images.",
      "Split archives are often saved in a set of files that use the same base filename and the .001, .002, .003, and so on extensions. These ascending numeric extensions denote that the files are just one part of a multi-part archive. Usually, all pieces of a split archive are stored in the same location, allowing users to easily access and extract files from the split archive."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Several archive utilities allow you to extract files from split archives. For example, in 7-Zip (Windows), you can right-click the 001 file of a split archive and select 7-Zip → Extract Here to extract a split archive's contents. Before doing so, make sure:",
      "You have every piece of the split archive.",
      "You've stored all the split archive's pieces in the same directory.",
      "Note that, because several programs can create split archives, some split archives are formatted differently than others. If you're having trouble opening a split archive in an archive utility, it might be because the program you're using does not support that split archive format (or, because you do not have all of the split archive's pieces)."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "7-Zip",
        "url": "https://fileinfo.com/software/igor_pavlov/7-zip"
      },
      {
        "name": "7-Zip",
        "url": "https://fileinfo.com/software/igor_pavlov/7-zip"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=6270&b=1"
      },
      {
        "name": "Smith Micro StuffIt Deluxe",
        "url": "https://fileinfo.com/software/smith_micro/stuffit_deluxe"
      },
      {
        "name": "7-Zip",
        "url": "https://fileinfo.com/software/igor_pavlov/7-zip"
      },
      {
        "name": "The Unarchiver",
        "url": "https://fileinfo.com/software/dag_agren/the_unarchiver"
      },
      {
        "name": "Smith Micro StuffIt Deluxe Mac 16",
        "url": "https://fileinfo.com/software/smith_micro/stuffit_deluxe_mac"
      },
      {
        "name": "Incredible Bee Archiver",
        "url": "https://fileinfo.com/software/incredible_bee/archiver"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}