{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/003",
  "slug": "003",
  "extension": "003",
  "name": ".003 File Extension",
  "type_name": "Split Archive Part 3",
  "summary": "Learn about .003 files and view a list of programs that open them.",
  "developer": "N/A",
  "more_information": {
    "description": [
      "A 003 file is the third part of a split archive, which was likely created by an archiving utility such as 7-Zip or Incredible Bee Archiver. It should be accompanied by a .001 and .002 file, and it may also be accompanied by successive .### files. These files contain the split archive's other parts."
    ]
  },
  "technical_info": {
    "content": [
      "Several archiving and file-splitting utilities allow users to split large archives (and other files) into smaller pieces. Each piece contains a portion of the archive's data. For example, a user who wants to email a large archive to a colleague may use 7-Zip to split that archive into multiple files. The user can then individually email each piece of the archive to their colleague, who can reconstitute the archive after receiving and downloading all the pieces.",
      "Each piece of a split archive uses the same base filename followed by the .001, .002, .003, etc. extensions. These ascending numeric extensions denote that a file is just one part of a split archive, and that a user cannot access its contents unless they have all pieces of that archive. Some utilities, such as 7-Zip, append compound extensions (e.g. .7Z.001) to the pieces of split archives, to denote both the file's format and the fact that it is part of a split archive."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Several common archive utilities allow you to extract files from split archives. For example, in 7-Zip (Windows), you can right-click a split archive's 001 file and select 7-Zip → Extract Here to extract the archive's contents. Before doing so, make sure:",
      "You have all the split archive's pieces.",
      "You've stored all the pieces in the same directory.",
      "Note, however, that because several programs can create split archives, some split archives are formatted differently than others. If you're having trouble opening a split archive, it might be because the program you're using does not support that split archive format. (Alternatively, it might be because you do not have all the split archive's pieces)."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "7-Zip",
        "url": "https://fileinfo.com/software/igor_pavlov/7-zip"
      },
      {
        "name": "Incredible Bee Archiver",
        "url": "https://fileinfo.com/software/incredible_bee/archiver"
      },
      {
        "name": "7-Zip",
        "url": "https://fileinfo.com/software/igor_pavlov/7-zip"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=9513&b=1"
      },
      {
        "name": "7-Zip",
        "url": "https://fileinfo.com/software/igor_pavlov/7-zip"
      },
      {
        "name": "Smith Micro StuffIt Deluxe",
        "url": "https://fileinfo.com/software/smith_micro/stuffit_deluxe"
      },
      {
        "name": "The Unarchiver",
        "url": "https://fileinfo.com/software/dag_agren/the_unarchiver"
      },
      {
        "name": "Incredible Bee Archiver",
        "url": "https://fileinfo.com/software/incredible_bee/archiver"
      },
      {
        "name": "Smith Micro StuffIt Deluxe Mac 16",
        "url": "https://fileinfo.com/software/smith_micro/stuffit_deluxe_mac"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}