{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/113",
  "slug": "113",
  "extension": "113",
  "name": ".113 File Extension",
  "type_name": "Iomega Disk Backup",
  "summary": "Learn about .113 files and view a list of programs that open them.",
  "developer": "Iomega",
  "more_information": {
    "description": [
      "A 113 file is a backup file created by Iomega Backup or Iomega Automatic Backup Pro. It contains a copy of the data stored on a Zip or Jaz disk. Typically, the Iomega backup utility used to create a 113 file can be used to restore that file to a Zip or Jaz disk."
    ]
  },
  "technical_info": {
    "content": [
      "Iomega was a tech company that specialized in producing data storage systems. One of Iomega's more popular products was the Zip drive system, which allowed users to store and load a then-large amount of data from \"superfloppy\" disks. Iomega followed up the Zip drive system with the Jaz drive system, a less-popular hard disk storage system.",
      "Iomega packaged later Zip and Jazz drive systems with Iomega Backup and Iomega Automatic Backup Pro, which were utilities that could be used to back up a disk's data to a 113 file. (Prior to Iomega Backup's release, Zip and Jaz drives included a backup utility named 1-Step Backup for Zip/Jaz. This program saved backups as .1-step files.) If the data on a user's backed-up disk became damaged or corrupted, they could use their drive's included backup utility to restore that data from the corresponding 113 file."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can use Iomega Backup or Iomega Automatic Backup to restore the data a 113 file contains to an appropriate disk. However, both those programs are discontinued. Therefore, if you do not already have access to Iomega Backup or Iomega Automatic Backup, you likely will not be able to access the data your 113 file contains."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=846&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}