{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/1pux",
  "slug": "1pux",
  "extension": "1pux",
  "name": ".1PUX File Extension",
  "type_name": "1Password Unencrypted Export",
  "summary": "Learn about .1PUX files and view a list of programs that open them.",
  "developer": "AgileBits",
  "more_information": {
    "description": [
      "A 1PUX file contains all of the information about an unencrypted account for AgileBits 1Password, a password-managing utility. It is a .ZIP archive that stores several files, including an export.attributes and export.data file, which contains all of the exported data and metadata. 1Password users export accounts as 1PUX files when transferring them to another installation of the application."
    ]
  },
  "technical_info": {
    "content": [
      "1Password is a password manager that securely stores and organizes passwords, login details, and other sensitive data in an encrypted vault. Individuals, businesses, and organizations can use the app across multiple platforms, including Windows, macOS, iOS, Android, and web browsers.",
      "While accounts are encrypted, users can export their accounts in the 1Password Unencrypted Export (1PUX) format when they want to transfer accounts to a different app (select File → Export to do so). Users can also export account information as .CSV files, but they support a limited set of fields and will only include login and password items.",
      "NOTE: Since 1PUX files are unencrypted, AgileBits advises users not to email them or store them online since anyone with access to them will be able to read their passwords. Users should also delete 1PUX files after transferring accounts."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open 1PUX files with AgileBits 1Password. To open a 1PUX file, click the ellipsis (three dots) in the sidebar of the app and select Import.",
      "Since 1PUX files are Zip archives, you can also extract the contents of a file with a Zip utility, such as File Explorer (Windows), Corel WinZip (Windows), or Apple Archive Utility (macOS). However, you may need to rename the .1pux file extension to .zip for the utility to recognize the file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Corel WinZip",
        "url": "https://fileinfo.com/software/corel/winzip"
      },
      {
        "name": "Apple Archive Utility",
        "url": "https://fileinfo.com/software/apple/archive_utility"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13785&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}