{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/3gx",
  "slug": "3gx",
  "extension": "3gx",
  "name": ".3GX File Extension",
  "type_name": "Luma3DS 3GX Plug-in",
  "summary": "Learn about .3GX files and view a list of programs that open them.",
  "developer": "Nanquitas",
  "more_information": {
    "description": [
      "A 3GX file is a Luma3DS 3GX (3DS Game eXtension) plug-in used by a Nintendo 3DS handheld gaming console with the Boot9Strap custom firmware loader and Luma3DS program installed. The file contains a plug-in that extends the functionality of a Nintendo 3DS game, such as adding a cheat loader or game mod."
    ]
  },
  "technical_info": {
    "content": [
      "You will most likely only encounter a 3GX file if you are a Nintendo 3DS gamer looking to modify your games. The Luma3DS 3GX plug-in format is developed by Nanquitas and evolved from the NTR PLG plug-in format. The primary advancement is the ability to load C/C++/asm code into a Nintendo 3DS game at runtime, which is then executed.",
      "You may create your own 3GX plug-in or download a plug-in and install it on your Nintendo 3DS console (Boot9Strap must be installed) via an SD card. Luma3DS, which is a custom firmware program, must also be installed on your device.",
      "In order to install the 3GX plug-in, follow these instructions:",
      "Download the boot.firm file from here and place it in your SD card root to overwrite the current one.",
      "Create a \"plugins\" folder in the \"luma\" folder in your SD card.",
      "Make a folder with the name of the game's titleid and place it in the \"plugins\" folder.",
      "Place the 3GX file in the folder with your game titleid.",
      "Insert the SD card in your 3DS device and boot it up (select \"Show NAND or user string in System Settings\" if you are greeted with a luma config screen, then press start).",
      "Open the rosalina menu in the home menu and enable the plug-in loader, then press B to exit rosalina.",
      "Open the game (the screen should flash green or blue when starting)."
    ]
  },
  "how_to_open": {
    "instructions": [
      "3GX files are not meant to be opened on your computer. Instead, you can load 3GX files with Luma3DS on a Nintendo 3DS gaming console that has Boot9Strap installed."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11799&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}