{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/a7p",
  "slug": "a7p",
  "extension": "a7p",
  "name": ".A7P File Extension",
  "type_name": "Authorware 7 Project",
  "summary": "Learn about .A7P files and view a list of programs that open them.",
  "developer": "Adobe Systems",
  "more_information": {
    "description": [
      "An A7P file is a project file created by version 7 of Adobe Authorware. It contains an in-development eLearning application. Developers can edit and publish the app an A7P file contains from within Authorware."
    ]
  },
  "technical_info": {
    "content": [
      "Adobe Authorware is a discontinued Integrated Development Environment (IDE) that allowed teachers and businesses to create eLearning apps. After creating an app, an Authorware user could publish the app via CD, DVD, or a network, for use by students, employees, and others.",
      "Version 7 of Authorware saved users' eLearning app projects as A7P files. Saving an app as an A7P file allowed a user to edit their app at any time, even after publication. For example, if a user found an error in one of their eLearning lessons, they could open their app's A7P file, fix the error, and republish their eLearning app.",
      "NOTE: Adobe discontinued Authorware after the 2007 release of version 7."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an A7P file with Adobe Authorware 7 (Windows, Mac). You cannot open an A7P file with earlier versions of Authorware. Because Authorware is discontinued, if you do not already have access to the program, you likely will not be able to open your A7P file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=9674&b=1"
      },
      {
        "name": "Adobe Authorware",
        "url": "https://fileinfo.com/software/adobe/authorware"
      },
      {
        "name": "Adobe Authorware",
        "url": "https://fileinfo.com/software/adobe/authorware"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}