{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/abex",
  "slug": "abex",
  "extension": "abex",
  "name": ".ABEX File Extension",
  "type_name": "Enhanced Android Backup",
  "summary": "Learn about .ABEX files and view a list of programs that open them.",
  "developer": "Camalot",
  "more_information": {
    "description": [
      "An ABEX file is an enhanced Android backup (.AB) file created by Droid Explorer, a Windows program used to manage Android devices and files. In addition to typical Android backup data, ABEX files contain a header that ties the backup file to a specific Android device. ABEX files are created using Droid Explorer's Device Backup feature and stored in a folder named Android Backups."
    ]
  },
  "technical_info": {
    "content": [
      "Droid Explorer allows Windows users to manage, explore, and back up a connected Android device's files. In addition to being able to produce normal Android backup files, Droid Explorer can produce ABEX, or enhanced Android backup, files. These files contain a unique header that links the backup they contain to a specific Android device, so the backup can be restored on only that device.",
      "An example ABEX file header looks like:",
      "ENHANCED ANDROID BACKUP\\n [DEVICE ID]\\n [Droid Explorer Version]\\n [ABEX Version]\\n $$$ ENHANCED ANDROID BACKUP $$$\\n",
      "The backup the file contains begins beneath this header."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can use Droid Explorer (Windows) to restore an ABEX backup to the Android device that created the file. To do so:",
      "Install Droid Explorer.",
      "Connect the Android device from which your ABEX file was created to your computer.",
      "Right-click your ABEX file and select Restore Backup to Device.",
      "Droid Explorer will then walk you through how to use your ABEX file to restore the backup it contains.",
      "You can also use Camalot's modified version of Android Backup Extractor (cross-platform) to extract the files an ABEX file contains."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12446&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}