{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/acsm",
  "slug": "acsm",
  "extension": "acsm",
  "name": ".ACSM File Extension",
  "type_name": "Adobe Content Server Message",
  "summary": "Learn about .ACSM files and view a list of programs that open them.",
  "developer": "Adobe Systems",
  "more_information": {
    "description": [
      "An ACSM file is a message file served by the Adobe Content Server to Adobe Digital Editions, a program used to manage and read eBooks as well as other digital publications. It contains data used to activate and download an eBook. It does not contain the eBook itself. ACSM files are used to authorize, legally download, and read purchased eBooks in Digital Editions."
    ]
  },
  "technical_info": {
    "content": [
      "Most Digital Editions users will not encounter an ACSM file. If you do find an ACSM file, it likely means one of your eBook downloads was interrupted. You can double-click your ACSM file to resume the download in Digital Editions. The ACSM file will be stored wherever your browser saves downloaded files.",
      "NOTE: Even if you use another eReader program, such as Kobo Desktop, you may still receive an ACSM file while downloading an eBook. If so, you must download the eBook using Adobe Digital Editions. After downloading the eBook, you can transfer its .EPUB file to your other eReader program."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an ACSM file in Adobe Digital Editions (cross-platform). To do so, double-click the file, or right-click the file and select Open with... → Adobe Digital Editions. Digital Editions will then begin downloading the eBook associated with your ACSM file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Adobe Digital Editions",
        "url": "https://fileinfo.com/software/adobe/digital_editions"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=4344&b=1"
      },
      {
        "name": "Adobe Digital Editions",
        "url": "https://fileinfo.com/software/adobe/digital_editions"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}