{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/adp",
  "slug": "adp",
  "extension": "adp",
  "name": ".ADP File Extension",
  "type_name": "Access Data Project",
  "summary": "Learn about .ADP files and view a list of programs that open them.",
  "developer": "Microsoft",
  "more_information": {
    "description": [
      "An ADP file is a Microsoft Access project file. It contains settings that Access uses to connect to a Microsoft SQL Server database. ADP files are commonly referred to as Access Data Projects."
    ]
  },
  "technical_info": {
    "content": [
      "In Access 2000, Microsoft added the ability for users to create Access Data Projects. Via an ADP, Access users could connect to, open, and edit a Microsoft SQL Server database. This allowed database administrators to more easily create and manage Access applications that use SQL Server databases.",
      "ADP files do not themselves contain any database data or objects. Instead, they contain data that Access uses to connect to, read data from, and make changes to an associated SQL Server database, using Microsoft's OLE DB architecture.",
      "With the release of Access 2013, Microsoft discontinued the ADP format. As a result, Access 2013 and later versions cannot open ADP files. For more information about this change, refer to Microsoft's official documentation."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an ADP file with versions 2000 to 2010 of Microsoft Access (Windows). Access 2013 and later versions do not support the ADP format, so you cannot open ADP files in those versions."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=492&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}