{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/aesir",
  "slug": "aesir",
  "extension": "aesir",
  "name": ".AESIR File Extension",
  "type_name": "Locky Ransomware Encrypted File",
  "summary": "Learn about .AESIR files and view a list of programs that open them.",
  "developer": "N/A",
  "more_information": {
    "description": [
      "A file with a .aesir extension is a file encrypted by the Locky trojan horse virus utilized by cybercriminals. It contains a user's file, such as an .AVI or .XLSX file, encrypted with the RSA algorithm and AES-128 ciphers. AESIR files became prevalent in 2016 as a Locky Virus variant and are nearly identical to .LOCKY and .ODIN files."
    ]
  },
  "technical_info": {
    "content": [
      "The Locky virus is malware, known as ransomware. The purpose of the virus is to take a victim's files hostage and force them to pay the perpetrator (by way of Bitcoin) to unlock their files.",
      "The Locky virus is a trojan horse that typically enters a victim's computer through a spam email attachment. For example, the cybercriminal may send an email disguised as a notice from the victim's ISP with a .ZIP file attachment (the attachment is likely named logs_[victim_name].zip).",
      "Once the virus affects their computer, it scrambles, renames, and encrypts their files. The virus then generates three files on the user's computer desktop (and changes the desktop wallpaper):",
      "INSTRUCTION.bmp",
      "INSTRUCTION.html",
      "1-INSTRUCTION.html",
      "The files include messages informing the victim of the takeover and what they need to do to recover their files (typically by paying a Bitcoin ransom)."
    ]
  },
  "how_to_open": {
    "instructions": [
      "There is no program currently available to restore AESIR files to their original state. If you back up your files you can execute a full system restore."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13624&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}