{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/ani",
  "slug": "ani",
  "extension": "ani",
  "name": ".ANI File Extension",
  "type_name": "Windows Animated Cursor",
  "summary": "Learn about .ANI files and view a list of programs that open them.",
  "developer": "Microsoft",
  "more_information": {
    "description": [
      "An ANI file is a cursor animation used by the Windows operating system. It contains a collection of .ICO files that comprise an animated cursor's animation. ANI files are very similar to .CUR (Windows Cursor) files, except they contain multiple distinct images used for animation."
    ]
  },
  "technical_info": {
    "content": [
      "Windows' default animated cursors, such as its wait and hourglass cursors, are stored in ANI files. These files contain all the still ICO images used to animate a cursor. When Windows shows an animated cursor, it is actually showing all an ANI file's included ICO images in sequence.",
      "Custom Windows desktop themes often include custom animated cursors, stored in custom ANI files. These custom ANI files are structured in the same way as Windows' official ANI files.",
      "To use an ANI file as a Windows cursor image:",
      "Open the Windows Control Panel and search for \"mouse.\"",
      "Select Change how the mouse pointer looks.",
      "In the Mouse Properties window's Pointers menu, select the cursor image you'd like to modify.",
      "Click Browse... and then navigate to and select your ANI file.",
      "Click Apply to apply your changes.",
      "NOTE: In March 2007, Microsoft reported a vulnerability in the way Windows handles ANI files that could be used to attack users' systems. This issue, which affected Windows 2000 through Windows Vista, was addressed and fixed in Security Bulletin MS07-017."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Windows users can open and edit ANI files, and their included ICO images, with RealWorld Cursor Editor, Axialis CursorWorkshop, and IcoFX. Non-Windows users can open ANI files in Inkscape, but should note that Inkscape will load only the ANI file's first frame."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "You can use Axialis CursorWorkshop or RealWorld Cursor Editor to convert ANI files to other formats. For example, RealWorld Cursor Editor can convert ANI files to the following formats:",
      ".PNG - Portable Network Graphic",
      ".GIF - Graphical Interchange Format",
      ".RCU - RealWorld Layered Cursor Image",
      ".RLI - RealWorld Graphics Layered Image",
      ".CUR - Windows Cursor Image"
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Inkscape",
        "url": "https://fileinfo.com/software/inkscape/inkscape"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=531&b=1"
      },
      {
        "name": "Inkscape",
        "url": "https://fileinfo.com/software/inkscape/inkscape"
      },
      {
        "name": "Inkscape",
        "url": "https://fileinfo.com/software/inkscape/inkscape"
      },
      {
        "name": "Inkscape",
        "url": "https://fileinfo.com/software/inkscape/inkscape"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/ani_531.png",
      "alt": "Screenshot of a .ani file in RealWorld Cursor Editor",
      "caption": "ANI file open in RealWorld Cursor Editor"
    }
  ]
}