{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/apk",
  "slug": "apk",
  "extension": "apk",
  "name": ".APK File Extension",
  "type_name": "Android Package File",
  "summary": "Learn about .APK files and view a list of programs that open them.",
  "developer": "Google",
  "more_information": {
    "description": [
      "An APK file is an app created for Android, Google's mobile operating system. Some apps come pre-installed on Android devices, while other apps can be downloaded from Google Play. Apps downloaded from Google Play are automatically installed on your device, while those downloaded from other sources must be installed manually."
    ]
  },
  "technical_info": {
    "content": [
      "Typically, users never see APK files because Android handles app installation in the background via Google Play or another app distribution platform. However, many websites offer direct APK file downloads for Android users who want to install apps manually. In this case, you should be careful that you trust the source of the APK file, because malware can be distributed in APK files, just as it can in the case of Windows and .EXE files.",
      "You can install APK files manually by following these instructions. Make sure that you trust the source of the APK file.",
      "Windows 11 is the first version of Windows to officially support the ability to install APK files. Windows 11 users can manually install APK files using Windows Subsystem for Android in combination with Android Debug Bridge. As of early 2022, this feature is available to only members of the Windows Insider Program. It also requires that users enable the Hyper-V and Virtual Machine Platform features in Windows settings.",
      "Android packages contain all the necessary files for a single Android program. Below is a list of the most prominent files and folders:",
      "META-INF/​: Contains the manifest file, signature, and a list of resources in the archive",
      "lib/​: Native libraries that run on specific device architectures (armeabi-v7a, x86, etc.)",
      "res/​: Resources, such as images, that were not compiled into resources.arsc",
      "assets/​: Raw resource files that developers bundle with the app",
      "AndroidManifest.xml: Describes the name, version, and contents of the APK file",
      "classes.dex: The compiled Java classes to be run on the device (.DEX file)",
      "resources.arsc: The compiled resources, such as strings, used by the app (.ARSC file)",
      "APK files are saved in a compressed .ZIP format and can be opened by any Zip decompression tool. Therefore, if you would like to explore the contents of an APK file, you can rename the file extension to \".zip\" and open the file, or you can open the file directly through a Zip application's open dialog box.",
      "Android apps are developed using Android Studio, the official IDE for Android software developers. It is available for Windows, Mac, and Linux, and it allows users to develop apps and prepare them for upload to a distribution service, such as Google Play. When apps are ready, developers can build them into APK files and sign them for release.",
      "NOTE: See the .AAB description for details on Google's new publishing format for developers."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=3361&b=1"
      },
      {
        "name": "Google Android Studio",
        "url": "https://fileinfo.com/software/google/android_studio"
      },
      {
        "name": "Corel WinZip",
        "url": "https://fileinfo.com/software/corel/winzip"
      },
      {
        "name": "7-Zip",
        "url": "https://fileinfo.com/software/igor_pavlov/7-zip"
      },
      {
        "name": "RARLAB WinRAR",
        "url": "https://fileinfo.com/software/rarlab/winrar"
      },
      {
        "name": "Google Android Studio",
        "url": "https://fileinfo.com/software/google/android_studio"
      },
      {
        "name": "Apple Archive Utility",
        "url": "https://fileinfo.com/software/apple/archive_utility"
      },
      {
        "name": "Smith Micro StuffIt Deluxe Mac 16",
        "url": "https://fileinfo.com/software/smith_micro/stuffit_deluxe_mac"
      },
      {
        "name": "Google Android Studio",
        "url": "https://fileinfo.com/software/google/android_studio"
      },
      {
        "name": "File Viewer for Android",
        "url": "https://fileinfo.com/software/android_file_viewer"
      },
      {
        "name": "Google Android Studio",
        "url": "https://fileinfo.com/software/google/android_studio"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/apk_3361.png",
      "alt": "Screenshot of a .apk file in Android Studio 4.2.2",
      "caption": "APK file open in Android Studio 4.2.2"
    }
  ]
}