{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/archive",
  "slug": "archive",
  "extension": "archive",
  "name": ".ARCHIVE File Extension",
  "type_name": "Cyberpunk 2077 Mod",
  "summary": "Learn about .ARCHIVE files and view a list of programs that open them.",
  "developer": "CD Projekt RED",
  "more_information": {
    "description": [
      "An ARCHIVE file is a mod Cyberpunk 2077 gamers install to alter aspects of the game, including weapons, vehicles, and other items. It is a Zip-compressed archive that stores various assets, such as 3d models, textures, animations, and sound files, that comprise a mod."
    ]
  },
  "technical_info": {
    "content": [
      "CD Projekt RED develops Cyberpunk 2077, an action role-playing game set in a dystopian universe. The game is available for various platforms, including PlayStation 5 and Xbox One, but only the Windows version supports the ARCHIVE format.",
      "Cyberpunk 2077 gamers often create custom mods (short for \"modifications\") and upload the ARCHIVE files to share with other gamers, who typically download them in .ZIP archives. Examples of mods include gorilla arms knuckles, projectile launcher rounds, and antivenom."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You should not attempt to open ARCHIVE files since Cyberpunk 2077 references the files to load mods that modify the gameplay. However, you can manage ARCHIVE files with the Nexus Mods Vortex mod manager in Windows.",
      "You can also place ARCHIVE files in the following directory for Cyberpunk 2077 to reference and load them:",
      "C:\\​Program Files (x86)\\​Steam\\​Steamapps\\​Common\\​Cyberpunk 2077\\​Archive\\​PC\\​Mod\\​",
      "If you need to view the contents of an ARCHIVE file, you can extract its contents with a Zip compression utility, such as Windows File Explorer or Apple Archive Utility (you may need to rename the .archive file extension to .zip. However, if you modify the contents of the ARCHIVE file, you may break the mod."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Apple Archive Utility",
        "url": "https://fileinfo.com/software/apple/archive_utility"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13637&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}