{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/arduboy",
  "slug": "arduboy",
  "extension": "arduboy",
  "name": ".ARDUBOY File Extension",
  "type_name": "Arduboy Game Package",
  "summary": "Learn about .ARDUBOY files and view a list of programs that open them.",
  "developer": "Arduboy",
  "more_information": {
    "description": [
      "An ARDUBOY file is a Zip-compressed game package used by Arduboy, an open-source 8-bit handheld gaming system. It stores a .HEX file that contains the compiled game code, a banner image (700 × 192 pixels), and one or more preview screenshots (128 × 64 pixels). ARDUBOY files also contain a required .JSON file (info.json) file, which includes metadata such as the game's title, version, author, and input configuration details."
    ]
  },
  "technical_info": {
    "content": [
      "Game developers and Arduboy enthusiasts primarily use the ARDUBOY format to simplify sharing, organizing, and installing games in a single file. The packages are .ZIP archives, but are saved with an .arduboy extension instead of .zip. Game managers and loaders, such as Team A.R.G. Game Loader, read these files to display game details, show preview images, and upload the game to the device.",
      "NOTE: You can create an ARDUBOY file by placing the required files into a folder, compressing it as a ZIP archive, and renaming the extension to .arduboy."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open ARDUBOY files with Arduboy Manager and Team A.R.G. Game Loader. The programs can display the game information and images, and upload the game to the Arduboy device over USB, streamlining the process for users who want to browse and install multiple games efficiently.",
      "You can also open ARDUBOY files with the built-in extractor on most operating systems, such as Microsoft File Explorer in Windows and Apple Archive Utility in macOS. Other archive tools, such as 7-Zip and WinRAR, can also extract the contents from ARDUBOY files. You may need to rename the file extension from .arduboy to .zip for the archive tool to extract the contents in the package."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Apple Archive Utility",
        "url": "https://fileinfo.com/software/apple/archive_utility"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10422&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}