{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/arexport",
  "slug": "arexport",
  "extension": "arexport",
  "name": ".AREXPORT File Extension",
  "type_name": "Spark AR Effects Package",
  "summary": "Learn about .AREXPORT files and view a list of programs that open them.",
  "developer": "Facebook",
  "more_information": {
    "description": [
      "An AREXPORT file is an augmented reality (AR) effects package created by Spark AR Studio, an application that Facebook users can use to create AR video effects. It contains up to three .ARFX files, which are used to apply an AR effect to videos created using different mobile devices. AREXPORT files are meant to be uploaded to Spark AR Hub, so they can be used with Facebook and Instagram."
    ]
  },
  "technical_info": {
    "content": [
      "Spark AR Studio allows Facebook users to create AR effects that they can apply to Facebook and Instagram videos. For example, a Spark AR Studio user could create a \"pixelation\" effect and then use the effect to pixelate people, animals, or other items in a video.",
      "After a user has finished creating their effect, they can publish it by clicking AR Studio's Publish icon. This produces an AREXPORT file. The AREXPORT file contains up to three ARFX files, each of which gives a user access to the AR effect they created on a different set of mobile devices. One ARFX file gives users access to the effect on iOS devices, one gives users access to the effect on newer Android devices, and one gives users access to the effect on old Android devices. An AREXPORT file may also contain a .ARPROJPKG file, which is a Zipped version of the project from which the AREXPORT file was created.",
      "NOTE: AREXPORT files must always be 40 MB or smaller. Users cannot upload AREXPORT files larger than 40 MB to Spark AR Hub."
    ]
  },
  "how_to_open": {
    "instructions": [
      "AREXPORT files are not meant to be opened. Instead, they are meant to be uploaded to Spark AR Hub, from which they can be used on Facebook and Instagram. The Spark AR Hub is accessible from within Facebook."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12163&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}