{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/arpatch",
  "slug": "arpatch",
  "extension": "arpatch",
  "name": ".ARPATCH File Extension",
  "type_name": "Spark AR Patch Asset",
  "summary": "Learn about .ARPATCH files and view a list of programs that open them.",
  "developer": "Facebook",
  "more_information": {
    "description": [
      "An ARPATCH file is a patch asset created by Spark AR Studio, an augmented reality (AR) effects application that integrates with Facebook and Instagram. It contains a group of patches that a user placed and connected in Spark AR Studio's Patch Editor. ARPATCH files are used to add interactivity, animation, and logic to Spark AR Studio effects."
    ]
  },
  "technical_info": {
    "content": [
      "Spark AR Studio allows Facebook users to create AR effects that they can apply to Facebook and Instagram videos. For example, a Spark AR Studio user could create a \"disco inferno\" effect that adds a 3D disco ball and flames to their Facebook videos.",
      "If a user wants to add logic, interactivity, or animations to their Spark AR Studio effect, they can do so using AR Studio's Patch Editor. The Patch Editor is a block-based code editor that allows users to edit their effects. To edit an effect, users add blocks, or patches, to the Patch Editor. They then link the patches together to manipulate their effect.",
      "Sometimes, users may want to quickly apply a group of patches to another Spark AR Studio effect or share the group with another Spark AR Studio user. To do so, they must first combine the patches into a patch group, and then convert the patch group to a patch asset. This patch asset, or ARPATCH file, can be imported into other instances of Spark AR Studio."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an ARPATCH file in Spark AR Studio (cross-platform). To do so, either drag the file to AR Studio or import it via the program's Assets panel."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12166&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}