{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/asice",
  "slug": "asice",
  "extension": "asice",
  "name": ".ASICE File Extension",
  "type_name": "ASiC-Extended Data Container",
  "summary": "Learn about .ASICE files and view a list of programs that open them.",
  "developer": "ETSI",
  "more_information": {
    "description": [
      "An ASICE file is a .ZIP file that stores data in the Associated Signature Container Extended (ASiC-E) format. It contains a root folder that stores both protected data and a META-INF folder. The META-INF folder contains digital signatures, timestamp tokens, and/or other metadata used to verify the data's authenticity."
    ]
  },
  "technical_info": {
    "content": [
      "In 2011, the European Telecommunications Standards Institute (ETSI) created the Associated Signature Container Extended format. It is used to hold a group of protected files and digital signatures and/or timestamp tokens associated with those files. Some software, such as qDigiDoc, can load ASICE files and use the credentials they contain to open the protected files they contain.",
      "All ASICE files are saved in the Zip format. The electronic signatures they contain are saved as CAdES or XAdES signatures. The timestamp tokens are saved in Internet Engineering Task Force-recognized formats."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an ASICE file and view the files it contains with qDigiDoc (multiplatform). qDigiDoc is an open-source file protection program used primarily by Estonians."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12851&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}