{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/aspx",
  "slug": "aspx",
  "extension": "aspx",
  "name": ".ASPX File Extension",
  "type_name": "Active Server Page Extended Webpage",
  "summary": "Learn about .ASPX files and view a list of programs that open them.",
  "developer": "Microsoft",
  "more_information": {
    "description": [
      "An ASPX file is a webpage written in the Active Server Page Extended (ASPX) format. Web servers running Microsoft's ASP.NET framework use ASPX files to generate dynamic webpages. Each ASPX file consists of Active Server Page markup and one or more scripts written in the VBScript or C# programming language. Web servers translate this content into standard HTML, before sending it to a user's web browser."
    ]
  },
  "technical_info": {
    "content": [
      "ASP.NET is a web application framework that developers use to create dynamic websites and webpages. For example, a web developer might use ASP.NET to create a web app that consists of several, interconnected fillable forms.",
      "Primarily, developers create and save ASP.NET webpages as ASPX files. They then place these files on web servers that support the ASP.NET framework. When a user's web browser requests the webpage an ASPX file describes, the web server first translates the markup and scripts the file contains into HTML content. The user's web browser then displays this content as it would any other HTML webpage.",
      "Typical internet users are most likely to encounter ASPX files as webpages displayed in their web browser. These ASPX files have already been translated into HTML content. While viewing one of these webpages, you can right-click and select View/Show Page Source to view the HTML version of the ASPX webpage.",
      "Some web developers may want to download the untranslated version of an ASPX file from another user's web server. (For example, to view the markup and scripts another developer used to create a webpage.) Unfortunately, unless you have login credentials for the associated web server, there is no way to download the untranslated version of an ASPX file."
    ]
  },
  "how_to_open": {
    "instructions": [
      "If you want to edit the markup and code an ASPX file contains, you should open it with Microsoft Visual Studio (Windows), Adobe Dreamweaver (Windows, Mac), or another web app development program that supports the ASPX format. These programs contain tools that make it easier to view, understand, and edit ASPX files' contents.",
      "If you just want to take a look at the text an ASPX file contains, you can open it with Microsoft Notepad (Windows), Apple TextEdit (Mac), or any other text editor. You can also drag the file to your web browser."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Microsoft Visual Studio",
        "url": "https://fileinfo.com/software/microsoft/visual_studio"
      },
      {
        "name": "Adobe Dreamweaver",
        "url": "https://fileinfo.com/software/adobe/dreamweaver"
      },
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "File Viewer Plus",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=9"
      },
      {
        "name": "Microsoft Visual Studio 2022",
        "url": "https://fileinfo.com/software/microsoft/visual_studio"
      },
      {
        "name": "Adobe Dreamweaver 2021",
        "url": "https://fileinfo.com/software/adobe/dreamweaver"
      },
      {
        "name": "Microsoft Visual Studio Code",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      },
      {
        "name": "Eclipse",
        "url": "https://fileinfo.com/software/eclipse_foundation/eclipse"
      },
      {
        "name": "Adobe Dreamweaver 2021",
        "url": "https://fileinfo.com/software/adobe/dreamweaver"
      },
      {
        "name": "Microsoft Visual Studio Code",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      },
      {
        "name": "Eclipse",
        "url": "https://fileinfo.com/software/eclipse_foundation/eclipse"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/aspx_9.png",
      "alt": "Screenshot of a .aspx file in Microsoft Visual Studio Code",
      "caption": "ASPX file open in Microsoft Visual Studio Code"
    }
  ]
}