{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/atom",
  "slug": "atom",
  "extension": "atom",
  "name": ".ATOM File Extension",
  "type_name": "Atom Syndication Format File",
  "summary": "Learn about .ATOM files and view a list of programs that open them.",
  "developer": "Internet Engineering Task Froce",
  "more_information": {
    "description": [
      "An ATOM file contains a website feed saved in the Atom Syndication Format. This feed consists of XML-formatted data, which lists the website's recent articles (or other content). You are most likely to encounter an ATOM file in your web browser, when viewing a website's Atom feed."
    ]
  },
  "technical_info": {
    "content": [
      "Web feeds are files that contain a list of a website's recent updates, typically saved in an XML format. When a user publishes an update to a website that uses a web feed, they (or their website's content management software) also update its feed to include a summary of the new content. Users subscribed to the website's feed are then notified of the new content.",
      "Atom is a feed format that was created to compete with the more popular .RSS format. Just like RSS feeds, Atom feeds are formatted using XML.",
      "In most cases, users who subscribe to an Atom feed will never need to view an ATOM file. Instead, they can simply enter the URL of a website's ATOM file into their Atom feed reader, to subscribe to the feed the file describes.",
      "However, in some cases, users may download the current version of an Atom feed as an ATOM file. For example, a web developer may want to download a website's Atom feed as an ATOM file to inspect the feed's structure or troubleshoot feed issues."
    ]
  },
  "how_to_open": {
    "instructions": [
      "If you've downloaded an ATOM file, you can open it in any text editor or web browser to view the data it contains.",
      "To subscribe to a website's Atom feed, you must typically enter the website's Atom feed address into your feed reader."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1183&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/atom_1183.png",
      "alt": "Screenshot of a .atom file in Microsoft Visual Studio Code",
      "caption": "ATOM file open in Microsoft Visual Studio Code"
    }
  ]
}