{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/auz",
  "slug": "auz",
  "extension": "auz",
  "name": ".AUZ File Extension",
  "type_name": "Ableton Authorization File",
  "summary": "Learn about .AUZ files and view a list of programs that open them.",
  "developer": "Ableton",
  "more_information": {
    "description": [
      "An AUZ file is a software license file used by Ableton Live, an audio production application used to create electronic audio mixes. It contains a registration key that allows users to authorize a legally-obtained copy of Ableton Live. Users can double-click AUZ files to complete their authorization."
    ]
  },
  "technical_info": {
    "content": [
      "If an Ableton Live user cannot complete the program's online registration process, they can manually register their copy of Ableton Live using an AUZ file. To receive an AUZ file, a user must:",
      "Use their offline copy of Ableton Live to generate a hardware code.",
      "On a computer that is connected to the Internet, log in to their Ableton user account and visit Ableton's offline authorization webpage.",
      "On the offline authorization webpage, use their hardware code to generate and download an AUZ file.",
      "The user must then transfer their AUZ file to their offline computer, where they can use it to complete their Ableton Live registration."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To use an AUZ file to register a copy of Ableton Live, open Ableton Live and then double-click your AUZ file. This should automatically register your copy of Ableton Live."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=6695&b=1"
      },
      {
        "name": "Ableton Live",
        "url": "https://fileinfo.com/software/ableton/live"
      },
      {
        "name": "Ableton Live",
        "url": "https://fileinfo.com/software/ableton/live"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}