{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/axx",
  "slug": "axx",
  "extension": "axx",
  "name": ".AXX File Extension",
  "type_name": "AxCrypt Encrypted File",
  "summary": "Learn about .AXX files and view a list of programs that open them.",
  "developer": "AxCrypt AB",
  "more_information": {
    "description": [
      "An AXX file is a file that has been encrypted by AxCrypt, a file encryption tool for Windows. It stores the contents of a file, such as an .XLSX spreadsheet or a .JPG image, in a protected format that users can only open with the correct password. In some cases, a key file may also be required for access (e.g., a .TXT, .KEY, or .DAT file)."
    ]
  },
  "technical_info": {
    "content": [
      "AxCrypt is a file encryption software designed for Windows (and later macOS, Android, and iOS) that enables users to securely encrypt individual files using strong encryption standards, such as AES-128 and AES-256 (it also provides built-in file compression to reduce file sizes). Individuals, small businesses, and privacy-conscious users who want a simple way to encrypt files for storage or transmission primarily use AxCrypt and AXX files to protect sensitive documents such as financial records, personal files, or work-related data.",
      "NOTE: Axantum Software AB, a Swedish company, initially developed AxCrypt. The tool gained popularity in the 2000s and eventually transitioned to a more structured organization named AxCrypt AB."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an AXX file with AxCrypt. To open an AXX file, you must enter the correct password (and key file, if used during encryption) in AxCrypt."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=849&b=1"
      },
      {
        "name": "Corel Pinnacle Studio",
        "url": "https://fileinfo.com/software/corel/pinnacle_studio"
      },
      {
        "name": "Corel Pinnacle Studio",
        "url": "https://fileinfo.com/software/corel/pinnacle_studio"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}