{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/ba8",
  "slug": "ba8",
  "extension": "ba8",
  "name": ".BA8 File Extension",
  "type_name": "TaxAct 2018 Tax Return Backup File",
  "summary": "Learn about .BA8 files and view a list of programs that open them.",
  "developer": "TaxAct",
  "more_information": {
    "description": [
      "A BA8 file is a backup tax return created by the 2018 version of TaxAct, a tax-preparation program. It contains tax data for the 2018 tax year, which is used for archival purposes and in case the .TA8 tax return file is lost or becomes corrupt. BA8 files store federal IRS and state tax form data along with basic personal information, such as the name and occupation of the user."
    ]
  },
  "technical_info": {
    "content": [
      "To save a backup of your tax return in TaxAct 2018, select File → Backup... and name your file. You must save your tax return as a TA8 file before creating your backup. To restore a backup in TaxAct 2018, select File → Restore Backup... and navigate to the location of your BA8 file.",
      "Since annual tax returns are filed for the previous year, the BA8 file is created in 2019, typically from the beginning of January to April 15. Once you have completed a tax return, you can either print and mail in the tax forms or file electronically."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11191&b=1"
      },
      {
        "name": "TaxAct",
        "url": "https://fileinfo.com/software/taxact/taxact"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}