{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/band",
  "slug": "band",
  "extension": "band",
  "name": ".BAND File Extension",
  "type_name": "GarageBand Project",
  "summary": "Learn about .BAND files and view a list of programs that open them.",
  "developer": "Apple",
  "more_information": {
    "description": [
      "A BAND file is an audio editing project created by Apple GarageBand, a digital audio workstation (DAW) available for macOS and iOS. It is a macOS package that contains the project's imported media files, settings, project data, and other resources. You can open a BAND file in GarageBand or Apple Logic Pro."
    ]
  },
  "technical_info": {
    "content": [
      "Apple GarageBand is the default DAW included with macOS; it is also available for iOS devices. GarageBand allows users to import, create, edit, and mix audio tracks to create and publish songs.",
      "When a GarageBand user saves an audio editing project, that project is saved as a BAND file. BAND files are macOS packages, whose contents can be viewed by right-clicking them and selecting Show Package Contents. Each BAND file stores a copy of the audio files that have been imported into that project, as well as an XML projectData file used to load the project's timeline and settings. BAND files may also include other folders, which store additional project resources."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a BAND file in Apple GarageBand (macOS, iOS). To open a BAND file in the macOS version of GarageBand, select File → Open... and then navigate to and open your BAND file.",
      "You can also open BAND files in Apple Logic Pro (macOS), which is Apple's professional music production application."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1440&b=1"
      },
      {
        "name": "Apple Logic Pro",
        "url": "https://fileinfo.com/software/apple/logic_pro"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/band_1440.png",
      "alt": "Screenshot of a .band file in GarageBand 10",
      "caption": "BAND file open in GarageBand 10"
    }
  ]
}