{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/bdoc",
  "slug": "bdoc",
  "extension": "bdoc",
  "name": ".BDOC File Extension",
  "type_name": "Binary DigiDoc Signature File",
  "summary": "Learn about .BDOC files and view a list of programs that open them.",
  "developer": "RIA",
  "more_information": {
    "description": [
      "A BDOC file is a binary digital document (DigiDoc) created with qDigiDoc, an open source software used to authenticate Estonian and Finnish government issued ID cards and signed documents. It is a .ZIP compressed container that stores the files that have been signed by a government employee, the signatures related to each file, and the protocol control information."
    ]
  },
  "technical_info": {
    "content": [
      "The BDOC format is based on the ETSI ASiC signature container standards. It is developed by Riigi Infosüsteemi Amet (RIA), which is the Information System Authority of Estonia. BDOC is one of three digital signature and cryptographic file formats in the DigiDoc family, along with the .CDOC and .DDOC files.",
      "Several versions of the BDOC format have been developed since its initial release. 1.0 was published in 2009 and was used until May 2014 when it was replaced by version 2.1. The BDOC format is the second generation of DigiDoc formats and succeeded the first generation DDOC format.",
      "The BDOC file contains the following contents:",
      "[document].doc",
      "mimetype",
      "META-INF/manifest.xml",
      "META-INF/signatures1.xml",
      "NOTE: The qDigiDoc software can be used to digitally sign documents using an employee's ID card or mobile ID and can open, save, and verify documents with digital signatures. The software is open source and can be downloaded for free through the links below."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10454&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}