{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/bp3",
  "slug": "bp3",
  "extension": "bp3",
  "name": ".BP3 File Extension",
  "type_name": "AutoCAD Batch Plot File",
  "summary": "Learn about .BP3 files and view a list of programs that open them.",
  "developer": "Autodesk",
  "more_information": {
    "description": [
      "A BP3 file is a batch plot list created by version 14 or earlier of Autodesk AutoCAD 2000, 2000i, 2002, or 2004. It contains a list of one or more files a user designates to publish to a plotter or printer via AutoCAD. BP3 files store information about each file and sheet in the list, including the name of each file or sheet, the type of file, the number of copies to be printed, and the save location of each file or sheet."
    ]
  },
  "technical_info": {
    "content": [
      "AutoCAD is a professional computer-aided design CAD) application for creating 2D and 3D drawings of industrial parts, buildings, city streets, parks, vehicles, furniture, and other items. The software creates BP3 files to allow you to save lists of files you commonly publish to printers or plotters, which saves you time so you do not have to recreate the list of files each time you want to publish the same files or sheets.",
      "Autodesk introduced the BP3 file type when it released AutoCAD 2000 in 1999, replacing .BPL and .BP2 files supported by versions 1 to 14 of AutoCAD. Now, AutoCAD allows you to save your publishing lists as .DSD files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open BP3 files with Autodesk AutoCAD 2000 and later in Windows and macOS. To open a BP3 file, select the Load folder icon in the Batch Publish dialog."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1313&b=1"
      },
      {
        "name": "Autodesk AutoCAD 2025",
        "url": "https://fileinfo.com/software/autodesk/autocad"
      },
      {
        "name": "Autodesk AutoCAD 2025",
        "url": "https://fileinfo.com/software/autodesk/autocad"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}