{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/brushset",
  "slug": "brushset",
  "extension": "brushset",
  "name": ".BRUSHSET File Extension",
  "type_name": "Procreate Brush Set",
  "summary": "Learn about .BRUSHSET files and view a list of programs that open them.",
  "developer": "Savage Interactive",
  "more_information": {
    "description": [
      "A BRUSHSET file is a brush set used by Savage Procreate, an illustration app for iOS. It contains a group of Procreate brushes (.BRUSH files). BRUSHSET files can be imported into Procreate's Brush Library."
    ]
  },
  "technical_info": {
    "content": [
      "Savage Procreate is a digital painting application designed for use on the iPad Pro. Most commonly, illustrators use the Apple Pencil to paint and draw in Procreate.",
      "Procreate contains a Brush Library that allows illustrators to select from and illustrate using a variety of brush effects. These effects are grouped into brush sets, which commonly contain related brushes. For example, by default, Procreate's Brush Library contains Sketching, Inking, Drawing, and Painting brush sets (as well as many others). These brush sets, and users' custom brush sets, can be exported as BRUSHSET files, to be shared with other users.",
      "To export a Procreate brush set as a BRUSHSET file, tap that brush set. A menu will appear. Select the Share option to export your brush set."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To import a BRUSHSET file into Savage Procreate (iOS):",
      "Locate the file in your Files app or wherever else it is stored.",
      "Drag and drop the file to Procreate.",
      "Your BRUSHSET file will then appear in your Procreate Brush Library."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12644&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}