{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/bsv",
  "slug": "bsv",
  "extension": "bsv",
  "name": ".BSV File Extension",
  "type_name": "ImBatch Task List",
  "summary": "Learn about .BSV files and view a list of programs that open them.",
  "developer": "High Motion Software",
  "more_information": {
    "description": [
      "A BSV file is a list of image batch processing actions created by ImBatch, an image batch processing program. It is meant to be loaded in ImBatch and used to automatically perform adjustments to a set of images. BSV files contain XML text, which can be viewed in any text editor."
    ]
  },
  "technical_info": {
    "content": [
      "High Motion Software ImBatch is a free Windows program that allows users to annotate, re-color, transform, tag, and make other adjustments to large batches of images at the same time. For example, if a professional photographer wanted to add a watermark to a large set of photos, they could load the photos in ImBatch, create a task to add the watermark, and then run the task to automatically add the watermark to all their photos.",
      "If an ImBatch user knows they'll want to run a set of tasks on additional images in the future, they can save their current task list as a BSV file. The user can then load and run the BSV file while processing other images. For example, if a photographer knows that they want to apply their watermark to additional images in the future, they could save their watermarking task as a BSV file. Then, they could load and run the file whenever they process images in ImBatch, to quickly add their watermark."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a BSV file with ImBatch (Windows). To do so, select the Folder button that appears in ImBatch's toolbar. Then, navigate to and open your BSV file. The tasks your BSV file contains will appear in ImBatch's task list.",
      "If you do not have access to ImBatch but want to view the task list a BSV file contains, you can open the file in any text editor to view the XML text it contains."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12255&b=1"
      },
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Vim",
        "url": "https://fileinfo.com/software/vim/vim"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/bsv_12255-2.png",
      "alt": "Screenshot of a .bsv file in High Motion Software ImBatch 7",
      "caption": "BSV file open in High Motion Software ImBatch 7"
    }
  ]
}