{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/bsxc",
  "slug": "bsxc",
  "extension": "bsxc",
  "name": ".BSXC File Extension",
  "type_name": "BimSens Component Configuration",
  "summary": "Learn about .BSXC files and view a list of programs that open them.",
  "developer": "Striped Horse",
  "more_information": {
    "description": [
      "A BSXC file is a component configuration file used by BimSens, a database tool that enables read/write interactions with standard and custom data sources, such as SQL Server and Excel. It contains plain or encrypted XML that defines a component's type and settings. For example, a BSXC file may define the configuration of a data source, layout, or color filter definition."
    ]
  },
  "technical_info": {
    "content": [
      "BimSens allows users to aggregate different data sources and visualize that data in 3D models. Users can also perform read/write operations on connected data and search and filter data.",
      "The data analysis and visualization projects that users create in BimSens are saved as .BSXP files. Each component included in a project can be saved as a BSXC file. To export a component's configuration as a BSXC file, users must select the component and then select Save As...."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can import a BSXC file into BimSens (Windows). To do so, create or select a relevant project component (e.g. a data source component if your BSXC file was created from a data source) and then select Import from the component's configuration dialogue."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10776&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}