{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/bu",
  "slug": "bu",
  "extension": "bu",
  "name": ".BU File Extension",
  "type_name": "Samsung CCTV Video File",
  "summary": "Learn about .BU files and view a list of programs that open them.",
  "developer": "Samsung",
  "more_information": {
    "description": [
      "A BU file is a video created by Samsung digital video recorders (DVRs), commonly used in closed-circuit television (CCTV) security systems. It stores recorded surveillance footage in a proprietary format designed for Samsung's recording devices and software, typically captured by one or more security cameras connected to the DVR."
    ]
  },
  "technical_info": {
    "content": [
      "Security professionals, system administrators, and property owners who use Samsung digital video recorders for capturing surveillance footage are most likely to encounter BU files. The recorder saves a .DB2 file alongside the BU file to store related database information, such as recording timestamps, camera details, and indexing data. While BU files often contain large amounts of video data, DB2 files are much smaller and serve as metadata references that help the software organize and retrieve footage efficiently."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open BU files with Samsung SmartViewer in Windows. However, the software is discontinued."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=9214&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}