{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/bussidmod",
  "slug": "bussidmod",
  "extension": "bussidmod",
  "name": ".BUSSIDMOD File Extension",
  "type_name": "Bus Simulator Indonesia Mod",
  "summary": "Learn about .BUSSIDMOD files and view a list of programs that open them.",
  "developer": "Maleo",
  "more_information": {
    "description": [
      "A BUSSIDMOD file contains a mod for Maleo Bus Simulator Indonesia, a bus driving simulation game for Android. It is used to alter the appearance of a player's vehicle. Players can download BUSSIDMOD files from the Internet and install them in Bus Simulator Indonesia."
    ]
  },
  "technical_info": {
    "content": [
      "Bus Simulator Indonesia, also known as BUSSID, is a mobile game in which players drive a bus across Indonesia. The game enjoys a healthy modding scene, which creates vehicle customization mods saved in BUSSIDMOD files. Modders then share their BUSSIDMOD files online.",
      "Other players may download a BUSSIDMOD file from a BUSSID-related forum or a file-sharing website. Sometimes, these BUSSIDMOD files are packaged in .ZIP or otherwise-compressed archives. To retrieve their BUSSIDMOD file, players must first decompress the archive in which it is stored."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To use a BUSSIDMOD file with Bus Simulator Indonesia (Android):",
      "Open Bus Simulator Indonesia and select MOD from the Management menu.",
      "In the MOD window, select Import.",
      "When the Import MOD window appears, select File Manager..",
      "In the File Manager window, navigate to and select your BUSSIDMOD file.",
      "Click through the Install Mod Fee window.",
      "The mod your BUSSIDMOD file contains will then appear in the MOD window's vehicle selection list."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12997&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}