{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/camproj",
  "slug": "camproj",
  "extension": "camproj",
  "name": ".CAMPROJ File Extension",
  "type_name": "Camtasia Studio Project",
  "summary": "Learn about .CAMPROJ files and view a list of programs that open them.",
  "developer": "TechSmith",
  "more_information": {
    "description": [
      "A CAMPROJ file is a project file created by legacy versions of TechSmith Camtasia, a screen recording and video editing program. It is saved using XML formatting and contains references to audio and video files, as well as a record of video edit, effect, and timeline settings. CAMPROJ files commonly contain software video tutorials and other demonstrations."
    ]
  },
  "technical_info": {
    "content": [
      "Prior to Camtasia 2020, the Windows version of Camtasia saved users' in-progress video projects as CAMPROJ files. These files contained information used to load a user's project and its component media clips in Camtasia.",
      "If a Camtasia user needed to transfer their project between Windows PCs, they could export their CAMPROJ file as a .ZIP package, which stored all their project data (including the project's component media files) in a single file. After a user finished editing their Camtasia project, they could use their CAMPROJ file to export the video they had created as an .AVI, .MP4, or .M4V file.",
      "While the Windows version of Camtasia, called Camtasia Studio, used the CAMPROJ extension, the Mac version, called Camtasia for Mac, used the .CMPROJ extension. Because of this, users could not transfer Camtasia project files between platforms."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a CAMPROJ file in Camtasia 2019 and earlier versions (Windows). You cannot open a CAMPROJ file in Camtasia 2020 or later versions, as the program no longer supports CAMPROJ files."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=5695&b=1"
      },
      {
        "name": "TechSmith Camtasia",
        "url": "https://fileinfo.com/software/techsmith/camtasia"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}