{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/ccgame",
  "slug": "ccgame",
  "extension": "ccgame",
  "name": ".CCGAME File Extension",
  "type_name": "XNA Creators Club Game Package",
  "summary": "Learn about .CCGAME files and view a list of programs that open them.",
  "developer": "Microsoft",
  "more_information": {
    "description": [
      "Game package created by XNA Studio, a game software development kit used for making Windows, Xbox 360, and Windows Phone games; includes all development assets (source code, resources, etc.) and incorporates digital protection to make sure that the contents are protected from unwanted access."
    ]
  },
  "technical_info": {
    "content": [
      "The CCGAME format is the format used for uploading games to Microsoft's Xbox LIVE Marketplace and Microsoft's App Hub. Therefore, when developers finish development, they package games as CCGAME files and submit them for review before the games can be sold to users. CCGAME files can also be used for sharing development projects between copies of XNA Game Studio.",
      "You can create CCGAME files by selecting Build → Package → as Creators Club Game from the XNA Game Studio menu within Visual Studio, or by using XnaPack.exe, a command line utility included with XNA Game Studio. To unpack a CCGAME file, you can double-click the file (assuming XNA Game Studio is installed) or use the XnaPack.exe program with the unpack option."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=7175&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}