{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/clf",
  "slug": "clf",
  "extension": "clf",
  "name": ".CLF File Extension",
  "type_name": "Caesium Image List",
  "summary": "Learn about .CLF files and view a list of programs that open them.",
  "developer": "SaeraSoft",
  "more_information": {
    "description": [
      "A CLF file is an image list created and used by Caesium, a free image compression tool for Windows. It contains a list of images stored on a user's computer (or other storage device), which the user had previously added in Caesium. CLF files specify each listed image's name, file size, resolution, location, and other information."
    ]
  },
  "technical_info": {
    "content": [
      "Caesium is a free tool that allows users to compress, resize, and convert images. To import images into Caesium, users select File → Add Pictures... or File → Open Folder... and then select the images they want to import. The imported images then appear in Caesium's file list.",
      "If a user wants to save their current Caesium file list, so they can easily load and manipulate the same set of images in the future, they can select File → Save List from Caesium's menu bar. Caesium will then save the user's current file list in a CLF file.",
      "CLF files are plain text files, which list the same attributes Caesium show in its file list. Most often, CLF files will specify each image's name, file size, resolution, and location. If you have already compressed or resized an image included in your file list, your CLF file will also contain information about the compressed or resized version of your image, such as its new file size and resolution."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a CLF file in Caesium (Windows). To do so, select File → Open List... from Caesium's menu bar. Then, navigate to and open your CLF file.",
      "If you do not have access to Caesium, or you just want to see the plain text information your CLF file contains, you can also open the file in any text editor, such as Microsoft Notepad (Windows) or Apple TextEdit (Mac)."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12349&b=1"
      },
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Vim",
        "url": "https://fileinfo.com/software/vim/vim"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/clf_12349.png",
      "alt": "Screenshot of a .clf file in SaeraSoft Caesium",
      "caption": "CLF file open in SaeraSoft Caesium"
    }
  ]
}