{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/cm0012",
  "slug": "cm0012",
  "extension": "cm0012",
  "name": ".CM0012 File Extension",
  "type_name": "Configuration Management File",
  "summary": "Learn about .CM0012 files and view a list of programs that open them.",
  "developer": "Western Digital",
  "more_information": {
    "description": [
      "A CM0012 file is a configuration management file created by a Western Digital WD TV Media Player. It is created when a user removes a USB flash drive or hard drive from the player without ejecting it. CM0012 files indicate your drive has been corrupted and will prevent your media player from playing files stored on your drive."
    ]
  },
  "technical_info": {
    "content": [
      "If you are having trouble playing the media contained on your USB drive, and the drive contains a CM0012 file, it means you removed the drive from your media player without ejecting it. To attempt to fix this issue, you can either reconnect the drive to your media player and eject it properly, or you can reformat the drive.",
      "Before you reformat the drive, check whether you can access your media from a PC or other media player. If you can, you should copy the media to another drive before reformatting your corrupted drive. Reformatting the drive will delete all files contained on it."
    ]
  },
  "how_to_open": {
    "instructions": [
      "CM0012 files contain no useful information and are not meant to be opened."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11572&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}