{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/cmm",
  "slug": "cmm",
  "extension": "cmm",
  "name": ".CMM File Extension",
  "type_name": "Corel Multimedia Manager Album",
  "summary": "Learn about .CMM files and view a list of programs that open them.",
  "developer": "Corel",
  "more_information": {
    "description": [
      "A CMM file is a photo album file created by Corel Multimedia Manager, a media organization tool included with older versions of CorelDRAW, starting with version 7. It contains references to images in a photo album and other metadata, it does not store the actual images. CMM files help users group and manage collections of image files, making it easier to browse, sort, and access media assets within the CorelDRAW environment."
    ]
  },
  "technical_info": {
    "content": [
      "Users of older CorelDRAW versions used CMM files to create categorized collections of graphics, photos, or other multimedia content, which was especially useful when working on design projects that required many image assets. However, CorelDRAW no longer includes the Corel Multimedia Manager tool."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open CMM files with Corel Multimedia Manager, which is a utility included with older versions of the CorelDRAW Graphics Suite. To open a CMM file in CorelDRAW, select File → Open Album."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1980&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}