{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/code-workspace",
  "slug": "code-workspace",
  "extension": "code-workspace",
  "name": ".CODE-WORKSPACE File Extension",
  "type_name": "Microsoft Visual Studio Code Multi-root Workspace",
  "summary": "Learn about .CODE-WORKSPACE files and view a list of programs that open them.",
  "developer": "Microsoft",
  "more_information": {
    "description": [
      "A CODE-WORKSPACE file is a multi-root workspace created in Microsoft Visual Studio Code. It contains references to the root folders included in a Visual Studio Code workspace. CODE-WORKSPACE files are created by selecting File → Save Workspace As... from Visual Studio Code's menu bar."
    ]
  },
  "technical_info": {
    "content": [
      "Microsoft Visual Studio Code (VS Code) is an open source, cross-platform code editor that developers can use to develop and debug applications. When developers want to work on multiple, related projects in VS Code at the same time, they can group those projects into a multi-root workspace. Doing so allows developers to open and switch between related projects using VS Code's EXPLORER sidebar, rather than opening each project in a separate instance of VS Code.",
      "For example, a developer who wants to simultaneously open and edit an app's source code and its documentation can add both projects to a multi-root workspace. Then, as the developer updates the app's source code, they can update the app's documentation to reflect those code changes.",
      "When a user saves a multi-root workspace (by selecting File → Save Workspace As... from VS Code's menu bar), the workspace is saved as a CODE-WORKSPACE file. This file is a JSON file that contains a list of the root directories the workspace includes. When a user loads a workspace, VS Code uses these references to determine which folders to show in the EXPLORER sidebar.",
      "To add a folder to a Visual Studio Code workspace:",
      "Select File > Add Folder to Workspace... from Visual Studio Code's menu bar.",
      "In the window that appears, navigate to the folder you want to add and select Add.",
      "The folder will then be added to your Visual Studio Code workspace."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can use a CODE-WORKSPACE file to open a multi-root workspace in Microsoft Visual Studio Code (cross-platform). To do so:",
      "Select File → Open Workspace... from VS Code's menu bar.",
      "Select and Open your CODE-WORKSPACE file.",
      "The folders your CODE-WORKSPACE file references will then appear in VS Code's EXPLORER sidebar.",
      "If you want to view the JSON-formatted text a CODE-WORKSPACE file contains, you can open the file in any text editor. You may want to do this, for example, if VS Code fails to open your CODE-WORKSPACE file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Microsoft Visual Studio Code",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11896&b=1"
      },
      {
        "name": "Microsoft Visual Studio Code",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      },
      {
        "name": "Microsoft Visual Studio Code",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      },
      {
        "name": "Microsoft Visual Studio Code",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/code-workspace_11896.png",
      "alt": "Screenshot of a .code-workspace file in Microsoft Visual Studio Code",
      "caption": "CODE-WORKSPACE file open in Microsoft Visual Studio Code"
    }
  ]
}