{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/conda",
  "slug": "conda",
  "extension": "conda",
  "name": ".CONDA File Extension",
  "type_name": "Conda Package",
  "summary": "Learn about .CONDA files and view a list of programs that open them.",
  "developer": "Anaconda",
  "more_information": {
    "description": [
      "A CONDA file is a software package that can be installed with Conda, a multiplatform package management system. It can contain system-level libraries, modules, executable programs, metadata, and/or other files. After installing a CONDA file, users can use the software it contains."
    ]
  },
  "technical_info": {
    "content": [
      "Conda is an open-source package management system available for Windows, macOS, and Linux. While it is primarily meant to be used to install Python software packages, Conda can also be used to install R, Ruby, Lua, Scala, Java, JavaScript, C/C++, and FORTRAN packages.",
      "Packages used with Conda are saved in one of two formats: .TAR.BZ2 or CONDA. CONDA files consist of two compressed .TAR files saved in a .ZIP container. The TAR files are compressed using Zstandard (zstd) compression. Conda users can search for packages using either Conda itself or the online Anaconda package repository.",
      "NOTE: Some CONDA files contain only metadata used by other programs. These files are referred to as metapackages."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can use Conda (multiplatform) to install the package a CONDA file contains. To do so, use the command conda install path/to/yourpackage.conda."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12974&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}