{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/cuid2",
  "slug": "cuid2",
  "extension": "cuid2",
  "name": ".CUID2 File Extension",
  "type_name": "Baidu Device ID File",
  "summary": "Learn about .CUID2 files and view a list of programs that open them.",
  "developer": "Baidu",
  "more_information": {
    "description": [
      "A CUID2 file is a hidden file created by apps that use the Baidu software development kit (SDK), such as ES File Explorer and WeChat. It contains your mobile device's ID and International Mobile Equipment Identity (IMEI), encrypted using 128-bit AES encryption. CUID2 files are used to share your device's id and International Mobile Equipment Identity (IMEI) with third parties without your permission."
    ]
  },
  "technical_info": {
    "content": [
      "Baidu is a Chinese technology company that specializes in Internet-related services and products. Apps created using Baidu's SDK often share users' information without their permission. One of the ways these apps do this is by copying sensitive information, which requires permission to access, to unrestricted folders. That way, other apps can access the sensitive information from the unrestricted folders, without asking your permission.",
      "For example, some apps that use the Baidu SDK create hidden CUID2 files in your SD card's backups/​.SystemConfig directory. Other apps can then access these CUID2 files and use them to learn your device's ID and IMEI without your permission.",
      "NOTE: Apps that use the Baidu SDK also often create .CUID files on users' devices."
    ]
  },
  "how_to_open": {
    "instructions": [
      "CUID2 files are encrypted. Therefore, while you can open them with any text editor, you will not be able to understand the information they contain."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12550&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}