{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/dart",
  "slug": "dart",
  "extension": "dart",
  "name": ".DART File Extension",
  "type_name": "Dart Source Code File",
  "summary": "Learn about .DART files and view a list of programs that open them.",
  "developer": "Google",
  "more_information": {
    "description": [
      "A DART file is a source code file that contains Dart programming language. It is used for building web, server, and mobile applications and IoT devices. Dart programming language an object-oriented language with C-style syntax that supports mixins, abstract classes, optional typing, and interfaces."
    ]
  },
  "technical_info": {
    "content": [
      "DART files can be compiled as JavaScript to run in popular web browsers, run in the Dartium browser (a version of the Chromium web browser that includes a Dart virtual machine and comes with the Dart SDK), or run in a command-line interface of the Dart virtual machine that comes with the Dart SDK.",
      "Dart was originally developed by Google but is now open-source under a Berkeley Software Distribution (BSD) license. The programming language was intended to supersede JavaScript as the future of the web. However, in 2015 Google announced that the Dart virtual machine would not be integrated into its Chrome web browser. Instead Dart is designed to be compiled into JavaScript using the dart2js compiler."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10340&b=1"
      },
      {
        "name": "File Viewer for Android",
        "url": "https://fileinfo.com/software/android_file_viewer"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}