{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/dash",
  "slug": "dash",
  "extension": "dash",
  "name": ".DASH File Extension",
  "type_name": "MPEG-DASH Video File",
  "summary": "Learn about .DASH files and view a list of programs that open them.",
  "developer": "Moving Picture Experts Group",
  "more_information": {
    "description": [
      "A DASH file is a video file created for high-quality video playback on sites such as YouTube and Netflix. It contains an HTTP-based segment of media content that is encoded with different bit rates, to keep a video playing through changing network conditions."
    ]
  },
  "technical_info": {
    "content": [
      "DASH (Dynamic Adaptive Streaming over HTTP) files are distributed over the DASH protocol. When clients, like web browsers, play back DASH-encoded content, they select DASH file segments with the appropriate bitrate to avoid re-buffering and stalls. The chosen bitrate reflects your current network and Internet connection.",
      "A variety of programs allow users to create and download DASH files. For example, RealPlayer Downloader downloads videos as DASH files before automatically converting them to .MP4 files. As another example, developers can use DASHEncoder to create DASH videos from other video files.",
      "If you have a DASH file on your computer, it is likely a segment of a larger video file. Because DASH files contain only a segment of a video, they cannot be played as is in most media players. You must combine a DASH file with its other related video segments and convert the combined file to an MP4 file before you can play it."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To play the video a DASH file contains, you must:",
      "Combine all the DASH files that comprise a single streamed video into one DASH file.",
      "Convert the combined DASH file into an MP4 file.",
      "Then, you'll be able to play the resulting MP4 file in a media player, such as VideoLAN VLC media player (cross-platform).",
      "In Linux and macOS terminals, you can use the cat command to combine multiple DASH files into a single file. In Windows command prompt, you can use the type or copy commands. When you combine your DASH files, be sure to combine them in the correct order. For example, if you have files named 000000.dash, 000001.dash, and 000002.dash, combine them in that order. If you combine DASH files in the wrong order, the resulting video won't play in media players.",
      "After you combine your DASH files into a single file, you can use FFmpeg (cross-platform) to convert that file into an MP4 file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "VideoLAN VLC media player",
        "url": "https://fileinfo.com/software/videolan/vlc_media_player"
      },
      {
        "name": "FFmpeg",
        "url": "https://fileinfo.com/software/ffmpeg/ffmpeg"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=9017&b=1"
      },
      {
        "name": "FFmpeg",
        "url": "https://fileinfo.com/software/ffmpeg/ffmpeg"
      },
      {
        "name": "RealNetworks RealPlayer Cloud",
        "url": "https://fileinfo.com/software/realnetworks/realplayer_cloud"
      },
      {
        "name": "FFmpeg",
        "url": "https://fileinfo.com/software/ffmpeg/ffmpeg"
      },
      {
        "name": "FFmpeg",
        "url": "https://fileinfo.com/software/ffmpeg/ffmpeg"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}