{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/db-journal",
  "slug": "db-journal",
  "extension": "db-journal",
  "name": ".DB-JOURNAL File Extension",
  "type_name": "SQLite Rollback Journal File",
  "summary": "Learn about .DB-JOURNAL files and view a list of programs that open them.",
  "developer": "SQLite",
  "more_information": {
    "description": [
      "A DB-JOURNAL file is a temporary database file created by SQLite database management systems during a transaction between an application and a database. It contains a rollback journal, which is a temporary database that stores the most recent state of the database. DB-JOURNAL files are used to restore a database in case the application using the database crashes while executing a transaction."
    ]
  },
  "technical_info": {
    "content": [
      "DB-JOURNAL files enable the atomic commit feature in SQLite database management systems. This feature refers to when all changes to a database can be made in one transaction. This is made possible by rollback journal files, which are typically seen with the \".db-journal\" extension.",
      "DB-JOURNAL files are temporary and should only exist when a running transaction is occurring in an SQLite database then deleted once the transaction is committed. The file is located in the same directory as the .DB database file that is running the transaction. Also it bears the same name as the associated DB file except it includes the appended \"-journal\" extension. For example, a file named example.db is accompanied by a temporary example.db-journal during the transaction."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10813&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}