{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/ddd",
  "slug": "ddd",
  "extension": "ddd",
  "name": ".DDD File Extension",
  "type_name": "Alpha Five Data Dictionary File",
  "summary": "Learn about .DDD files and view a list of programs that open them.",
  "developer": "Alpha Software",
  "more_information": {
    "description": [
      "Dictionary file created by Alpha Five, an IDE that enables users to develop Web, desktop, and mobile applications; contains a list of all the elements added to the .DBF file; elements include browses, reports, saved operations, letters, and form designs; functions similarly to the DBF file format as it's a table linked to a .DDM memo file like the DBF file is linked to the .FPT memo file."
    ]
  },
  "technical_info": {
    "content": [
      "An example of the relationship between DBF, DDD, and DDM files: Let's say we created a field rule in the DBF file called \"Rule.\" A record is then created in the DDD file with Rule in the name field, FRUL in the type field (because it's a field rule), and code in the memo field that references the actual code in the DDM file.",
      "For every table you create in Alpha Five, a DDM, DDD, and .DDX file will be created. These files make up the table data dictionary for a DBF file. The dictionary stores queries, saved utility settings, and layouts. It's referenced by Alpha Five to overcome limitations of the DBF file. DDD files should be kept with the DDM and DDX Data Dictionary files in order for Alpha to find all of the elements and their pieces.",
      "NOTE: In 2013, Alpha Five became Alpha Anywhere."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=9165&b=1"
      },
      {
        "name": "Alpha Software Alpha Anywhere",
        "url": "https://fileinfo.com/software/alpha_software/alpha_anywhere"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}