{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/ded",
  "slug": "ded",
  "extension": "ded",
  "name": ".DED File Extension",
  "type_name": "DED Cryptor Ransomware Encrypted File",
  "summary": "Learn about .DED files and view a list of programs that open them.",
  "developer": "N/A",
  "more_information": {
    "description": [
      "A file with a .ded extension is a file that has been encrypted by the DED Cryptor virus, which is ransomware that became prevalent in late-2019. It is encrypted so it is not possible to open the file by simply changing the .ded file extension."
    ]
  },
  "technical_info": {
    "content": [
      "Nbes ransomware is a type of malware utilized by cybercriminals that encrypts the files on a computer with AES-256 encryption. After the ransomware takes the files hostage, it forces the victim to pay the perpetrator to unlock the files. It is most often introduced to a victim's computer through spam emails with a .DOCX file attached that stores the ransomware.",
      "When the ransomware runs on a user's computer, it encrypts files on the computer and adds the .ded extension onto the names of the files. The types of files typically targeted include spreadsheets, documents, images, videos, and system files, such as .CSV, .PDF, .JPEG, .AVI, and .DLL files. For example, an presentation.pptx file becomes presentation.pptx.ded.",
      "The virus then generates a ransom note image instead of a ransom note .TXT file and sets it as the background of the user's desktop. The image includes instructions explaining the hostile takeover of the user's files and how the user can recover his files by paying a ransom payment, which is typically 2 Bitcoins."
    ]
  },
  "how_to_open": {
    "instructions": [
      "No known program can restore DED files to their original state. The best way to recover your files is to retrieve them from a recent backup or perform a System Restore to a point before your computer was infected."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11548&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}