{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/dft",
  "slug": "dft",
  "extension": "dft",
  "name": ".DFT File Extension",
  "type_name": "Solid Edge Draft Document",
  "summary": "Learn about .DFT files and view a list of programs that open them.",
  "developer": "Siemens",
  "more_information": {
    "description": [
      "A DFT file is a CAD drafting document created by Siemens Solid Edge, a 3D CAD application for designing mechanical and engineering components. It contains 2D drafting data and layout information for documenting and detailing 3D models, including dimensions, annotations, and other technical information required for manufacturing and engineering processes."
    ]
  },
  "technical_info": {
    "content": [
      "Engineers and designers use DFT files to create drafts for parts or assemblies of an engineering project. The DFT format captures the technical and graphical elements of a product or component, such as specific views (like front, top, or side) and layout instructions, which is helpful for production teams and quality control in industrial settings. Designers can also share DFT files with stakeholders who need to review or produce parts based on the detailed information in the draft.",
      "NOTE: UGS Corporation initially developed Solid Edge as a 3D CAD tool for engineering and manufacturing. In 2007, Siemens AG acquired UGS and integrated it into the Siemens Digital Industries Software division."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open DFT files with Siemens Solid Edge in Windows. To open a DFT file with the software, select File → Open."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "Siemens Solid Edge can convert DFT files to various file types, including the following formats:",
      ".DWG - AutoCAD Drawing",
      ".DXF - Drawing Exchange Format File",
      ".PDF - Portable Document Format"
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1402&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}