{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/dim",
  "slug": "dim",
  "extension": "dim",
  "name": ".DIM File Extension",
  "type_name": "Active@ Raw Disk Image Backup File",
  "summary": "Learn about .DIM files and view a list of programs that open them.",
  "developer": "Active@ Data Recovery Software",
  "more_information": {
    "description": [
      "Raw disk image backup created by Active@ Disk Image, a Windows backup and recovery program; stores a raw disk image, which includes configuration data that describes the disk or partition geometry."
    ]
  },
  "technical_info": {
    "content": [
      "When you create a raw disk image with Active@ you create an identical copy of every sector from a selected physical hard disk or logical partition, which includes all used and unused space. The DIM raw disk image is mainly used for future data recovery or backing up non-Windows operating systems.",
      "You can create a raw image by selecting \"Create Raw Image\" under \"Disk Operations\" or \"Tools\" on the menu bar. Two files are created when you create a raw disk image. A DIM file containing the image description is created while another file is created to hold the data. This data file is named after the name of the raw disk image and has \"001\" appended on to its \"dim\" extension. If your raw disk image is named \"DiskImage\", the data file would be named DiskImage.dim.001. If more than one data file is needed, another file is created with \"002\" appended on to the extension."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=9978&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}