{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/djvus",
  "slug": "djvus",
  "extension": "djvus",
  "name": ".DJVUS File Extension",
  "type_name": "STOP DJVUS Ransomware Encrypted File",
  "summary": "Learn about .DJVUS files and view a list of programs that open them.",
  "developer": "N/A",
  "more_information": {
    "description": [
      "A file with the .djvus extension has been renamed and encrypted by STOP Djvus ransomware. The file could be an encrypted document, image, video, or other type of file. Because the file is encrypted, you cannot open it. Typically, the .djvus extension is added to the file's normal extension, resulting in a file with an extension like .docx.djvus."
    ]
  },
  "technical_info": {
    "content": [
      "STOP ransomware, also known as STOP Djvu ransomware, is a common family of ransomware that cybercriminals use to extort ransoms from PC users. The DJVUS variant of STOP ransomware first appeared in late 2018. It encrypts a user's files and then produces a plain text ransom note named _readme.txt in every folder that contains an infected file. The note contains instructions users are meant to follow to decrypt their files.",
      "STOP Djvus ransomware is most commonly distributed within programs that appear to be legitimate but are actually adware and malware bundles. If you recently downloaded and installed an unverified program, that may be how your computer became infected by STOP Djvus ransomware."
    ]
  },
  "how_to_open": {
    "instructions": [
      "DJVUS files are encrypted and cannot be opened. To decrypt your DJVUS files and return them to their pre-infected state, you can use Emsisoft Decryptor for STOP Djvu. The decryptor's website includes detailed instructions for decrypting DJVUS files."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12426&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}