{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/dqy",
  "slug": "dqy",
  "extension": "dqy",
  "name": ".DQY File Extension",
  "type_name": "Microsoft Excel Query",
  "summary": "Learn about .DQY files and view a list of programs that open them.",
  "developer": "Microsoft",
  "more_information": {
    "description": [
      "A DQY file is a database query used by Microsoft Excel, a popular spreadsheet application. It stores a query defined with Microsoft Query or the Query Wizard included with Excel that accesses an external database to retrieve data and import it into an Excel spreadsheet. DQY files are saved in the ODBC standard for compatibility with other databases."
    ]
  },
  "technical_info": {
    "content": [
      "Most Excel users will not create or open DQY files. However, advanced users looking to import data from a database may create and open DQY files since they are useful for saving queries to be used again.",
      "To create a DQY file with Query Wizard or Microsoft Query in Excel 365, follow these steps:",
      "Select Get Data in the Data tab",
      "Choose From Other Sources → From Microsoft Query",
      "Verify that the \"Use the Query Wizard to create/edit queries\" checkbox is checked in the \"Choose Data Source\" dialog",
      "Select the data source, click OK, choose the database you want to query, and define the query",
      "DQY files created with the Query Wizard or Microsoft Query in Excel 365 are saved in the following location, by default:",
      "C:\\​Users\\​[username]\\​AppData\\​Roaming\\​Microsoft\\​Queries",
      "NOTE: DQY files are primarily used by Excel 2007 to 365 users."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open DQY files with Microsoft Excel in Windows and macOS. There are several ways to open a DQY file.",
      "To open the query directly from Excel 365:",
      "Select Get Data in the Data tab",
      "Choose From Other Sources → From Microsoft Query",
      "Click the \"Queries\" tab in the \"Choose Data Source\" dialog, select the query, then click Open",
      "To open the query directly from Microsoft Query (included with Excel), select File → Open....",
      "NOTE: You can also select File → Open and choose the DQY file in Excel 365 or double-click a DQY file if it is associated with Excel. These options will run the query and insert the data into a new worksheet."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Microsoft Excel",
        "url": "https://fileinfo.com/software/microsoft/excel"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=936&b=1"
      },
      {
        "name": "Microsoft Excel 365",
        "url": "https://fileinfo.com/software/microsoft/excel"
      },
      {
        "name": "Microsoft Excel 365",
        "url": "https://fileinfo.com/software/microsoft/excel"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}