{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/dvb",
  "slug": "dvb",
  "extension": "dvb",
  "name": ".DVB File Extension",
  "type_name": "AutoCAD VBA Project File",
  "summary": "Learn about .DVB files and view a list of programs that open them.",
  "developer": "Autodesk",
  "more_information": {
    "description": [
      "A DVB file is a VBA project created by AutoCAD VBA, a module used to write applications for automating tasks in AutoCAD. It contains a Microsoft Visual Basic for Applications (VBA) program, which is known as a macro that includes components and code for automating a task."
    ]
  },
  "technical_info": {
    "content": [
      "You can choose to save a VBA project two different ways:",
      "Save the macro as a DVB file - This allows you to easily move the VBA macro between AutoCAD drawings.",
      "Embed the macro into a drawing - This allows you to easily package the macro with an AutoCAD drawing and the macro is automatically loaded when the drawing is opened.",
      "You can manage a VBA project after loading the DVB file that contains the project into the AutoCAD drawing environment. To load the DVB file:",
      "Type vbaman at the command prompt and press Enter.",
      "Click Load in the VBA Manager dialog box.",
      "Browse to the DVB file, select load, and click Open.",
      "Click Enable Macros in the message box and select Close.",
      "NOTE: VBA was included with the AutoCAD installation but must now be downloaded and installed separately. You can download the AutoCAD VBA module below."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10510&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}