{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/dvt",
  "slug": "dvt",
  "extension": "dvt",
  "name": ".DVT File Extension",
  "type_name": "Digital Video Transcript",
  "summary": "Learn about .DVT files and view a list of programs that open them.",
  "developer": "inData",
  "more_information": {
    "description": [
      "A DVT file is a digital video transcript created and used by IPRO TrialDirector or inData DepoView, which are legal deposition transcription programs. It contains a deposition transcript and a video clip associated with that transcript. DVT files are often used to show deposition clips and transcripts to juries."
    ]
  },
  "technical_info": {
    "content": [
      "During trials, lawyers may want to show a videotaped deposition and its transcript to juries simultaneously. IPRO TrialDirector (formerly inData TrialDirector) allows users to do this by linking a video and its transcript together as a DVT file. The DVT file contains the video and its transcript, synchronized so they can be played together.",
      "InData DepoView is a free DVT file viewer that allows users to search for a specific portion of testimony in a DVT file, create a clip of that portion, and export the clip to PowerPoint or in other video formats. Users who don't have access to TrialDirector can use DepoView to open, edit, and export clips or text from DVT files.",
      "NOTE: Some DVT files may contain other kinds of transcripted audio or video, such as a 911 call, CCTV video, or wiretap audio."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a DVT file with IPRO TrialDirector (Windows) and inData DepoView (Windows)."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12967&b=1"
      },
      {
        "name": "inData DepoView",
        "url": "https://support.indatacorp.com/software/depoview/getdepoview.aspx"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}