{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/e48",
  "slug": "e48",
  "extension": "e48",
  "name": ".E48 File Extension",
  "type_name": "Emu48 Save State",
  "summary": "Learn about .E48 files and view a list of programs that open them.",
  "developer": "Sébastien Carlier",
  "more_information": {
    "description": [
      "An E48 file is a save state created by Emu48, a classic HP graphing calculator emulator. It can be used to load a user's saved Emu48 session. E48 files can be opened only if you possess a corresponding Emu48 calculator ROM."
    ]
  },
  "technical_info": {
    "content": [
      "Emu48 is an emulator that allows users to emulate the HP48SX, HP48GX, HP49G, HP40G, HP39G, and HP38G graphing calculators on their PCs. Additionally, an Emu48 port, Emu48 for Android, allows users to emulate these calculators on their Android devices.",
      "When a user saves their Emu48 session, the program saves the user's current state as a file whose extension matches the user's calculator. E48 files contain sessions created while emulating an HP48 graphing calculator. Emu48 also saves users' states as .e38, .e39, .e49, and .w48 files.",
      "NOTE: An E48 file does not contain an Emu48 ROM. It contains only a record of a user's Emu48 session. To open an E48 file in Emu48, you must also possess and load an HP48 graphing calculator ROM image."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an E48 file in Emu48 (Windows, Android), provided you have already loaded an HP48 graphing calculator ROM image. To do so, select File → Open... from the program's menu bar. Then, navigate to and open your E48 file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12397&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}