{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/edf",
  "slug": "edf",
  "extension": "edf",
  "name": ".EDF File Extension",
  "type_name": "Edificius Project",
  "summary": "Learn about .EDF files and view a list of programs that open them.",
  "developer": "Acca Software",
  "more_information": {
    "description": [
      "An EDF file is a project created by ACCA Edificius, a CAD program that helps users create 2D and 3D architectural designs. It contains information about various aspects of an entire project, which includes each element of the building design (roof material, door width, window fixture model, balcony slab inclination, etc.), terrain, and one or more GANTT charts. EDF files may also store photorealistic renderings and video tours of the design."
    ]
  },
  "technical_info": {
    "content": [
      "You will most likely only encounter an Edificius Project EDF file if you are an Architecture, Engineering, and Construction (AEC) professional using Edificius. The EDF file is created by Edificius when a user saves his construction project by selecting File → Save or Save As.",
      "EDF files are the primary file type associated with Edificius and is only supported by Edificius. You can open an EDF file with Edificius by selecting File → Open.",
      "If you receive an EDF file and do not have access to Edificius, you can download and install the trial of Edificius from their website to open the file. Or you can ask the sender to export the design in a different format, such as Autodesk Drawing Exchange (.DXF), AutoCAD Drawing Database (.DWG), Wavefront 3D Object (.OBJ), SketchUp (.SKP), COLLADA (.DAE), Stereolithography (.STL), Polygon Model (.PLY), or Industry Foundation Classes (.IFC).",
      "Along with the design information, EDF files also contain data that makes up the \"Bill of Quantities,\" which is a list of tariffs, work descriptions, dimensions, and financial amount of the construction of the design. This data can be exported to a .DCF file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=9537&b=1"
      },
      {
        "name": "ACCA Edificius",
        "url": "https://fileinfo.com/software/acca/edificius"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/edf_9537.png",
      "alt": "Screenshot of a .edf file in ACCA Edificius BIM 2",
      "caption": "EDF file open in ACCA Edificius BIM 2"
    }
  ]
}