{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/efq",
  "slug": "efq",
  "extension": "efq",
  "name": ".EFQ File Extension",
  "type_name": "Ensoniq SQ1/SQ2/KS-32 File",
  "summary": "Learn about .EFQ files and view a list of programs that open them.",
  "developer": "Ensoniq",
  "more_information": {
    "description": [
      "An EFQ file is a sound data file used by the Ensoniq SQ-1, SQ-2, and KS-32 synthesizers, which are digital music workstations released in the early 1990s. It stores specific voice, patch, or performance data that defines how the synthesizer produces a particular sound. Musicians and producers typically use EFQ files to save and load custom sound settings, making it easier to reuse or share patches across different sessions or devices."
    ]
  },
  "technical_info": {
    "content": [
      "The Ensoniq SQ-1, SQ-2, and KS-32 synthesizers were popular keyboards in the 1990s that allowed musicians to create, edit, and play a wide range of synthesized sounds. The EFQ files the keyboards create help users store complex configurations without needing to manually recreate them every time. Although the Ensoniq SQ-1, SQ-2, and KS-32 synthesizers and the EFQ format are no longer widely used, users may still encounter EFQ files when working with vintage Ensoniq gear or in digital audio archives."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open EFQ files with Chicken Systems Translator in Windows and macOS."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1735&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}