{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/eix",
  "slug": "eix",
  "extension": "eix",
  "name": ".EIX File Extension",
  "type_name": "Metin2 Encrypted Index",
  "summary": "Learn about .EIX files and view a list of programs that open them.",
  "developer": "Webzen Games",
  "more_information": {
    "description": [
      "An EIX file is an index file that catalogs a set of game assets used by Metin2, a massively-multiplayer online role-playing game (MMORPG). It is stored alongside a corresponding .EPK file, which contains the actual game assets. Metin2 modders use EIX files to extract assets from EPK files."
    ]
  },
  "technical_info": {
    "content": [
      "Metin2 is a South Korean MMORPG in which players fight enemies and each other within a world based on East Asian mythology and fantasy stories. Ymir Entertainment originally developed Metin2; it is now developed by Webzen Games.",
      "The game stores a variety of game data in EPK files, which are asset packages that are always associated with an EIX file. The EIX file lists the assets that its associated EPK file contains. EPK and EIX files are both stored in Metin2's pack directory."
    ]
  },
  "how_to_open": {
    "instructions": [
      "In EterNexus (Windows), you can load an EIX file to extract assets from the file's associated EPK file. To do so, select File → Extract Archvie from EterNexus's menu bar. Then, navigate to and open your desired EIX file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=3895&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}