{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/epgz",
  "slug": "epgz",
  "extension": "epgz",
  "name": ".EPGZ File Extension",
  "type_name": "Pencil Project File",
  "summary": "Learn about .EPGZ files and view a list of programs that open them.",
  "developer": "Evolus",
  "more_information": {
    "description": [
      "An EPGZ file is a project created by Evolus Pencil, an open-source prototyping tool used to design mockups. It contains various design elements on one or more pages, such as text, shapes, flowchart stencils, web and mobile elements, and images. EPGZ files also store settings for the project, including the page size, number of pages, and names of the pages."
    ]
  },
  "technical_info": {
    "content": [
      "You can use Pencil to design various mockup drawings, such as mobile user interface (UI and webpage layouts, flowcharts, and desktop widgets. The application comes with various stencils and design elements to insert into a mockup, but you can also import custom elements.",
      "When you create and save a project, the EPGZ file is created to store the contents of the design. To create an EPGZ file with Pencil, click the menu in the upper-left corner of the application, select New Document, create the mockup, then select Save or Save As....",
      "You can save, close, and re-open EPGZ projects to continue editing your design. When you are finished modifying the mockup, you can export the project to various formats, such as .PNG, .SVG, .PDF, and .ODT. To export an EPGZ file with Pencil, click the menu in the upper-left corner of the application and select Export...."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open EPGZ files with Evolus Pencil in Windows, macOS, and Linux. To open an EPGZ file with Pencil, click the menu in the upper-left corner of the application and select Open...."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12120&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/epgz_12120.png",
      "alt": "Screenshot of a .epgz file in Evolus Pencil 3.1",
      "caption": "EPGZ file open in Evolus Pencil 3.1"
    }
  ]
}