{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/esf2",
  "slug": "esf2",
  "extension": "esf2",
  "name": ".ESF2 File Extension",
  "type_name": "Eos 2.9 Show File",
  "summary": "Learn about .ESF2 files and view a list of programs that open them.",
  "developer": "ETC",
  "more_information": {
    "description": [
      "An ESF2 file is a lighting control file used by versions 2.9 and above of Electronic Theater Control's (ETC) Eos software. It contains instructions that Eos uses to control theater lighting during a performance. ESF2 files are the same as ETC .ESF files, except that they are compressed."
    ]
  },
  "technical_info": {
    "content": [
      "ETC Eos is a family of theater lighting control consoles that comes with accompanying software, also named Eos. Using the Eos family software, lighting designers can design, save, and run theater lighting sequences, referred to as shows.",
      "Version 2.9 of Eos saves designers' shows in the compressed ESF2 format by default. (Optionally, designers can instead save their shows in the ESF format.) While ESF2 and ESF files contain the same data, ESF2 files are compressed (to reduce their file size). Due to this difference between the ESF2 and ESF formats, versions 2.8.3 and below of Eos cannot open ESF2 files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an ESF2 file with versions 2.9 and above of ETC's Eos software. While the software is available primarily within Eos family lighting control consoles, you can also download Windows and Mac versions of Eos software from ETC's website (linked below)."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13566&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}