{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/etl",
  "slug": "etl",
  "extension": "etl",
  "name": ".ETL File Extension",
  "type_name": "Microsoft Event Trace Log File",
  "summary": "Learn about .ETL files and view a list of programs that open them.",
  "developer": "Microsoft",
  "more_information": {
    "description": [
      "An ETL file is a log file created by Microsoft Tracelog, a program that creates logs using the events from the kernel in Microsoft operating systems. It contains trace messages that have been generated during trace sessions, such as disk accesses or page faults. ETL files are used to log high-frequency events while tracking the performance of an operating system."
    ]
  },
  "technical_info": {
    "content": [
      "Trace logs are generated by trace providers in trace session buffers and are stored by the operating system. They are then written to a log and stored in a compressed binary format in order to reduce the amount of space occupied.",
      "Reports may be generated from ETL files using the command-line utility Tracerpt. ETL file output may be configured with several options, such as a maximum allowable file size, so that the logs do not cause a computer run out of disk space.",
      "NOTE: Deleting ETL files will not affect your PC's function or performance."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=4126&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}