{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/ewnet",
  "slug": "ewnet",
  "extension": "ewnet",
  "name": ".EWNET File Extension",
  "type_name": "Ultiboard Netlist File",
  "summary": "Learn about .EWNET files and view a list of programs that open them.",
  "developer": "National Instruments",
  "more_information": {
    "description": [
      "An EWNET file contains a netlist, which is a representation of a PCB design that is saved in ASCII format and used by National Instruments Circuit Design Suite. It stores a netlist transferred from Multisim to Ultiboard, which includes the unique pin names of each device in the design and the name of the pattern associated with each design component reference ID."
    ]
  },
  "technical_info": {
    "content": [
      "EWNET files are used for transferring a PCB layout to a schematic or a schematic to a layout. The EWNET file is created by the Multisim and Ultiboard programs included with the Circuit Design Suite. When you select Transfer → Transfer to Ultiboard in Multisim or Transfer → Backward Annotate to Multisim in Ultiboard. You can open an EWNET file by selecting File → Open.",
      "PCBs are used in many electronic products such as radios and computer systems. Ultiboard allows you to design the layout of electrical wires, central processors, and other electronic components on your PCB and integrates with Multisim, an electronic schematic capture and SPICE simulation environment. The program is used by teachers, students, and professionals in the engineering field."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10562&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}