{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/exe",
  "slug": "exe",
  "extension": "exe",
  "name": ".EXE File Extension",
  "type_name": "Windows Executable File",
  "summary": "Learn about .EXE files and view a list of programs that open them.",
  "developer": "Microsoft",
  "more_information": {
    "description": [
      "An EXE file is an executable program that runs in Microsoft Windows. It contains an application, like notepad.exe or msedge.exe, that opens when you double-click the file. Some EXE files, such as installers downloaded from the internet, will install a program on your Windows computer when opened."
    ]
  },
  "technical_info": {
    "content": [
      "EXE is the primary format software developers use to package and deliver Windows programs. Each EXE file contains data that Windows uses to recognize, read, and run the program the file contains. This data is saved in a compiled, binary format, sometimes called machine code. EXE files also often contain additional program resources, such as the program's icon and its GUI graphics assets.",
      "When you double-click an EXE file in Windows, Windows runs the program the file contains. If the file includes an application installer, the installer will open and start the installation process. If the file stores an application, the application will open. Additionally, if the file contains a different kind of program (e.g., malware), that program will run.",
      "Developers typically name EXE files such that you can tell whether they contain an installer or an application. For example, EXE files that store an installer are often named setup.exe, while EXE files that launch an app usually include the app's name (e.g. msedge.exe for Microsoft Edge).",
      "Developers may save Windows application installers as .MSI files instead of EXE files. MSI files are similar to EXE files, except they always contain application installers. They never store Windows applications or other programs. Windows always uses Windows Installer (a utility included with Windows) to open MSI files and install the programs they contain."
    ]
  },
  "how_to_open": {
    "instructions": [
      "In Windows, you can run the program an EXE file contains by double-clicking the file. However, do not double-click the file unless you can verify its legitimacy.",
      "Advanced users can also extract an EXE file's contents without running the program it contains, using archive expansion tools like 7-Zip or RARLAB WinRAR.",
      "The EXE file format is designed specifically for use with Windows. Non-Windows operating systems (OS), such as macOS and Linux, cannot natively run programs saved as EXE files. However, macOS, Linux, and other non-Windows users can run Windows programs on their PCs by creating a Windows virtual machine.",
      "In macOS, you can use a Windows virtual machine created by Parallels Desktop or VMware Fusion to run the program an EXE file contains. You can also install Windows on a Mac with the Boot Camp utility bundled with the OS.",
      "In Linux, you can use a Windows virtual machine created by Oracle VM VirtualBox to run the program an EXE file contains. You can also use Wine, an application designed specifically to allow users to run Windows applications without installing Windows.",
      "In Android, you can use the Android version of Wine to run Windows applications. However, Wine for Android is limited by Android devices' architecture, and it can run only some Windows programs. In iOS, you can use the iOS version of Turing Software UTM to run Windows applications."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Microsoft Edge",
        "url": "https://fileinfo.com/software/microsoft/edge"
      },
      {
        "name": "7-Zip",
        "url": "https://fileinfo.com/software/igor_pavlov/7-zip"
      },
      {
        "name": "RARLAB WinRAR",
        "url": "https://fileinfo.com/software/rarlab/winrar"
      },
      {
        "name": "Parallels Desktop",
        "url": "https://fileinfo.com/software/parallels/desktop_for_mac"
      },
      {
        "name": "VMware Fusion",
        "url": "https://fileinfo.com/software/vmware/fusion"
      },
      {
        "name": "Oracle VM VirtualBox",
        "url": "https://fileinfo.com/software/oracle/vm_virtualbox"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=29&b=1"
      },
      {
        "name": "Microsoft Windows",
        "url": "https://fileinfo.com/software/microsoft/windows"
      },
      {
        "name": "7-Zip",
        "url": "https://fileinfo.com/software/igor_pavlov/7-zip"
      },
      {
        "name": "RARLAB WinRAR",
        "url": "https://fileinfo.com/software/rarlab/winrar"
      },
      {
        "name": "Parallels Desktop for Mac with Microsoft Windows installed",
        "url": "https://fileinfo.com/software/parallels/desktop_for_mac"
      },
      {
        "name": "VMware Fusion with Microsoft Windows installed",
        "url": "https://fileinfo.com/software/vmware/fusion"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/exe_29.png",
      "alt": "Screenshot of a .exe file in Microsoft Windows 11",
      "caption": "EXE file open in Microsoft Windows 11"
    }
  ]
}