{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/eyetv",
  "slug": "eyetv",
  "extension": "eyetv",
  "name": ".EYETV File Extension",
  "type_name": "EyeTV Recording File",
  "summary": "Learn about .EYETV files and view a list of programs that open them.",
  "developer": "Geniatech",
  "more_information": {
    "description": [
      "Recording created and used by EyeTV, a program that allows users to watch and record live TV directly on their computer; contains a video recording of a TV program and related metadata files."
    ]
  },
  "technical_info": {
    "content": [
      "The EYETV file is similar to a Mac OS X .PKG file. It contains a video file in MPEG format, most likely an .MPG file, and the metadata files, such as the .EYETVP file, associated with your TV recording. To view the contents of the EYETV recording file, right-click the file and select Show Package Contents.",
      "The EYETV files, along with .EYETVSCHED files and other setup information files, are located in the \"EyeTV Archive\" folder. You can move this folder to wherever you want but it must be named \"EyeTV Archive\" and you must specify in the application where the folder is located.",
      "The EyeTV software is only compatible with OS X and iOS although Geniatech develops peripherals that are available for Windows and Android devices. Product availability depends on the country in which you reside.",
      "NOTE: Geniatech acquired EyeTV from Elgato in February 2016."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=9729&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}