{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/fbmod",
  "slug": "fbmod",
  "extension": "fbmod",
  "name": ".FBMOD File Extension",
  "type_name": "Frosty Tool Suite Mod",
  "summary": "Learn about .FBMOD files and view a list of programs that open them.",
  "developer": "Cade and Frosty Tool Suite Team",
  "more_information": {
    "description": [
      "An FBMOD file is a video game mod created using Frosty Editor. It contains data used to modify the Windows version of a DICE Frostbite Engine video game, such as Mass Effect: Andromeda or Dragon Age: Inquisition. FBMOD files are installed using the Frosty Mod Manager."
    ]
  },
  "technical_info": {
    "content": [
      "The Frosty Tool Suite is a set of player-created tools used to modify Frostbite Engine video games. It includes the Frosty Editor, used to create mods, and the Frosty Mod Manager, used to install mods.",
      "Mods that players create using Frosty Editor are saved as FBMOD files. Typically, these files are packaged in .ZIP files, to reduce their file size. Mod creators often upload their FBMOD files to mod-sharing websites, such as NexusMods.com, to share them with other players.",
      "FBMOD files can contain a variety of different types of mods. For example, they may include aesthetic modifications to items or characters, or they may contain data used to modify a game's mechanics."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can install an FBMOD file using Frosty Mod Manager (Windows). For complete instructions on how to install a mod using Frosty Mod Manager, refer to the app's documentation."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12804&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}