{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/fbr",
  "slug": "fbr",
  "extension": "fbr",
  "name": ".FBR File Extension",
  "type_name": "FlashBack Recording",
  "summary": "Learn about .FBR files and view a list of programs that open them.",
  "developer": "Blueberry",
  "more_information": {
    "description": [
      "An FBR file is a screen recording created by Blueberry FlashBack Pro, a screen recorder for Windows. It contains a video of actions a user performed in Windows. It may also contain annotations, transitions, and other special effects."
    ]
  },
  "technical_info": {
    "content": [
      "Blueberry FlashBack Pro is a screen recording suite that consists of two programs: FlashBack Pro Recorder and FlashBack Pro Player. Using FlashBack Pro Recorder, a user can record the actions they take on their computer. (For example, a user might create a recording for use as a video tutorial.) FlashBack Pro saves screen recordings as FBR files.",
      "After creating an FBR file, a user can open that file with FlashBack Pro Player. Doing so allows the user to watch, edit, and export the recording they created. For example, a user could trim their screen recording, add text and transitions, and then export the edited recording as an .MP4 file. (They can also save the edited recording as an FBR file, if they plan to continue editing it in the future.)"
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an FBR file with Blueberry FlashBack Pro Player, which is included with FlashBack Pro. FlashBack Pro Player allows you to watch, edit, and convert the screen recording an FBR file contains."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "You can use Blueberry FlashBack Pro Player (included with FlashBack Pro) to convert an FBR file to the following formats:",
      ".MP4 - MPEG-4 Video",
      ".AVI - Audio Video Interleave",
      ".GIF - Graphical Interchange Format",
      ".EXE - Executable File",
      "To do so:",
      "Open your FBR file with FlashBack Player.",
      "Select File → Export...",
      "Choose your desired export format.",
      "Click OK.",
      "Click Export.",
      "Name and save your converted file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=3367&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/fbr_3367.png",
      "alt": "Screenshot of a .fbr file in Blueberry FlashBack Pro Player",
      "caption": "FBR file open in Blueberry FlashBack Pro Player"
    }
  ]
}