{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/fgrom",
  "slug": "fgrom",
  "extension": "fgrom",
  "name": ".FGROM File Extension",
  "type_name": "FragRoom Shader File",
  "summary": "Learn about .FGROM files and view a list of programs that open them.",
  "developer": "siljamdev",
  "more_information": {
    "description": [
      "An FGROM file is a fragment shader file used by siljamdev FragRoom, an application for running fragment shaders offline on a desktop computer. It contains two main sections comprised of plain text: special FragRoom configuration options and OpenGL Shading Language (GLSL) code. The configuration options control aspects of the FragRoom window, such as its title, maximum frames per second (FPS), and other runtime settings, while the GLSL section contains the shader program itself, which is processed and rendered by the application."
    ]
  },
  "technical_info": {
    "content": [
      "GLSL is a C-like programming language used to write shaders, which are small programs that run on a computer’s graphics processing unit (GPU). Any user can create or edit an FGROM file using a standard text editor, making the format accessible to both shader developers and hobbyists who want to experiment with visual effects outside of a web browser or online shader platform."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open FGROM files with FragRoom in Windows. While other shader tools could open the GLSL portion of an FGROM file, the added configuration options are specific to FragRoom and may cause errors in programs that do not recognize them.",
      "Since FGROM files store plain text, you can also open them with a source code or plain text editor. Some options include Microsoft Visual Studio Code, Microsoft Notepad, and Apple TextEdit."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Microsoft Visual Studio Code",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      },
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13857&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/fgrom_13857.png",
      "alt": "Screenshot of a .fgrom file in Microsoft Visual Studio Code 1",
      "caption": "FGROM file open in Microsoft Visual Studio Code 1"
    }
  ]
}