{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/flmpst",
  "slug": "flmpst",
  "extension": "flmpst",
  "name": ".FLMPST File Extension",
  "type_name": "FL Studio Mobile Plug-in Preset",
  "summary": "Learn about .FLMPST files and view a list of programs that open them.",
  "developer": "Image-Line",
  "more_information": {
    "description": [
      "An FLMPST file is a preset used by a plug-in for Image-Line FL Studio Mobile, a digital audio workstation (DAW). It contains an instrument or effect that can be loaded in the associated plug-in. FLMPST files work only with FL Studio Mobile; they do not work with FL Studio."
    ]
  },
  "technical_info": {
    "content": [
      "FL Studio Mobile is the mobile version of Image-Line FL Studio. It is available primarily for Android, ChromeOS, and iOS. It can also be used on Windows and Mac PCs, either by itself or in conjunction with the desktop version of FL Studio.",
      "Just like FL Studio, FL Studio Mobile allows you to install plug-ins that add additional instruments and audio effects. These plug-ins load instruments and effects from FLMPST files, which are also referred to as plug-in presets.",
      "Most plug-ins are packaged with some default FLMPST files. You can download and install additional FLMPST files from the Internet."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an FLMPST file with Image-Line FL Studio Mobile. Before doing so, you must install the plug-in with which your FLMPST file is associated. Then, either:",
      "Long-press your FLMPST file and select Open with FL Studio Mobile",
      "Move your FLMPST file to FL Studio Mobile's My Presets directory, then open it in FL Studio Mobile from its associated plug-in"
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Image-Line FL Studio",
        "url": "https://fileinfo.com/software/image-line/fl_studio"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13098&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}