{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/fluid",
  "slug": "fluid",
  "extension": "fluid",
  "name": ".FLUID File Extension",
  "type_name": "Loop Component",
  "summary": "Learn about .FLUID files and view a list of programs that open them.",
  "developer": "Microsoft",
  "more_information": {
    "description": [
      "A FLUID file is a Microsoft Loop component. It contains text a user inserted in a Microsoft Teams chat, shared Word document, or other collaborative Microsoft 365 document, so others could edit it. FLUID files are typically stored in their creator's Microsoft OneDrive for Business storage."
    ]
  },
  "technical_info": {
    "content": [
      "Microsoft Loop is an online collaboration app that, among other things, allows users to add collaborative components while using various Microsoft 365 apps. For example, co-workers conducting a team chat in Microsoft Teams can add Loop components that allow them to edit a piece of text together in real-time or vote on an issue.",
      "To ensure users have access to their Loop components in the future, each component is automatically saved in its creator's Microsoft OneDrive for Business storage. In the past, Microsoft Loop saved components as FLUID files. It now saves components as .LOOP files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a FLUID file with Microsoft Loop (Web). To do so, double-click the file in your OneDrive for Business account. OneDrive will then use Loop to open the component the file contains."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13159&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}