{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/fp4",
  "slug": "fp4",
  "extension": "fp4",
  "name": ".FP4 File Extension",
  "type_name": "FileMaker Pro 4 Database",
  "summary": "Learn about .FP4 files and view a list of programs that open them.",
  "developer": "Claris",
  "more_information": {
    "description": [
      "An FP4 file is a database created by Claris FileMaker Pro 4. It contains one or more data tables, each of which includes labels and data records. Businesses use FP4 files to organize their inventories, finances, employees, and projects."
    ]
  },
  "technical_info": {
    "content": [
      "FileMaker Pro is a data management program that allows businesses to input, organize, and review data. For example, a business might input its inventory list into a FileMaker Pro database and use the program to track and share its inventory.",
      "In 1997, Claris released the fourth version of FileMaker Pro, named FileMaker Pro 4. This version of the program saved users' databases as FP4 files. Notably, Claris changed its name to FileMaker, Inc. before releasing FileMaker Pro 4.1. The company has since changed its name back to Claris."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an FP4 file with FileMaker Pro (Windows, Mac) versions 4 through 11. To open an FP4 file with a more recent version of FileMaker Pro, you must first convert the file to the current FileMaker Pro database format. For example, to open an FP4 file with FileMaker Pro 12, you must:",
      "Open the file with FileMaker Pro 11 to convert it to the .FP7 format.",
      "Open the converted FP7 file with FileMaker Pro 12 or a later version to convert it to the .FMP12 format."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "FileMaker Pro",
        "url": "https://fileinfo.com/software/filemaker/filemaker_pro"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=403&b=1"
      },
      {
        "name": "FileMaker Pro Advanced",
        "url": "https://fileinfo.com/software/filemaker/filemaker_pro"
      },
      {
        "name": "FileMaker Pro Advanced",
        "url": "https://fileinfo.com/software/filemaker/filemaker_pro"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}