{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/fpc",
  "slug": "fpc",
  "extension": "fpc",
  "name": ".FPC File Extension",
  "type_name": "FreePCB Printed Circuit Board Layout",
  "summary": "Learn about .FPC files and view a list of programs that open them.",
  "developer": "Allan Wright",
  "more_information": {
    "description": [
      "An FPC file is a printed circuit board (PCB) layout created using FreePCB, an open-source PCB design program, or a related program, such as FreePCB-2. It contains plain text data that specifies the PCB's name, number of copper layers, default trace and via widths, and overall design."
    ]
  },
  "technical_info": {
    "content": [
      "FreePCB and its successor, FreePCB-2, are free Windows programs that PCB designers can use to create and edit digital PCBs. After they finish editing a PCB, designers can export that PCB in file formats used by PCB manufacturers, so the manufacturer can create a real-life copy of the PCB.",
      "FreePCB saves users' PCB design projects as FPC files. Each FPC file is a plain text file that includes many sections, each of which specifies some subset of data about the PCB the file describes."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an FPC file in FreePCB (Windows) or FreePCB-2 (Windows). To do so, select File → Open... from either program's menu bar. Then, navigate to and open your FPC file.",
      "If you so desire, you can also open an FPC file in Microsoft Notepad (Windows) or any other text editor, to view the plain text data the file contains.",
      "To use an FPC file to create Gerber and Drill files:",
      "Open the FPC file in FreePCB or FreePCB-2.",
      "Select File → Generate CAM files...",
      "Review and, if needed, adjust the settings and selections in the Generate Gerber and Drill Files window.",
      "Select Create Files."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12514&b=1"
      },
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Vim",
        "url": "https://fileinfo.com/software/vim/vim"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}