{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/fsymbols-art",
  "slug": "fsymbols-art",
  "extension": "fsymbols-art",
  "name": ".FSYMBOLS-ART File Extension",
  "type_name": "FSymbols Draw ASCII Art",
  "summary": "Learn about .FSYMBOLS-ART files and view a list of programs that open them.",
  "developer": "FSymbols",
  "more_information": {
    "description": [
      "An FSYMBOLS-ART file is an image created by FSymbols Draw, an online ASCII art editor. When opened in FSymbols Draw, an FYSMBOLS-ART file appears as an ASCII art image. However, FSYMBOLS-ART files are actually JSON files, which contain both a textual and PNG representation of an image."
    ]
  },
  "technical_info": {
    "content": [
      "ASCII art is a graphic design technique in which artists use ASCII characters to create word art, logos, and other illustrations. FSymbols Draw is a web app that artists can use to draw ASCII art illustrations on a canvas, using drawing and painting tools similar to other graphic design apps'.",
      "If an artist wants to continue editing their FSymbols Draw illustration in the future, they can select Save to edit later to save their current illustration as an FSYMBOLS-ART file. This file contains not only a textual representation of an artist's image, but also binary data that FSymbols Draw can use to export a PNG version of the image."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an FSYMBOLS-ART file with FSymbols Draw (Web). To do so:",
      "Open FSymbols Draw in your web browser.",
      "Select Import saved.",
      "Navigate to and open your FSYMBOLS-ART file."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "You can use FSymbols Draw to convert an FSYMBOLS-ART file to a .PNG file. To do so, open your FSYMBOLS-ART file in FSymbols Draw, and then select SAVE.PNG from the program's upper-left side."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13452&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/fsymbols-art_13452.png",
      "alt": "Screenshot of a .fsymbols-art file in FSymbols Draw",
      "caption": "FSYMBOLS-ART file open in FSymbols Draw"
    }
  ]
}