{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/gamingroot",
  "slug": "gamingroot",
  "extension": "gamingroot",
  "name": ".GAMINGROOT File Extension",
  "type_name": "Xbox Game Root File",
  "summary": "Learn about .GAMINGROOT files and view a list of programs that open them.",
  "developer": "Microsoft",
  "more_information": {
    "description": [
      "A GAMINGROOT file is a hidden system file used by the Xbox and Game Bar apps on Windows 10 or 11 to indicate that a particular drive is suitable for game installation. When these apps identify a drive as appropriate for storing games, they automatically create a GAMINGROOT file on it. GAMINGROOT files are unnamed and appear as .GamingRoot. Users should not delete these files since doing so could prevent games from functioning properly."
    ]
  },
  "technical_info": {
    "content": [
      "The Xbox and Game Bar apps automatically generate GAMINGROOT files when they recognize a drive suitable for game data. These files are typically very small, usually less than one kilobyte in size, but play an essential role in ensuring that your games are installed and run correctly on the designated drive.",
      "NOTE: Windows only displays GAMINGROOT files if you have hidden files displayed in Windows."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You should not attempt to open GAMINGROOT files. Instead, the Xbox or Game Bar apps reference the files to identify drives suitable for storing games and their related data."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13735&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}