{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/gbmap",
  "slug": "gbmap",
  "extension": "gbmap",
  "name": ".GBMAP File Extension",
  "type_name": "GoreBox Map",
  "summary": "Learn about .GBMAP files and view a list of programs that open them.",
  "developer": "F2Games",
  "more_information": {
    "description": [
      "A GBMAP file is a game map used by GoreBox, a violent sandbox video game. Primarily, it contains plain text data that defines the map's structure. GoreBox uses this data to load and display the map."
    ]
  },
  "technical_info": {
    "content": [
      "In GoreBox, players engage in a bevy of violent activities within destructible, sandbox environments. Using GoreBox's Map Editor, players can create and play in their own custom environments.",
      "GoreBox saves these custom game maps as GBMAP files (stored in the game's Maps directory). Each GBMAP file specifies the included map's name, description, and created-on date. Then, it specifies the map coordinates and materials data that GoreBox uses to display the map.",
      "Typically, players share GBMAP files with each other via GoreBox's in-game Workshop (by uploading maps to and downloading maps from the Workshop). However, players sometimes also share individual GBMAP files online, so others can download, install, and play on the maps those GBMAP files contain."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a GBMAP file with GoreBox (Windows, Android). To do so, place the file in GoreBox's Maps directory. The next time you open GoreBox, you will be able to select the map your GBMAP file contains."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13563&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}