{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/gbsproj",
  "slug": "gbsproj",
  "extension": "gbsproj",
  "name": ".GBSPROJ File Extension",
  "type_name": "GB Studio Project File",
  "summary": "Learn about .GBSPROJ files and view a list of programs that open them.",
  "developer": "Chris Maltby",
  "more_information": {
    "description": [
      "A GBSPROJ file is a project file created by GB Studio, a program used to create custom Game Boy video games. It contains JSON-formatted information about a game project. For example, GBSPROJ files list a project's name, author, and included scenes. GB Studio uses the information that GBSPROJ files contain to open the described game project."
    ]
  },
  "technical_info": {
    "content": [
      "Using GB Studio, Game Boy enthusiasts can develop and publish their own Game Boy games. When a developer saves their game development project, GB Studio creates a project-specific directory. This directory contains all the project's assets, a GBSPROJ file, and a GBSPROJ.BAK file (a backup of the GBSPROJ file).",
      "GBSPROJ files are renamed .JSON files that contain project metadata and describe a project's structure and included assets. To re-open a GB Studio project, developers select and open that project's GBSTUDIO file.",
      "NOTE: If a GBSTUDIO file is not stored alongside its associated assets, the file and associated project will not open correctly."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a GBSPROJ file (and the game development project it describes) with GB Studio. To do so:",
      "Select File → Open... from GB Studio's menu bar.",
      "Navigate to and open your GBSPROJ file.",
      "After you open a GBSPROJ file with GB Studio, you can edit, run, and export the game the GBSPROJ file describes. For more information about GB Studio, click here.",
      "If necessary, you can also open a GBSPROJ file with Microsoft Visual Studio Code or any other text editor, to view the JSON-formatted text it contains."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Microsoft Visual Studio Code",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13616&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/gbsproj_13616.png",
      "alt": "Screenshot of a .gbsproj file in GB Studio",
      "caption": "GBSPROJ file open in GB Studio"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/gbsproj_13616-2.png",
      "alt": "GBSPROJ file open in Microsoft Visual Studio Code",
      "caption": "GBSPROJ file open in Microsoft Visual Studio Code"
    }
  ]
}