{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/gbw",
  "slug": "gbw",
  "extension": "gbw",
  "name": ".GBW File Extension",
  "type_name": "GerbView Project",
  "summary": "Learn about .GBW files and view a list of programs that open them.",
  "developer": "Software Companions",
  "more_information": {
    "description": [
      "A GBW file is a project created by Software Companions GerbView, a program for managing Gerber and Drill files, such as .GTL, .GBL and .DRL files, which are integral for designing printed circuit boards (PCBs). It contains information about a workspace, including references to loaded Gerber files, layer settings, and other project configurations. GBW files do not store the actual design data but include information to keep track of the files contained in the project and how the app displays them."
    ]
  },
  "technical_info": {
    "content": [
      "PCB designers, electrical engineers, and manufacturers working with Gerber files to design and fabricate PCBs are the primary users of GerbView. The software helps them visualize, verify, and convert Gerber and Drill files before sending them for production.",
      "Saving projects as GBW files allows users to close and reopen their work without reloading multiple individual Gerber files manually. This is especially helpful when managing complex layer configurations across multiple files while reviewing or preparing designs for manufacturing."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open GBW files with Software Companions GerbView in Windows. To open a GBW file, select File → Open Project."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "Software Companions GerbView can convert GBW file to various file types, including the following formats:",
      ".DXF - Drawing Exchange Format",
      ".SVG - Scalable Vector Graphic",
      ".PDF - Portable Document Format",
      ".JPG - JPEG Image"
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13789&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}