{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/gci",
  "slug": "gci",
  "extension": "gci",
  "name": ".GCI File Extension",
  "type_name": "GameCube Saved Game",
  "summary": "Learn about .GCI files and view a list of programs that open them.",
  "developer": "Nintendo",
  "more_information": {
    "description": [
      "A GCI file is a saved game file created while playing a Nintendo GameCube video game. It records a player's progress so they can resume their game at a later time. Most often, GCI files are used to load saved games in the Dolphin GameCube emulator."
    ]
  },
  "technical_info": {
    "content": [
      "When GameCube players save an in-progress game, their progress is typically saved in a GCI or .SAV file. The American versions of GameCube games save players' progress in GCI files, while their European equivalents save games in SAV files. These files are stored on players' GameCube memory cards.",
      "Outside of loading saved games on their GameCubes, most GameCube players will not encounter a GCI file. However, those who use the Dolphin emulator to play GameCube games on their PCs can download, create, and open GCI files to resume in-progress games (including their own and other players') on their PCs."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a GCI file in Dolphin (cross-platform). To do so, you must possess a corresponding American-edition GameCube ROM, which will likely be saved in a .GCM or .ISO file.",
      "To load your GCI file, first use Dolphin's Memory Card Manager to add the file to your list of GameCube saved games. Then, open the GCI file's corresponding ROM and load the saved game your GCI file contains."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Dolphin",
        "url": "https://fileinfo.com/software/dolphin/dolphin"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=3712&b=1"
      },
      {
        "name": "Dolphin",
        "url": "https://fileinfo.com/software/dolphin/dolphin"
      },
      {
        "name": "Dolphin",
        "url": "https://fileinfo.com/software/dolphin/dolphin"
      },
      {
        "name": "Dolphin",
        "url": "https://fileinfo.com/software/dolphin/dolphin"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}