{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/gdocx",
  "slug": "gdocx",
  "extension": "gdocx",
  "name": ".GDOCX File Extension",
  "type_name": "Google Drive Document",
  "summary": "Learn about .GDOCX files and view a list of programs that open them.",
  "developer": "Google",
  "more_information": {
    "description": [
      "A GDOCX file is a pointer file created by Google Docs, an online document editor included with Google Drive. It contains information that points to the location of a word processing document stored in Google Drive. GDOCX files do not store actual document content, only the location of a word processing document stored in Google Drive."
    ]
  },
  "technical_info": {
    "content": [
      "GDOCX files are similar to shortcut files. When you double-click a GDOCX file, it opens the actual word processing document stored in Google Drive. Instead of a GDOCX file, you may see a .GDOC file, which stores the same information but is more common.",
      "Google Drive is a file storage service that can be downloaded and installed in Windows or macOS as a desktop client for synchronizing remote Google Drive files with a local computer. If you install the Google Drive desktop client, your Google Docs documents are accessible within a special folder named Google Drive, which is on the local hard drive. This folder is used to synchronize files with the remote Google Drive. When you double-click a GDOCX file, the document is opened in Google Drive in your default web browser.",
      "NOTE: In 2018, the Google Drive desktop applications were discontinued but you can still access Google Drive online."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Google Docs",
        "url": "https://fileinfo.com/software/google/docs"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10696&b=1"
      },
      {
        "name": "Google Drive",
        "url": "https://fileinfo.com/software/google/drive"
      },
      {
        "name": "Google Drive",
        "url": "https://fileinfo.com/software/google/drive"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}