{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/geode",
  "slug": "geode",
  "extension": "geode",
  "name": ".GEODE File Extension",
  "type_name": "Geometry Dash Geode Mod",
  "summary": "Learn about .GEODE files and view a list of programs that open them.",
  "developer": "Geode Team",
  "more_information": {
    "description": [
      "A GEODE file is a mod for the Geometry Dash created by Geode, a mod-loading utility. It contains a collection of files in a Zip-compressed format that adds functionality, such as new levels and gameplay options, to Geometry Dash when loaded by Geode. Geometry Dash gamers can create GEODE mods and then publish them to the Geode Mods repository (repo), which other Geometry Dash gamers can download and install through the game."
    ]
  },
  "technical_info": {
    "content": [
      "RobTop Games develops Geometry Dash, a music-based platforming game in which players must click or tap their screen in time to the music to avoid obstacles. It is available on multiple platforms, including Windows, macOS, and Linux.",
      "Geometry Dash gamers can develop mods to enhance gameplay in Geometry Dash. For example, a mod may allow gamers to back up save files, adjust the main menu, or change game modes during the game.",
      "Gamers often upload mods to the Geode Mods Repo, where other gamers can freely download and install them. Gamers can also publish mods on a separate platform that others can purchase, download, and install.",
      "NOTE: You can find more information about creating GEODE mods in the Geode SDK documentation."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open GEODE files with Geode, a modding toolkit for Geometry Dash. The utility is available for Windows, macOS, and Linux and must be installed with Geometry Dash.",
      "Since GEODE files are Zip-compressed, you can extract their contents with a Zip utility, such as Corel Winzip or 7-Zip. You can also decompress them in Windows with Microsoft Windows File Explorer or Apple Archive Utility in macOS (you may need to rename the .geode file extension to .zip for the utility to recognize it)."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Corel Winzip",
        "url": "https://fileinfo.com/software/corel/winzip"
      },
      {
        "name": "7-Zip",
        "url": "https://fileinfo.com/software/igor_pavlov/7-zip"
      },
      {
        "name": "Apple Archive Utility",
        "url": "https://fileinfo.com/software/apple/archive_utility"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13701&b=1"
      },
      {
        "name": "Corel WinZip",
        "url": "https://fileinfo.com/software/corel/winzip"
      },
      {
        "name": "7-Zip",
        "url": "https://fileinfo.com/software/igor_pavlov/7-zip"
      },
      {
        "name": "Apple Archive Utility",
        "url": "https://fileinfo.com/software/apple/archive_utility"
      },
      {
        "name": "Corel WinZip Mac",
        "url": "https://fileinfo.com/software/corel/winzip_mac"
      },
      {
        "name": "RARLAB RAR",
        "url": "https://fileinfo.com/software/rarlab/rar_for_android"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}