{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/gig",
  "slug": "gig",
  "extension": "gig",
  "name": ".GIG File Extension",
  "type_name": "Tascam GigaSampler File",
  "summary": "Learn about .GIG files and view a list of programs that open them.",
  "developer": "Tascam",
  "more_information": {
    "description": [
      "A GIG file is a sound sample file created by Tascam GigaSampler, a software sampler used to produce realistic instrument sounds and other audio effects. It stores recordings of individual notes or sounds, along with instructions for how they should be played back, such as velocity layers and key mappings. GIG files allow musicians to reproduce the sound of real instruments with detailed dynamics and expression."
    ]
  },
  "technical_info": {
    "content": [
      "GigaSampler was one of the early software samplers designed for professional music production. Users load GIG files into the program, which trigger the samples with MIDI input, making it possible to play complex sampled instruments in real time.",
      "NOTE: GigaStudio replaced GigaSampler, which continued to use the GIG file format and expanded its features. However, both GigaSampler and GigaStudio are no longer supported."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open GIG files with various third-party samplers and audio tools. Some examples include LMMS and LinuxSampler."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1754&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}