{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/gmd",
  "slug": "gmd",
  "extension": "gmd",
  "name": ".GMD File Extension",
  "type_name": "Geometry Dash Level",
  "summary": "Learn about .GMD files and view a list of programs that open them.",
  "developer": "HJfod",
  "more_information": {
    "description": [
      "A GMD file is a Geometry Dash game level created using GDShare or GDShare-mod, which are third-party level import/export tools. It contains data used to import a custom level into the Windows or macOS version of Geometry Dash."
    ]
  },
  "technical_info": {
    "content": [
      "Geometry Dash is a music-based platforming game in which players must click or tap in time with music to avoid obstacles. The game is available for iOS, Android, Windows, and macOS.",
      "Geometry Dash includes a custom level creation system that allows players to create their own levels, share them online, and play levels designed by other players. However, there is no official way to export levels as local files. So, Geometry Dash enthusiast HJfod created the GDShare utility, which allows players to save their custom levels as GMD files.",
      "The original GDShare utility functioned as an independent program that allowed users to export levels from and import levels into Geometry Dash. HJfod has since created an updated version of the utility, called GDShare-mod, which integrates directly with Geometry Dash. HJfod recommends that players use GDShare-mod, and not GDShare, to create and manage GMD files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can use GDShare-mod to import GMD files into the Windows and macOS versions of Geometry Dash. After you've installed GDShare-mod, import and export buttons will appear in Geometry Dash's custom level creator, allowing you to save and load levels as GMD files."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12189&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/gmd_12189.png",
      "alt": "Screenshot of a .gmd file in Microsoft Visual Studio Code",
      "caption": "GMD file open in Microsoft Visual Studio Code"
    }
  ]
}