{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/gmd2",
  "slug": "gmd2",
  "extension": "gmd2",
  "name": ".GMD2 File Extension",
  "type_name": "Geometry Dash Level",
  "summary": "Learn about .GMD2 files and view a list of programs that open them.",
  "developer": "HJfod",
  "more_information": {
    "description": [
      "A GMD2 file is a Geometry Dash game level created using GDShare-mod, a third-party level import/export tool. It contains data used to import a custom level into the Windows or macOS version of Geometry Dash. The GMD2 format replaced the .GMD format."
    ]
  },
  "technical_info": {
    "content": [
      "Geometry Dash is a music-based platforming game in which players must click or tap in time with music to avoid obstacles. It includes a custom level creation system that allows players to create their own levels, share them online, and play levels designed by other players. However, there is no official way to export levels as local files.",
      "To allow players to save custom levels locally, Geometry Dash enthusiast HJfod created the GDShare utility, which was succeeded by GDShare-mod. GDShare-mod integrates directly with Geomery Dash and allows users to export levels from and import levels into Geometry Dash. These levels are saved as GMD2 files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can use GDShare-mod to import GMD2 files into the Windows and macOS versions of Geometry Dash. After you've installed GDShare-mod, import and export buttons will appear in Geometry Dash's custom level creator, allowing you to save and load levels as GMD2 files."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12665&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}