{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/gr2",
  "slug": "gr2",
  "extension": "gr2",
  "name": ".GR2 File Extension",
  "type_name": "Granny 3D File",
  "summary": "Learn about .GR2 files and view a list of programs that open them.",
  "developer": "RAD Game Tools",
  "more_information": {
    "description": [
      "A GR2 file is a 3D model or animation file created using Granny 3D, a toolkit developed by RAD Game Tools (now part of Epic Games). It stores data such as 3D meshes, textures, skeletons, and animations. Game developers use GR2 files to save animated characters and objects, which they load into a game engine during the development process."
    ]
  },
  "technical_info": {
    "content": [
      "RAD Game Tools introduced Granny 3D in the early 2000s to help developers efficiently create, manage, and integrate 3D content into games. It is middleware (software that works between different applications or systems to help them work together more smoothly) that has been used in many commercial titles across PC, console, and mobile platforms.",
      "The GR2 format is typically part of a game's build pipeline, supporting tasks like animation blending, mesh deformation, and real-time playback. Third-party 3D content creation tools may also support GR2 files, allowing for both exporting to and importing from them.",
      "NOTE: Developers working with older Granny file formats (.GRN) can convert them to the GR2 format using the official \"grn2gr2\" conversion utility."
    ]
  },
  "how_to_open": {
    "instructions": [
      "GR2 files are not meant to be opened manually. The files are often embedded in game assets and are instead managed through the Granny3D toolset."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=4080&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}