{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/gtzip",
  "slug": "gtzip",
  "extension": "gtzip",
  "name": ".GTZIP File Extension",
  "type_name": "GT Designer Zip File",
  "summary": "Learn about .GTZIP files and view a list of programs that open them.",
  "developer": "StudioCoast",
  "more_information": {
    "description": [
      "A GTZIP file is a Zip-compressed file created by StudioCoast GT Designer Advanced, a program used to create titles and lower-third templates for vMix live production and streaming software. It contains a title or lower-third graphic overlay consisting of one or more layers and may include text and graphics, text properties, and animation information."
    ]
  },
  "technical_info": {
    "content": [
      "GT Designer Advanced is a utility included with StudioCoast vMix. You can create titles or lower-third graphics with GT Designer Advanced, then import them into vMix to be displayed during a production, such as a sporting event, newscast, or church service.",
      "To create a GTZIP file with GT Designer, select File → Save As. After saving the title, GT Designer creates a GTZIP file to store the title or lower-third graphic information. The GTZIP file is a working file, which means you can close the file, re-open it, then continue modifying the title or lower-third graphic.",
      "NOTE: You can also save a title or lower-third graphic created by GT Designer as a GTXML file, which stores its information in the XML standard."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open GTZIP files with StudioCoast GT Designer (included with the vMix download) in Windows. You can also edit the file with GT Designer. To open a GTZIP file with GT Designer, select File → Open.",
      "You can also open a GTZIP file with StudioCoast vMix in Windows. To open a GTZIP file with vMix, select Add Input → Title, click Browse, then choose the GTZIP file you would like to open.",
      "NOTE: Since GTZIP files are compressed with Zip compression, you can extract the contents stored in the GTZIP file by renaming the .gtzip file extension to .zip, then opening it with a Zip decompression utility."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12341&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/gtzip_12341.png",
      "alt": "Screenshot of a .gtzip file in StudioCoast GT Designer Advanced 2",
      "caption": "GTZIP file open in StudioCoast GT Designer Advanced 2"
    }
  ]
}