{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/gwd",
  "slug": "gwd",
  "extension": "gwd",
  "name": ".GWD File Extension",
  "type_name": "Galaxy Watchface Design File",
  "summary": "Learn about .GWD files and view a list of programs that open them.",
  "developer": "Samsung",
  "more_information": {
    "description": [
      "A GWD file is a watchface design project created by Samsung Galaxy Watch Studio, an application used by developers to create faces for various Samsung watches. It contains a design for a watchface, which includes the background, index, images, animation, complications (battery, heart rate, workout, etc.), and watch hands."
    ]
  },
  "technical_info": {
    "content": [
      "Galaxy Watch Studio allows you to edit every detail of the watch face. You can specify the dimensions, placement, angle, font type and size, language, and time format of the watchface. Once you are finished designing your watchface you can build it as a .TPK file then upload it to the Galaxy store.",
      "Galaxy Watch Studio was formerly known as Gear Watch Designer. GWD files created by version 1.2.0 or later of Gear Watch Designer cannot be opened by version 1.1.0 or earlier.",
      "Also, version 2.0 of Galaxy Watch Designer dropped support for Gear S, Gear Fit2, Gear Fit2 Pro, and Gear S2 watches. You will need to use version 1.6.2 of Galaxy Watch Designer or earlier to support these models."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10370&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}