{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/gwsave",
  "slug": "gwsave",
  "extension": "gwsave",
  "name": ".GWSAVE File Extension",
  "type_name": "Inscryption Saved Game",
  "summary": "Learn about .GWSAVE files and view a list of programs that open them.",
  "developer": "Daniel Mullins Games",
  "more_information": {
    "description": [
      "A GWSAVE file is a saved game created by Inscryption, a roguelike deck-building video game. It contains a plain text record of a player's current game progress and deck. Inscryption modders often modify their GWSAVE files to add cards to their decks, give themselves in-game items, and alter other gameplay elements."
    ]
  },
  "technical_info": {
    "content": [
      "In Inscryption, players take on the role of Luke Carder, a vlogger who has been sucked into a complex and malevolent deck-building video game. As the player progresses through the game, they add new cards to their deck, acquire items, and experience numerous surprises.",
      "Inscryption records a player's current deck, acquired items, map location, and other progress and achievements in a GWSAVE file, named SaveFile.gwsave. (It also backs up a player's prior saved game in SaveFile-Backup.gwsave.) This file is a plain text file, which consists of various sections associated with specific aspects of gameplay.",
      "For example, the playerDeck section describes the contents of a player's current deck (including how cards in the deck have been modified in-game), while the playerLives section records the number of lives a player has left. For more complete information on the data a GWSAVE file contains and how to modify that data, click here."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a GWSAVE file and edit the saved game data it contains with Microsoft Visual Studio Code, Microsoft Notepad, Apple TextEdit, or any other text editor. Alternatively, you can use the online Inscryption Save Editor to edit the data your GWSAVE file contains.",
      "To use a GWSAVE file with Inscryption, place it one of the following locations (and delete your existing GWSAVE file):",
      "Windows: ~/​Steam/​steamapps/​common/​Inscryption",
      "Mac: ~/​Users/​YourUserName/​Applications/​Inscryption.app",
      "To place a GWSAVE file in Inscryption.app, right-click the file and select Show Package Contents. Then, move your GWSAVE file into the Contents directory that appears."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Microsoft Visual Studio Code",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      },
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13404&b=1"
      },
      {
        "name": "Microsoft Visual Studio Code",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      },
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Microsoft Visual Studio Code",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/gwsave_13404.png",
      "alt": "Screenshot of a .gwsave file in Microsoft Visual Studio Code",
      "caption": "GWSAVE file open in Microsoft Visual Studio Code"
    }
  ]
}