{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/h5m",
  "slug": "h5m",
  "extension": "h5m",
  "name": ".H5M File Extension",
  "type_name": "Heroes of Might and Magic V Map",
  "summary": "Learn about .H5M files and view a list of programs that open them.",
  "developer": "Ubisoft",
  "more_information": {
    "description": [
      "An H5M file is a game map used by Heroes of Might and Magic V, a popular turn-based strategy game. Each H5M file is a renamed .ZIP file, which contains all the files needed to load a game map. Players can create H5M files with Heroes of Might and Magic V's Map Editor, added in version 1.3."
    ]
  },
  "technical_info": {
    "content": [
      "Heroes of Might and Magic V mapmakers often post their custom maps online, for other players to download and use. These custom maps, usually created using the game's Map Editor, are saved as H5M files. (Additionally, some mapmakers have recreated Heroes of Might and Magic V's default maps as H5M files, for archival purposes.)",
      "Players using a version of Heroes of Might and Magic V prior to 1.3 will not be able to install and use H5M files. Prior to version 1.3, players saved Heroes of Might and Magic V mods and custom maps as .PAK files.",
      "NOTE: In some cases, an H5M file may instead contain a Heroes of Might and Magic V mod. Most mods, however, are saved as .H5U files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To use an H5M file with Heroes of Might and Magic V (versions 1.3 and above), place the file in the game's Maps directory. The next time you load Heroes of Might and Magic V, you'll be able to select the map your H5M file contains.",
      "In some cases, you may want to view and/or edit an H5M file's contents. To do so, rename the file to use the .ZIP extension and decompress it as you would any ZIP archive. To repackage your decompressed H5M file's contents, zip them up and rename the resulting ZIP file to use the .h5m extension."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10328&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}