{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/hbk",
  "slug": "hbk",
  "extension": "hbk",
  "name": ".HBK File Extension",
  "type_name": "Mathcad Handbook File",
  "summary": "Learn about .HBK files and view a list of programs that open them.",
  "developer": "Mathsoft",
  "more_information": {
    "description": [
      "File created by Mathcad, engineering calculating software; specifies the order for the indivdual files in the Mathcad electronic book as the reader goes through it; acts very similar to the book binding on a physical book; can be created using any text editor or word processor but must be saved as text-only."
    ]
  },
  "technical_info": {
    "content": [
      "HBK files will be located in the subfolder HANDBOOK, which is contained in the Mathcad Professional folder. If you don't have the HANDBOOK subfolder, create it. This folder will hold your HBK files and your Mathcad worksheets.",
      "To open your electronic book you will go to the same location of your HBK file, in Mathcad choose Open Book from the Help menu, browse for which HBK file you're looking for, click on it, then click \"Open.\"",
      "In order to get the Queuing Theory Handbook from your Queuing Theory CD, it must be installed manually. On your hard drive, in the Mathcad Professional directory, locate or create a Handbook folder. Copy the Queuing folder and queuing.hbk file from the Queuing Theory CD, and paste them into the Mathcad Professional Handbook folder. After moving the file and folder you will be able to access the handbooks from within Mathcad by going to Help, then Open Book, then clicking on the Mathcad Handbook folder, and then choosing the appropriate HBK file.",
      "NOTE: Mathsoft was acquired by Parametric Technology Corporation in 2006."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=8882&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}