{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/hkx",
  "slug": "hkx",
  "extension": "hkx",
  "name": ".HKX File Extension",
  "type_name": "Havok Packed File",
  "summary": "Learn about .HKX files and view a list of programs that open them.",
  "developer": "Havok",
  "more_information": {
    "description": [
      "An HKX file is a compressed XML data file used in Havok Physics engine video games. It contains a character animation, skeleton, or other data used to simulate real-world physics. HKX files are most notably used in The Elder Scrolls V: Skyrim and Fallout 4."
    ]
  },
  "technical_info": {
    "content": [
      "Many video games use the Havok Physics engine to simulate real-world physics and collisions. The engine uses a variety of files to simulate physics, including HKX files. HKX files store character animations, skeletons, and behaviors that are referenced and applied when a character performs an action or collides with another in-game object.",
      "Most gamers will never encounter HKX files, but Skyrim and Fallout 4 players who enjoy modding games sometimes convert, open, and edit HKX files to modify characters' in-game behavior."
    ]
  },
  "how_to_open": {
    "instructions": [
      "The Skyrim and Fallout 4 modding communities have created a variety of third-party tools that allow players to decompress HKX files to their original XML format. These include:",
      "HKXPack",
      "HKXCMD",
      "CONVERT-XML-HKF-KF",
      "After you convert an HKX file to an XML file, you can open and edit the XML file in Autodesk 3ds Max, Blender, or Autodesk Maya. Then, you can convert the XML file back to an HKX file using the tools listed above."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Autodesk 3ds Max",
        "url": "https://fileinfo.com/software/autodesk/3ds_max"
      },
      {
        "name": "Blender",
        "url": "https://fileinfo.com/software/blender/blender"
      },
      {
        "name": "Autodesk Maya",
        "url": "https://fileinfo.com/software/autodesk/maya"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11749&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}