{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/hvl",
  "slug": "hvl",
  "extension": "hvl",
  "name": ".HVL File Extension",
  "type_name": "Hively Tracker Module",
  "summary": "Learn about .HVL files and view a list of programs that open them.",
  "developer": "Peter Gordon",
  "more_information": {
    "description": [
      "An HVL file is an audio module created by Hively Tracker, a music tracker based on the AHX tracker for Amiga computers. It contains binary data used to play synthesized music. When opened in Hively Tracker, an HVL file appears as a set of tracks, notes, and other song data."
    ]
  },
  "technical_info": {
    "content": [
      "Hively Tracker is a music tracker inspired by Abyss' Highest eXperience (AHX), a classic tracker available for Amiga computers. Like AHX, Hively Tracker can import and export audio modules saved in the .AHX format. However, Hively Tracker can also create modules saved in the HVL format, which improves upon the AHX format in several ways (including the ability to contain multichannel audio and use per-channel stereo panning).",
      "NOTE: Hively Tracker is available for Windows, macOS, AmigaOS, and MorphOS."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an HVL file with Hively Tracker. To do so, open Hively Tracker and select Load Mod. Then, navigate to and open your HVL file. To play the song your HVL file contains, select Play Song."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "You can use Hively Tracker to convert HVL files to the .AHX (Abyss' Highest eXperience Module) format. To do so, open your HVL file with Hively Tracker and then select Save AHX."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13386&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/hvl_13386.png",
      "alt": "Screenshot of a .hvl file in Hively Tracker",
      "caption": "HVL file open in Hively Tracker"
    }
  ]
}