{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/hwav",
  "slug": "hwav",
  "extension": "hwav",
  "name": ".HWAV File Extension",
  "type_name": "3hs Music",
  "summary": "Learn about .HWAV files and view a list of programs that open them.",
  "developer": "Erista",
  "more_information": {
    "description": [
      "An HWAV file is an audio file used by 3hs, a homebrew client that allows users to install content from hShop directly onto their 3DS. It contains background music in the Homebrew WAV (HWAV) format, which is based on the Binary CWAV (.BCWAV) format used by the 3DS system. HWAV files support additional tags and metadata in their headers, making them more flexible for custom use in 3hs."
    ]
  },
  "technical_info": {
    "content": [
      "The original Nintendo 3DS hShop was an unofficial content repository popularized in the early 2020s that allowed users to download 3DS games, downloadable content (DLC), updates, and other software. Following the continued decline of official 3DS services, including the shutdown of the Nintendo eShop in March 2023, developers created 3hs as a standalone homebrew application for hacked 3DS systems running custom firmware, allowing users to install content from the new version of hShop. One of its main features is the ability to play background music while browsing the app, enhancing the user experience.",
      "Gamers typically create HWAV files by converting standard .WAV files to HWAV format using 3hs’ official online HWAV generator. However, the included command-line tool, 3hstool, also supports converting other audio formats into HWAV files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open HWAV files with 3hs. To use an HWAV file with 3hs, place it in the following directory on your Nintendo 3DS's SD card (after installing 3hs):",
      "sd:/​3ds/​3hs/​music",
      "Then, launch 3hs, and you can play the file by selecting Music from the app's menu bar."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13392&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}