{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/i3pack",
  "slug": "i3pack",
  "extension": "i3pack",
  "name": ".I3PACK File Extension",
  "type_name": "Point Blank Game Data",
  "summary": "Learn about .I3PACK files and view a list of programs that open them.",
  "developer": "Zepetto",
  "more_information": {
    "description": [
      "An I3PACK file is a game data file used by Zepetto Point Blank, an online first-person shooter. It may contain textures, sounds, 3D models, and other game assets. Point Blank modders have created tools that allow them to extract the assets that I3PACK files contain."
    ]
  },
  "technical_info": {
    "content": [
      "Point Blank, also known as Piercing Blow, is a video game in which players split into a Red and Blue Team and attempt to either complete mission objectives or kill the opposing team. Zepetto released Point Blank in South Korea in 2008 and in North America (as Piercing Blow) in 2010.",
      "Point Blank stores many of its game assets in a set of I3PACK archives. Each I3PACK file typically contains a collection of related game assets. For example, an I3PACK file may contain all the data needed to load a particular in-game weapon, or it may contain a collection of in-game audio files.",
      "While players are not meant to open I3PACK files or modify their contents, some Point Blank enthusiasts have created tools that allow them to extract I3PACK files' contents."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can use i3PackTool (Windows) to view and extract an I3PACK file's contents."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=8168&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}