{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/ibd",
  "slug": "ibd",
  "extension": "ibd",
  "name": ".IBD File Extension",
  "type_name": "MySQL InnoDB Table",
  "summary": "Learn about .IBD files and view a list of programs that open them.",
  "developer": "Oracle",
  "more_information": {
    "description": [
      "An IBD file is a MySQL table created by the InnoDB database engine. It contains a table-specific tablespace and index data. IBD files are created when MySQL's innodb_file_per_table option is enabled, which it is by default."
    ]
  },
  "technical_info": {
    "content": [
      "MySQL is a popular open-source database management system. InnoDB is the default database engine that MySQL uses to create, update, and otherwise manage table-based data. In most instances of MySQL, InnoDB saves users' tables in individual files, which are saved with the .ibd extension.",
      "IBD files are often encrypted, meaning their data can be accessed only using the keys generated when a user created the database that created the IBD file. However, MySQL users can use IBD files to import even encrypted tables into other MySQL databases. When using an IBD file to import a table, you must also import the table's associated .CFG metadata file and, if the table is encrypted, CFP file, which InnoDB creates when you use the FLUSH TABLES FOR EXPORT command."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an IBD file in MySQL (cross-platform) if you are using the InnoDB database engine. For example, you can use a backup IBD file to restore the table it contains if your current copy of the table has become corrupted or been deleted. For more information on how to use a backup IBD file to restore a MySQL table, refer to MySQL's official documentation."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12093&b=1"
      },
      {
        "name": "MySQL",
        "url": "https://fileinfo.com/software/oracle/mysql"
      },
      {
        "name": "MySQL",
        "url": "https://fileinfo.com/software/oracle/mysql"
      },
      {
        "name": "MySQL",
        "url": "https://fileinfo.com/software/oracle/mysql"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}