{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/ics",
  "slug": "ics",
  "extension": "ics",
  "name": ".ICS File Extension",
  "type_name": "Calendar File",
  "summary": "Learn about .ICS files and view a list of programs that open them.",
  "developer": "Internet Engineering Task Force",
  "more_information": {
    "description": [
      "An ICS file is a calendar file saved in a universal calendar format used by several email and calendar programs, including Microsoft Outlook, Google Calendar, and Apple Calendar. It allows users to share calendar information on the web and over email. For example, when users send a meeting request to others, they can share ICS files with them, who can import the meeting's details into their calendars."
    ]
  },
  "technical_info": {
    "content": [
      "In 1998, the Internet Engineering Task Force created the iCalendar, or ICS, file format. ICS files are plain text files that contain information about a calendar event, including the event's:",
      "Title",
      "Summary and description",
      "Start and end times",
      "Location",
      "Alert trigger",
      "The ICS format is a universal calendar file format that all popular calendar applications, including Microsoft Outlook, Apple Calendar, Google Calendar, and Mozilla Thunderbird Lightning Calendar, create and recognize. Because all popular calendar applications can use ICS files to add event details to a calendar, ICS files are the most common type of files used to exchange calendar information. Most commonly, office workers and other professionals use ICS files to send each other meeting requests. You may also receive ICS reminders for an upcoming birthday, holiday, trip, party, or other events."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an ICS file with various applications. For example, if you have a calendar application, such as Microsoft Outlook, Google Calendar, or Apple Calendar, installed on your device, you can double-click an ICS file to import the event details the file contains into your calendar.",
      "If necessary, you can also manually import an ICS file into your calendar app. For example, to import an event into the web version of Google Calendar:",
      "Click the Gear icon that appears in the program's upper right-hand side.",
      "Select Settings → Import & export.",
      "Select Import and import your ICS file. The event(s) it contains will be added to your calendar.",
      "If you are having trouble importing your ICS file into a calendar application, you can open the file in any text editor, such as Microsoft Notepad (Windows) or Apple TextEdit (Mac), to view the event information it contains. For example, you can see the event's start and end times (including time zone) listed in the file's DTSTART and DTEND lines. While opening an ICS file with a text editor is not the best way to view an event's details, it does allow you to view the information without a calendar application."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "You can convert an ICS file to a CSV file with a free online ICS to CSV converter, such as Indigoblue Free ICS to CSV Converter or ProjectWizards ICS to CSV Converter.",
      "By converting an ICS file to a CSV file, you can import a calendar event into Microsoft Excel or another spreadsheet program."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Microsoft Excel",
        "url": "https://fileinfo.com/software/microsoft/excel"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=629&b=1"
      },
      {
        "name": "Microsoft Outlook 365",
        "url": "https://fileinfo.com/software/microsoft/outlook"
      },
      {
        "name": "Microsoft Windows Media Player with Sony Player Plug-in",
        "url": "https://fileinfo.com/software/microsoft/windows_media_player"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/ics_629.png",
      "alt": "Screenshot of a .ics file in Apple Calendar",
      "caption": "ICS file open in Apple Calendar"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/ics_3032.png",
      "alt": "Screenshot of a .ics file in IronCAD 2022",
      "caption": "ICS file open in IronCAD 2022"
    }
  ]
}