{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/id3tag",
  "slug": "id3tag",
  "extension": "id3tag",
  "name": ".ID3TAG File Extension",
  "type_name": "MP3 Skype Recorder Temporary File",
  "summary": "Learn about .ID3TAG files and view a list of programs that open them.",
  "developer": "Alexander Nikiforov",
  "more_information": {
    "description": [
      "An ID3TAG file is a temporary file created by MP3 Skype Recorder, a free program used to record Skype conversations. It contains metadata about a recorded conversation that is deleted once the recording is finished."
    ]
  },
  "technical_info": {
    "content": [
      "The MP3 Skype Recorder program is used to automatically record and store Skype conversations in Windows. When the recording is finished the conversation is stored in an .MP3 file. However, if your computer freezes or MP3 Skype Recorder has a bug or quits unexpectedly during the recording, the MP3 file is not created. This occurrence leaves the user with only the ID3TAG file. Since the file does not contain any audio, it is not useful to user and cannot be used to recover the conversation.",
      "Most of the instances where the ID3TAG file was created occurred with MP3 Skype Recorder version 4.18 earlier. The bug was claimed by the developer to be fixed with the release of version 4.19.",
      "NOTE: The ID3TAG file is created by MP3 Skype Recorder but cannot be opened by the program."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10437&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}