{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/ilg",
  "slug": "ilg",
  "extension": "ilg",
  "name": ".ILG File Extension",
  "type_name": "InstallScript Log File",
  "summary": "Learn about .ILG files and view a list of programs that open them.",
  "developer": "Flexera",
  "more_information": {
    "description": [
      "An ILG file is a log file created by an InstallScript or InstallScript MSI installation. It contains a recording of the procedures your installation performed, which allows you to analyze the performance of your installation. ILG files can be viewed by the Log File Viewer and InstallShield Cabinet tools included with the InstallShield application."
    ]
  },
  "technical_info": {
    "content": [
      "InstallScript and InstallScript MSI installations are created using Flexera InstallShield to install software. InstallShield is a program that specializes in the design of customized software installers. When the InstallScript or InstallScript MSI installation is run on a user's computer, an ILG file is automatically created to record and store the procedure.",
      "Procedures recorded in an ILG file are typically one of the following:",
      "Locations and values of the registry keys of an installed product.",
      "Changes made to the system's file structure.",
      "Information about files added to your InstallShield project.",
      "General information about the product being installed.",
      "NOTE: ILG files can only be created when logging is enabled."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10537&b=1"
      },
      {
        "name": "Flexera InstallShield",
        "url": "https://fileinfo.com/software/flexera/installshield"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}