{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/infinitemacdisk",
  "slug": "infinitemacdisk",
  "extension": "infinitemacdisk",
  "name": ".INFINITEMACDISK File Extension",
  "type_name": "Infinite Mac Disk Image",
  "summary": "Learn about .INFINITEMACDISK files and view a list of programs that open them.",
  "developer": "Mihai Parparita",
  "more_information": {
    "description": [
      "An INFINITEMACDISK file is a disk image created by Infinite Mac, an online Classic Mac OS emulator. It is an exported copy of an Infinite Mac user's Saved HD virtual drive. Users can create and open INFINITEMACDISK files with versions 2.1 and above of Infinite Mac."
    ]
  },
  "technical_info": {
    "content": [
      "Using Infinite Mac, users can run Classic Mac OS within an online virtual machine. In versions 2.1 and above of Infinite Mac (which run versions 2.1 and above of Classic Mac OS), users can import and/or store files in Infinite Mac's Saved HD drive. This drive is saved to the local storage of the user's web browser, allowing the user to access the drive (and the files it contains) across Infinite Mac instances.",
      "If a user wants to back up the contents of their Saved HD drive, they can do so by selecting Settings → Export.... This saves the current contents of the user's Saved HD drive in an INFINTEMACDISK file. If necessary, the user can import this file into an Infinite Mac instance to access the files it contains."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an INFINITEMACDISK file with versions 2.1 and above of Infinite Mac. To do so:",
      "Open version 2.1 or above of Infinite Mac in your web browser.",
      "Select Settings → Import....",
      "Navigate to and import your INFINITEMACDISK file.",
      "At this point, Infinite Mac will restart and load the disk image your INFINTEMACDISK file contains as its new Saved HD drive."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13598&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/infinitemacdisk_13598.png",
      "alt": "Screenshot of a .infinitemacdisk file in Infinite Mac",
      "caption": "INFINITEMACDISK file open in Infinite Mac"
    }
  ]
}