{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/ing",
  "slug": "ing",
  "extension": "ing",
  "name": ".ING File Extension",
  "type_name": "MasterCook Ingredients File",
  "summary": "Learn about .ING files and view a list of programs that open them.",
  "developer": "ValuSoft",
  "more_information": {
    "description": [
      "An ING file contains a list of ingredients for ValuSoft MasterCook, an app that organizes cookbooks, meal calendars, shopping lists, and more. It stores detailed information about ingredients, such as names, quantities, and nutritional data, which users can reference in the app when creating or organizing recipes. MasterCook uses ING files to manage ingredient lists and ensure consistency across recipes within the program."
    ]
  },
  "technical_info": {
    "content": [
      "Sierra On-Line initially developed MasterCook in the early 1990s, and then ValuSoft acquired the software in 2002. It quickly gained popularity among culinary enthusiasts for creating, organizing, and sharing recipes. It also offers meal planning, shopping lists, and nutritional analysis tools.",
      "The program uses various types of files to store your information. For example, MasterCook saves cookbooks as .MC2 files, shopping lists as SL files, cooking tips as .MTF files, and ingredients as ING files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open ING files with ValuSoft MasterCook in Windows."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1584&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}