{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/insp",
  "slug": "insp",
  "extension": "insp",
  "name": ".INSP File Extension",
  "type_name": "Insta360 Panoramic Image",
  "summary": "Learn about .INSP files and view a list of programs that open them.",
  "developer": "Insta360",
  "more_information": {
    "description": [
      "An INSP file is a panoramic image captured by an Insta360 camera, which is used to record 360-degree video and images. It stores an image saved in the proprietary INSP 360 format. INSP files are typically used by adventurous photographers and extreme sports enthusiasts."
    ]
  },
  "technical_info": {
    "content": [
      "You can open an INSP image captured by an Insta360 camera using Insta360 software. Insta360 Studio can be used in Windows or macOS to view and edit images captured by the ONE, Nano, Nano S, and Air cameras. If the image is captured with the ONE X or EVO, Insta360 Studio 2019 can be used in Windows or macOS to view and edit the images. The Insta360 Player for Android and iOS devices can also be used to view or edit INSP images.",
      "You can export INSP images to the JPEG format using Insta360 Studio. This feature allows you to convert your images to a more widely supported format.",
      "NOTE: There are several models of Insta360 cameras, including ONE, ONE X, EVO, Nano, Nano S, Air, and Titan. Video captured by these cameras is saved as an .INSV file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11254&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}