{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/insv",
  "slug": "insv",
  "extension": "insv",
  "name": ".INSV File Extension",
  "type_name": "Insta360 Panoramic Video",
  "summary": "Learn about .INSV files and view a list of programs that open them.",
  "developer": "Insta360",
  "more_information": {
    "description": [
      "An INSV file contains panoramic video saved in the Insta360 INSV format. It stores video captured by an Insta360 camera, which is used to record 360-degree video and images. INSV files are typically used by videographers and extreme sports enthusiasts."
    ]
  },
  "technical_info": {
    "content": [
      "You can open an INSV file captured by an Insta360 camera using Insta360 software. Insta360 Studio can be used in Windows or macOS to play and edit video captured by the ONE, Nano, Nano S, and Air cameras. If the video is captured with the ONE X or EVO, Insta360 Studio 2019 can be used in Windows or macOS to play or edit the video. The Insta360 Player for Android and iOS devices can also be used to play INSV video.",
      "INSV files can be exported to the more widely supported .MP4 video format using Insta360 Studio. If you are unable to access Insta360 Studio, you may also rename the .insv file extension to .mp4 and open it as an MP4 file.",
      "NOTE: There are several models of Insta360 cameras, including ONE, ONE X, EVO, Nano, Nano S, Air, and Titan. Images captured by these cameras are saved as .INSP files."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11255&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}