{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/iqe",
  "slug": "iqe",
  "extension": "iqe",
  "name": ".IQE File Extension",
  "type_name": "Inter-Quake Export Model",
  "summary": "Learn about .IQE files and view a list of programs that open them.",
  "developer": "Lee Salzman",
  "more_information": {
    "description": [
      "An IQE file is a 3D model saved in the Inter-Quake Export format, a text-based format designed to work alongside the binary Inter-Quake Model (.IQM) format in game engines that support the Inter-Quake Model system. It contains information about the structure of a model, such as meshes, bones, and animations. Because of their readability, game developers and modders often use IQE files as an intermediate step for creating or editing models before converting them into the faster, more compact IQM format for use in games."
    ]
  },
  "technical_info": {
    "content": [
      "Developers can create or edit models in 3D modeling software, such as Blender, and then export them to the IQE format using available plugins or scripts, where they can analyze details like meshes, bones, and animations. Once finalized, various IQM development tools can convert the IQE file into an IQM file, which game engines such as Cube 2: Sauerbraten, Red Eclipse, and Tesseract can load for real-time rendering.",
      "The IQM and IQE formats are closely related file types used for 3D models in video games. IQE is a text-based exchange format designed for editing and exporting models, while IQM is a binary runtime format optimized for loading models quickly in game engines."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open IQE files with Blender, via community-developed import/export plugins explicitly created for the Inter-Quake Model system. Since IQE files contain plain text, you can also open them with text editors, such as Microsoft Notepad and Apple TextEdit. However, opening IQE files with a text editor will not appear the same as opening them with a modeling tool."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "IQM Development Kit, a command-line utility, can compile IQE files into IQM files."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Blender",
        "url": "https://fileinfo.com/software/blender/blender"
      },
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13867&b=1"
      },
      {
        "name": "Blender with IQE plugin",
        "url": "https://fileinfo.com/software/blender/blender"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}