{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/jad",
  "slug": "jad",
  "extension": "jad",
  "name": ".JAD File Extension",
  "type_name": "Java Application Descriptor File",
  "summary": "Learn about .JAD files and view a list of programs that open them.",
  "developer": "Oracle",
  "more_information": {
    "description": [
      "A JAD file contains information about a MIDlet, which is a type of Java program developed for the Java ME (Micro Edition) virtual machine. It stores text attributes that describe the contents and capabilities of the MIDlet and may also include DRM protection information. JAD files are commonly used to package Java games and applications developed for cell phones."
    ]
  },
  "technical_info": {
    "content": [
      "JAD files are created by Java developers with the Java ME Software Development Kit SDK when they build and package a project into a MIDlet. The Java ME app consists of a JAD file and a .JAR (Java Archive) file, which stores compiled classes and resources that make up the application.",
      "A JAD file consists of mandatory and optional attributes that may be general JAD attributes, user-defined attributes, or custom carrier/manufacturer attributes. Examples of mandatory attributes include the MIDlet name, version, JAR URL, and edition configuration. Optional attributes include a MIDlet icon, description, and data size."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=2442&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}