{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/jam",
  "slug": "jam",
  "extension": "jam",
  "name": ".JAM File Extension",
  "type_name": "Jam STAPL File",
  "summary": "Learn about .JAM files and view a list of programs that open them.",
  "developer": "Altera",
  "more_information": {
    "description": [
      "A JAM file is a CAD file created in the Jam Standard Test and Programming Language (STAPL) format, a standard file format used for programming PLDs (Programmable Logic Devices). It includes the data and algorithm needed to program a PLD. JAM files enable vendor-specific programming requirements to be communicated to PLD programmers in a recognized format."
    ]
  },
  "technical_info": {
    "content": [
      "JAM files are typically generated by a vendor-specific software program, referred to as the \"Jam Composer.\" PLD vendors then distribute JAM files to customers (device programmers), who program and test a PLD using the \"Jam Player.\" The Jam Player reads the JAM file and provides the facilities needed to program the device in a standard JTAG (Joint Test Action Group) chain. This process used to be carried out using separate command-line tools provided by Altera, but it is now encapsulated in Altera's Quartus design software.",
      "NOTE: JAM files are stored in an ASCII text format. They can be compiled into .JBC byte-code files for a binary representation."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=6598&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/jam_13620.jpg",
      "alt": "Screenshot of a .jam file in Figma Desktop App 116",
      "caption": "JAM file open in Figma Desktop App 116"
    }
  ]
}