{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/jfproj",
  "slug": "jfproj",
  "extension": "jfproj",
  "name": ".JFPROJ File Extension",
  "type_name": "JSON Font Project File",
  "summary": "Learn about .JFPROJ files and view a list of programs that open them.",
  "developer": "Microsoft",
  "more_information": {
    "description": [
      "A JFPROJ file is a font project created by Microsoft Font Maker, a font authoring program for Windows. It contains a font based on the penmanship of a user recorded from a connected electronic pen device. JFPROJ files include the glyphs that make up the alphabet and other symbols, several sentences written by the user, and information about the space between characters and words and the size of the font."
    ]
  },
  "technical_info": {
    "content": [
      "You will only encounter a JFPROJ file if you use Microsoft Font Maker for creating fonts. When you save a font, Microsoft Font Maker creates the JFPROJ file to store the information about the font. You can close and re-open the JFPROJ file at a later time to edit it.",
      "To create and save a JFPROJ file with Microsoft Font Maker, click the \"Save\" icon in the upper-right corner of the program. To open a JFPROJ file with Microsoft Font Maker, click the \"Open\" icon in the upper-right corner of the program. When you are done editing a font with Microsoft Font Maker, you can export it as a .TTF file, which can be installed in Windows or macOS and used as a font in various programs, such as Microsoft Word and Adobe Photoshop.",
      "NOTE: JFPROJ files store project information in JSON format."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11517&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}