{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/jlr",
  "slug": "jlr",
  "extension": "jlr",
  "name": ".JLR File Extension",
  "type_name": "Juliar Source Code File",
  "summary": "Learn about .JLR files and view a list of programs that open them.",
  "developer": "Juliar",
  "more_information": {
    "description": [
      "A JLR file is a file written in Juliar, which is a programming language designed for cross-platform rapid prototyping. It contains Juliar source code that can be interpreted by Juliar.jar or compiled to .JAR files or JLRLIB files, which are compiled versions of Juliar library files."
    ]
  },
  "technical_info": {
    "content": [
      "You can use the Juliar application to interpret JLR files and edit or re-run the code. However, Java Virtual Machine (JVM) must also be installed on your device.",
      "The following example is the simple syntax of Juliar that would print out \"Hello World\":",
      "function main() = { printLine(\"Hello World\"); }",
      "The primary purpose of the Juliar programming language is to allow developers to quickly code on any platform, which includes Windows, macOS, Linux, iOS, Android, and Windows Phone. Juliar runs on top of JVM and can be either interpreted or compiled into JVM intermediate bytecode. If it is compiled, Juliar produces a JAR file which can run on any platform that has JVM installed simply by double-clicking it. If Juliar is interpreted, then Juliar.jar and JVM are required to run the application.",
      "NOTE: Juliar programming language was changed to Juka programming language in 2019. Instead of JLR files, .JUK files are used to store source code."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10857&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}