{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/jmc",
  "slug": "jmc",
  "extension": "jmc",
  "name": ".JMC File Extension",
  "type_name": "JM-Crypt Encrypted File",
  "summary": "Learn about .JMC files and view a list of programs that open them.",
  "developer": "JM-Crypt Security",
  "more_information": {
    "description": [
      "File encrypted by the JM-Crypt encryption algorithm; stores a file protected by a hybrid encryption algorithm and password."
    ]
  },
  "technical_info": {
    "content": [
      "The JMC file is commonly used to encrypt confidential personal files, as well as sensitive business files, when sharing them with other users. JM-Crypt also uses the \".jmcx\", \".jmck\", \".jmcp\", \".jmcr\", and \".jmce\" file extensions for encrypting files.",
      "The JM-Crypt algorithm uses the one-time pad (OTP) encryption method and twice encrypts the file. The first encryption is with a random extract of a long random key generated by JM-Crypt Security's homemade fast Fourier transform (FFT) key generator. The second encryption includes password protection that depends on the method selected by the user, which may be fully automatic, semi-automatic (project mode), or manual (a password created by the user and featured in the JMC file), and includes password protection.",
      "NOTE: In order to decrypt the JMC file, you need the JM-Crypt software and algorithm that were used to originally encrypt the file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10205&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}