{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/jvs",
  "slug": "jvs",
  "extension": "jvs",
  "name": ".JVS File Extension",
  "type_name": "JavaScript Proxy Autoconfig File",
  "summary": "Learn about .JVS files and view a list of programs that open them.",
  "developer": "Netscape Communications",
  "more_information": {
    "description": [
      "A JVS file is a JavaScript-based configuration file used by web browsers to automatically determine whether to use a proxy server when connecting to specific websites. It contains a function called FindProxyForURL(), which evaluates the requested URL and decides whether the browser should route the request through a proxy server or connect directly. JVS files help organizations manage and control Internet access without requiring users to configure proxy settings manually."
    ]
  },
  "technical_info": {
    "content": [
      "Network administrators often distribute JVS files, which browser or system network settings then reference. JVS files serve the same purpose as .PAC (Proxy Auto-Config) files, though they are less commonly used.",
      "Whether a file is saved as JVS or PAC depends on the system or software generating it. JVS and PAC files have the same structure and function despite the different extensions, relying on JavaScript logic to guide how browsers handle network requests.",
      "NOTE: Netscape Communications introduced the JavaScript Proxy Auto-Config format in the mid-1990s. Then, other vendors, such as Microsoft and Apple, adopted and extended it as proxy management became an essential part of enterprise network configuration."
    ]
  },
  "how_to_open": {
    "instructions": [
      "JVS files are not meant to be opened by a user. Instead, browsers or systems configured to use the JVS files interpret them.",
      "However, since JVS files store JavaScript, you can open them with a text or source code editor. Some options include Microsoft Notepad (Windows), Apple TextEdit (macOS), and Microsoft Visual Studio Code (multiplatform)."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Microsoft Visual Studio Code",
        "url": "https://fileinfo.com/software/microsoft/visual_studio_code"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=666&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}