{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/kb2",
  "slug": "kb2",
  "extension": "kb2",
  "name": ".KB2 File Extension",
  "type_name": "Kleo Backup File",
  "summary": "Learn about .KB2 files and view a list of programs that open them.",
  "developer": "Carroll-Net",
  "more_information": {
    "description": [
      "Backup archive created by Kleo Bare Metal Backup for Servers, a program used to backup and clone computer files; can store the entire computer's file system, including operating system, device driver, and application files; used to clone or backup and restore all files on a hard drive."
    ]
  },
  "technical_info": {
    "content": [
      "KB2 backups are file system aware, meaning that they retain the native file system structure for the computer's disk partitions. To save space, Kleo backups do not store unused blocks or empty disk space, and are compressed with Gzip compression. However, even with these space optimizations, they still may be very large in size depending on the amount of data to backup.",
      "Kleo is an application that does not run within a standard operating system, such as Mac OS X or Windows. Instead, Kleo runs from a bootable system disc. Instead of loading the computer's operating system, it loads itself during the computer's boot process.",
      "Kleo is compatible with Intel-based computers and supports a wide variety of Mac, Windows, and Linux file system types, including NTFS, FAT32, UFS, and HFS.",
      "NOTE: Kleo does not support the Ubuntu Ext4 file system type."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=4925&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}