{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/keyboard",
  "slug": "keyboard",
  "extension": "keyboard",
  "name": ".KEYBOARD File Extension",
  "type_name": "Make Your Own Keyboard File",
  "summary": "Learn about .KEYBOARD files and view a list of programs that open them.",
  "developer": "Jack Goossen",
  "more_information": {
    "description": [
      "A KEYBOARD file contains a keyboard layout created by Make Your Own Keyboard, an iPadOS and iOS app for designing on-screen keyboards. It stores plain text information about the keyboard, including the layout of characters, values for each character, and modifier keys."
    ]
  },
  "technical_info": {
    "content": [
      "Make Your Own Keyboard comes with various pre-made keyboard layouts you can modify or you can create custom layouts from scratch. This capability is helpful when you want to add support for an obscure language or dialect. You can also create keyboard layouts for historical or fictitious languages.",
      "To create a KEYBOARD file with Make Your Own Keyboard, tap and hold the keyboard you want to export from the \"Keyboards\" screen and select Export. You can then choose the export location for the file."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open KEYBOARD files with Make Your Own Keyboard on an iPhone or iPad.",
      "Since the files store plain text information, you can also open them with a text editor, such as Apple TextEdit (macOS) or Microsoft Notepad (Windows). However, opening them with a text editor will not appear the same as opening them with Make Your Own Keyboard."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13776&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/keyboard_13776.png",
      "alt": "Screenshot of a .keyboard file in Make Your Own Keyboard 1",
      "caption": "KEYBOARD file open in Make Your Own Keyboard 1"
    }
  ]
}