{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/kkk",
  "slug": "kkk",
  "extension": "kkk",
  "name": ".KKK File Extension",
  "type_name": "KKK Ransomware Encrypted File",
  "summary": "Learn about .KKK files and view a list of programs that open them.",
  "developer": "N/A",
  "more_information": {
    "description": [
      "A KKK file is a file encrypted by the KKK Virus, a trojan horse utilized by cybercriminals. It contains a user's file, such as a .WMV or .XLSX file, encrypted with the RSA algorithm and AES-128 ciphers. KKK files became prevalent in June 2017."
    ]
  },
  "technical_info": {
    "content": [
      "The KKK Virus is highly dangerous malware and is commonly referred to as ransomware. The purpose of the virus is to take your files hostage and force you to pay the perpetrator to unlock your files. The virus is a trojan horse that may be disguised as an Adobe Flash Player or java update or as an email message attachment. Once the virus affects your computer it begins scrambling your files, renaming them, and encrypting them. The virus then generates a ransom note informing you of the takeover and what you are meant to do to recover your files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "No known program can restore KKK files to their original state. The best way to recover your files is to retrieve them from a recent backup or perform a System Restore to a point before your computer was infected."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11106&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}