{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/kl",
  "slug": "kl",
  "extension": "kl",
  "name": ".KL File Extension",
  "type_name": "Android Key Layout File",
  "summary": "Learn about .KL files and view a list of programs that open them.",
  "developer": "Google",
  "more_information": {
    "description": [
      "A KL file is a key layout map that connects keyboard input on an Android device to actions in Android. It stores key definitions in UTF-8 text, which include the SCANCODE (the key number preceded by key), KEYCODE (the action the key is mapped to), and FLAGS (additional functionality associated with the key, like waking the device). KL files also include comments denoted by the pound character (#)"
    ]
  },
  "technical_info": {
    "content": [
      "Android devices come with KL files pre-installed in the following directories:",
      "/​system/​usr/​keylayout",
      "/​data/​usr/​keylayout",
      "These directories store several KL files, including the Generic.kl file, that Android references for specific input devices. For example, the device keyboard may use one KL file, while a connected joystick uses a separate KL file."
    ]
  },
  "how_to_open": {
    "instructions": [
      "KL files are not meant to be opened. Instead, the Google Android operating system references the file to correctly map input gathered from a device to actions in Android.",
      "However, if you are looking to modify the key layout map, you can open KL files with a text editor. After modifying the KL file, you must place it back in the directory in which you found it for it to take effect."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12597&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/kl_12597.png",
      "alt": "Screenshot of a .kl file in Microsoft Visual Studio Code 1.62",
      "caption": "KL file open in Microsoft Visual Studio Code 1.62"
    }
  ]
}