{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/kmp",
  "slug": "kmp",
  "extension": "kmp",
  "name": ".KMP File Extension",
  "type_name": "Mario Kart Wii Course Description File",
  "summary": "Learn about .KMP files and view a list of programs that open them.",
  "developer": "Nintendo",
  "more_information": {
    "description": [
      "A KMP file is a course description file used by Mario Kart Wii, a racing game developed by Nintendo for the Wii console. It contains structured data that defines how a race track functions in the game, helping control player positions, object behavior, and in-game events. Each KMP file works in conjunction with the track's visual and collision data to create a complete, playable course."
    ]
  },
  "technical_info": {
    "content": [
      "Nintendo originally created KMP files for use in the official Mario Kart Wii tracks; however, fans and modders also utilize them when designing custom courses. The KMP format is divided into multiple sections, with each section describing a specific aspect of the course.",
      "The sections include racer start points, checkpoints, camera placements, respawn locations, and object positions such as item boxes or obstacles. Together, these elements determine how the game engine interprets the layout and interactive features of the track during gameplay.",
      "NOTE: To create the KMP file in the KMP Modifier, select File → New, make your edits, and select File → Save or Save As"
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open KMP files with KMP Modifier in Windows by selecting File → Open. You can also open and edit KMP files with KMP Cloud, KMP Editor, and the KMP3D plugin for Google SketchUp. The wkmpt tool included with Wiimms SZS Tools can also be used to modify, export, and create KMP files."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=9225&b=1"
      },
      {
        "name": "FMJ-Software Awave Studio",
        "url": "https://fileinfo.com/software/fmj-software/awave_studio"
      },
      {
        "name": "FMJ-Software Awave Studio",
        "url": "https://fileinfo.com/software/fmj-software/awave_studio"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}