{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/kps",
  "slug": "kps",
  "extension": "kps",
  "name": ".KPS File Extension",
  "type_name": "Keyman Developer Package Source File",
  "summary": "Learn about .KPS files and view a list of programs that open them.",
  "developer": "Tavultesoft",
  "more_information": {
    "description": [
      "A KPS file contains package information and is created by Keyman Developer, a program used to create, edit, and distribute digital keyboards. It stores information that specifies which files should be included in the package when compiled into a KMP Keyman package file."
    ]
  },
  "technical_info": {
    "content": [
      "After you create a keyboard in Keyman Developer you can package it to make it easier for other users to install. The package may include one or more keyboards, a welcome page, fonts, shortcuts, and documentation, which are stored in the KMX, KVK, .TTF, and .HTML files. The KPS file is used to describe which of these files should be included in the package when compiling it into the KMP file.",
      "You will most likely only come across a KPS file if you have Keyman Developer installed on your computer. The file is created using the Package Editor that comes with Keyman Developer. You can open it by selecting File → Open and selecting the KPS file type."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10573&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}