{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/lg2",
  "slug": "lg2",
  "extension": "lg2",
  "name": ".LG2 File Extension",
  "type_name": "Message Queuing Message State File",
  "summary": "Learn about .LG2 files and view a list of programs that open them.",
  "developer": "MIcrosoft",
  "more_information": {
    "description": [
      "An LG2 file is a log file created by Microsoft Message Queuing (MSMQ), a technology implemented in Windows for asynchronous communication between applications across different networks. It contains information about the state of a Queueing Message log (QMLog) .MQ file that is currently being written to by MSMQ. LG2 files temporarily store message information, along with .LG1 files, in case the MQ file becomes corrupt during the writing process."
    ]
  },
  "technical_info": {
    "content": [
      "MSMQ allows applications that are running across separate networks and at different times to communicate with each other. When an application sends a message to an application on another network that is currently offline, the message is placed in a queue. When the receiving application becomes accessible, the message(s) stored in the queue is sent.",
      "The messages communicated between applications are saved in MQ files. These files may contain messages from a single queue or from multiple queues and may grow up to 4 MB in size. Once they reach 4 MB, another MQ file is generated. Since messages may occur over a long span of time, information is written to LG1 and LG2 files to log the state of the MQ file in case anything happens to it.",
      "You will most likely only encounter an MSMQ LG2 file if you are a developer of a system that utilizes MSMQ and are exploring the MSMQ\\​Storage folder. This folder also contains one or more MQ files for which the LG1 and LG2 files were created to store logs.",
      "NOTE: The MSMQ messaging protocol was developed by Microsoft and introduced in Windows NT 4 and Windows 95."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11472&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}