{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/lic",
  "slug": "lic",
  "extension": "lic",
  "name": ".LIC File Extension",
  "type_name": "Software License File",
  "summary": "Learn about .LIC files and view a list of programs that open them.",
  "developer": "N/A",
  "more_information": {
    "description": [
      "A LIC file is a license file commonly used with shareware programs, commercial applications, and networks. It contains registration information for various software applications as well as server configuration information for networks."
    ]
  },
  "technical_info": {
    "content": [
      "LIC files are commonly distributed from the software vendor to the user after the user purchases the software product. Generally, the files must be installed or available locally for the registered program to run with a valid license. Consult the program-specific registration instructions to install the license properly.",
      "Example programs/technologies that use LIC files include VMware, Citrix License Servers, AutoCAD, Alfresco, Aspose.Cells, Microsoft ActiveX, and Microsoft Visual Studio (sometimes included with software deployment builds).",
      "LIC files are also used by Autodesk for configuring a network with the Network License Manager (NLM) program. In order to request and validate a network license file, you must collect license server information, request a license file, copy the license file to a server, and confirm the accuracy of the license file. When you receive the LIC file you must save it on your license server. You can rename the LIC file since it comes with a long name once downloaded but you cannot alter the \".lic\" extension.",
      "NOTE: The VMware license file (vmware.lic) for Windows is located in the C:\\​Program Files\\​VMware\\​VMware License Server\\​ directory."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=442&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/lic_12903.png",
      "alt": "Screenshot of a .lic file in Lic",
      "caption": "LIC file open in Lic"
    }
  ]
}