{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/lightkeyproj",
  "slug": "lightkeyproj",
  "extension": "lightkeyproj",
  "name": ".LIGHTKEYPROJ File Extension",
  "type_name": "Lightkey Project",
  "summary": "Learn about .LIGHTKEYPROJ files and view a list of programs that open them.",
  "developer": "Monospace",
  "more_information": {
    "description": [
      "A LIGHTKEYPROJ file contains a project created by Lightkey, a professional program used to configure and control DMX-compatible lighting fixtures for various types of venues. It stores project information, which includes light fixtures and light shows configured for a lighting display. LIGHTKEYPROJ files are working files, which means they can be modified, saved, closed, then reopened for further editing."
    ]
  },
  "technical_info": {
    "content": [
      "Lightkey projects are commonly created, edited, and saved by Lightkey users. Users may create multiple projects for different lighting installations but typically only use one since the project can store any number of light shows for a lighting installation.",
      "In a Lightkey project, you can modify the lighting installation layout, add connected light fixtures, and set lighting presets, cues, and sequences. You can also preview the various light shows saved in the project file.",
      "To open a LIGHTKEYPROJ file in Lightkey, select File → Open... or Open Recent. To create a LIGHTKEYPROJ file in Lightkey, select File → New Project, modify the project, then select File → Save."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11397&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/lightkeyproj_11397.jpg",
      "alt": "Screenshot of a .lightkeyproj file in Monospace Lightkey 3",
      "caption": "LIGHTKEYPROJ file open in Monospace Lightkey 3"
    }
  ]
}