{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/lilith",
  "slug": "lilith",
  "extension": "lilith",
  "name": ".LILITH File Extension",
  "type_name": "Lilith Ransomware Encrypted File",
  "summary": "Learn about .LILITH files and view a list of programs that open them.",
  "developer": "N/A",
  "more_information": {
    "description": [
      "A file with the .lilith extension has been maliciously encrypted by Lilith ransomware. It contains a document, image, or other file the ransomware is holding hostage. Because the file is encrypted, you cannot open it."
    ]
  },
  "technical_info": {
    "content": [
      "Lilith ransomware is a form of malware that attempts to steal a user's data and encrypt their files. The ransomware begins its attack by terminating several common Windows application processes. It then produces a ransom note named *Restore_Your_Files.txt in every folder that will contain an encrypted file. Finally, it encrypts most of a user's files and appends them with the .lilith extension.",
      "*Restore_Your_Files.txt contains instructions a user can supposedly follow to decrypt their files. The note also warns that, if the user does not pay the ransom, the ransomware distributors will leak their data.",
      "Ransomware is most commonly distributed in email attachments and programs that appear to be legitimate but are actually adware and malware bundles. If you recently downloaded and opened an unverified attachment or program, that may be how your computer became infected by Lilith ransomware."
    ]
  },
  "how_to_open": {
    "instructions": [
      "At this time, there is no way to decrypt and open LILITH files. The best way to restore encrypted files is to retrieve them from a recent backup or perform a System Restore."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12793&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}