{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/lmc",
  "slug": "lmc",
  "extension": "lmc",
  "name": ".LMC File Extension",
  "type_name": "Mobility Client Configuration File",
  "summary": "Learn about .LMC files and view a list of programs that open them.",
  "developer": "IBM",
  "more_information": {
    "description": [
      "An LMC file contains configuration settings used by Mobility Client, a component of IBM Mobile Connect used to establish virtual private network connections (VPNs). It stores a configuration that controls how a Mobility Client connects to a network. LMC files may consist of platform-independent settings or a complete configuration."
    ]
  },
  "technical_info": {
    "content": [
      "LMC files are only used internally to store the configuration for Mobility Client. To export the configuration, click a connection in the \"Connections\" window in Mobility Client and select Tools → Export Configuration, and choose the type of configuration. Mobility Client creates the LMC file to save the configuration. To import an LMC file, click a connection in the \"Connections\" window in Mobility Client and select Tools → Import Configuration, and browse for the LMC file.",
      "IBM Mobile Connect allows users to securely access enterprise data and applications from anywhere. Mobility Client is a component of IBM Mobile Connect that is used to create VPN connections across wireless and wireline networks."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10641&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}