{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/loadtest",
  "slug": "loadtest",
  "extension": "loadtest",
  "name": ".LOADTEST File Extension",
  "type_name": "Visual Studio Load Test File",
  "summary": "Learn about .LOADTEST files and view a list of programs that open them.",
  "developer": "Microsoft",
  "more_information": {
    "description": [
      "A LOADTEST file contains a load test used by Visual Studio, a software development tool for Windows programs and web applications. It stores one or more web tests that are used for simulating many users accessing a server at the same time. LOADTEST files also include properties, such as browser targets, load patterns, and user profiles."
    ]
  },
  "technical_info": {
    "content": [
      "Load tests are used by Visual Studio for various types of testing. They may be used to test the responsiveness of an application, how an application performs at different capacities, how an application performs under light loads for minimal durations, or if an application runs successfully under a heavy load for a long duration.",
      "You can create LOADTEST files with the Load Test Wizard and edit its properties with the Load Test Editor. You can also view load tests when they run using the Load Test Monitor and completed test runs using the Load Test Analyzer.",
      "Visual Studio uses different file extensions for a variety of file types. Some of the different test file extensions include LOADTEST, .GENERICTEST, and .WEBTEST."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10657&b=1"
      },
      {
        "name": "Microsoft Visual Studio 2022",
        "url": "https://fileinfo.com/software/microsoft/visual_studio"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}