{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/lockmypix",
  "slug": "lockmypix",
  "extension": "lockmypix",
  "name": ".LOCKMYPIX File Extension",
  "type_name": "LockMyPix Vault",
  "summary": "Learn about .LOCKMYPIX files and view a list of programs that open them.",
  "developer": "fourchars",
  "more_information": {
    "description": [
      "A LOCKMYPIX file is an encrypted vault created by fourchars LockMyPix, a mobile app used to protect private photos, videos, and documents. It contains users’ sensitive content that they have added to the app. LOCKMYPIX files are similar to folders, acting as a single, secure unit that contains content inaccessible without the correct password or authentication method, such as face recognition or a fingerprint."
    ]
  },
  "technical_info": {
    "content": [
      "LockMyPix utilizes encryption to ensure that files stored in the vault remain private and secure. When a user adds photos or other media to the app, it moves them from their original location to the LOCKMYPIX Vault file, helping prevent unauthorized access through file managers, galleries, or other apps.",
      "People who want to keep personal or sensitive content private on their Android or iOS devices are the most likely users of LockMyPix and its Vault format. It is especially useful for those who share their devices or are concerned about data privacy."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open LOCKMYPIX files with LockMyPix on an Android or iOS device. You can unlock the vault using a password, PIN, fingerprint, or face recognition, depending on your device and app settings."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13828&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}