{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/logicly",
  "slug": "logicly",
  "extension": "logicly",
  "name": ".LOGICLY File Extension",
  "type_name": "Logicly Circuit",
  "summary": "Learn about .LOGICLY files and view a list of programs that open them.",
  "developer": "Bowler Hat",
  "more_information": {
    "description": [
      "A LOGICLY file is a virtual circuit created by Logicly, a circuit design program. It contains an interactive circuit diagram, comprised of linked circuit components. For example, a LOGICLY file might contain a simple circuit comprised of switches, logic gates, and light bulbs."
    ]
  },
  "technical_info": {
    "content": [
      "Logicly is a circuit design program that lets students experiment with building logic gate-based circuits. Students can save the circuits they create as LOGICLY files, to share them with others or continue editing them in the future.",
      "Each LOGICLY file can contain a variety of circuit components, including (but not limited to) switches, push buttons, light bulbs, logic gates, flip flops, and buses. After a user finishes designing their circuit, they can test out their design by interacting with the circuit's input controls.",
      "NOTE: Logicly also allows users to create custom integrated circuits, which can be shared between projects using .LOGICLYLIB files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a LOGICLY file in Bowler Hat Logicly (Windows, Mac, Web). To do so, open Logicly and select File → Open.... Then, navigate to and open your LOGICLY file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10359&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/logicly_10359.png",
      "alt": "Screenshot of a .logicly file in Bowler Hat Logicly",
      "caption": "LOGICLY file open in Bowler Hat Logicly"
    }
  ]
}