{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/logiclylib",
  "slug": "logiclylib",
  "extension": "logiclylib",
  "name": ".LOGICLYLIB File Extension",
  "type_name": "Logicly Integrated Circuit Library",
  "summary": "Learn about .LOGICLYLIB files and view a list of programs that open them.",
  "developer": "Bowler Hat",
  "more_information": {
    "description": [
      "A LOGICLYLIB file is an integrated circuit library created by Logicly, a circuit design program. It contains one or more custom integrated circuits that a user exported from Logicly. Users can import LOGICLYLIB files to use the integrated circuits they contain."
    ]
  },
  "technical_info": {
    "content": [
      "Logicly is a circuit design program that lets students create virtual circuits and learn about logic gates. In addition to allowing users to create simple circuits (saved as .LOGICLY files), Logicly allows users to create custom integrated circuits. Users can then re-use these custom integrated circuits in other designs.",
      "If a user wants to export the integrated circuits they've created, to re-use them later, they can select File → Export Integrated Circuit Library... from Logicly's menu bar. This saves all the custom integrated circuits included in the user's current project as a LOGICLYLIB file. Each integrated circuit includes a circuit layout, name, and identifying symbol, all of which are stored in the LOGICLYLIB file."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a LOGICLYLIB file with Logicly (Windows, Mac, Web). To do so:",
      "Select File → Import Integrated Circuit Library... from Logicly's menu bar.",
      "Navigate to and open your LOGICLYLIB file.",
      "The integrated circuits your LOGICLYLIB file includes will then appear in the Custom section of Logicly's left-hand sidebar. Note that Logicly will not re-import any duplicate integrated circuits."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13167&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/logiclylib_13167.png",
      "alt": "Screenshot of a .logiclylib file in Bowler Hat Logicly",
      "caption": "LOGICLYLIB file open in Bowler Hat Logicly"
    }
  ]
}