{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/lqqw",
  "slug": "lqqw",
  "extension": "lqqw",
  "name": ".LQQW File Extension",
  "type_name": "LQQW Ransomware Encrypted File",
  "summary": "Learn about .LQQW files and view a list of programs that open them.",
  "developer": "N/A",
  "more_information": {
    "description": [
      "An LQQW file is a file that has been renamed and encrypted by LQQW ransomware, which is malware distributed by cybercriminals. It contains a normal file, such as an image or document, that the ransomware is holding hostage. LQQW files cannot be decrypted."
    ]
  },
  "technical_info": {
    "content": [
      "In August 2021, some PC users began reporting their computers had been infected by a new variant of STOP ransomware. This variant encrypts users' files and appends them with the .lqqw extension. The ransomware then produces a plain text ransom note named _readme.txt in every folder that contains an infected file. The note contains instructions users are meant to follow to decrypt their files.",
      "Additionally, LQQW ransomware attempts to delete users' System Restore points and restrict access to certain web domains. The ransomware may also install a trojan that its creators can use to access your computer again at a later time. As such, it is highly recommended that you take action to remove the ransomware as soon as possible.",
      "LQQW ransomware is most commonly distributed in programs that appear to be legitimate but are actually adware and malware bundles. If you recently downloaded and installed an unverified program, that may be how LQQM ransomware infected your computer.",
      "NOTE: To learn more about STOP ransomware and its variants, refer to the .STOP entry."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Because LQQW files are encrypted, you cannot open them. Additionally, because LQQW files are encrypted using an online private key, there is no way to decrypt them.",
      "If your computer has been infected by LQQW ransomware, the best option to restore your files to their original state is likely to perform a System Restore (provided the ransomware has not deleted your restore points). Note that performing a System Restore will cause you to lose any data created in the interval between now and your last restore point. Therefore, you may want to back up any data and files created since your last restore point."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12297&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}