{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/lrlibrary",
  "slug": "lrlibrary",
  "extension": "lrlibrary",
  "name": ".LRLIBRARY File Extension",
  "type_name": "Adobe Lightroom Library",
  "summary": "Learn about .LRLIBRARY files and view a list of programs that open them.",
  "developer": "Adobe Systems",
  "more_information": {
    "description": [
      "An LRLIBRARY file is a photo library used by Adobe Lightroom, a photo editing and management application. It stores copies of images that users import into Lightroom and data that the app references to organize and manage the imported images, which helps reduce loading times (similar to a cache). Lightroom automatically creates the LRLIBRARY file, named Lightroom Library.lrlibrary, and saves it in the user's Pictures folder when the user installs the application."
    ]
  },
  "technical_info": {
    "content": [
      "Inside the LRLIBRARY file, photos are stored in the originals folder and organized by the date they were captured. This structure helps Lightroom quickly locate and display imported images. The LRLIBRARY file also contains supporting data, such as .MCAT catalog files and other metadata files, which Lightroom uses to track edits, tags, albums, and other organizational details.",
      "Lightroom saves LRLIBRARY files in the following locations by default:",
      "Windows - C:\\​Users\\​[user name]\\​Pictures\\​Lightroom",
      "macOS - /​Users/​[user name]/​Pictures/​Lightroom",
      "You can change the storage location of LRLIBRARY files by selecting Preferences → Local Storage or Cache in Lightroom."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an LRLIBRARY file with Adobe Lightroom. To do so, double-click the file (with Lightroom installed) or right-click the file and select Open With → Adobe Lightroom.",
      "Since LRLIBRARY files are macOS packages, you can right-click an LRLIBRARY file and select Show Package Contents to view the package's directories and files with Apple Finder.",
      "You can manually explore the contents of an LRLIBRARY file using Windows File Explorer. For example, you can open an LRLIBRARY file with File Explorer to view the directories and reclaim the images it contains."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Adobe Lightroom",
        "url": "https://fileinfo.com/software/adobe/lightroom"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10738&b=1"
      },
      {
        "name": "Adobe Lightroom",
        "url": "https://fileinfo.com/software/adobe/lightroom"
      },
      {
        "name": "Adobe Lightroom",
        "url": "https://fileinfo.com/software/adobe/lightroom"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/lrlibrary_10738.png",
      "alt": "Screenshot of a .lrlibrary file in Adobe Lightroom 8",
      "caption": "LRLIBRARY file open in Adobe Lightroom 8"
    }
  ]
}