{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/lsc",
  "slug": "lsc",
  "extension": "lsc",
  "name": ".LSC File Extension",
  "type_name": "Logo! Soft Comfort File",
  "summary": "Learn about .LSC files and view a list of programs that open them.",
  "developer": "Siemens",
  "more_information": {
    "description": [
      "File created by Logo! Soft Comfort, an automation application that enables you to create and test control program schemes; contains a \"Function block diagram (FBD)\" that outlines the different parts of the program; includes rich text, inputs, outputs, timers, and other functions."
    ]
  },
  "technical_info": {
    "content": [
      "The Logo! Soft Comfort program features a \"drawing board\" interface that organizes the positioning and linking of different program elements for creating, and testing complex control programs. The program offers numerous features, such as text formatting, diagram editing, and simulation tools. Examples of different programs include air-conditioning systems, automatic feeders, industrial gates, rainwater pumps, and traffic signals.",
      "To create an LSC file, select File → New → Function block diagram (FBD), build your diagram, select File → Save or Save As..., choose the save location (it defaults to the \"Program\" folder), name the file, and click Save.",
      "To open an LSC file, select File → Open..., navigate to your file, and click Open."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=9346&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}