{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/lsr",
  "slug": "lsr",
  "extension": "lsr",
  "name": ".LSR File Extension",
  "type_name": "LANsurveyor Report",
  "summary": "Learn about .LSR files and view a list of programs that open them.",
  "developer": "SolarWinds",
  "more_information": {
    "description": [
      "An LSR file is a custom report generated by LANsurveyor, software for monitoring LAN and WAN networks. It contains information about network devices, such as mobile devices, computers, or printers, in spreadsheet format."
    ]
  },
  "technical_info": {
    "content": [
      "IT professionals primarily use LANsurveyor to manage networks, which includes monitoring security threats and the performance of connected nodes. One of the LANsurveyor's capabilities is its ability to generate reports customized by users. Users can save generated reports as LSR files, which they can close, then re-open without losing information.",
      "NOTE: Neon Software originally developed LANsurveyor, but SolarWinds acquired Neon Software in 2007. SolarWinds then discontinued LANsurveyor and replaced it with Network Topology Mapper."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can only open an LSR file with SolarWinds LANsurveyor, which SolarWinds discontinued. SolarWinds replaced LANsurveyor with Network Topology Mapper, which does not support LSR files."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1457&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}