{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/lss",
  "slug": "lss",
  "extension": "lss",
  "name": ".LSS File Extension",
  "type_name": "LiveSplit Splits",
  "summary": "Learn about .LSS files and view a list of programs that open them.",
  "developer": "LiveSplit",
  "more_information": {
    "description": [
      "An LSS file is a splits file that was created for use with LiveSplit, a timer program used by video game speedrunners. It contains XML text that defines a series of splits, or video game sub-sections, that speedrunners are trying to complete in record time. LSS files may contain empty splits, with no previously recorded runtimes, in-progress splits, or completed splits."
    ]
  },
  "technical_info": {
    "content": [
      "LiveSplit allows video game speedrunners to time their progress through a video game, a section of a video game, or an in-game challenge. Speedrunners can divide their progress into sub-sections, referred to as splits, that represent specific levels or goals. For example, a gamer trying to complete Terraria in record time might divide the game into sub-sections that reflect how long it took to defeat each of the game's bosses. Each boss-based split would then appear and be timed separately in LiveSplit (along with the speedrunner's overall time).",
      "If a speedrunner wants to load a set of pre-set splits into LiveSplit, they can do so using an LSS file. LSS files are XML files that define splits for a specific game or challenge. For example, when a speedrunner takes part in an online challenge, they may have to download that challenge's LSS file, load it in LiveSplit, and use it to time their speedrun."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To open an LSS file in LiveSplit, right-click in the program and select Open Splits → From File.... Then, navigate to and select your LSS file. LiveSplit will then load the splits your LSS file contains.",
      "While you can also open and edit an LSS file in any text editor, such as Microsoft Notepad (Windows), Apple TextEdit (Mac), or GitHub Atom (cross-platform), it is best to edit splits directly in LiveSplit. To do so, right-click in LiveSplit and select Edit Splits....",
      "Any LiveSplit user can save their current splits as an LSS file. For example, you might want to save your splits as a new LSS file after you finish a speedrun, so you have a record of your time. To save your current splits as a new LSS file, right-click in LiveSplit and select Save Splits As....",
      "LiveSplit allows users to share their splits files directly to some social platforms. To share your LSS file with others, select Share... from LiveSplit's right-click menu, select a platform on which to share your splits, and then select the Attach Splits checkbox. Note that the Attach Splits checkbox is not available for every social platform."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "GitHub Atom",
        "url": "https://fileinfo.com/software/github/atom"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12134&b=1"
      },
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "GitHub Atom",
        "url": "https://fileinfo.com/software/github/atom"
      },
      {
        "name": "GNU Emacs",
        "url": "https://fileinfo.com/software/gnu/emacs"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "GitHub Atom",
        "url": "https://fileinfo.com/software/github/atom"
      },
      {
        "name": "GNU Emacs",
        "url": "https://fileinfo.com/software/gnu/emacs"
      },
      {
        "name": "Vim",
        "url": "https://fileinfo.com/software/vim/vim"
      },
      {
        "name": "GitHub Atom",
        "url": "https://fileinfo.com/software/github/atom"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/lss_12134.png",
      "alt": "Screenshot of a .lss file in LiveSplit",
      "caption": "LSS file open in LiveSplit"
    }
  ]
}