{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/lxe",
  "slug": "lxe",
  "extension": "lxe",
  "name": ".LXE File Extension",
  "type_name": "Modo Environment Preset File",
  "summary": "Learn about .LXE files and view a list of programs that open them.",
  "developer": "Foundry",
  "more_information": {
    "description": [
      "An LXE file is a preset file created by Foundry Modo, a 3D modeling, texturing, animation, and photorealistic rendering tool. It stores a customized environment, which may be a complete scene that includes lights and meshes."
    ]
  },
  "technical_info": {
    "content": [
      "Modo is primarily used by professional 3D designers for creating various types of models and environments. Some examples include product package designs, shoes, room designs, video game characters, film effects, and building structures.",
      "Presets allow users to save often-used components that can be inserted into different projects. This enables users to save time on repetitive tasks.",
      "You can create an LXE file by selecting File → Save Environment Preset..., or right-click a material layer in the \"Shading\" tab in the right panel and select Save Environment Preset.",
      "NOTE: Foundry Modo was formerly known as Luxology Modo before Luxology merged with Foundry."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can only open LXE files with Foundry Modo by selecting File → Open.... To set the LXE file to automatically appear in the Preset Browser in Modo, place the LXE file in the Luxology\\​Content\\​Assets directory."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11759&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}