{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/maf",
  "slug": "maf",
  "extension": "maf",
  "name": ".MAF File Extension",
  "type_name": "Microsoft Access Form",
  "summary": "Learn about .MAF files and view a list of programs that open them.",
  "developer": "Microsoft",
  "more_information": {
    "description": [
      "An MAF file is a form created by Microsoft Access, a relational database management system (RDBMS). It contains formatted fields used to enter data into or retrieve data from an .ACCDB database. MAF files are created using Microsoft Access's Form tool."
    ]
  },
  "technical_info": {
    "content": [
      "To allow database managers to more easily enter data into or retrieve data from a Microsoft Access database, the program allows managers to create and link forms with database tables. To create a form, managers select the table for which they want to create a form, select Create from Microsoft Access's menu bar, and then select Form. Access then creates a form that contains fields linked to the table's columns.",
      "Each Microsoft Access form is saved as an MAF file. You can open an MAF file in Microsoft Access to edit the form's fields and appearance, using Access's Form Layout Tools. You can also use a form to search for or enter data into a database, provided you have access to that database.",
      "Forms may include subforms, which show information from related tables. For example, a form used to search for or add customers to a database may include a subform that shows information about customers' orders, which is stored in a related table.",
      "After you finish creating a Microsoft Access form, you may want to set that form as your database's default form. This will cause the form to appear automatically each time you open the database. To set a form as a database's default form:",
      "Select File → Options.",
      "Select Current Database.",
      "From the Display Form list, select the form you want to use as your database's default form.",
      "Select OK."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an MAF file in Microsoft Access (Windows). To do so, select File → Open... from the program's menu bar, and then navigate to and open your MAF file.",
      "You can then use the form to enter data into or retrieve data from the table it is linked with, or you can edit the form using Microsoft Access's Form Design Tools. To access Access's Form Design Tools, select the View button found in Access's toolbar, and then select Layout view or Design view."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Microsoft Access",
        "url": "https://fileinfo.com/software/microsoft/access"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=468&b=1"
      },
      {
        "name": "Microsoft Access 365",
        "url": "https://fileinfo.com/software/microsoft/access"
      },
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Microsoft WordPad",
        "url": "https://fileinfo.com/software/microsoft/wordpad"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}