{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/mbtiles",
  "slug": "mbtiles",
  "extension": "mbtiles",
  "name": ".MBTILES File Extension",
  "type_name": "Mapbox Tileset",
  "summary": "Learn about .MBTILES files and view a list of programs that open them.",
  "developer": "Mapbox",
  "more_information": {
    "description": [
      "An MBTILES file is a tile-based geographic map used by Mapbox and other mapping programs. It contains a map and, usually, additional overlaid information. In mapping programs, users can zoom in upon the map an MBTILES file contains to view areas in greater detail."
    ]
  },
  "technical_info": {
    "content": [
      "Mapbox's MBTILES format allows users to save detailed collections of geospatial information as a single map. For example, the map an MBTILES file contains might be overlaid with information about hiking trails, utility lines, administrative boundaries, and/or points of interest.",
      "MBTILES maps are comprised of vector- or raster-based tiles, which contain map images. When a user zooms in on a particular tile, mapping programs show that tile (and the surrounding area) in more detail. Because they are comprised of tiles, MBTILES files are often referred to as tilesets."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an MBTILES file with several mapping programs, including Mapbox Studio (Web), MBView (multiplatform), and MapTiler Desktop (multiplatform). For example, to open an MBTILES file in Mapbox Studio, log in to your account and select New tileset. Then, upload and open your MBTILES file (which will be stored in the program's Custom tilesets section)."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12748&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/mbtiles_12748.png",
      "alt": "Screenshot of a .mbtiles file in MapTiler Desktop",
      "caption": "MBTILES file open in MapTiler Desktop"
    }
  ]
}