{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/mca",
  "slug": "mca",
  "extension": "mca",
  "name": ".MCA File Extension",
  "type_name": "Minecraft Anvil Region",
  "summary": "Learn about .MCA files and view a list of programs that open them.",
  "developer": "Mojang",
  "more_information": {
    "description": [
      "An MCA file is a region of a Minecraft world. It contains a portion of the world's terrain chunks, which must be combined with other MCA files to comprise a world. The MCA format replaced Minecraft's previous .MCR region format."
    ]
  },
  "technical_info": {
    "content": [
      "Minecraft is a popular open-world exploration and construction game. The game's Java Edition allows players to examine, modify, and replace game files, including MCA files.",
      "MCA files are stored in a world's region directories. Typically, each world contains three region directories: one each for the world's Nether, End, and Overworld. Each region directory uses its own set of MCA files, whose filenames include the coordinates at which the region is placed (e.g. r.8.20.mca).",
      "Just as in the MCR format, regions are divided into chunks. In the MCA format, these chunks consist of 16x16x16 groups of terrain blocks. The MCA format improved on the MCR format by including increased build height (256 or 384 blocks depending on version, compared to MCR's 128), support for more block types, and more efficient file compression. The MCA format also includes more features Minecraft modders can use to modify regions.",
      "NOTE: Players often refer to the MCA format as the Anvil region format. Minecraft's developers arbitrarily assigned this name to the format."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To use an MCA file as a Minecraft region, place the file in an appropriate region sub-directory. Most likely, you will want to place a group of related MCA files in a region sub-directory at the same time, to use them as a world's Overworld, Nether, or End. Note that MCA files created for newer versions of Minecraft may not work in older versions of Minecraft, and vice-versa.",
      "You can also open an MCA file in NBTExplorer (multiplatform), to view the region data it contains."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=7369&b=1"
      },
      {
        "name": "Mojang Minecraft",
        "url": "https://fileinfo.com/software/mojang/minecraft"
      },
      {
        "name": "NBTExplorer",
        "url": "https://fileinfo.com/software/nbtexplorer/nbtexplorer"
      },
      {
        "name": "Mojang Minecraft",
        "url": "https://fileinfo.com/software/mojang/minecraft"
      },
      {
        "name": "NBTExplorer",
        "url": "https://fileinfo.com/software/nbtexplorer/nbtexplorer"
      },
      {
        "name": "Mojang Minecraft",
        "url": "https://fileinfo.com/software/mojang/minecraft"
      },
      {
        "name": "NBTExplorer",
        "url": "https://fileinfo.com/software/nbtexplorer/nbtexplorer"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}