{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/mcapm",
  "slug": "mcapm",
  "extension": "mcapm",
  "name": ".MCAPM File Extension",
  "type_name": "Minecraft Anvil PocketMine Data File",
  "summary": "Learn about .MCAPM files and view a list of programs that open them.",
  "developer": "N/A",
  "more_information": {
    "description": [
      "An MCAPM file is a data file saved in the PMAnvil format, which is used by PocketMine-MP server software for Minecraft: Pocket Edition. It contains information about a Minecraft map, also known as a world or level. MCAPM files contain chunks, which are segments of a map that are referenced by the game and displayed as a player moves around the map."
    ]
  },
  "technical_info": {
    "content": [
      "PocketMine-MP is a program used to configure and connect to a private server that Minecraft gamers can play on with other gamers. The program can also be used to install plugins and customize Minecraft gameplay. It is a popular server alternative to Bedrock server software officially used by Minecraft.",
      "MCAPM files are alternatives to .MCA files, which replaced and improved upon the Minecraft Region .MCR file format. MCA files are saved in the Anvil format and used by most Minecraft servers, including Nukkit.",
      "NOTE: You can convert MCAPM files to the Anvil format (MCA files) using pmanvil-converter."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11231&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}