{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/mcx-8",
  "slug": "mcx-8",
  "extension": "mcx-8",
  "name": ".MCX-8 File Extension",
  "type_name": "Mastercam X8 Model",
  "summary": "Learn about .MCX-8 files and view a list of programs that open them.",
  "developer": "CNC Software",
  "more_information": {
    "description": [
      "An MCX-8 file is a 3D model created by Mastercam X8, a computer-aided design (CAD) and computer-aided manufacturing (CAM) application. It is a representation of a mechanical part, which machinists use to produce a physical copy of that part. You can open MCX-8 files in Mastercam. From within Mastercam, you can convert MCX-8 files to .IGS or .SPT files, for use in other CAD and CAM applications."
    ]
  },
  "technical_info": {
    "content": [
      "In 1983, CNC Software released the first version of Mastercam. Mastercam was one of the first CAD and CAM applications that allowed machinists and engineers to model mechanical parts and help automate part production.",
      "Over the years, CNC Software has released many subsequent versions of Mastercam. In 2014, CNC Software released Mastercam X8. Mastercam X8 saved users' 3D part designs as MCX-8 files.",
      "In 2019, CNC Software discontinued Mastercam X8, suggesting that users should upgrade to the then-current version of Mastercam, Mastercam 2020. However, current versions of Mastercam can still open MCX-8 files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an MCX-8 file in CNC Software Mastercam (Windows). If you attempt to resave your MCX-8 file, you'll likely be asked to save it in Mastercam's current 3D model file format."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12328&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}