{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/mer",
  "slug": "mer",
  "extension": "mer",
  "name": ".MER File Extension",
  "type_name": "RSView Development Runtime File",
  "summary": "Learn about .MER files and view a list of programs that open them.",
  "developer": "Rockwell Automation",
  "more_information": {
    "description": [
      "A MER file is a runtime file created by Rockwell Automation RSView. It contains program data that has been compiled and saved in an executable format. MER files are created from RSView development (.MED) files."
    ]
  },
  "technical_info": {
    "content": [
      "RSView is a Human Machine Interface (HMI) application that allows you to develop, monitor, and control industrial automation systems. It is available in multiple versions, including RSView Studio and RSView ME (Machine Edition).",
      "After a developer creates an automation program in RSView, they can compile that program and save it as an MER file. RSView can then execute the program to perform the automation tasks it contains.",
      "NOTE: In 2021, Rockwell Automation replaced RSView with FactoryTalk."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a MER file in Rockwell Automation RSView (Windows). Note that RSView has been discontinued."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "In versions 6 and above of RSView, you can specify that you want to allow RSView to convert a compiled MER file back into a MED file for further editing. If the developer who created your MER file selected this option, you can use RSView to convert your MER file to a MED file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=2906&b=1"
      },
      {
        "name": "Rockwell Automation RSView",
        "url": "https://www.rockwellautomation.com/en-us/products/software/factorytalk.html"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}