{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/merry",
  "slug": "merry",
  "extension": "merry",
  "name": ".MERRY File Extension",
  "type_name": "Merry X-Mas Ransomware Encrypted File",
  "summary": "Learn about .MERRY files and view a list of programs that open them.",
  "developer": "N/A",
  "more_information": {
    "description": [
      "A file with the .merry extension has been encrypted and renamed by Merry X-mas ransomware. It could be an encrypted document, database, image, video, or other type of file. Because the file is encrypted, you cannot open it. The .merry extension is added to the file's normal extension, producing an extension like .doc.merry."
    ]
  },
  "technical_info": {
    "content": [
      "In 2016, users first began reporting the existence of Merry X-Mas, or Merry Christmas, ransomware. Merry X-Mas infects a user's computer, encrypts and renames the user's files, and then produces a ransom note named YOUR_FILES_ARE_DEAD.HTA or MERRY_I_LOVE_YOU_BRUCE.HTA. The ransomware then automatically opens the ransom note, which contains a threatening countdown.",
      "Merry X-mas ransomware is distributed via spam emails that claim to be a consumer complaint notification from the Federal Trade Commission (FTC). When you click the link the email contains, it downloads a file named COMPLAINT.pdf to your computer. This file is actually an .EXE file, not a .PDF file. Opening the file executes the program it contains, which installs Merry X-mas ransomware on your computer.",
      "FileInfo recommends you never pay a ransom to decrypt your files. Also, free decryption tools exist that may allow you to restore your MERRY files to their normal state.",
      "NOTE: Variants of Merry X-mas ransomware append users' files with the .mrcr1, .rare1, .rmcm1, or .pegs1 extension, instead of .merry."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can decrypt MERRY files using Emsisoft Decryptor for MRCR (Windows). This tool requires that you have at least one pair of encrypted and decrypted files. (For example, the file document.docx, retrieved from a backup device, and its sibling, document.docx.merry, stored on your computer.) For full instructions on how to use Emsisoft Decryptor for MRCR, click the link found below."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12465&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}