{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/mfx",
  "slug": "mfx",
  "extension": "mfx",
  "name": ".MFX File Extension",
  "type_name": "Clickteam Fusion Extension",
  "summary": "Learn about .MFX files and view a list of programs that open them.",
  "developer": "Clickteam",
  "more_information": {
    "description": [
      "An MFX file is an extension for Clickteam Fusion, a visual game development program. It contains information about an extension, which adds extra features, objects, characters, or other resources to the program."
    ]
  },
  "technical_info": {
    "content": [
      "Clickteam Fusion is an app for developing software and games that replaced Multimedia Fusion and The Games Factory. It comes with various features that allow beginners to build custom programs, but it also allows you to install extensions developed by Clickteam and third-party developers.",
      "MFX extensions are available via the Clickteam Extension Manager. Examples of extensions include 3D meshes, advanced function objects, and active backdrops, shapes, and gradient backdrops.",
      "NOTE: Clickteam introduced MFX files when it released version 2 of Multimedia Fusion and The Games Factory (Clickteam later replaced these apps with Fusion 2.5). MFX files replaced .COX files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open MFX files with Clickteam Fusion (Windows). For example, to install an MFX extension:",
      "Right-click your frame in Fusion",
      "Select Insert Object",
      "Click Manager",
      "Choose the extension you want to install, then click Install"
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=2217&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}