{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/mlmodel",
  "slug": "mlmodel",
  "extension": "mlmodel",
  "name": ".MLMODEL File Extension",
  "type_name": "Create ML Model",
  "summary": "Learn about .MLMODEL files and view a list of programs that open them.",
  "developer": "Apple",
  "more_information": {
    "description": [
      "An MLMODEL file is a machine learning model created in Apple Create ML. It contains text and binary data that define a model's prediction methods, configuration, and description. MLMODEL files are created in Apple Create ML and used to add machine learning models to applications developed in Apple Xcode."
    ]
  },
  "technical_info": {
    "content": [
      "Create ML is an Apple Xcode component that macOS developers can use to create and train machine learning models. Specifically, developers use Create ML to create Core ML machine learning models, which are optimized for integration into Xcode applications.",
      "After a developer finishes using an .MLPROJ file to create a machine learning model, Create ML saves the model in an MLMODEL file. The developer can then open their model in Apple Xcode, to view the model's metadata and preview its capabilities.",
      "For example, a developer who uses Create ML to create an image classification model can open that model's MLMODEL file in Xcode and test its image classification capabilities. To do so, the developer double-clicks the MLMODEL file, selects the Preview tab, and either drags and drops an image in Xcode or selects the + button to add images and test their model. Not all types of models include the Preview tab, but all models do include the Predictions tab, which developers can use to view the inputs and outputs a model accepts and generates.",
      "Developers who are satisfied with their MLMODEL file's prediction methods and outputs can integrate the model into Xcode applications. For detailed instructions on how to add an MLMODEL to an Xcode project, click here."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an MLMODEL file in Apple Xcode (Mac). Doing so allows you to view the MLMODEL's metadata and preview the model's prediction capabilities. If you have Xcode installed, you can open your MLMODEL file by double-clicking the file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Apple Xcode",
        "url": "https://fileinfo.com/software/apple/xcode"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11946&b=1"
      },
      {
        "name": "Apple Xcode",
        "url": "https://fileinfo.com/software/apple/xcode"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/mlmodel_11946.png",
      "alt": "Screenshot of a .mlmodel file in Apple Xcode",
      "caption": "MLMODEL file open in Apple Xcode"
    }
  ]
}