{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/mlproj",
  "slug": "mlproj",
  "extension": "mlproj",
  "name": ".MLPROJ File Extension",
  "type_name": "MATLAB Archived Project",
  "summary": "Learn about .MLPROJ files and view a list of programs that open them.",
  "developer": "MathWorks",
  "more_information": {
    "description": [
      "An MLPROJ file is a MathWorks MATLAB project that has been packaged as a single compressed archive. It contains all the data needed to import and open a project in MATLAB. MLPROJ files are used to share projects among MATLAB users."
    ]
  },
  "technical_info": {
    "content": [
      "MathWorks MATLAB is a cross-platform mathematical analysis and computation program. Researchers, developers, and engineers use MATLAB to perform calculations, develop algorithms, and model, analyze, and explore mathematical data.",
      "When a MATLAB user wants to share a project (.PRJ file) they've been working on with another user, they can package that project and all its component files (including referenced projects) as an MLPROJ file. MLPROJ files are compressed archives, which make them easy to email, upload to a cloud storage system, or store on a USB flash drive. Other MATLAB users can then access and decompress the MLPROJ file, to open the project it contains.",
      "Sometimes, MLPROJ files may contain only some of the files used by a MATLAB project. Users can use MATLAB export profiles to choose what files they include in their MLPROJ archives."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an MLPROJ (MATLAB Project) file in MathWorks MATLAB (cross-platform). If you have MATLAB installed, you can import the project an MLPROJ file contains by double-clicking the file. MATLAB will then open the Extract Project to dialog box. Specify the location at which you want to save the project, and then click Select Folder. The project your MLPROJ file contains will then open in MATLAB."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12050&b=1"
      },
      {
        "name": "The MathWorks MATLAB",
        "url": "https://fileinfo.com/software/the_mathworks/matlab"
      },
      {
        "name": "The MathWorks MATLAB",
        "url": "https://fileinfo.com/software/the_mathworks/matlab"
      },
      {
        "name": "The MathWorks MATLAB",
        "url": "https://fileinfo.com/software/the_mathworks/matlab"
      },
      {
        "name": "Apple Xcode",
        "url": "https://fileinfo.com/software/apple/xcode"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/mlproj_11806.png",
      "alt": "Screenshot of a .mlproj file in Apple Create ML",
      "caption": "MLPROJ file open in Apple Create ML"
    }
  ]
}