{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/motr",
  "slug": "motr",
  "extension": "motr",
  "name": ".MOTR File Extension",
  "type_name": "Apple Motion Transition Project Template",
  "summary": "Learn about .MOTR files and view a list of programs that open them.",
  "developer": "Apple",
  "more_information": {
    "description": [
      "A MOTR file is a project template that contains a transition created by Apple Motion, a motion graphics application. It stores information about a transition, such as the layers and duration of the transition. MOTR files do not contain the actual media that makes up the effect only references to the media."
    ]
  },
  "technical_info": {
    "content": [
      "Apple Motion is used to create generators, effects, transitions, and titles for video projects. It is often used with a video editor to create an effect, title, transition, which is then exported from Motion and imported into the video editor. Motion is most commonly used with Final Cut Pro.",
      "Apple Motion uses several extensions for saving different project types. Titles created in Motion are saved as .MOTI files, effects are saved as .MOEF files, and generators are saved as .MOTN files.",
      "By default, MOTR files are saved in the following directory in macOS:",
      "/​Users/​username/​Movies/​Motion Templates/​Transitions/​",
      "MOTR files are typically found in the \"Transitions\" folder accompanied by a media folder that stores all the media associated with the transition project. MOTR files are also commonly found with a large and small .PNG thumbnail for previewing the transition in the Final Cut Pro browser and a .MOV preview of the MOTR transition when it is selected in the Motion \"Project Browser.\" However, the MOV file is only created if the \"Save Preview Movie\" checkbox is checked when saving the MOTR transition file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10716&b=1"
      },
      {
        "name": "Apple Final Cut Pro",
        "url": "https://fileinfo.com/software/apple/final_cut_pro"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}