{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/mp12",
  "slug": "mp12",
  "extension": "mp12",
  "name": ".MP12 File Extension",
  "type_name": "Multisim 12 Project",
  "summary": "Learn about .MP12 files and view a list of programs that open them.",
  "developer": "National Instruments",
  "more_information": {
    "description": [
      "An MP12 file is a project created by version 12 of Multisim, a program used to design, analyze, and simulate printed circuit boards (PCB). It contains references to circuit designs stored in .MS12 files and may include simulation results, documents, and reports. MP12 files are used to organize and manage multiple designs in a project."
    ]
  },
  "technical_info": {
    "content": [
      "MP12 and MS12 files are the primary file types associated with Multisim. You can simply double-click the MP12 or MS12 file to open it in Multisim. Although Multisim is only available through purchase, it does provide a free trial period, which allows you to open an MP12 file.",
      "Multisim appends a number to project file extensions, which indicates the version of Multisim that created the project. For example, Multisim 10 creates the .MP10 file extension and Multisim 11 creates the .MP11 file extension. Also, Multisim supports older project formats, which means that version 14 of Multisim can open an .MP8 project created by version 8 of Multisim.",
      "Multisim provides a variety of features that make it a powerful electronic schematic capture and SPICE environment. It is used by educators, researchers, and engineers around the world to simualte and analyze PCBs."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10587&b=1"
      },
      {
        "name": "National Instruments Multisim",
        "url": "https://fileinfo.com/software/national_instruments/multisim"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}