{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/mp2m",
  "slug": "mp2m",
  "extension": "mp2m",
  "name": ".MP2M File Extension",
  "type_name": "Max Payne 2 Mod",
  "summary": "Learn about .MP2M files and view a list of programs that open them.",
  "developer": "Rockstar Games",
  "more_information": {
    "description": [
      "An MP2M file is a mod for Rockstar Games Max Payne 2. It contains data used to import a custom level into the game or modify an existing level. For example, an MP2M file might contain custom 3D models, skins, and/or game logic."
    ]
  },
  "technical_info": {
    "content": [
      "Max Payne 2: The Fall of Max Payne is a third-person shooter in which players play as a New York City police detective named Max Payne. It is a sequel to the original Max Payne game.",
      "Those playing the Windows version of Max Payne 2 can modify the game using MP2M files. MP2M files contain custom game content packed using the Remedy Archive System. Players can unpack these files using RASMaker 2 or RASMaster, if they want to edit the mod's contents before installing it."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can use RASMaster (Windows) or MaxPaynePacker (Windows) to extract an MP2M file's contents. You can also use these tools to package files into an MP2M file.",
      "To use an MP2M file as a Max Payne 2 mod, place the file in Max Payne 2's installation directory, alongside its .exe file. Then, you can select your mod from the game's Choose Customized Game menu option."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=2714&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}