{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/mp8",
  "slug": "mp8",
  "extension": "mp8",
  "name": ".MP8 File Extension",
  "type_name": "Multisim 8 Project",
  "summary": "Learn about .MP8 files and view a list of programs that open them.",
  "developer": "National Instruments",
  "more_information": {
    "description": [
      "An MP8 file is a project created by version 8 of Multisim, a program used to design, analyze, and simulate printed circuit boards (PCB). It contains references to circuit designs stored in .MS8 files. MP8 files may also include simulation results, documents, and reports."
    ]
  },
  "technical_info": {
    "content": [
      "MP8 files are used to organize and manage multiple designs in a project. MP8 and MS8 files are the primary file types associated with Multisim 8. You can simply double-click the MP8 or MS8 file to open it in Multisim.",
      "Multisim appends numbers to project file extensions, which indicates the version of Multisim that created the project. For example, Multisim 10 creates the .MP10 file extension and Multisim 11 creates the .MP11 file extension. Also, Multisim supports older project formats, which means that version 14 of Multisim can open an MP9 project created by version 9 of Multisim.",
      "Multisim provides a variety of features that make it a powerful electronic schematic capture and SPICE environment. It is used by educators, researchers, and engineers around the world to simualte and analyze PCBs."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10588&b=1"
      },
      {
        "name": "National Instruments Multisim",
        "url": "https://fileinfo.com/software/national_instruments/multisim"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}