{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/mpm",
  "slug": "mpm",
  "extension": "mpm",
  "name": ".MPM File Extension",
  "type_name": "Max Payne Mod",
  "summary": "Learn about .MPM files and view a list of programs that open them.",
  "developer": "Rockstar Games",
  "more_information": {
    "description": [
      "An MPM file is a mod for Rockstar Games Max Payne. It contains data used to import a custom level into the game or modify an existing level. For example, an MPM file might contain custom game logic that modifies how Max Payne's weapons behave."
    ]
  },
  "technical_info": {
    "content": [
      "Max Payne is a popular third-person shooter video game in which players play as a New York City police detective named Max Payne. Rockstar Games released Max Payne in 2001.",
      "Those playing the Windows version of Max Payne can use MPM files to modify the game's content. To do so, a player must place the MPM file in Max Payne's installation directory. Modders can also use Max Payne modding tools, such as RASMaster and MaxPaynePacker, to unpack MPM files and customize their contents."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can use RASMaster (Windows) or MaxPaynePacker (Windows) to extract an MPM file's contents. You can also use these tools to package files into an MPM file.",
      "To use an MPM file as a Max Payne mod, place the file in Max Payne 2's installation directory, alongside its .exe file. Then, you can select your mod from the game's Choose Customized Game menu option."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1411&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}