{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/mpn",
  "slug": "mpn",
  "extension": "mpn",
  "name": ".MPN File Extension",
  "type_name": "Mophun Video Game",
  "summary": "Learn about .MPN files and view a list of programs that open them.",
  "developer": "Synergenix Interactive",
  "more_information": {
    "description": [
      "An MPN file is a game that can be played using Mophun, a legacy mobile gaming platform. It contains binary code used to load and run a game. MPN files are typically found in old mobile devices' Mophun directory."
    ]
  },
  "technical_info": {
    "content": [
      "In the early 2000s, Synergenix Interactive's Mophun game platform was included in several mobile phones and other devices. Most notably, many Sony Ericsson phones included Mophun. Mophun allowed players to install and play games downloaded from the Internet. These games were saved in MPN files.",
      "After a player installed a Mophun game, the game's MPN file was typically stored in their device's Mophun directory. For example, to install a Mophun game on an ARCHOS Gmini 402 pocket multimedia device, a user had to:",
      "Download an MPN file on their PC.",
      "Connect their Gmini 402 to their PC.",
      "Transfer the MPN file to their Gmini 402.",
      "After the user disconnected their Gmini 402 from their PC, the Gmini 402 automatically detected and installed the new MPN file, by moving it to the device's Mophun directory."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Because the mobile devices that included the Mophun game platform are now outdated or obsolete, there is no easy way to open an MPN file and play the game it contains. While some Mophun emulators exist, they are either incomplete or available only for legacy devices, such as Windows Phones. The easiest way to play an MPN game is to install the game on an old device that includes the Mophun platform."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11888&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}