{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/msrcincident",
  "slug": "msrcincident",
  "extension": "msrcincident",
  "name": ".MSRCINCIDENT File Extension",
  "type_name": "Windows Remote Assistance Invitation",
  "summary": "Learn about .MSRCINCIDENT files and view a list of programs that open them.",
  "developer": "Microsoft",
  "more_information": {
    "description": [
      "An MSRCINCIDENT file is an invitation created by Microsoft Windows Remote Assistance, a built-in Windows tool that allows one user to assist another remotely. It contains XML-formatted details, such as connection settings and authentication information, and enables a trusted recipient to connect remotely to a computer for troubleshooting or technical support."
    ]
  },
  "technical_info": {
    "content": [
      "When a user selects \"Invite someone you trust to help you\" in Windows Remote Assistance, the tool gives an option to save the invitation as an MSRCINCIDENT file or send it via email. When a user creates an MSRCINCIDENT file, a password is also generated. The user must separately share this password with the recipient, either verbally or through a secure method.",
      "NOTE: Microsoft removed Windows Remote Assistance in Windows 11 and recommends using the \"Quick Assist\" tool instead."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open MSRCINCIDENT files with Microsoft Windows Remote Assistance in Windows 7, 8, and 10 (it is not available with Windows 11 and later).",
      "To open an MSRCINCIDENT file with Windows Remote Assistance, select Help someone who has invited you then Use an invitation file to start the remote session. You must also enter the password sent from the sender before you can connect to their computer. This extra step helps ensure security by preventing unauthorized access, even if an unintended party obtains the MSRCINCIDENT file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=5788&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}