{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/nba",
  "slug": "nba",
  "extension": "nba",
  "name": ".NBA File Extension",
  "type_name": "Nero BackItUp Archive",
  "summary": "Learn about .NBA files and view a list of programs that open them.",
  "developer": "Nero",
  "more_information": {
    "description": [
      "An NBA file is a compressed archive created by Nero BackItUp, a file backup utility. It contains one or more files that a user backed up. Users typically store NBA files on USB flash drives, external hard drives, or other backup media."
    ]
  },
  "technical_info": {
    "content": [
      "Nero BackItUp (formerly BackItUp & Burn) is a backup utility that allows users to back up their files in compressed archives. Users can configure BackItUp to back up their files automatically, and they can store backups on external drives or in the cloud.",
      "The archives that BackItUp versions 12 and earlier creates are saved with the .nba extension. Users can optionally choose to encrypt and password-protect these archives, to prevent others from opening them or extracting the files they contain."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an NBA file and retrieve the files it contains in Nero BackItUp (Windows). However, you may not be able to open NBA files created in previous versions of BackItUp in newer versions of the program. If you attempt to open an old NBA file in a newer version of BackItUp, the program may instead show an error message and fail to open your file.",
      "If you do not have access to Nero BackItUp, or you cannot open your NBA file in BackItUp, you can instead:",
      "Rename your NBA file to use the .ZIP extension.",
      "Open it as you would any ZIP file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=4177&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}