{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/nbmap",
  "slug": "nbmap",
  "extension": "nbmap",
  "name": ".NBMAP File Extension",
  "type_name": "NintendoWare Bezel Engine Map",
  "summary": "Learn about .NBMAP files and view a list of programs that open them.",
  "developer": "Nintendo",
  "more_information": {
    "description": [
      "An NBMAP file is a game map used by a NintendoWare Bezel Engine video game. Nintendo Switch games such as Super Mario Party and WarioWare: Get It Together! use NBMAP files. NBMAP files are stored in .BEA archives."
    ]
  },
  "technical_info": {
    "content": [
      "The NintendoWare Bezel Engine is a game engine Nintendo released to make Switch video game development easier for third-party developers. However, both official Nintendo games and third-party games use the Bezel Engine.",
      "Bezel Engine games contain game maps saved as NBMAP files. For example, Super Mario Party (Switch) contains an NBMAP file named bdr001_map_b02.nbmap.",
      "The NBMAP files found in Switch video games are binary files. However, when being developed in the Bezel Engine, NBMAP files are XML files. The Bezel Engine converts NBMAP files to binary files when compiling a developer's game."
    ]
  },
  "how_to_open": {
    "instructions": [
      "NBMAP files are not meant to be opened. At the moment, Switch game modders have not produced any tools that allow them to open NBMAP files."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12390&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}