{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/nc1",
  "slug": "nc1",
  "extension": "nc1",
  "name": ".NC1 File Extension",
  "type_name": "Mastercam Numerical Control File",
  "summary": "Learn about .NC1 files and view a list of programs that open them.",
  "developer": "CNC Software",
  "more_information": {
    "description": [
      "An NC1 file is a numerical control file created by Mastercam, a suite of CAD programs used for designing and manufacturing components. It contains instructions for directing a machine tool, such as a laser cutter, nester, welder, or drill, during production. NC1 files are the same as .NC files but with a different extension."
    ]
  },
  "technical_info": {
    "content": [
      "NC1 files specify 2D or 3D machine toolpaths and their coordinates. They also help to translate toolpaths into a format that machine tools can understand. The NC1 format is supported by a variety of machines that perform plasma, waterjet, oxy, and laser cutting of materials such as aluminum, copper, steel, bronze, and armour. These machines are used in various industries around the world, such as general engineering & manufacturing, agricultural machinery, commercial vehicle, and defense & aerospace.",
      "NOTE: The FastCAM programs also supports the NC1 format. The Drawing Editor is a handy program for importing NC1 files to edit drawings."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10480&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}