{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/nfa",
  "slug": "nfa",
  "extension": "nfa",
  "name": ".NFA File Extension",
  "type_name": "Netflix Audio File",
  "summary": "Learn about .NFA files and view a list of programs that open them.",
  "developer": "Netflix",
  "more_information": {
    "description": [
      "An NFA file is an audio file created by the Netflix streaming app for Android and iOS. It contains audio for a movie or show downloaded through the app. NFA files are the same as .AAC files but renamed."
    ]
  },
  "technical_info": {
    "content": [
      "The Netflix app allows Android and iOS users to download a wide variety of movies and shows for viewing when not connected to the Internet. Most titles on Netflix are available for download although some are excluded. If a title can be downloaded it has a download icon next to the name. You can search for downloadable titles by selecting \"Available for Download\" from the Netflix menu. Tap the download icon to begin the download then navigate to the \"My Downloads\" section of the app to access the downloaded movie or show.",
      "When you choose a movie or TV to download to your device, the Netflix app downloads and saves one or more NFA files to your device in a folder. The file(s) are downloaded along with several other files, including the .MANIFEST, .NFV, .NFI, and .NFS files.",
      "If you want to delete a movie or show you downloaded to your Android device tap the menu icon in the app, select \"My Downloads\", tap the pencil edit icon in the upper right corner, and tap the red \"X\" icon to delete the title.",
      "If you want to delete a movie or show you downloaded to your iOS device tap the menu icon in the app, select \"My Downloads\", tap \"Edit\", and select the red \"X\" icon to delete the title.",
      "NOTE: In order to download Netflix content on your Android or iOS app you need to have Android 4.4.2 or later or iOS 8.0 or later. You also need the latest version of the Netflix app."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10935&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}