{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/nlx",
  "slug": "nlx",
  "extension": "nlx",
  "name": ".NLX File Extension",
  "type_name": "MyDraw XML Library",
  "summary": "Learn about .NLX files and view a list of programs that open them.",
  "developer": "Nevron Software",
  "more_information": {
    "description": [
      "An NLX file is a library created by Nevron Software MyDraw, an application used to create various diagrams and technical illustrations. It stores a collection of stencils, which are shapes, connectors, and other objects used within a drawing. NLX files are typically used for distributing design elements between MyDraw users to insert into technical drawings."
    ]
  },
  "technical_info": {
    "content": [
      "MyDraw can create various types of drawings, such as organizational charts, infographics, database models, business flowcharts, network diagrams, and family trees. When creating a drawing, you can insert stencils from libraries via the Library browser into the drawing to enhance it.",
      "NLX files come pre-installed with MyDraw, and you may also create them. To create an NLX file, select the library icon in the Library browser, choose Save Library As..., then select the NLX format.",
      "NOTE: You can also save MyDraw libraries as .NLB files, which are libraries saved in binary format instead of XML format."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open NLX files with Nevron Software MyDraw in Windows and macOS by selecting File → Open."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12106&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}