{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/nmo",
  "slug": "nmo",
  "extension": "nmo",
  "name": ".NMO File Extension",
  "type_name": "NMO Ransomware Encrypted File",
  "summary": "Learn about .NMO files and view a list of programs that open them.",
  "developer": "N/A",
  "more_information": {
    "description": [
      "A file with the .nmo extension has been maliciously renamed and encrypted by NMO ransomware. It contains a document, image, video, or other file the ransomware is holding hostage. The .nmo extension and an email address are appended to the file's normal extension, producing a compound extension like .docx.[[email protected]].nmo."
    ]
  },
  "technical_info": {
    "content": [
      "NMO ransomware is a variant of Dharma ransomware (which operates similarly but appends users' files with the .DHARMA extension). After infecting a user's computer, this malware encrypts the user's files and produces a ransom note named info.txt. The note contains instructions users can supposedly follow to decrypt their files.",
      "Unlike most other forms of ransomware, NMO ransomware inserts the attacker's email address in encrypted files' extensions. Presumably, this is to make it easier, and thus more tempting, for victims to contact the attacker and pay their ransom.",
      "NMO ransomware is most commonly distributed within email attachments and programs that appear to be legitimate but are actually malicious. If you recently downloaded and opened an unverified email attachment or program, that may be how your computer became infected by NMO ransomware."
    ]
  },
  "how_to_open": {
    "instructions": [
      "No known program can restore NMO files to their original state. The best way to recover your files is to retrieve them from a recent backup or perform a System Restore to a point before your computer was infected."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12924&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}