{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/nojekyll",
  "slug": "nojekyll",
  "extension": "nojekyll",
  "name": ".NOJEKYLL File Extension",
  "type_name": "GitHub Pages NoJekyll File",
  "summary": "Learn about .NOJEKYLL files and view a list of programs that open them.",
  "developer": "GitHub",
  "more_information": {
    "description": [
      "A NOJEKYLL file is a configuration file used when publishing a website via GitHub Pages. It tells GitHub Pages to not use Jekyll to build the associated website. NOJEKYLL files do not contain any data; they are typically stored in a website's root directory."
    ]
  },
  "technical_info": {
    "content": [
      "GitHub Pages is a tool that allows GitHub users to publish websites for themselves and their GitHub projects. Typically, GitHub Pages uses the Jekyll static site generator to build users' websites, prior to publication.",
      "For various reasons, however, users may not want to have GitHub Pages use Jekyll to build their website. For example, those who use Pelican to generate their GitHub Pages website(s) do not need to run their content through Jekyll. In these cases, users can add a NOJEKYLL file to their website's root directory (or another appropriate location). This tells GitHub Pages to not use Jekyll when publishing the user's website."
    ]
  },
  "how_to_open": {
    "instructions": [
      "NOJEKYLL files do not contain any data and are not meant to be opened. For more information on how to use NOJEKYLL files, refer to GitHub's associated blog post."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13514&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}