{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/novabackup",
  "slug": "novabackup",
  "extension": "novabackup",
  "name": ".NOVABACKUP File Extension",
  "type_name": "Nova Launcher Home Screen Backup",
  "summary": "Learn about .NOVABACKUP files and view a list of programs that open them.",
  "developer": "TeslaCoil Software",
  "more_information": {
    "description": [
      "A NOVABACKUP file is a home screen layout created using Nova Launcher, a home screen replacement app for Android. It contains data Nova Launcher uses to load and display a custom Android home screen. Users create NOVABACKUP files from within Nova Launcher, by selecting the app's menu button and then Nova Settings → Backup and Import → Backup."
    ]
  },
  "technical_info": {
    "content": [
      "Nova Launcher is an Android app that allows users to replace the operating system's default home screen with a custom home screen of their own design. For example, users can use Nova Launcher to customize their home screen's icon themes, or to update old Android devices' home screens to include features available on newer devices.",
      "If a user wants to back up and/or share their Nova Launcher-created home screen with another Nova Launcher user, they can save the screen as a NOVABACKUP file. Other users can load the NOVABACKUP file as their initial home screen when they first open Nova Launcher, or they can import the NOVABACKUP file into Nova Launcher using the app's Import option."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a NOVABACKUP file in Nova Launcher (Android), for use as your Android device's home screen. To do so, open Nova Launcher and select the app's menu button. Then, select Nova Settings → Backup and Import → Import. Finally, navigate to and select your NOVABACKUP file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12435&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}