{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/nxtheme",
  "slug": "nxtheme",
  "extension": "nxtheme",
  "name": ".NXTHEME File Extension",
  "type_name": "Nintendo Switch Theme",
  "summary": "Learn about .NXTHEME files and view a list of programs that open them.",
  "developer": "Exelix 11",
  "more_information": {
    "description": [
      "An NXTHEME file is a portion of a custom theme that can be installed on the Nintendo Switch gaming console. It contains a .JPG image and JSON data used to overwrite the appearance of the Switch's home screen, lock screen, or another screen. NXTHEME files are created using Switch Theme Injector and installed using NXThemes."
    ]
  },
  "technical_info": {
    "content": [
      "Gamers who have hacked their Nintendo Switch so they can install homebrew files can use the NXThemes application to install custom Switch themes. These themes are saved in a series of NXTHEME files. Each NXTHEME file contains a 1280 x 720 JPG image and JSON-formatted text used to overwrite a particular Switch screen's appearance. NXThemes can install a custom theme on a user's:",
      "Home screen",
      "Lock screen",
      "User page",
      "All apps page",
      "Settings applet",
      "News applet",
      "Player select applet",
      "NXTHEME files are created using Switch Theme Injector, a Windows and web app. Switch Theme Injector and NXThemes are both available from the SwitchThemeInjector GitHub page.",
      "NOTE: Unofficial Switch themes are sometimes also distributed as .SZS files. However, while SZS files contain copyrighted content, NXTHEME files do not."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an NXTHEME file in the Windows version of Switch Theme Injector to extract the JSON and JPG files it is comprised of. To do so, open Switch Theme Injector, select EXTRACT NXTHEME, and then select OPEN NXTHEME.",
      "To install NXTHEME files on your Nintendo Switch, you must first hack your Switch and install the NXThemes application. Then, you can use NXThemes to install the theme your NXTHEME files contain."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12220&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}