{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/ocb",
  "slug": "ocb",
  "extension": "ocb",
  "name": ".OCB File Extension",
  "type_name": "Oxygen Forensics Cloud Backup",
  "summary": "Learn about .OCB files and view a list of programs that open them.",
  "developer": "Oxygen Forensics",
  "more_information": {
    "description": [
      "An OCB file contains data extracted from a cloud storage account with the Cloud Extractor tool included with Oxygen Forensics Detective. It stores information, such as files, photos, videos, emails, passwords, and messages, passwords, photos, and videos extracted from a cloud storage service, such as Google, iCloud, or other Microsoft."
    ]
  },
  "technical_info": {
    "content": [
      "Corporate investigators, federal agencies, and law enforcement typically use Oxygen Forensics software to collect digital evidence from various digital sources, such as computers, mobile devices, and cloud services. To extract data from a cloud storage service, you must first provide the correct credentials or token in the Detective application; then, you can dump the information and save it as an OCB file for future analysis with Oxygen Forensics software."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an OCB file with Oxygen Forensic Detective, a Windows application that allows you to analyze data extracted from a cloud storage service."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12525&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}