{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/oir",
  "slug": "oir",
  "extension": "oir",
  "name": ".OIR File Extension",
  "type_name": "FV3000 Specimen Image",
  "summary": "Learn about .OIR files and view a list of programs that open them.",
  "developer": "Olympus",
  "more_information": {
    "description": [
      "An OIR file is an image created by an Olympus FV3000 laser scanning microscope. It contains a 2D or 3D image of a scientific specimen. The image may be a complete image of the specimen, or it may be a portion of a composite image."
    ]
  },
  "technical_info": {
    "content": [
      "Scientists use the Olympus FV3000 to examine and create detailed, laser-scanned images of scientific specimens. For example, a biologist might use the FV3000 to image a portion of an animal's brain.",
      "Images created using the FV3000 are saved as OIR files. Typically, each OIR file contains a complete image (which may be tiled to allow for detailed analysis). However, when creating an image larger than 1 GB, the FV3000 splits the image into multiple OIR files. To see the entirety of a split image, you must load all associated OIR files (e.g. for a split image that consists of two files, you must load both Example.oir and Example_00001.oir])."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an OIR file with OME Bio-Formats (multiplatform) or ImageJ (multiplatform). To open an OIR file with ImageJ, you must install the Olympus ImageJ plug-in."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12746&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}