{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/omwaddon",
  "slug": "omwaddon",
  "extension": "omwaddon",
  "name": ".OMWADDON File Extension",
  "type_name": "OpenMW Plug-in",
  "summary": "Learn about .OMWADDON files and view a list of programs that open them.",
  "developer": "OpenMW",
  "more_information": {
    "description": [
      "An OMWADDON file is a game data file used by OpenMW, a third-party game engine update for The Elder Scrolls III: Morrowind. It contains a plug-in that modifies the game in some way. OMWADDON files are similar to .ESP files."
    ]
  },
  "technical_info": {
    "content": [
      "Morrowind is an open-world fantasy role-playing video game published by Bethesda Softworks. The game enjoys a healthy modding community, which has created a series of third-party mods and updates that players can install and use to enhance Morrowind's gameplay.",
      "OpenMW is a game engine that Morrowind modders created to address issues with Morrowind's original game engine. In addition to fixing these issues, OpenMW allows players to install Morrowind mods saved in the OMWADDON format. These mods can modify game graphics, items, mechanics, text, and other aspects of gameplay. To create OMWADDON files, modders use OpenMW-CS, a utility included with OpenMW.",
      "Players install OMWADDON files just as they would Morrowind ESP and .ESM mod files, by placing them in the appropriate game directory. Then, from within OpenMW's game launcher, players can re-arrange their mod files such that Morrowind loads mods in the correct order (e.g. to ensure a mod that contains dependencies is loaded after the mod that contains those dependencies)."
    ]
  },
  "how_to_open": {
    "instructions": [
      "For instructions on how to install the mod an OMWADDON file contains, click here. Note that you must have already installed and set up OpenMW to use OMWADDON files.",
      "You can also open an OMWADDON file with OpenMW-CS, the mod creation utility included with OpenMW, if you want to edit the data it contains."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13357&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}