{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/one",
  "slug": "one",
  "extension": "one",
  "name": ".ONE File Extension",
  "type_name": "OneNote Document",
  "summary": "Learn about .ONE files and view a list of programs that open them.",
  "developer": "Microsoft",
  "how_to_open": {
    "instructions": [
      "You can open ONE files in Microsoft OneNote. To open a ONE file in OneNote for Windows 10 and later versions, you must import the file into your Microsoft OneDrive. To view instructions for how to import a ONE file into OneDrive, click the Microsoft OneNote Notebook Importer link found below.",
      "Mac, iPad, and iPhone users can also open their ONE files in Gorillized Outline, a note-taking application designed for macOS and iOS.",
      "As of April 2020, there is no good way to export OneNote notebooks or the notes they contain out of Microsoft OneNote for Windows 10 and later versions. The best method to move notes out of OneNote is to either manually copy and paste the notes into a word processor document, such as a .DOCX or .PAGES file, or to print each page your notebook includes as a .PDF.",
      "To print a OneNote notebook page as a PDF:",
      "Open your OneNote notebook and select the page you want to print as a PDF.",
      "In the web version of OneNote, select File → Print → Print and set the print destination to Save as PDF. In the Windows version of OneNote, select the hamburger menu (...), select Print, and set the print destination to Microsoft Print to PDF.",
      "MacOS and iOS users can use Gorillized Outline to export OneNote notebooks as ONE files or PDF files. They can store the exported notebooks locally (or in another cloud storage service) and share them with others."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=2945&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/one_2945-2.png",
      "alt": "Screenshot of a .one file in Microsoft OneNote for Windows 10",
      "caption": "ONE file open in Microsoft OneNote for Windows 10"
    }
  ]
}