{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/opb",
  "slug": "opb",
  "extension": "opb",
  "name": ".OPB File Extension",
  "type_name": "Outplayed Backup File",
  "summary": "Learn about .OPB files and view a list of programs that open them.",
  "developer": "Overwolf",
  "more_information": {
    "description": [
      "An OPB file is a backup file created by Overwolf Outplayed, a video-capturing app for gamers. It contains a copy of a user's Outplayed videos, settings, and other data. Users can create and restore OPB files from the Storage screen of Outplayed's Settings menu."
    ]
  },
  "technical_info": {
    "content": [
      "Using Outplayed, Windows gamers can record themselves playing video games. By default, Outplayed stores these recordings in the following directory:",
      "C:/​Users/​UserName/​Videos/​Overwolf/​Outplayed",
      "Optionally, Outplayed users can also enable the app for specific games, customize how the app captures video, and control what notifications the app displays.",
      "If a user wants to back up their Outplayed recordings and settings, they can do so by selecting Settings → Storage → Create backup. This opens the Backup and restore screen, from which the user can:",
      "Save their Outplayed data to an OPB file",
      "Restore the data a previously-created OPB file contains",
      "OPB files are renamed .ZIP files, which contain a Media directory, a metadata.json file, and an outplayed.json file. The Media directory contains a backup of a user's videos. Metadata.json contains a record of the time at which the OPB file was created and the version of Outplayed that created it. Outplayed.json contains a backup of a user's Outplayed settings."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To restore the backup an OPB file contains in Overwolf Outplayed (Windows):",
      "Open Outplayed's Settings menu.",
      "Select Storage → Create backup.",
      "Select Restore.",
      "Either browse to or drag and drop your OPB file.",
      "Select Restore backup → Confirm.",
      "When Outplayed finishes restoring your backup, it will prompt you to relaunch the app. After you do, your restored videos and settings will appear in Outplayed.",
      "If necessary, you can also extract the files an OPB file contains by renaming the file to use the .ZIP extension and then opening it with any Zip-decompression utility."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13608&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/opb_13608.png",
      "alt": "Screenshot of a .opb file in Overwolf Outplayed",
      "caption": "OPB file open in Overwolf Outplayed"
    }
  ]
}