{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/opk",
  "slug": "opk",
  "extension": "opk",
  "name": ".OPK File Extension",
  "type_name": "GCW Zero Open Package",
  "summary": "Learn about .OPK files and view a list of programs that open them.",
  "developer": "N/A",
  "more_information": {
    "description": [
      "An OPK file is a package used to distribute apps to GCW Zero, a Linux-based open source handheld video game. It stores information about an app, such as the app title, description, icon, launch metadata, and manual. OPK files are compressed to save space, which allows them to be more easily transferred."
    ]
  },
  "technical_info": {
    "content": [
      "The easiest method for transferring OPK files to the GCW Zero is using the GCW Zero Manager program. You can also transfer an OPK file from a computer to a GCW Zero device by placing the file on the microSD card of the device. Drag the file into the \"Apps\" folder (if there is no \"Apps\" folder, you can create one) on the microSD card then re-insert the microSD card into the GCW Zero.",
      "Another way to transfer an OPK file is by using an FTP program, such as FlashFXP or FileZilla. Using the FTP program, you can transfer the OPK file to the internal storage of the GCW Zero device.",
      "NOTE: The operating system of the GCW Zero is OpenDingux, which is a Linux distribution for the Dingoo A320/A330."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10927&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}