{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/osp",
  "slug": "osp",
  "extension": "osp",
  "name": ".OSP File Extension",
  "type_name": "OpenShot Video Editor Project File",
  "summary": "Learn about .OSP files and view a list of programs that open them.",
  "developer": "OpenShot Studios",
  "more_information": {
    "description": [
      "An OSP file is a video editing project created by OpenShot Video Editor, an open-source, cross-platform video editor. It contains references to audio, video, and image files and transitions, effects, and sequencing information. OpenShot Video Editor users can save and load OSP projects and export them to widely supported video formats."
    ]
  },
  "technical_info": {
    "content": [
      "OpenShot Video Editor is a non-linear video editor, which means that users can access and edit any frame in a video without destroying the original copy of the frames. The software uses FFmpeg libraries, which provide support for several different audio, video, and image formats. You can import multimedia files into an OSP project by selecting File → Import Files.",
      "When you first save a project with OpenShot Video Editor (File → Save Project), the software creates an OSP file to store the project information (e.g., timeline editing information, settings, and references to the locations of imported multimedia files). After saving the OSP file, you can close it and re-open it to continue editing the project without losing your progress."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an OSP file with OpenShot Video Editor in Windows, macOS, and Linux. To open an OSP file, select File → Open Project... from the program's menu bar. This will load your project and its related media in OpenShot.",
      "If you are having trouble opening an OSP file with OpenShot Video Editor, or you want to examine the text contained within an OSP file, you can also open it using any text editor, such as Microsoft Notepad (Windows), Apple TextEdit (Mac), or GitHub Atom (cross-platform). However, opening an OSP file with a text editor will not display the project the same as opening it with OpenShot Video Editor."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "OpenShot Video Editor can convert OSP files to various file types, including the following formats:",
      ".MP4 -MPEG-4 Video",
      ".AVI - Audio Video Interleave File",
      ".MKV - Matroska Video",
      ".MOV - Apple QuickTime Movie",
      ".WEBM - WebM Video",
      ".MP3 - MP3 Audio",
      ".OGG - Ogg Vorbis Audio",
      ".GIF - Graphical Interchange Format",
      ".XML - XML File"
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "GitHub Atom",
        "url": "https://fileinfo.com/software/github/atom"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=5387&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/osp_5387.jpg",
      "alt": "Screenshot of a .osp file in OpenShot Video Editor 3",
      "caption": "OSP file open in OpenShot Video Editor 3"
    }
  ]
}