{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/osz2",
  "slug": "osz2",
  "extension": "osz2",
  "name": ".OSZ2 File Extension",
  "type_name": "osu! Submitted Beatmap File",
  "summary": "Learn about .OSZ2 files and view a list of programs that open them.",
  "developer": "peppy",
  "more_information": {
    "description": [
      "An OSZ2 file is a beatmap file used by osu!, a free rhythm game in which players click and drag on-screen items in time with music. It contains a game level that can be played in osu!. OSZ2 files are created when a player uploads a custom level to the osu! website. They are stored in the game's SubmissionCache directory."
    ]
  },
  "technical_info": {
    "content": [
      "osu! allows players to create their own custom levels, which can include custom audio, graphics, and prompts. Typically, these levels are saved as OSZ files. However, when a player submits their custom level to osu!'s website, the level is submitted as an OSZ2 file. The game also saves a local copy of these files.",
      "Unlike OSZ files, OSZ2 files are not Zip-compressed files. This prevents players from decompressing the files and editing their contents. OSZ2 levels can be edited only in osu!, and not via File Explorer and other non-osu! applications.",
      "At one point, it was thought that the OSZ2 format would become osu!'s primary beatmap format. However, players seem to prefer the OSZ format, as they enjoy the ability to edit levels outside osu!."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an OSZ2 file in osu! (Windows). To do so, click and drag your OSZ2 file into the osu! game window. osu! will then add the file to its Songs folder.",
      "You may also be able to open OSZ2 files in some osu! variants. For example, osu!mac (Mac) allows players to import OSZ2-based levels."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12117&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}