{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/otf",
  "slug": "otf",
  "extension": "otf",
  "name": ".OTF File Extension",
  "type_name": "OpenType Font",
  "summary": "Learn about .OTF files and view a list of programs that open them.",
  "developer": "Microsoft and Adobe Systems",
  "more_information": {
    "description": [
      "An OTF file is a font saved in the OpenType format developed by Microsoft and Adobe. The OpenType format combines aspects of the PostScript (.PS) and TrueType (.TTF) font formats. OTF fonts are fully scalable, meaning their characters can be resized without losing quality."
    ]
  },
  "technical_info": {
    "content": [
      "In the 1990s, Microsoft set out to produce a competitor to Apple's TrueType font format. In collaboration with Adobe, Microsoft produced the OpenType font, or OTF, format. The OpenType format is similar to the TrueType format, except that it includes additional data structures that determine how fonts appear and behave.",
      "In the early 2000s, the OpenType format became an open font standard. Thus, most computer systems can now recognize and install OTF fonts.",
      "To use an OTF file as a font, you must first install it on your system. In Windows, you install fonts by placing them in the C:/​Windows/​Fonts directory. In macOS, you install fonts by opening them in Apple Font Book and selecting the Install Font button."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an OTF file in Microsoft Windows Font Viewer (Windows) or Apple Font Book (Mac). Before opening an OTF file in Windows Font Viewer, you must place the file in the C:/​Windows/​Fonts directory. Otherwise, Windows will not recognize the file as a valid font file.",
      "While it is more difficult to install an OTF font on an Android device than a Windows or Mac PC, you can do so. iFont is one application that allows users to install and use OTF fonts on Android devices."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=197&b=1"
      },
      {
        "name": "FontForge",
        "url": "https://fileinfo.com/software/fontforge/fontforge"
      },
      {
        "name": "FontForge",
        "url": "https://fileinfo.com/software/fontforge/fontforge"
      },
      {
        "name": "FontForge",
        "url": "https://fileinfo.com/software/fontforge/fontforge"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/otf_197.png",
      "alt": "Screenshot of a .otf file in Microsoft Windows Font Viewer",
      "caption": "OTF file open in Microsoft Windows Font Viewer"
    }
  ]
}