{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/p8",
  "slug": "p8",
  "extension": "p8",
  "name": ".P8 File Extension",
  "type_name": "PICO-8 Source Code File",
  "summary": "Learn about .P8 files and view a list of programs that open them.",
  "developer": "Lexaloffle",
  "more_information": {
    "description": [
      "A P8 file contains source code written in PICO-8, which is a language used to program 8-bit retro-style games that can be played with the PICO-8 virtual fantasy gaming console. PICO-8 source code uses the Lua scripting language syntax and may include references to sprites, sound effects, maps, and music data that make up the game."
    ]
  },
  "technical_info": {
    "content": [
      "You will most likely only encounter a P8 file if you are developing a game in PICO-8 and save the source code as a \"cartridge.\" When saving the \"cartridge,\" PICO-8 creates the P8 file to store the source code. You may also acquire the P8 file if you download the source code of a PICO-8 game or receive it from another PICO-8 developer.",
      "P8 files can be edited with PICO-8, which allows you to run the game locally and make builds of the game. PICO-8 comes with several editors, including Code, Sprite, Map, SFX, and Music, that enable you to modify specific parts of the game stored in the P8 file.",
      "You can also modify a P8 file with a text editor, such as Microsoft Notepad or Apple TextEdit. However, plain text editors do not provide the same syntax-highlighting features as PICO-8.",
      "P8 files may also be compiled with PICO-8 into the binary .P8.PNG format. This format is used to store games that can be shared among other gamers and played in PICO-8.",
      "NOTE: PICO-8 is a cross-platform program that allows you to create, play, and share tiny retro-style games. The games can be saved as \"virtual cartridges\" with .p8 or .p8.png file extensions."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11379&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/p8_11379.png",
      "alt": "Screenshot of a .p8 file in Microsoft Notepad",
      "caption": "P8 file open in Microsoft Notepad"
    }
  ]
}