{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/pages",
  "slug": "pages",
  "extension": "pages",
  "name": ".PAGES File Extension",
  "type_name": "Apple Pages Document",
  "summary": "Learn about .PAGES files and view a list of programs that open them.",
  "developer": "Apple",
  "more_information": {
    "description": [
      "A PAGES file is a document created by Apple Pages, a word processor and page layout program for macOS and iOS. It saves a document, such as a report, poster, resume, newsletter, book, certificate, or brochure that was created from a blank page or built from a template. PAGES documents typically contain text and page formatting information, but may also include images, tables, graphs, and charts."
    ]
  },
  "technical_info": {
    "content": [
      "Apple Pages is a word processor similar to Microsoft Word, and is included in the iWork office suite, along with Numbers and Keynote, that is bundled with macOS. You can use Pages to compose various types of documents and save them as PAGES files or convert them to another format.",
      "You most likely will only encounter a PAGES file if you use an Apple device, such as a MacBook or iPad, and save documents with the Pages application. However, you may also encounter a PAGES file if you do not use an Apple device. For example, a co-worker or friend who uses Pages on a Mac may share a letter saved as a PAGES file with you.",
      "Pages saves documents as PAGES files by default, much like Word saves documents as DOCX files by default. To create a PAGES file with Pages on a Mac, select File → New..., choose a template or a blank document, then select File → Save...."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a PAGES file with Apple Pages on a Mac or iOS device. This is the best option since Pages provides native viewing and editing capabilities.",
      "If you do not have access to Pages, you can upload PAGES files to your iCloud online account and view and edit the document in the iCloud version of Pages. Here, you can view and edit the document, and download a copy of the document as a PAGES, PDF, DOCX, or EPUB file.",
      "Since PAGES files are stored in .ZIP format, you may also manually view a PAGES file's contents by extracting them with a Zip-decompression utility. This is especially helpful for Windows users who cannot install Pages and need to view the contents of a PAGES document. Contents that can be extracted from a PAGES file include a .JPG file and an optional PDF file that provide a preview for the document.",
      "To manually view the contents of a PAGES file, follow these instructions:",
      "Rename the .pages file extension to .zip.",
      "Extract the resulting ZIP file with a Zip decompression utility, such as Microsoft File Explorer, Corel WinZip, or Apple Archive Utility. The extracted files should contain a folder named QuickLook. Navigate to this folder.",
      "In the QuickLook folder, open the file Thumbnail.jpg. This file only gives a preview of the first page of the document, but can still be helpful in some situations.",
      "In the QuickLook folder, there may also be a PDF file named Preview.pdf. Open this file to view a preview of the entire PAGES document. Note that the PDF file is only created if the user chose to save the original document with additional preview information in Pages."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "Apple Pages can convert PAGES files to several different formats. In the macOS version, select File → Export To, then choose one of the following formats:",
      ".DOCX, .DOC - Microsoft Word Document",
      ".PDF - Portable Document Format",
      ".EPUB - Open eBook",
      ".RTF, .RTFD - Rich Text Format",
      ".TXT - Plain Text",
      "Pages '09 Document",
      "In the iCloud version, select the ... button, select Download a Copy..., and export your file as a .PDF, .DOCX, or .EPUB file.",
      "You can also convert PAGES files to PDF files with Apple Preview by selecting File → Export as PDF...."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Microsoft Word",
        "url": "https://fileinfo.com/software/microsoft/word"
      },
      {
        "name": "Numbers",
        "url": "https://fileinfo.com/software/apple/numbers"
      },
      {
        "name": "Keynote",
        "url": "https://fileinfo.com/software/apple/keynote"
      },
      {
        "name": "Apple Pages",
        "url": "https://fileinfo.com/software/apple/pages"
      },
      {
        "name": "Apple Pages",
        "url": "https://fileinfo.com/software/apple/pages"
      },
      {
        "name": "Apple Preview",
        "url": "https://fileinfo.com/software/apple/preview"
      },
      {
        "name": "Apple Pages",
        "url": "https://fileinfo.com/software/apple/pages_for_ios"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/pages_1244.png",
      "alt": "Screenshot of a .pages file in Apple Pages 10.1",
      "caption": "PAGES file open in Apple Pages 10.1"
    }
  ]
}