{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/pdc",
  "slug": "pdc",
  "extension": "pdc",
  "name": ".PDC File Extension",
  "type_name": "Safeguard PDF Security Protected PDF",
  "summary": "Learn about .PDC files and view a list of programs that open them.",
  "developer": "Locklizard",
  "more_information": {
    "description": [
      "A PDC file is an encrypted .PDF file created by Locklizard Safeguard PDF Security. It is copy-protected to prevent unauthorized users from opening it. Businesses sometimes email PDC files and associated Locklizard Safeguard PDF Viewer licenses (.LLV files) to users."
    ]
  },
  "technical_info": {
    "content": [
      "Locklizard Safeguard PDF Security is a Windows application that allows companies to encrypt and copy-protect PDF documents, so unauthorized users cannot view, modify, print, or take screenshots of the documents' contents. Safeguard PDF Security saves these protected PDF files as PDC files.",
      "Each PDC file is encrypted using AES 256-bit encryption and Digital Rights Management (DRM) controls, which specify how authorized users can open the file, as well as what actions they can take after opening the file. Within a company, PDC files are often locked to specific users or devices. When sent outside a company, a PDC file is typically accompanied by an LLV file, which is a license file that allows the user who received the PDC file to open it with Locklizard Safeguard PDF Viewer."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To open a PDC file, you must be authorized to do so. If you've been sent a PDC file via email, it should be accompanied by an LLV file. To open your PDC file:",
      "Install Locklizard Safeguard PDF Viewer.",
      "Double-click the LLV file you received.",
      "Double-click your PDC file.",
      "The PDC file will then open in Locklizard PDC Viewer.",
      "If your PDC file is not accompanied by an LLV file, you should reach out to the organization that sent you the PDC file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=2863&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/pdc_2863.png",
      "alt": "Screenshot of a .pdc file in Locklizard Safeguard PDF Viewer",
      "caption": "PDC file open in Locklizard Safeguard PDF Viewer"
    }
  ]
}