{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/pdf",
  "slug": "pdf",
  "extension": "pdf",
  "name": ".PDF File Extension",
  "type_name": "Portable Document Format File",
  "summary": "Learn about .PDF files and view a list of programs that open them.",
  "developer": "Adobe",
  "more_information": {
    "description": [
      "A PDF file is a widely used document type that maintains the original layout and formatting across different devices and operating systems. It is often used for sharing documents, such as reports, contracts, manuals, or forms, ensuring that the content appears the same for all users. PDF files can include text, images, annotations, and even interactive elements (e.g., buttons and checkboxes), and users typically create them from other file formats, such as Word .DOCX documents, Excel .XLSX spreadsheets, and images."
    ]
  },
  "technical_info": {
    "content": [
      "You may encounter PDF files in various ways, whether downloading a document from a website or receiving a document from a co-worker or friend as an email attachment. PDF files also preserve fonts and formatting electronically across multiple platforms and appear the same on the screen as when printed on paper.",
      "You may create PDF files with various programs, including word processors, image editors, and PDF file utilities like Adobe Acrobat. You may also create PDF files from documents using the Print dialog in Windows and macOS.",
      "For example, in Windows, you can select File → Print... or click the printer icon to open the Print dialog within an application. Then, select Microsoft Print to PDF from the list of available printers in the Print dialog box and click Print to create the PDF file. In macOS, you can choose Print... from the application's File menu, and then select Save as PDF... from the PDF dropdown menu in the window.",
      "NOTE: View the PDF definition for more information."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open and view PDF files with a large number of applications, most notably, Adobe Acrobat Reader (multiplatform) and Adobe Acrobat (multiplatform), which can also edit them. Nitro Pro (Windows) and Smile PDFpenPro (macOS) are other applications that provide PDF viewing and editing capabilities.",
      "Other options for viewing PDF files include Microsoft Word (Windows and macOS), Apple Preview (bundled with macOS), Foxit Reader, and web browsers, such as Google Chrome (multiplatform) and Microsoft Edge (multiplatform), which includes annotation capabilities.",
      "On mobile devices, you can view PDF files with Adobe Reader (Android and iOS), Apple Books (iOS), Apple Pages (iOS), Google Play Books (Android), and in web browsers, such as Chrome and Safari."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "Several applications, including Adobe Acrobat, Microsoft Word, Apple Preview, and Nitro Pro, can convert PDF files to other formats.",
      "Adobe Acrobat can convert PDF files to the following formats:",
      ".DOCX - Word Document",
      ".XLSX - Excel Spreadsheet",
      ".PPTX - PowerPoint Presentation",
      ".JPEG - JPEG Image",
      ".PNG - PNG Image",
      ".TIFF - TIFF Image",
      ".HTML - HTML Webpage",
      "Adobe also provides free online PDF to Word, PDF to Excel, PDF to PowerPoint, and PDF to JPG converters."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Adobe Acrobat Reader",
        "url": "https://fileinfo.com/software/adobe/reader"
      },
      {
        "name": "Adobe Acrobat",
        "url": "https://fileinfo.com/software/adobe/acrobat"
      },
      {
        "name": "Nitro Pro",
        "url": "https://fileinfo.com/software/nitro_software/nitro_pro"
      },
      {
        "name": "Microsoft Word",
        "url": "https://fileinfo.com/software/microsoft/word"
      },
      {
        "name": "Apple Preview",
        "url": "https://fileinfo.com/software/apple/preview"
      },
      {
        "name": "Google Chrome",
        "url": "https://fileinfo.com/software/google/chrome"
      },
      {
        "name": "Microsoft Edge",
        "url": "https://fileinfo.com/software/microsoft/edge"
      },
      {
        "name": "File Viewer Plus",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=74"
      },
      {
        "name": "Adobe Acrobat DC",
        "url": "https://fileinfo.com/software/adobe/acrobat"
      },
      {
        "name": "Adobe Acrobat Reader DC",
        "url": "https://fileinfo.com/software/adobe/reader"
      },
      {
        "name": "Microsoft Edge",
        "url": "https://fileinfo.com/software/microsoft/edge"
      },
      {
        "name": "Microsoft Word 365",
        "url": "https://fileinfo.com/software/microsoft/word"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/pdf_74.png",
      "alt": "Screenshot of a .pdf file in Adobe Acrobat Pro DC 2021",
      "caption": "PDF file open in Adobe Acrobat Pro DC 2021"
    }
  ]
}