{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/pdrproj",
  "slug": "pdrproj",
  "extension": "pdrproj",
  "name": ".PDRPROJ File Extension",
  "type_name": "PowerDirector for Mobile Project",
  "summary": "Learn about .PDRPROJ files and view a list of programs that open them.",
  "developer": "CyberLink",
  "more_information": {
    "description": [
      "A PDRPROJ file is a video editing project created by the mobile version of CyberLink PowerDirector, which is available for Android and iOS tablets. It contains data and metadata used to load a project, including the project's video, audio, and effect layers, in PowerDirector for mobile. From within PowerDirector for mobile, users can upload PDRPROJ files to the CyberLink Cloud, from which they can import the files into PowerDirector for Windows and macOS."
    ]
  },
  "technical_info": {
    "content": [
      "The mobile version of CyberLink PowerDirector allows Android and iOS tablet users to combine video, audio, images, and other elements into polished movies. PowerDirector for mobile features a streamlined user interface designed specifically for tablets, does not include all the features that PowerDirector for PC includes, and saves users' video editing projects as PDRPROJ files, instead of .PDS files.",
      "Though they are used to open video editing projects in PowerDirector for mobile, PDRPROJ files do not actually contain any video, audio, or image assets. Instead, they contain text-based references to the locations at which assets are stored. If you move an asset used in a PowerDirector for mobile project, your PDRPROJ file may not open correctly in PowerDirector for mobile.",
      "After a user has finished editing their video in PowerDirector for mobile, they can share the video on Facebook or YouTube, export the video as an .MP4 file, or upload their video project (and its assets) to the CyberLink Cloud. Users who upload their PDRPROJ files to the CyberLink Cloud can import those files into PowerDirector for Windows and macOS, to take advantage of that application's more advanced editing tools."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open PDRPROJ files in the mobile version of CyberLink PowerDirector (Android, iOS). If your PDRPROJ file is stored in the CyberLink Cloud, you can also import the file into the PC version of CyberLink PowerDirector (Windows, Mac).",
      "To import a PDRPROJ file stored in the CyberLink Cloud into PowerDirector for PC, select File → Download Project from CyberLink Cloud.... from PowerDirector for PC's menu bar. Then, select your PDRPROJ file and click the Download button."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "CyberLink PowerDirector",
        "url": "https://fileinfo.com/software/cyberlink/powerdirector"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12004&b=1"
      },
      {
        "name": "CyberLink PowerDirector 365",
        "url": "https://fileinfo.com/software/cyberlink/powerdirector"
      },
      {
        "name": "CyberLink PowerDirector 365",
        "url": "https://fileinfo.com/software/cyberlink/powerdirector"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}