{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/pjpeg",
  "slug": "pjpeg",
  "extension": "pjpeg",
  "name": ".PJPEG File Extension",
  "type_name": "Progressive JPEG Image",
  "summary": "Learn about .PJPEG files and view a list of programs that open them.",
  "developer": "N/A",
  "more_information": {
    "description": [
      "A PJPEG file is a bitmap image created in the Progressive JPEG format (PJPEG), which stores multiple \"scans\" of an image a web browser displays progressively at a higher quality to provide the user a preview of the image as it loads. Since PJPEG files are a variation of the baseline JPEG format, you can open them by renaming the .pjpeg extension to .jpg."
    ]
  },
  "technical_info": {
    "content": [
      "The progressive JPEG format allows you to preview an image in a web browser as it loads the image instead of waiting for it to load completely, like with images saved in the baseline JPEG format. For example, if your internet connection is slow, you might wait 20 seconds for an image saved in the baseline JPEG format to completely load line by line on a blank space on the page.",
      "However, a web browser loading a PJPEG image loads scans of the image that progressively increase in quality with each pass. The first scan is a low-resolution version of the image (likely blurry and pixelated) that improves (becomes sharper and less pixelated) as the browser loads the scans (typically 3 to 5).",
      "NOTE: PJPEG files more often use the .pjpg extension (.PJPG files). However, both files are rare, and most progressive JPEG image files use the .jpg extension (.JPG files)."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a PJPEG file with applications that support the JPEG format, including Microsoft Photos in Windows and Apple Preview in macOS. If the app does not open the file, you may need to rename the .pjpeg extension to .jpg.",
      "Additionally, if the program still does not open the PJPEG file renamed with the .jpg extension, you can open it with Microsoft Photos or Apple Preview, then convert it to a different format to view it with other programs."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "Image editors that support the JPEG format (most image editors) can convert PJPEG files to other formats, such as Baseline JPEG images or .PNG. The image editors may detect the PJPEG format and open the PJPEG file automatically. However, you may need to rename the .pjpeg extension to .jpg, then open it with the image editor.",
      "For example, to convert a PJPEG file with Microsoft Photos:",
      "Rename the .pjpeg extension to .jpg.",
      "Open the renamed file with Photos.",
      "Select the ellipsis \"See more\" icon, then choose Save as."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Microsoft Photos",
        "url": "https://fileinfo.com/software/microsoft/photos"
      },
      {
        "name": "Apple Preview",
        "url": "https://fileinfo.com/software/apple/preview"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=6124&b=1"
      },
      {
        "name": "Microsoft Internet Explorer",
        "url": "https://fileinfo.com/software/microsoft/internet_explorer"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/pjpeg_6124.jpg",
      "alt": "Screenshot of a .pjpeg file in Apple Preview 11",
      "caption": "PJPEG file open in Apple Preview 11"
    }
  ]
}