{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/ppdf",
  "slug": "ppdf",
  "extension": "ppdf",
  "name": ".PPDF File Extension",
  "type_name": "Rights Management Protected File",
  "summary": "Learn about .PPDF files and view a list of programs that open them.",
  "developer": "Microsoft",
  "more_information": {
    "description": [
      "A PPDF file is a file protected with Microsoft Rights Management (RMS), an application used to protect a user's digital information. It contains a user's file, such as an .XLSX or .PPT file, that has been encrypted for security purposes. PPDF files are protected as read-only, which means users cannot edit them."
    ]
  },
  "technical_info": {
    "content": [
      "PPDF files are similar to generically protected .PFILE files, which are more commonly created by RMS. PTXT and PJPG files are also created by RMS to protect text and image files.",
      "The two most common ways you will come across a PPDF file is by finding it on your computer or receiving it as an email attachment from an RMS user. You must install RMS to open the file then you can simply double-click the file to open it. You will most likely be prompted to confirm that you are authorized to view the file with a username and password unless your credentials are cached.",
      "NOTE: Microsoft Rights Management is also known as Azure Information Protection."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10459&b=1"
      },
      {
        "name": "Nitro Pro",
        "url": "https://fileinfo.com/software/nitro_software/nitro_pro"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}