{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/ppenc",
  "slug": "ppenc",
  "extension": "ppenc",
  "name": ".PPENC File Extension",
  "type_name": "Privacy Protector Encrypted File",
  "summary": "Learn about .PPENC files and view a list of programs that open them.",
  "developer": "Ashampoo",
  "more_information": {
    "description": [
      "A PPENC file is a file that has been encrypted and password-protected by Ashampoo Privacy Protector. It contains a folder, document, image, video, or other file a user has chosen to encrypt. PPENC files are encrypted with AES-256 encryption."
    ]
  },
  "technical_info": {
    "content": [
      "Ashampoo Privacy Protector is a Windows app you can use to encrypt and password-protect folders and files, so other users cannot access them. For example, if you have a folder of sensitive financial information that you don't want to allow others to access, you can use Privacy Protector to encrypt that folder and the files it contains.",
      "After Privacy Protector encrypts a folder or file, it renames that folder or file to use the PPENC extension. This reminds users that the folder or file has been encrypted, and must be decrypted (and unlocked, if password-protected) before it can be opened and used.",
      "NOTE: Ashampoo Privacy Protector was later renamed to Ashampoo Magical Security."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can use Ashampoo Privacy Protector (Windows) to decrypt PPENC files and access the folder or file they contain. If your PPENC file is password-protected, you must enter the password used to encrypt it."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13285&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}