{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/ppp",
  "slug": "ppp",
  "extension": "ppp",
  "name": ".PPP File Extension",
  "type_name": "Serif PagePlus Document",
  "summary": "Learn about .PPP files and view a list of programs that open them.",
  "developer": "Serif",
  "more_information": {
    "description": [
      "A PPP file is a document created by Serif PagePlus, a British desktop publishing program for Windows. It may contain text, images, charts, tables, and multiple pages. The PPP file format was discontinued in 2017, when Serif replaced PagePlus with Affinity Publisher."
    ]
  },
  "technical_info": {
    "content": [
      "Serif PagePlus was a long-running desktop publishing program available for Windows. Serif released the first version of PagePlus in 1990.",
      "Throughout its many versions, PagePlus saved users' documents as PPP files. The PPP format changed over time, making some versions of PPP files incompatible with some versions of PagePlus. However, every PPP file contains some sort of document created using a version of PagePlus, such as a report, flyer, or manuscript. PagePlus users can also export PPP files as .PDF files, email messages, and webpages.",
      "Serif released the last version of PagePlus, PagePlus X9, in November 2015. In 2017, Serif replaced PagePlus with a new desktop publishing program, named Affinity Publisher.",
      "There is no easy way to import PagePlus PPP files into Affinity Publisher. Serif recommends that users either:",
      "Copy the contents of their PPP file, create a new Affinity Publisher document, and paste the PPP file's contents into the Affinity Publisher document",
      "Export the PPP file from PagePlus as a .PDF file, then import the PDF into Affinity Publisher"
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a PPP file in Serif PagePlus (Windows). Serif still hosts downloads for PagePlus X9 on its website, which you can access using the link below. However, note that you will need a valid product key to install PagePlus X9."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=2523&b=1"
      },
      {
        "name": "CyberLink PowerProducer 6",
        "url": "https://fileinfo.com/software/cyberlink/powerproducer"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/ppp_11866.png",
      "alt": "Screenshot of a .ppp file in PhotoPad Photo Editor",
      "caption": "PPP file open in PhotoPad Photo Editor"
    }
  ]
}