{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/pqa",
  "slug": "pqa",
  "extension": "pqa",
  "name": ".PQA File Extension",
  "type_name": "Palm Query Application",
  "summary": "Learn about .PQA files and view a list of programs that open them.",
  "developer": "Palm",
  "more_information": {
    "description": [
      "A PQA file is a Palm Query Application database. PQA files are similar to .PDB files, except they contain content that is accessed via the Internet. On Palm OS devices, PQA files are opened using the Web Clipping Application Viewer program."
    ]
  },
  "technical_info": {
    "content": [
      "Various Palm OS applications store information in PDB files, which are local database files. PQA files are PDB files that contain not only local data, but data retrieved from the Internet at the time the database is opened. While PDB files are typically opened using whatever application created them, PQA files are always opened using the Palm OS Web Clipping Application Viewer. PQA files are created using the Web Clipping Application builder.",
      "NOTE: With the release of version 4 of Palm OS, Palm began referring to PQA files as Web Clipping Applications and WCA files. However, the files continued to use the .pqa file extension."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a PQA file on a Palm OS device using the Web Clipping Application Viewer. You may also be able to open the file in Palm Desktop (Windows, Mac). In both cases, however, you will not be able to access the Internet-based data your PQA file is meant to retrieve, as Palm's servers are no longer active."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Palm Desktop",
        "url": "https://fileinfo.com/software/palm/desktop"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12258&b=1"
      },
      {
        "name": "Palm Desktop",
        "url": "https://fileinfo.com/software/palm/desktop"
      },
      {
        "name": "Palm Desktop",
        "url": "https://fileinfo.com/software/palm/desktop"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}