{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/prfpset",
  "slug": "prfpset",
  "extension": "prfpset",
  "name": ".PRFPSET File Extension",
  "type_name": "Premiere Pro Filter Preset File",
  "summary": "Learn about .PRFPSET files and view a list of programs that open them.",
  "developer": "Adobe Systems",
  "more_information": {
    "description": [
      "A PRFPSET file is a video effect preset file used by Adobe Premiere Pro, a professional video editing and production application. It contains effect settings, such as motion, opacity, and time remapping values, in the XML standard. PRFPSET files can be saved and applied to other video clips."
    ]
  },
  "technical_info": {
    "content": [
      "Premiere Pro presets save you time by saving the settings of an effect. After saving the effect preset you can apply it to future video clips instead of having to recreate the effect from scratch. PRFPSET files also allow you to easily share effects with other Premiere Pro users.",
      "NOTE: To export a PRFPSET file, open the \"Effects\" pane in Premiere Pro, choose the preset you would like to export, click the three-line hamburger icon (or right-click the preset in the pane), and select Export Presets...."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open PRFPSET files with Adobe Premiere Pro. To import a PRFPSET file, open the \"Effects\" pane in Premiere Pro, click the three-line hamburger icon (or right-click in the pane), and select Import Presets....",
      "You can also open PRFPSET files with an XML or source code editor since the file stores its information in the XML standard. However, the file is not meant to be manually edited with an XML editor since modifications may break the preset."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=6238&b=1"
      },
      {
        "name": "Adobe Premiere Pro 2023",
        "url": "https://fileinfo.com/software/adobe/premiere_pro"
      },
      {
        "name": "Adobe Premiere Pro 2023",
        "url": "https://fileinfo.com/software/adobe/premiere_pro"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/prfpset_6238.png",
      "alt": "Screenshot of a .prfpset file in Microsoft Visual Studio Code 1.6",
      "caption": "PRFPSET file open in Microsoft Visual Studio Code 1.6"
    }
  ]
}