{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/pro6x",
  "slug": "pro6x",
  "extension": "pro6x",
  "name": ".PRO6X File Extension",
  "type_name": "ProPresenter 6 Bundle File",
  "summary": "Learn about .PRO6X files and view a list of programs that open them.",
  "developer": "Renewed Vision",
  "more_information": {
    "description": [
      "A PRO6X file is a Zip-compressed bundle created with ProPresenter 6, which is a program used to assemble productions for church worship services, concerts, conferences, and sporting events. It contains one or more .PRO6 documents along with any media files included in the presentation or playlist selected. PRO6X files are helpful for archival purposes and for transferring playlists between computers running ProPresenter."
    ]
  },
  "technical_info": {
    "content": [
      "You will most likely only encounter PRO6X files if you use ProPresenter to display complex presentations and export a presentation with the media files featured in it. The presentation may be a slideshow with multiple slides of images and videos, a song with multiple slides for verses and choruses and looping video, or another type of custom presentation with media.",
      "PRO6X files are similar to PRO6 files but are packaged with the media files included in the presentation (PRO6 files only include references to the directory location of the media files in the presentation). The media may be video, image, or audio files, such as .MOV, .MP4, .JPG, .PNG, or .MP3 files. This is helpful for keeping a presentation fully intact when exporting it.",
      "To export a presentation with the media included in it, select File → Export Document → As Bundle.... You can also right-click an existing document in the Library and select \"Export ProPresenter Bundle.\" To import a PRO6X file in ProPresenter, select File → Import → Import File....",
      "NOTE: Since PRO6X files are saved in a compressed ZIP format, you can also manually open the file with a Zip decompression utility and extract the presentation document(s) and media files."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11443&b=1"
      },
      {
        "name": "Renewed Vision ProPresenter",
        "url": "https://fileinfo.com/software/renewed_vision/propresenter"
      },
      {
        "name": "Renewed Vision ProPresenter",
        "url": "https://fileinfo.com/software/renewed_vision/propresenter"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/pro6x_11443.jpg",
      "alt": "Screenshot of a .pro6x file in Renewed Vision ProPresenter 6",
      "caption": "PRO6X file open in Renewed Vision ProPresenter 6"
    }
  ]
}