{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/protondoc",
  "slug": "protondoc",
  "extension": "protondoc",
  "name": ".PROTONDOC File Extension",
  "type_name": "Proton Docs Document",
  "summary": "Learn about .PROTONDOC files and view a list of programs that open them.",
  "developer": "Proton",
  "more_information": {
    "description": [
      "A PROTONDOC file is a document created by Proton Docs, an online word processor included with Proton Drive. It stores a text document in an encrypted container format that users can edit and collaborate on within Proton Docs. PROTONDOC files are stored directly in a user's Proton Drive account, and the user will likely never see the .protondoc file extension."
    ]
  },
  "technical_info": {
    "content": [
      "Proton Docs is a web-based document editor integrated into Proton Drive that allows users to create, edit, and collaborate on text documents with end-to-end encryption. Proton Drive is Proton's encrypted cloud storage service, designed to protect files and documents from unauthorized access while enabling private sharing and syncing across devices.",
      "When you create a new document in Proton Drive using the built-in Proton Docs editor, the app saves it as a PROTONDOC file. If you open an existing text-based file, such as a .DOCX or .TXT, in Proton Docs, the app generates a new PROTONDOC version for editing within the encrypted environment."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open PROTONDOC files with the Proton Docs editor included with Proton Drive (available online and as an Android or iOS app). However, you will likely not see the .protondoc file extension since Proton Drive uses it internally."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "Proton Docs (included with Proton Drive) can convert PROTONDOC files to several file types, including the following formats:",
      ".DOCX - Microsoft Word Document",
      ".TXT - Plain Text File",
      ".PDF - Portable Document Format"
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13853&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/protondoc_13853.png",
      "alt": "Screenshot of a .protondoc file in Proton Drive",
      "caption": "PROTONDOC file open in Proton Drive"
    }
  ]
}