{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/psdc",
  "slug": "psdc",
  "extension": "psdc",
  "name": ".PSDC File Extension",
  "type_name": "Adobe Photoshop Cloud Document",
  "summary": "Learn about .PSDC files and view a list of programs that open them.",
  "developer": "Adobe",
  "more_information": {
    "description": [
      "A PSDC file is an Adobe Photoshop document saved in the Adobe Photoshop Document Cloud (PSDC) format. It contains an image in the same format as a .PSD file, including layers, annotations, and effects, but is stored in the cloud via Adobe's cloud documents system. Photoshop automatically updates the PSDC file when a user opens and modifies it on different devices."
    ]
  },
  "technical_info": {
    "content": [
      "Adobe introduced the PSDC format in November 2019 when it released Photoshop for iPad and Photoshop CC 2020 for Windows and macOS. The purpose of the format is to allow users to work on the same PSD document on their computer or iPad and have their modifications synced so the document is always up-to-date.",
      "The PSDC file format is the same as the PSD format, which includes support for image layers, adjustment layers, layer masks, annotations, and other Photoshop-specific elements. However, the PSDC format also supports caching of edits made to a document when a user works on it offline. Then, the changes are synced when the user connects to the Internet again.",
      "To create a PSDC file in Adobe Photoshop, select File → Save or Save As.... If you are prompted to save the document on your computer, click the Save to cloud documents button, name the PSDC file, then click Save. If you are prompted to save the document to your Cloud documents storage space, name the PSDC file, then click Save."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a PSDC file with Adobe Photoshop (multiplatform). To open a PSDC file saved in your Adobe Cloud account with Photoshop, select File → Open..., click Open cloud documents, and choose the PSDC file.",
      "The PSDC file format supports incremental backup and restore. To view the version history of your Adobe cloud PSDC document, select File → Version History (versions expire after 30 days unless you mark them for preservation).",
      "You can also sign in to Adobe Assets Web with your Adobe account, then select Files → Cloud documents, choose a PSDC file, and click Timeline to view all the saved versions of the document."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "Adobe Photoshop can convert PSDC files to many file types, including the following formats:",
      ".PSD - Adobe Photoshop Document",
      ".PSB - Photoshop Large Document Format",
      ".PDF - Portable Document Format",
      ".JPG - JPEG Image",
      ".PNG - Portable Network Graphic",
      ".TIF - Tagged Image File Format",
      ".GIF - Graphical Interchange Format",
      ".WEBP - WebP Image",
      ".AI - Adobe Illustrator Artwork",
      ".BMP - Bitmap Image",
      ".DCM - DICOM Image",
      ".EPS - Encapsulated PostScript"
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Adobe Photoshop",
        "url": "https://fileinfo.com/software/adobe/photoshop"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11400&b=1"
      },
      {
        "name": "Adobe Photoshop 2025",
        "url": "https://fileinfo.com/software/adobe/photoshop"
      },
      {
        "name": "Adobe Photoshop 2025",
        "url": "https://fileinfo.com/software/adobe/photoshop"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/psdc_11400.jpg",
      "alt": "Screenshot of a .psdc file in Adobe Photoshop 2025",
      "caption": "PSDC file open in Adobe Photoshop 2025"
    }
  ]
}