{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/psxprj",
  "slug": "psxprj",
  "extension": "psxprj",
  "name": ".PSXPRJ File Extension",
  "type_name": "PhotoScape X Project",
  "summary": "Learn about .PSXPRJ files and view a list of programs that open them.",
  "developer": "Mooii Tech",
  "more_information": {
    "description": [
      "A PSXPRJ file is an image-editing project created by Photoscape X, an image editor developed by Mooii Tech. It contains an image and a record of any adjustments, effects, or transformations applied to that image. Saving projects as PSXPRJ files allows users to revert or continue making changes to an image."
    ]
  },
  "technical_info": {
    "content": [
      "Photoscape X is a free image editor available for Windows and macOS. It allows users to import images and apply adjustments, effects, and transformations to them. For example, a user could use Photoscape X to crop, recolor, and add a text mask to an image.",
      "If a user wants to continue editing an image in Photoscape X in the future, they can save their current editing project as a PSXPRJ file. This retains a record of the modifications the user has made to the image, so they can remove them, adjust them, or compare their edited image to the original.",
      "To save a Photoscape X project as a PSXPRJ file:",
      "Select the Save button.",
      "From the Save window, select Save Project....",
      "Name and save your PSXPRJ file."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a PSXPRJ file with Photoscape X (Windows, Mac). To do so, select the Open link that appears on the program's main screen. Then, navigate to and open your PSXPRJ file."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "After opening a PSXPRJ file in Photoscape X, you can save it as a .JPEG, .PNG, .GIF, .BMP, .TIFF, or .WEBP file. To do so:",
      "Select Save.",
      "From the Save window, select Save As....",
      "Choose the format and location in which you want to save your edited image."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12908&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/psxprj_12908.png",
      "alt": "Screenshot of a .psxprj file in Mooji Tech Photoscape X",
      "caption": "PSXPRJ file open in Mooji Tech Photoscape X"
    }
  ]
}