{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/pvmz",
  "slug": "pvmz",
  "extension": "pvmz",
  "name": ".PVMZ File Extension",
  "type_name": "Parallels Compressed Virtual Machine",
  "summary": "Learn about .PVMZ files and view a list of programs that open them.",
  "developer": "Parallels",
  "more_information": {
    "description": [
      "A PVMZ file is a compressed virtual machine created with Parallels Desktop emulation software. It contains all the information for a virtual machine (VM) required by Parallels Desktop for Mac to load and run an operating system, such as Windows, macOS, or Linux. PVMZ files are the same as .PVM files but are Zip-compressed to save space."
    ]
  },
  "technical_info": {
    "content": [
      "Parallels Desktop for Mac is an operating system virtualization program that can run Windows, Linux, Android, and additional versions of macOS on Macs. When users create a VM with Parallels Desktop, the software creates a PVM file, which is a macOS package, to store its contents.",
      "Since PVM files can grow large, users typically compress PVM files as PVMZ files to reduce their size. This functionality is only available in Parallels Desktop for Mac Pro and Business Editions.",
      "To create a PVMZ file with Parallels Desktop, right-click the VM in Control Center, then select Archive. After archiving the VM, the PVM file becomes a PVMZ file in the same location."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a PVMZ file with Parallels Desktop for Mac in macOS. To open a PVMZ file, place the file in the folder you set as the default location for storing virtual machines (Parallels default location is Macintosh HD/​Users/​[username]/​Documents/​Parallels/​), select File → Open in Parallels Desktop for Mac, and choose your PVMZ file.",
      "If the virtual machine (VM) is listed as \"Archived\" in the Parallels Desktop for Mac Control Center, you can double-click it to unarchive it or right-click the VM and select Unarchive."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Parallels Desktop for Mac",
        "url": "https://fileinfo.com/software/parallels/desktop_for_mac"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10773&b=1"
      },
      {
        "name": "Parallels Desktop for Mac 26",
        "url": "https://fileinfo.com/software/parallels/desktop_for_mac"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/pvmz_10773.png",
      "alt": "Screenshot of a .pvmz file in Parallels Desktop for Mac 26",
      "caption": "PVMZ file open in Parallels Desktop for Mac 26"
    }
  ]
}