{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/qewe",
  "slug": "qewe",
  "extension": "qewe",
  "name": ".QEWE File Extension",
  "type_name": "QEWE Ransomware Encrypted File",
  "summary": "Learn about .QEWE files and view a list of programs that open them.",
  "developer": "N/A",
  "more_information": {
    "description": [
      "A file with the .qewe extension has been maliciously renamed and encrypted by QEWE ransomware. It contains a document, image, video, or other file the ransomware is holding hostage. The .qewe extension is added to the file's normal extension, producing a compound extension like .jpg.qewe."
    ]
  },
  "technical_info": {
    "content": [
      "In May 2020, some PC users began reporting their computers had been infected by ransomware that encrypted their files and renamed them to use the .qewe extension. Further investigation revealed that QEWE ransomware is a variant of STOP DJVU ransomware, one of the most commonly distributed forms of ransomware.",
      "QEWE ransomware is most commonly distributed within programs that appear to be legitimate but are actually adware and malware bundles. If you recently downloaded and installed an unverified program, that may be how your computer became infected by QEWE ransomware."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Because QEWE files are encrypted, you cannot open them. At this time, there is no way to decrypt QEWE files. The best way to restore files encrypted by QEWE ransomware is to retrieve them from a recent backup or perform a System Restore."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12916&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}