{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/qiz",
  "slug": "qiz",
  "extension": "qiz",
  "name": ".QIZ File Extension",
  "type_name": "Exam Builder Quiz",
  "summary": "Learn about .QIZ files and view a list of programs that open them.",
  "developer": "MacKichan Software",
  "more_information": {
    "description": [
      "A QIZ file contains a quiz created by Scientific Notebook or Scientific WorkPlace, which are mathematical and scientific word processors. It storess formulas and conditions that are referenced every time the QIZ file is opened in order to generate different quiz questions for the user."
    ]
  },
  "technical_info": {
    "content": [
      "QIZ files are generated from .TEX documents using the Exam Builder tool offered by Scientific Notebook and Scientific WorkPlace. The Exam Builder tool allows mathematics and scientific instructors to design different types of quizzes that can be taken and graded online by students.",
      "Every time a student opens a QIZ file in Scientific Notebook or WorkPlace, the questions are rearranged, meaning every time a student opens the QIZ file to take the quiz, he will encounter different questions. This allows instructors to build tests that are more challenging and dynamic than a static test that displays the same questions and answers every time it is opened."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10633&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}