{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/qmdl",
  "slug": "qmdl",
  "extension": "qmdl",
  "name": ".QMDL File Extension",
  "type_name": "Qualcomm Mobile Data Log",
  "summary": "Learn about .QMDL files and view a list of programs that open them.",
  "developer": "Qualcomm",
  "more_information": {
    "description": [
      "A QMDL file is a log file created by a Qualcomm smartphone or other mobile device. It contains a record of data the device has sent over a network. QMDL files are similar to .PCAP files, except they are saved in a Qualcomm-proprietary file format."
    ]
  },
  "technical_info": {
    "content": [
      "Qualcomm mobile devices save a record of the data packets they've sent over a network in QMDL files. Developers and network administrators can use these files to troubleshoot issues with a device, app, or network. To analyze these files, users either submit the files to Qualcomm or view their contents with Qualcomm eXtensible Diagnostic Monitor."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a QMDL file with Qualcomm eXtensible Diagnostic Monitor (Windows). This program, which is also known as QXDM, is available for purchase from Qualcomm."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "You can use Scat (multiplatform) to convert QMDL files to the .PCAP format. You can then open the converted files with Wireshark to view their contents."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12976&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}