{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/qrk",
  "slug": "qrk",
  "extension": "qrk",
  "name": ".QRK File Extension",
  "type_name": "QuArK Configuration File",
  "summary": "Learn about .QRK files and view a list of programs that open them.",
  "developer": "The QuArK Team",
  "more_information": {
    "description": [
      "A QRK file is a configuration file used by Quake Army Knife (QuArK), a modding tool for Quake engine games. It contains data that QuArK uses to load and display game assets in its map editor. Modders create QRK files with QuArK Explorer."
    ]
  },
  "technical_info": {
    "content": [
      "Created by id Software, the Quake engine is a game development engine that has been used to create many popular 3D video games, including the Quake series. Additionally, other game development companies, such as Valve, have created and used variants of the Quake engine to develop their own 3D games.",
      "QuArK is a modding tool that allows modders to edit Quake (and related) engine game maps and modify some other game assets (such as sounds, models, and textures). Before a modder can use QuArK to modify a game's maps, they must use QuArK Explorer to create a series of QRK files. These files tell QuArK where to find and load game assets from, for display in the program's map editor. When a modder makes a change to a game asset, QuArK uses the related QRK file to apply that change to the game asset.",
      "NOTE: QRK files may be saved in a binary or plain text format."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a QRK file with QuArK Explorer, to view the data it contains. QuArK Explorer is packaged with QuArK.",
      "Additionally, if your QRK file contains plain text data, you can open it with Microsoft Notepad, Apple TextEdit, or any other text editor to view the data it contains. If your QRK file contains binary data, you can open it in QuArK Explorer and save it as structured text (with the .TXT extension) to convert it to a plain text file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13495&b=1"
      },
      {
        "name": "QuArK",
        "url": "https://fileinfo.com/software/quark/quark"
      },
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Vim",
        "url": "https://fileinfo.com/software/vim/vim"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}