{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/qrmx",
  "slug": "qrmx",
  "extension": "qrmx",
  "name": ".QRMX File Extension",
  "type_name": "Quick Risk Matrix File",
  "summary": "Learn about .QRMX files and view a list of programs that open them.",
  "developer": "Riskfiniti",
  "more_information": {
    "description": [
      "A QRMX file contains a matrix created by Riskfiniti Quick Risk Matrix, a program used to design risk matrices. It stores a matrix, which is a chart that includes data about the probability of an unwanted event and the consequence of the event, organized into rows and columns of grids. QRMX files also contain matrix settings, such as the pixel width and height and color of grids."
    ]
  },
  "technical_info": {
    "content": [
      "The QRMX file is the main file type associated with Quick Risk Matrix, which is available for Windows and macOS in Standard and Premium editions. The file is created when you save your matrix design and can be exported to other formats, such as .PNG, .JPG, and .PDF.",
      "Risk matrices are used in environments where risk assessment and management is important. Typically these environments are organizations that deal with a large amount of risk regarding finances, such as manufacturing companies, sports organizations, hospitals, aerospace companies, government departments, and energy companies."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10953&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}