{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/qrt",
  "slug": "qrt",
  "extension": "qrt",
  "name": ".QRT File Extension",
  "type_name": "QuickRoute Map",
  "summary": "Learn about .QRT files and view a list of programs that open them.",
  "developer": "Mats Troeng and Jörgen Ohlin",
  "more_information": {
    "description": [
      "A QRT file is a map created using QuickRoute, a Windows program that allows you to import, map, analyze, and export GPS routes. It contains a GPS route overlaid on a map, as well as metadata about the route. Users create QRT files by combining a map saved as a .JPG or .PNG file with GPS data saved in a .GPX, .FIT, or .TCX file."
    ]
  },
  "technical_info": {
    "content": [
      "QuickRoute is a free program that allows hikers, runners, bicyclists, travel enthusiasts, and others to plot data recorded using a Garmin, Fitbit, or other GPS device on an image of a map. For example, runners can import data recorded during a run into QuickRoute and overlay that data on a map image. Runners can also review the split time and pace information their device recorded.",
      "After aligning their GPS data with their map image, QuickRoute users can save their finalized map as a QRT file. QRT files can be opened only in QuickRoute, but QuickRoute users can use QRT files to show route information in Google Earth (by selecting Tools → Open in Google Earth from QuickRoute's menu bar), publish their maps to a web service (by selecting Tools → Publish map...), or export their map as an image (by selecting File → Export → Image...)."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a QRT file in QuickRoute (Windows). To do so, select File → Open... from the program's menu bar. Then, navigate to and open your QRT file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12215&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/qrt_12215.png",
      "alt": "Screenshot of a .qrt file in QuickRoute 2",
      "caption": "QRT file open in QuickRoute 2"
    }
  ]
}