{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/qvw",
  "slug": "qvw",
  "extension": "qvw",
  "name": ".QVW File Extension",
  "type_name": "QlikView Document",
  "summary": "Learn about .QVW files and view a list of programs that open them.",
  "developer": "QlikTech International",
  "more_information": {
    "description": [
      "A QVW file is a document created by QlikView, a business intelligence analysis app. It contains reports, charts, KPIs, and other business data. Businesses use QlikView and QVW files to analyze their performance, quality, finances, and other important metrics."
    ]
  },
  "technical_info": {
    "content": [
      "QlikTech International QlikView is an analytics program businesses use to track and analyze various business metrics. QlikView is now discontinued and has been replaced by Qlik Sense, a primarily cloud-based analytics platform.",
      "QlikView users could save a set of charts, reports, data models, and other objects as a QVW file. These files are alternately referred to as QlikView documents and QlikView applications. Users could then share their QVW files with others, to give those users access to the data the QVW file contains."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a QVW file with QlikTech QlikView, provided you still have access to it. Users who do not have access to QlikView can instead use their QVW file with QlikTech Qlik Sense.",
      "Qlik Sense users can import QVW files into their Qlik Sense hub. To do so, select Add new → Upload app. Then, navigate to and upload your QVW file. Note that your QVW file can be only 1, 2, or 10 GB in size, depending on your Qlik Sense license.",
      "Qlik Sense users can also convert QVW files into Qlik Sense apps with the official QlikView Converter. After opening the Converter, drag your QVW file to it to begin the conversion process. If you need additional instructions, refer to QlikView Converter's official documentation (linked below)."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=6227&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}