{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/qwd",
  "slug": "qwd",
  "extension": "qwd",
  "name": ".QWD File Extension",
  "type_name": "QuakeWorld Demo",
  "summary": "Learn about .QWD files and view a list of programs that open them.",
  "developer": "id Software",
  "more_information": {
    "description": [
      "A QWD file is a match recording created by QuakeWorld, a multiplayer version of the classic game Quake. It contains information about player actions, movements, and interactions during the game, which users can share and play back to replay matches or review specific moments in the game."
    ]
  },
  "technical_info": {
    "content": [
      "id Software released QuakeWorld in 1996 as an updated version of Quake. It was designed to improve the multiplayer experience by offering faster network performance and smoother gameplay. Because of its success, it eventually became the standard for Quake multiplayer matches. One of its features many players found helpful was the ability to record and share gameplay experiences as QWD files, such as matches, tricks, or in-depth analysis of strategies."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open QWD files with the discontinued QuakeWorld if you still have access to it. nQuake, which is based on QuakeWorld can also open QWD files. To open a QWD file and play it with nQuake, launch it and open the console, and then type the command /playdemo followed by the name of the QWD file you want to play (e.g., example.qwd)."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1494&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}