{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/raf",
  "slug": "raf",
  "extension": "raf",
  "name": ".RAF File Extension",
  "type_name": "Fujifilm RAW Image",
  "summary": "Learn about .RAF files and view a list of programs that open them.",
  "developer": "Fujifilm",
  "more_information": {
    "description": [
      "An RAF file is an image captured in the RAW Fujifilm (RAF) format by select Fujifilm digital cameras, such as the FinePix F550 EXR and X100V models. It stores image data exactly how the camera's sensor captured it along with metadata, such as camera settings and format version. RAF files may also include a .JPG version of the same image for thumbnail preview purposes."
    ]
  },
  "technical_info": {
    "content": [
      "Fujifilm is continuously developing the RAF format, adding capabilities available with newer cameras. For example, most RAF files store uncompressed image data, but more recent Fujifilm X-T3 and X-Pro2 cameras allow you to compress RAF files to reduce their size and save storage space.",
      "Additionally, more recent Fujifilm cameras, like the X100V, allow you to capture images in the HDR RAF format (images captured when the HDR setting is enabled on the camera in the RAW mode). In these cases, the camera captures three images with different exposure levels and saves them all in one RAF file.",
      "Professional photographers and camera hobbyists utilizing Fujifilm cameras will most likely encounter the RAF format. When transferring images from their camera, they may view or edit the RAF files with an image editor, then send them to print, incorporate them into digital artwork, or archive them for later use.",
      "Additionally, RAF is one of many proprietary camera raw formats developed by digital camera manufacturers. Other camera raw formats include Canon .CR3, Sony .ARW, and Nikon .NEF formats. Photographers using digital cameras from these manufacturers will likely work with these formats."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open RAF files with Fujifilm image-viewing and -editing software, such as X RAW STUDIO and RAW FILE CONVERTER EX (developed for Fujifilm by Ichikawa Soft Laboratory). Fujifilm software is typically the best option for opening RAF files because it likely supports all the camera models that capture the RAF images.",
      "Third-party image viewers and editors also support RAF files, but they may not support all the camera models that capture the images. For example, Adobe Photoshop (multiplatform) can open RAF files through its Camera Raw utility but does not support RAF images captured by all Fujifilm cameras. It also does not open all the multiple images saved in HDR RAF format (only one image).",
      "Other third-party apps that can open RAF files include Microsoft Photos (Windows) with the Raw Image Extension installed, and Apple Preview and Apple Photos, which both come bundled with macOS. If you are a mobile user, you can open RAF files with Adobe Photoshop Express (Android and iOS)."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "Several applications, including Adobe Photoshop and RAW FILE CONVERTER EX, can convert RAF files to other formats.",
      "For example, Photoshop can convert RAF files to many file types, including the following formats:",
      ".DNG - Digital Negative Image",
      ".JPG - JPEG Image",
      ".PNG - Portable Network Graphic",
      ".TIF - Tagged Image File Format",
      ".GIF - Graphical Interchange Format",
      ".WEBP - WebP Image",
      ".BMP - Bitmap Image",
      ".PSD - Adobe Photoshop Document"
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Adobe Photoshop",
        "url": "https://fileinfo.com/software/adobe/photoshop"
      },
      {
        "name": "Microsoft Photos",
        "url": "https://fileinfo.com/software/microsoft/photos"
      },
      {
        "name": "Apple Preview",
        "url": "https://fileinfo.com/software/apple/preview"
      },
      {
        "name": "Apple Photos",
        "url": "https://fileinfo.com/software/apple/photos"
      },
      {
        "name": "File Viewer Plus",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1428"
      },
      {
        "name": "Fujifilm X RAW STUDIO",
        "url": "https://fujifilm-x.com/global/support/download/software/x-raw-studio/"
      },
      {
        "name": "Ichikawa Soft Laboratory RAW FILE CONVERTER EX",
        "url": "https://fujifilm-x.com/global/support/download/software/raw-file-converter-ex-powered-by-silkypix/"
      },
      {
        "name": "Microsoft Photos with the Raw Image Extension installed",
        "url": "https://fileinfo.com/software/microsoft/photos"
      },
      {
        "name": "Corel PaintShop Pro 2023",
        "url": "https://fileinfo.com/software/corel/paintshop_pro"
      },
      {
        "name": "ACD Systems ACDSee Photo Studio",
        "url": "https://fileinfo.com/software/acd_systems/acdsee"
      },
      {
        "name": "Adobe Photoshop 2025",
        "url": "https://fileinfo.com/software/adobe/photoshop"
      },
      {
        "name": "Adobe Photoshop Elements",
        "url": "https://fileinfo.com/software/adobe/photoshop_elements"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/raf_1428.jpg",
      "alt": "Screenshot of a .raf file in Ichikawa Soft Laboratory RAW FILE CONVERTER EX 3",
      "caption": "RAF file open in Ichikawa Soft Laboratory RAW FILE CONVERTER EX 3"
    }
  ]
}