{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/ravi",
  "slug": "ravi",
  "extension": "ravi",
  "name": ".RAVI File Extension",
  "type_name": "Radiometric Video File",
  "summary": "Learn about .RAVI files and view a list of programs that open them.",
  "developer": "N/A",
  "more_information": {
    "description": [
      "A RAVI file is a video file created by thermal imaging software, such as Micro-Epsilon TIM Connect or Optris PIX Connect. It contains video captured by thermal cameras and is saved in a format similar to the Audio Video Interleave (.AVI) format. RAVI files also store radiometric information, such as temperature and measurement area information collected by the thermal camera."
    ]
  },
  "technical_info": {
    "content": [
      "Micro-Epsilon TIM Connect and Optris PIX Connect are programs that allow users to record and analyze RAVI video using a compatible thermal camera, such as the Optris PI450 or thermoIMAGER TIM 200. The software may be used by professionals in a variety of fields that deal with thermal analysis, such as scientists and engineers.",
      "Optris PIX Connect can be used to record radiometric video sequences in the RAVI or WMV formats. It can also be used to capture radiometric snapshots as .TIFF images.",
      "Micro-Epsilon TIM Connect can be used to record radiometric video sequences in the RAVI or AVI formats. It can also be used to capture radiometric snapshots as TIFF images."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11284&b=1"
      },
      {
        "name": "Optris PIX Connect",
        "url": "https://optris.com/us/software/pixconnect/"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/ravi_11284.png",
      "alt": "Screenshot of a .ravi file in Micro-Epsilon TIM Connect 3",
      "caption": "RAVI file open in Micro-Epsilon TIM Connect 3"
    }
  ]
}