{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/reality",
  "slug": "reality",
  "extension": "reality",
  "name": ".REALITY File Extension",
  "type_name": "Reality 3D Scene Format",
  "summary": "Learn about .REALITY files and view a list of programs that open them.",
  "developer": "Apple",
  "more_information": {
    "description": [
      "A REALITY file contains a 3D scene or object saved in the proprietary Reality file format developed by Apple. It stores information about a 3D scene, which may include multiple objects, animation and physics properties, and audio data. REALITY files are typically used to save 3D objects that can be visualized with apps and websites that utilize augmented reality (AR) technology."
    ]
  },
  "technical_info": {
    "content": [
      "You will most likely only encounter a REALITY file if you are a developer creating 3D objects or scenes for a website or an application with Apple Reality Composer. You may also download a REALITY 3D model online or receive a REALITY file via email from a developer or designer when collaborating.",
      "The most common usage of the Reality format is to enable users to view 3D objects in augmented reality. It is used in various types of apps, such as educational tools, games, data visualization programs, and e-commerce websites. For example, a data visualization app may be used to view the proposed construction on a street intersection.",
      "iPhones and iPads running iOS 12 or later support REALITY files through the AR Quick Look tool. Various mobile apps bundled with iOS and iPadOS, such as Safari and Messages, come with the AR Quick Look feature.",
      "There are several other programs available for macOS, iOS, and iPadOS that also support the USDZ format. Reality Composer is an app developed by Apple that can view REALITY files, as well as edit and save them. It is available for iOS and iPadOS and is bundled with Apple Xcode 11 for macOS."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11531&b=1"
      },
      {
        "name": "Apple Xcode",
        "url": "https://fileinfo.com/software/apple/xcode"
      },
      {
        "name": "Apple Safari",
        "url": "https://fileinfo.com/software/apple/safari"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}