{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/repobundle",
  "slug": "repobundle",
  "extension": "repobundle",
  "name": ".REPOBUNDLE File Extension",
  "type_name": "R.E.P.O. Bundle File",
  "summary": "Learn about .REPOBUNDLE files and view a list of programs that open them.",
  "developer": "Semiwork Studios",
  "more_information": {
    "description": [
      "A REPOBUNDLE file stores a game modification for R.E.P.O., an online co-op horror game. It contains information and assets, similarly to a plugin, that modify the functionality of the game, such as adding monsters and character customization options. R.E.P.O. gamers create mods and upload them to share with other gamers, who can use them in their installations of the game."
    ]
  },
  "technical_info": {
    "content": [
      "R.E.P.O. is a co-op sci-fi horror game developed by Semiwork, where players act as intergalactic repo agents sent to recover assets from abandoned or dangerous locations. Teams must work together to locate objectives, avoid or survive hostile entities, and extract safely before time runs out. The game utilizes REPOBUNDLE files within its ecosystem to package and distribute content, streamlining the game's file management and facilitating updates or mod installations."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open REPOBUNDLE files with Semiwork R.E.P.O. in Windows. Gamers often add content to R.E.P.O. with REPOLib, a widely used library. REPOLib loads REPOBUNDLE files stored in the BepInEx/​plugins folder."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13823&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}