{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/rfs",
  "slug": "rfs",
  "extension": "rfs",
  "name": ".RFS File Extension",
  "type_name": "Reflection FTP Client Script",
  "summary": "Learn about .RFS files and view a list of programs that open them.",
  "developer": "Micro Focus",
  "more_information": {
    "description": [
      "An RFS file is a script used by Reflection FTP Client or SFTP Client, which are file transfer programs. It contains commands that can be executed using the clients' Script menu. RFS files are also created and edited from the Script menu."
    ]
  },
  "technical_info": {
    "content": [
      "Reflection FTP Client and SFTP Client are file transfer programs included with Micro Focus's Reflection file management suite. They allow users to transfer files between their local computer and a remote host.",
      "RFS files are scripts used to automatically execute a set of commands, such as a server connection or file transfer operation, in FTP or SFTP Client. To create a new RFS script, users access the clients' Script menu and select Record."
    ]
  },
  "how_to_open": {
    "instructions": [
      "RFS files are meant to be opened using Reflection FTP Client or SFTP Client's Script menu. The Script menu allows users to edit or execute the script an RFS file contains. Users can also run RFS scripts at Reflection FTP Client or SFTP Client's startup by providing the scripts as command line parameters."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12229&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}