{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/rge",
  "slug": "rge",
  "extension": "rge",
  "name": ".RGE File Extension",
  "type_name": "Entourage File Archive",
  "summary": "Learn about .RGE files and view a list of programs that open them.",
  "developer": "Microsoft",
  "more_information": {
    "description": [
      "An RGE file is a macOS package that contains items exported from a Microsoft Entourage database. It may include email messages, tasks, contacts, notes, calendar events, and project files. Entourage users create RGE files using the program's File → Export command."
    ]
  },
  "technical_info": {
    "content": [
      "Microsoft Entourage was an email and productivity app available for macOS. The first version of Entourage was released in 2000. In 2010, Microsoft discontinued Entourage and replaced it with Outlook for Macintosh (which was included in Office for Mac 2011)."
    ]
  },
  "how_to_open": {
    "instructions": [
      "If you are still using Microsoft Entourage, you can import the data your RGE file contains into Entourage using the File → Import command.",
      "If you want to migrate the data your RGE file contains to Microsoft Outlook or another email program, you can:",
      "In macOS, right-click your RGE file and select Show Package Contents. This will show you the folders your RGE file contains. You can then manually import the files these folders contain into Microsoft Outlook or Apple Mail.",
      "In Windows, use Mail Passport Pro to convert your RGE file to a .PST file. You can then import your PST file into Microsoft Outlook."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1424&b=1"
      },
      {
        "name": "Apple Mail",
        "url": "https://fileinfo.com/software/apple/mail"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}