{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/rgf",
  "slug": "rgf",
  "extension": "rgf",
  "name": ".RGF File Extension",
  "type_name": "LEGO MINDSTORMS EV3 Robot Graphics File",
  "summary": "Learn about .RGF files and view a list of programs that open them.",
  "developer": "The LEGO Group",
  "more_information": {
    "description": [
      "An RGF file is an image saved in the EV3 Robot Graphics Format (RGF) created by LEGO MINDSTORMS EV3, a program for creating and programming LEGO robots. It contains image data in the proprietary RGF raster image format that LEGO MINDSTORMS EV3 users create and edit with the software's Image Editor tool. RGF graphics may include text boxes, shapes, drawings, and other elements."
    ]
  },
  "technical_info": {
    "content": [
      "To create an RGF file with the Image Editor tool in LEGO MINDSTORMS EV3:",
      "Select Tools → Image Editor.",
      "Open your image or create an image.",
      "Click the floppy disk icon, name the image, and click Ok.",
      "LEGO MINDSTORMS EV3 saves the RGF in an .EV3 project. To view your RGF file(s) in a project, go to your project, click the wrench icon, and select the \"Images\" tab.",
      "To export the RGF file from a project and share it with other LEGO MINDSTORMS EV3 users, click the wrench icon at the top left of the Project screen in the application, select your RGF file under the \"Images\" tab, click Export at the bottom of the window, name your file, choose the save location, and click Save."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open RGF files with the LEGO MINDSTORMS EV3 (the Home and Education versions) in Windows or macOS.",
      "You cannot double-click RGF files to open them. Instead, you must import the files:",
      "Click the wrench icon in the top-left of the Project screen in the application.",
      "Select the \"Images\" tab and click Import in the bottom of the window.",
      "Navigate to your RGF file, select it, and click Open."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "LEGO MINDSTORMS EV3",
        "url": "https://fileinfo.com/software/lego/mindstorms_ev3"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=9203&b=1"
      },
      {
        "name": "LEGO MINDSTORMS EV3",
        "url": "https://fileinfo.com/software/lego/mindstorms_ev3"
      },
      {
        "name": "LEGO MINDSTORMS EV3",
        "url": "https://fileinfo.com/software/lego/mindstorms_ev3"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}