{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/rpmnew",
  "slug": "rpmnew",
  "extension": "rpmnew",
  "name": ".RPMNEW File Extension",
  "type_name": "Red Hat Package New Default Configuration",
  "summary": "Learn about .RPMNEW files and view a list of programs that open them.",
  "developer": "Red Hat",
  "more_information": {
    "description": [
      "An RPMNEW file is a configuration file created during the installation of an .RPM (Red Hat Package Manager) file. It contains the new default settings for a Unix configuration (.CONF) file you have previously modified. RPMNEW files are produced so users can compare a package's updated configuration defaults to their modified configuration files. The user can then apply changes made in the RPMNEW file as they see fit."
    ]
  },
  "technical_info": {
    "content": [
      "When a Red Hat, Fedora, or other Red Hat variant Linux user installs the updates contained in an RPM file, and the updates include changes to a CONF file the user has previously modified, one of two things typically happens. The package either overwrites the user's current CONF file and produces a similarly-named .RPMSAVE file, which contains a copy of the user's previous configuration, or the package leaves the user's current CONF file in place and produces a similarly-named RPMNEW file, which contains the modified CONF file's new default settings.",
      "Typically, RPM packages produce RPMNEW files, rather than RPMSAVE files. This ensures users' modified configurations remain in place after the update finishes. If a user wants to apply any of the new default settings listed in an RPMNEW file to the corresponding CONF file, they can do so by examining the RPMNEW file and manually updating their CONF file to match as necessary.",
      "NOTE: RPMNEW files typically have the .rpmnew extension appended to the name of the CONF file they correspond to. For example, an RPMNEW file that contains a new default configuration for the file httpd.conf would be named httpd.conf.rpmnew."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Because RPMNEW files are plain text files, you can open and edit them in any text editor, including:",
      "GitHub Atom (cross-platform)",
      "GNU Emacs (cross-platform)",
      "Vim (Linux)",
      "To apply the new default configuration settings an RPMNEW file contains, you must update or replace the CONF file the RPMNEW file corresponds to. For example, you could open both the RPMNEW file and CONF file in a text editor and selectively copy the RPMNEW file's updates into the CONF file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "GitHub Atom",
        "url": "https://fileinfo.com/software/github/atom"
      },
      {
        "name": "GNU Emacs",
        "url": "https://fileinfo.com/software/gnu/emacs"
      },
      {
        "name": "Vim",
        "url": "https://fileinfo.com/software/vim/vim"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11997&b=1"
      },
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "GitHub Atom",
        "url": "https://fileinfo.com/software/github/atom"
      },
      {
        "name": "GNU Emacs",
        "url": "https://fileinfo.com/software/gnu/emacs"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "GitHub Atom",
        "url": "https://fileinfo.com/software/github/atom"
      },
      {
        "name": "GNU Emacs",
        "url": "https://fileinfo.com/software/gnu/emacs"
      },
      {
        "name": "Vim",
        "url": "https://fileinfo.com/software/vim/vim"
      },
      {
        "name": "GitHub Atom",
        "url": "https://fileinfo.com/software/github/atom"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}