{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/rpmsg",
  "slug": "rpmsg",
  "extension": "rpmsg",
  "name": ".RPMSG File Extension",
  "type_name": "Outlook Restricted Permission Message",
  "summary": "Learn about .RPMSG files and view a list of programs that open them.",
  "developer": "Microsoft",
  "more_information": {
    "description": [
      "An RPMSG file is a protected email message created by Microsoft Outlook, Microsoft's email and calendar application. It contains an encrypted email that only certain users can view, print, copy, or forward. Outlook sends RPMSG files as attachments to standard email messages; these attachments use the filename message.rpmsg."
    ]
  },
  "technical_info": {
    "content": [
      "Outlook users can use the program's information rights management (IRM) features to protect the emails they send. When a user protects an email this way, Outlook compresses and encrypts the message's contents and any permissions the sender has specified (e.g., restrictions on forwarding or printing the message). It then saves this encrypted version of the message as an RPMSG file.",
      "The Outlook email client sends the RPMSG file to recipients as an attachment to a standard Outlook message. The message explains that it contains protected content and includes a link to open the RPMSG file. Only specified recipients can open RPMSG files.",
      "NOTE: Azure Information Protection also creates encrypted email messages saved as RPMSG files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open RPMSG files with Microsoft Outlook. For example, if you receive a protected email message with the message.rpmsg file attached, you can click the RPMSG file in Outlook to open the file (only while logged in to the email account that initially received the message). You can also select File → Open if you are using the desktop version of Outlook.",
      "If you use an email client other than Outlook, such as Gmail, you will be redirected to a separate Microsoft Outlook webpage when you click the message.rpmsg file attachment. You are then prompted to sign in to your Gmail account to verify your identity, then must click Allow. After successfully signing in, you can view the protected message via the Microsoft Outlook webpage in the new tab.",
      "Besides the Outlook email client, you can open RPMSG files with the Microsoft Azure Information Protection app on Android and iOS devices."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Microsoft Outlook",
        "url": "https://fileinfo.com/software/microsoft/outlook"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=6887&b=1"
      },
      {
        "name": "Microsoft Outlook 365",
        "url": "https://fileinfo.com/software/microsoft/outlook"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}