{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/sa",
  "slug": "sa",
  "extension": "sa",
  "name": ".SA File Extension",
  "type_name": "Xiaomi Mobile Phone Hidden File",
  "summary": "Learn about .SA files and view a list of programs that open them.",
  "developer": "Xiaomi",
  "more_information": {
    "description": [
      "An SA file is an encrypted file that a Xiaomi mobile phone user has chosen to hide from their phone's Explorer app. It contains a picture, video, or document the user did not want others to be able to access. SA files can be accessed and opened only by providing the password(s) used to encrypt them."
    ]
  },
  "technical_info": {
    "content": [
      "Xiaomi is a Chinese technology company that produces a variety of mobile phones, such as the Xiaomi Redmi. On those phones, users can choose to hide files, such as pictures, videos, and documents, that would otherwise appear in the phone's default Explorer app. This prevents others from finding and opening the hidden files.",
      "To hide a file, users open the file from Explorer and then select More → Hide. The user's phone then encrypts the file, changes its extension to .sa, and moves it to the phone's Gallery/​cloud/​.secretAlbum directory. The first time a user hides a file, they must create one or more passwords. Users cannot access their hidden files without providing these password(s)."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an SA file using the Explorer app on a Xiaomi mobile phone. To do so, navigate to the Explorer's home screen and pull down until the Release to view hidden folders text appears. Then, release. Your phone will prompt you to enter the password(s) you entered when you hid your first file.",
      "After you enter your password(s), the folder containing your hidden SA files will appear. To restore a hidden file to Explorer, so you can open it normally, select the file and then select Unhide. Your phone will then ask where you want to save the restored version of your file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12233&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}