{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/sbfres",
  "slug": "sbfres",
  "extension": "sbfres",
  "name": ".SBFRES File Extension",
  "type_name": "Compressed Breath of the Wild Model File",
  "summary": "Learn about .SBFRES files and view a list of programs that open them.",
  "developer": "Nintendo",
  "more_information": {
    "description": [
      "An SBFRES file is a compressed 3D model, collection of textures, or mipmap used in The Legend of Zelda: Breath of the Wild. It contains data used to show an in-game character or item. SBFRES files can be converted to more common image file formats using various fan-made conversion tools."
    ]
  },
  "technical_info": {
    "content": [
      "While a variety of Wii U games use .BFRES files, The Legend of Zelda: Breath of the Wild (BOTW) is the only Wii U game known to use SBFRES files. For this reason, aspiring BOTW modders have taken a particular interest in examining, opening, modding, and creating their own SBFRES files.",
      "BOTW actually uses four distinct types of SBFRES files, including:",
      ".sbfres files, which contain 3D models",
      ".Tex1.sbfres files, which contain textures",
      ".Tex2.sbfres files, which contain mipmaps",
      ".Tex.sbfres files, which the Nintendo Switch version of BOTW uses to store both textures and mipmaps",
      "These files are all compressed using Yaz0 compression, and when decompressed they function as normal BFRES files. In order to open and edit SBFRES files, BOTW modders have created a number of utilities that allow them to extract SBFRES files from BOTW, decompress them, convert them to common image formats, and edit them in image editors and 3D modeling programs."
    ]
  },
  "how_to_open": {
    "instructions": [
      "A variety of fan-made utilities allow The Legend of Zelda: Breath of the Wild players to open SBFRES files and convert them to more common image file formats. For a detailed walkthrough of one way you can decompress, convert, and edit SBFRES files click here."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11887&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}