{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/schem",
  "slug": "schem",
  "extension": "schem",
  "name": ".SCHEM File Extension",
  "type_name": "Minecraft Schematic",
  "summary": "Learn about .SCHEM files and view a list of programs that open them.",
  "developer": "Sponge",
  "more_information": {
    "description": [
      "A SCHEM file is a schematic used in versions 1.13+ of Minecraft Java Edition, a 3D sandbox construction game. It contains a custom arrangement of blocks that comprise a structure or structures that can be placed within a Minecraft world. SCHEM files replaced .SCHEMATIC files with the release of Minecraft Java Edition 1.13."
    ]
  },
  "technical_info": {
    "content": [
      "Minecraft Java Edition is the original version of Minecraft. Notably, it allows players to use a variety of unofficial add-ons and mods to enhance their gameplay. Some mods allow players to save copies of their Minecraft structures, such as homes, natural features, monuments, or even entire worlds, and export those structures as SCHEM files. Then, players can easily import those structures to another Minecraft world or share them with other players via the Internet.",
      "Prior to Minecraft 1.13, most Minecraft mods saved schematics as SCHEMATIC files. Minecraft 1.13 introduced technical changes that required mods to start saving schematics in a different file format. Many mod developers chose the SCHEM format created by the team behind Sponge, an open-source Minecraft modding framework.",
      "SCHEM files and SCHEMATIC files are not interchangeable. Some mods allow players to convert SCHEM files to SCHEMATIC files for use in pre-1.13 versions of Minecraft, but there is currently no easy way to convert a SCHEMATIC file to a SCHEM file."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open and edit SCHEM files using a variety of Minecraft mod tools. WorldEdit and Litematica are two noteworthy mod tools that allow players to create, export, and import SCHEM files from within Minecraft Java Edition.",
      "You can convert SCHEM files to SCHEMATIC files, for use in pre-1.13 versions of Minecraft, using SchemToSchematic (Web) or Mineways (Windows)."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11624&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}