{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/sdlproj",
  "slug": "sdlproj",
  "extension": "sdlproj",
  "name": ".SDLPROJ File Extension",
  "type_name": "SDL Trados Studio Project",
  "summary": "Learn about .SDLPROJ files and view a list of programs that open them.",
  "developer": "SDL",
  "more_information": {
    "description": [
      "An SDLPROJ file is a project created by SDL Trados Studio, a program used by businesses to edit, review, and manage translation projects. It contains one or more files added by a user that need to be translated to a different language or reviewed by another user. SDLPROJ files also include project details, such as the description, authorized users, due date, source language, and target language."
    ]
  },
  "technical_info": {
    "content": [
      "SDLPROJ files are the main file type used by Trados Studio. The projects contain all the files, such as .DOC, .DOCX, or .XML files, needed to be translated and reviewed. You can open an SDLPROJ by selecting File → Open Project. You can create an SDLPROJ by selecting File → New → New Project and choose to start from scratch or template (.SDLTPL file).",
      "SDLPROJ files can be saved as .SDLPPX packages for better organization and easier sharing with other team members. You can create an SDLPPX file using the \"Create Project Package\" wizard in SDL Trados Studio. To do this, select Create Project Package in the toolbar. You can also right-click projects you want in the package and select Create Project Package."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10705&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/sdlproj_10705.jpg",
      "alt": "Screenshot of a .sdlproj file in SDL Trados Studio 2017",
      "caption": "SDLPROJ file open in SDL Trados Studio 2017"
    }
  ]
}