{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/se1",
  "slug": "se1",
  "extension": "se1",
  "name": ".SE1 File Extension",
  "type_name": "Swiss Ephemeris Data File",
  "summary": "Learn about .SE1 files and view a list of programs that open them.",
  "developer": "Astrodienst",
  "more_information": {
    "description": [
      "Data file created and used by Swiss Ephemeris, a high precision ephemeris used to compute complete horoscopes; contains data about planets, moons, or planetoids; used to increase the precision of the built-in default ephemeris."
    ]
  },
  "technical_info": {
    "content": [
      "There are several types of Swiss Ephemeris data files. One type is Planetary, which is used for all planets, such as Mars, Venus, and Neptune. It also includes the sun. The second type is Moon, which pertain to the earth's moon. The third type is Asteroid files, which is used for planetoids such as Chiron, Vesta, and Pholus. Each data file type has time intervals of 600 years.",
      "An Ephemeris is a calendar or diary used in astronomy and celestial navigation to give the positions of astronomical objects in the sky at a given time. The Swiss Ephemeris is largely based on the DExxx ephemerides from NASA's JPL. It is a library that can be licensed by developers to incorporate into their astrological software."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10095&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}