{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/sequence",
  "slug": "sequence",
  "extension": "sequence",
  "name": ".SEQUENCE File Extension",
  "type_name": "Online Sequencer Sequence",
  "summary": "Learn about .SEQUENCE files and view a list of programs that open them.",
  "developer": "Jacob Morgan",
  "more_information": {
    "description": [
      "A SEQUENCE file is a song created by Online Sequencer, a web-based music sequencer. It contains a collection of sequenced musical notes. SEQUENCE files also contain song metadata, such as the song's time signature, instrument settings, grid spacing, and other data."
    ]
  },
  "technical_info": {
    "content": [
      "Online Sequencer is a music sequencer that musicians can access in their web browser, at onlinesequencer.net. It allows musicians to place notes upon a grid to create a song. While creating a song, musicians can also adjust the song's time signature, BPM, playback instrument, and other settings.",
      "After creating a song, musicians can choose to save the song online or download it to their computer. Downloaded songs are saved as SEQUENCE files. Musicians can also download other users' songs as SEQUENCE files from the Sequences section of Online Sequencer's website."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a SEQUENCE file with Online Sequencer (Web). To do so:",
      "Select the three-dots menu button that appears on Online Sequencer's right-hand side.",
      "Select Upload Sequence File.",
      "Navigate to and open your SEQUENCE file."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "You can use Online Sequencer to convert SEQUENCE files to the following formats:",
      ".MP3 - MP3 Audio",
      ".WAV - WAVE Audio",
      ".MID - MIDI File",
      "To do so, choose the Show options button that appears next to the Save icon. Then, choose the format in which you want to export your SEQUENCE file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13188&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/sequence_13188.png",
      "alt": "Screenshot of a .sequence file in Online Sequencer",
      "caption": "SEQUENCE file open in Online Sequencer"
    }
  ]
}