{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/shapes",
  "slug": "shapes",
  "extension": "shapes",
  "name": ".SHAPES File Extension",
  "type_name": "Pixelmator Pro Shapes",
  "summary": "Learn about .SHAPES files and view a list of programs that open them.",
  "developer": "Pixelmator Team",
  "more_information": {
    "description": [
      "A SHAPES file contains one or more shapes created and used in Pixelmator Pro, a professional image-editing program. Pixelmator Pro users can import SHAPES files into the program and use them to place custom shapes in their images (.PXD files). The shapes that SHAPES files contain are vector graphics defined using XML."
    ]
  },
  "technical_info": {
    "content": [
      "Pixelmator Pro is an Adobe Photoshop equivalent that allows photographers and graphic designers to make non-destructive, layer-based edits to images. Users can use Pixelmator Pro to enhance their images, remove unwanted imperfections, and add graphic design elements. Some of the elements users can add to their images are Pixelmator Pro shapes.",
      "Pixelmator Pro includes 40 default shapes, including arrows, speech bubbles, rectangles, and circles, and it also allows users to create custom shapes. If a user wants to export one or more custom shapes from Pixelmator Pro, they can do so by saving the shapes in a SHAPES file. A SHAPES file may contain just one shape, a collection of shapes, or a user's entire shapes library, depending on how the user exported the file.",
      "While SHAPES files appear as shapes in Pixelmator Pro, they are actually plain text files that contain XML data. The XML that SHAPES files contain defines how they appear in Pixelmator Pro.",
      "NOTE: Users can also export Pixelmator Pro shapes as .SVG files, to use the shapes in other image-editing applications."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can import a SHAPES file into Pixelmator Pro (Mac) for use as a custom shape. To do so, drag and drop the file into Pixelmator Pro. The shape(s) your SHAPES file contains will then appear in Pixelmator Pro's Shape tool.",
      "If you want to see the XML data a SHAPES file contains, you can open the file in any text editor, such as Apple TextEdit (Mac) or Microsoft Notepad (Windows)."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12318&b=1"
      },
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Pixelmator Pro",
        "url": "https://fileinfo.com/software/pixelmator_team/pixelmator_pro"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Vim",
        "url": "https://fileinfo.com/software/vim/vim"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}