{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/shortcut",
  "slug": "shortcut",
  "extension": "shortcut",
  "name": ".SHORTCUT File Extension",
  "type_name": "Apple Shortcuts Shortcut",
  "summary": "Learn about .SHORTCUT files and view a list of programs that open them.",
  "developer": "Apple",
  "more_information": {
    "description": [
      "A SHORTCUT file is an automated action created by Apple Shortcuts, a productivity app for iPhones and iPads. It contains data used to perform a multi-step action, such as getting directions to a pre-set address, playing a specific musical playlist, or uploading a photo to a social media service, with one tap. SHORTCUT files can be shared with others via Apple's iCloud service."
    ]
  },
  "technical_info": {
    "content": [
      "Apple Shortcuts is an app that allows iPhone and iPad users to automate multi-step actions they perform on their mobile devices, so they can perform those actions with a single button tap. These automated actions are referred to as shortcuts. Each shortcut appears as a separate button in Apple Shortcuts and is saved in its own SHORTCUT file.",
      "If a user wants to share one of their Apple Shortcuts shortcuts with another user, they can tap the app's Share button and create an iCloud link. Other users can enter the link's URL in their web browser to download and install the shortcut. Users cannot manually save and send each other SHORTCUT files to install shortcuts, as Shortcuts does not allow users to import shortcuts from anywhere other than iCloud."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Unfortunately, you cannot manually import and open SHORTCUT files in Apple Shortcuts. The only way to install a SHORTCUT file is by first uploading the file to Apple iCloud (typically from within Apple Shortcuts) and then navigating to the SHORTCUT file's iCloud URL in your web browser. From that webpage, you can download and install the SHORTCUT file in Apple Shortcuts.",
      "Note that, to install shortcuts you receive from other users, you must turn on the Allow Untrusted Shortcuts setting found in Shortcuts' settings menu."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11987&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}