{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/snagitstamps",
  "slug": "snagitstamps",
  "extension": "snagitstamps",
  "name": ".SNAGITSTAMPS File Extension",
  "type_name": "Snagit Stamp Archive",
  "summary": "Learn about .SNAGITSTAMPS files and view a list of programs that open them.",
  "developer": "TechSmith",
  "more_information": {
    "description": [
      "A SNAGITSTAMPS file is a stamp pack used by TechSmith Snagit, a screen capture and annotation program. It contains stamps that can be added to a screen capture. You can download a variety of SNAGITSTAMPS packs from TechSmith's online Snagit asset library."
    ]
  },
  "technical_info": {
    "content": [
      "Technical writers, developers, and others use Snagit to take and annotate screenshots for use in software documentation. One of the ways users can annotate screenshots is by adding stamps to them, using Snagit's Stamp tool. For example, a user might add numbered stamps to a screenshot, to label the UI elements associated with a step-based list.",
      "If a user wants to add additional stamps to Snagit, they can select the Download More button available in the Stamp tool. Selecting this button opens the online Snagit asset library, from which users can download additional stamp packs as SNAGITSTAMPS files.",
      "NOTE: Users cannot directly add stamps to Snagit videos. However, users can include stamps in Snagit videos by creating the video from a series of images that already contain stamps."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To open a SNAGITSTAMPS file in Snagit:",
      "Open Snagit and select the Stamp tool.",
      "Select Import Stamps.",
      "Navigate to and open your SNAGITSTAMPS file.",
      "If you want to view the stamps a SNAGITSTAMPS file contains outside of Snagit, rename the file to use the .ZIP extension and decompress it with any archive utility. This will allow you to view the file's stamps as a collection of .PDF files."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=8989&b=1"
      },
      {
        "name": "TechSmith Snagit",
        "url": "https://fileinfo.com/software/techsmith/snagit"
      },
      {
        "name": "TechSmith Snagit",
        "url": "https://fileinfo.com/software/techsmith/snagit"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/snagitstamps_8989.png",
      "alt": "Screenshot of a .snagitstamps file in Snagit 2022",
      "caption": "SNAGITSTAMPS file open in Snagit 2022"
    }
  ]
}