{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/snt",
  "slug": "snt",
  "extension": "snt",
  "name": ".SNT File Extension",
  "type_name": "Sticky Notes File",
  "summary": "Learn about .SNT files and view a list of programs that open them.",
  "developer": "Microsoft",
  "more_information": {
    "description": [
      "An SNT file contains a Windows Vista, 7, 8, or 10 user's sticky notes, created by the Sticky Notes app bundled with Windows. When opened with Sticky Notes, the notes an SNT file contains appear as sticky notes attached to a user's desktop. Sticky Notes automatically saves a user's notes to their SNT file whenever the user edits a note."
    ]
  },
  "technical_info": {
    "content": [
      "In Windows Vista, Microsoft introduced the Sticky Notes app. This app allows users to write themselves one or more digital notes and stick those notes to their desktop, for later review.",
      "The Windows Vista, 7, and 8 versions of Sticky Notes save all a user's sticky notes in a single SNT file. This file is stored in the following location:",
      "C:/​Users/​YourUserName/​AppData/​Roaming/​Microsoft/​Sticky Notes",
      "Initially, Microsoft included the Windows 8 version of Sticky Notes in Windows 10. However, Microsoft replaced the Windows 8 version of Sticky Notes with a new version in the Windows 10 Anniversary Update. The Windows 10 Anniversary Update and Windows 11 version of Sticky Notes do not create or use SNT files. (Instead, they store a user's notes in a .SQLITE database.)",
      "NOTE: SNT files created by the Windows Vista and Windows 7/8/10 versions of Sticky Notes are not compatible. Thus, the Windows 7/8/10 version of Sticky Notes cannot load a Windows Vista SNT file, and vice versa."
    ]
  },
  "how_to_open": {
    "instructions": [
      "In most cases, you will not have to manually open an SNT file. Instead, when you open Sticky Notes, the app will automatically load your Sticky Notes from the SNT file saved in the following directory:",
      "C:/​Users/​YourUserName/​AppData/​Roaming/​Microsoft/​Sticky Notes",
      "However, if you need to manually open an SNT file, you can:",
      "Right-click on your SNT file and select Open.",
      "From the window that appears, choose Select a program from a list of installed programs.",
      "Click Browse.",
      "Navigate to C:/​Windows/​System32 and select StikyNot.exe."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=6130&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}