{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/soepsx",
  "slug": "soepsx",
  "extension": "soepsx",
  "name": ".SOEPSX File Extension",
  "type_name": "Player Studio Viewer Item File",
  "summary": "Learn about .SOEPSX files and view a list of programs that open them.",
  "developer": "Daybreak Game Company",
  "more_information": {
    "description": [
      "A SOEPSX file is an item file created by Player Studio Viewer (PSV), an application distributed with Daybreak Games such as EverQuest, EverQuest II, Landmark, and PlanetSide 2 games. It contains an item such as helmets, decals, or armor, texture maps, and geometry files. SOEPSX files are saved in the Sony Online Entertainment Player Studio (SOEPSX) format."
    ]
  },
  "technical_info": {
    "content": [
      "Player Studio allows you to create and edit in-game items. These items can be uploaded to the Daybreak Games marketplace to be sold as long as you have a valid Daybreak account. The items can also be created just to import into the game.",
      "You can view and edit your items with the PSV before submitting them. The PSV application can be found in the \"PlayerStudio\" subfolder of the game installation directory. Each PSV is unique to the game it is bundled with. PSV is used to prepare submission bundles and save the item in the SOEPSX format. Once you are ready to submit your item to the marketplace you must take a screenshot of your submission in .JPG format and name the screenshot to match the submission.",
      "NOTE: Daybreak Game Company is an American game developer that was formerly known as Sony Online Entertainment."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10400&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}