{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/spdf",
  "slug": "spdf",
  "extension": "spdf",
  "name": ".SPDF File Extension",
  "type_name": "Sealed PDF File",
  "summary": "Learn about .SPDF files and view a list of programs that open them.",
  "developer": "Oracle",
  "more_information": {
    "description": [
      "An SPDF file is a protected .PDF file created by Oracle Information Rights Management (IRM) document protection software. It saves the document in a \"sealed,\" or locked, format and can only be opened by users with sufficient rights. SPDF files are sometimes used by online textbook vendors for protecting the distribution of purchased digital textbooks."
    ]
  },
  "technical_info": {
    "content": [
      "SPDF files can be viewed with the Oracle IRM Desktop software, which facilitates the authorization rights management for the digital documents. It also tracks document usage statistics and allows the document rights manager to revoke privileges at any time.",
      "Oracle IRM software sometimes integrates with common business applications such as Microsoft Office or Lotus Notes. With this setup, SPDF files appear as normal PDF files to the end user, but there may be an additional option \"seal\" a file. The integrated IRM software then facilitates the hosting, transfer, and authorization rights management behind the scenes.",
      "NOTE: SealedMedia, the original creators of the \"sealed\" file type, were acquired by Oracle. The company previously provided an application called SealedMedia Unsealer, which would unseal documents. However, this program is no longer available."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=777&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}