{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/sprx",
  "slug": "sprx",
  "extension": "sprx",
  "name": ".SPRX File Extension",
  "type_name": "Signed PlayStation Relocatable Executable",
  "summary": "Learn about .SPRX files and view a list of programs that open them.",
  "developer": "Sony",
  "more_information": {
    "description": [
      "An SPRX file is an executable file used by the Sony PlayStation 3 (PS3) or PlayStation Vita. It contains common code that can be referenced and run by multiple PS3 or Vita programs, such as apps and games. The PS3 and Vita use SPRX files similarly to how Windows uses .DLL files."
    ]
  },
  "technical_info": {
    "content": [
      "SPRX files allow app and game developers to avoid manually writing code for common PS3 and Vita functions. Instead, the developers can reference relevant Sony-developed SPRX files, which they know will correctly perform the function they need. This saves developers time and allows them to create smaller apps (because they can reference SPRX files instead of adding additional code to their app).",
      "The PS3 and Vita include many SPRX files. Updates sometimes install updated or new SPRX files, which include updated or new functions that developers' apps and games might reference.",
      "NOTE: .SELF files are similar to SPRX files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "SPRX files are not meant to be opened. The most common interaction gamers have with SPRX files is installing them as part of the setup for RPCS3 (Windows, Linux), a PC-based PlayStation 3 emulator."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12265&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}