{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/storytemplate",
  "slug": "storytemplate",
  "extension": "storytemplate",
  "name": ".STORYTEMPLATE File Extension",
  "type_name": "Articulate Storyline 360 Project Template",
  "summary": "Learn about .STORYTEMPLATE files and view a list of programs that open them.",
  "developer": "Articulate Global",
  "more_information": {
    "description": [
      "A STORYTEMPLATE file is a project template created by Articulate Storyline 360, a program for developing e-learning content, such as interactive training courses and presentations. It is saved in the same format as a .STORY file, storing all the elements of a course, such as slides, animations, quizzes, text, video, audio, user interactions, and metadata. While STORYTEMPLATES are saved in the same format as STORY files, they are used to store learning courses that Instructional designers, corporate trainers, educators, etc., want to replicate with the same content and appearance."
    ]
  },
  "technical_info": {
    "content": [
      "Users typically work with STORY files during the course development phase since that is the default format for storing projects. However, if they want to replicate a course structure, they can save it as a STORYTEMPLATE file by selecting File → Save As, and then choosing \"Storyline Template\" from the \"Save as type\" dropdown menu.",
      "For example, a university professor creating an online course might use STORYTEMPLATE files to develop multiple self-paced learning modules with a similar appearance. Once finalized, the professor can publish the STORYTEMPLATE file in formats like Sharable Content Object Reference Model (SCORM) or Experience API (xAPI) for use in a Learning Management System (LMS) such as Blackboard or Moodle."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open STORYTEMPLATE files with Articulate Storyline 360 by selecting File → Open. While Articulate 360 is available as an online tool, only the Windows version of the software (available within the Articulate 360 suite) supports STORYTEMPLATE files.",
      "Like STORY files, STORYTEMPLATE files are Zip-compressed, which means you can open them with a compression utility, such as Microsoft File Explorer (bundled with Windows), Apple Archive Utility (bundled with macOS), and Corel WinZip (Windows). However, you may need to change the .storytemplate file extension to .zip for the utility to recognize it. Also, opening the file as a .ZIP archive will not appear the same as opening it with Articulate Storyline 360."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Apple Archive Utility",
        "url": "https://fileinfo.com/software/apple/archive_utility"
      },
      {
        "name": "Corel WinZip",
        "url": "https://fileinfo.com/software/corel/winzip"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13797&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/storytemplate_13797.png",
      "alt": "Screenshot of a .storytemplate file in Articulate Storyline 360 3.97",
      "caption": "STORYTEMPLATE file open in Articulate Storyline 360 3.97"
    }
  ]
}