{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/stormreplay",
  "slug": "stormreplay",
  "extension": "stormreplay",
  "name": ".STORMREPLAY File Extension",
  "type_name": "Heroes of the Storm Replay File",
  "summary": "Learn about .STORMREPLAY files and view a list of programs that open them.",
  "developer": "Blizzard Entertainment",
  "more_information": {
    "description": [
      "A STORMREPLAY file is a Heroes of the Storm match replay. It contains game data Heroes of the Storm uses to save and play a match replay. STORMREPLAY files are saved in the ~/​Blizzard/​Heroes of the Storm/​Accounts/​Account#/​#HeroName#/​Replays directory."
    ]
  },
  "technical_info": {
    "content": [
      "Heroes of the Storm is a free-to-play multiplayer online battle arena (MOBA) game developed and published by Blizzard Entertainment. In the game, players assume the role of one of the titular heroes and join with four other players to battle opposing five-person teams.",
      "After a Heroes of the Storm match concludes, the game automatically saves a replay of that match on players' PCs. The replay is saved in a STORMREPLAY file. Players can access and watch STORMREPLAY files using the Watch button found on Heroes of the Storm's home screen.",
      "Contrary to what you might expect, STORMREPLAY files are not video files (and thus cannot be opened in media players). Rather, they contain all the game data that Heroes of the Storm records during a match. The game uses this data to reconstruct a match in its entirety, so players can examine every aspect of a match when watching a Heroes of the Storm replay."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To open a STORMREPLAY file in Heroes of the Storm, first make sure the file is stored in your Heroes of the Storm/​~/​Replays directory. Then, open Heroes of the Storm and select the Watch button found on the game's home screen. A list of your saved Heroes of the Storm replays will appear. After it does, select the replay you want to watch and click Watch Solo to start the replay."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11790&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}