{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/sxf",
  "slug": "sxf",
  "extension": "sxf",
  "name": ".SXF File Extension",
  "type_name": "Secure eXchange Format File",
  "summary": "Learn about .SXF files and view a list of programs that open them.",
  "developer": "Topographic Service of the Russian Armed Forces",
  "more_information": {
    "description": [
      "An SXF file is a GIS data file saved in the Secure eXchange Format. It contains data about one or more objects mapped using a GIS application. SXF files are always read-only."
    ]
  },
  "technical_info": {
    "content": [
      "In 1992, the Topographic Service of the Russian Armed Forces developed the SXF file format. This format became one of the primary formats that Russian agencies use to exchange geographic data, such as topographic and navigational maps, with each other.",
      "Each SXF file contains one or more position-based objects organized into layers. Objects may include points, lines, polygons, signatures, and graphics. When opened in a GIS or mapping application, the objects an SXF file describes are overlaid on an associated map.",
      "NOTE: SXF files are sometimes paired with RSC files that use the same filename. An RSC file defines its corresponding SXF file's object name and formatting information."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an SXF file in several GIS applications, including Panorama Group GIS Panorama (Windows, Linux), Safe Software FME Desktop (Windows), and PCI Geomatics CATALYST Professional (Windows)."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Safe Software FME Desktop",
        "url": "https://fileinfo.com/software/safe_software/fme_desktop"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12529&b=1"
      },
      {
        "name": "Safe Software FME Desktop",
        "url": "https://fileinfo.com/software/safe_software/fme_desktop"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}