{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/t20",
  "slug": "t20",
  "extension": "t20",
  "name": ".T20 File Extension",
  "type_name": "H&R Block 2020 Tax Return",
  "summary": "Learn about .T20 files and view a list of programs that open them.",
  "developer": "H&R Block",
  "more_information": {
    "description": [
      "A T20 file is a tax return created by the 2020 version of H&R Block Tax Software, a Windows and macOS program used to prepare and file tax returns in the U.S. It stores tax data, including user information and 2020 state and federal tax forms."
    ]
  },
  "technical_info": {
    "content": [
      "H&R Block Tax Software creates a T20 file when you save your tax return progress. After saving the file, you can close it then reopen it to resume working on it.",
      "The software saves T20 files in the \"HR Block\" folder in your \"Documents\" folder by default. Once you finish your tax return, you can electronically file it directly with H&R Block Tax Software or print and mail it to the appropriate tax authorities.",
      "H&R Block Tax Software may also create a T20 file when you save a backup tax return for archival purposes. To create a backup in Tax Software select File → Backup Tax Return....",
      "NOTE: The file extension appended onto H&R Block tax returns indicates the year of the return. T20 files store information for 2020 tax returns, .T19 files store information for 2019 tax returns, and so on."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can only open a T20 file with H&R Block Tax Software (2020 or later) in Windows or macOS. You can also import a T20 file in the 2021 version of H&R Block Tax Software when starting a return based on tax information from the previous year."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11898&b=1"
      },
      {
        "name": "H&R Block Tax Software",
        "url": "https://fileinfo.com/software/hr_block/tax_software"
      },
      {
        "name": "H&R Block Tax Software",
        "url": "https://fileinfo.com/software/hr_block/tax_software"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}