{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/ta7",
  "slug": "ta7",
  "extension": "ta7",
  "name": ".TA7 File Extension",
  "type_name": "TaxAct 2017 Tax Return File",
  "summary": "Learn about .TA7 files and view a list of programs that open them.",
  "developer": "TaxAct",
  "more_information": {
    "description": [
      "A TA7 file is a 2017 tax return created with TaxAct 2017, a program used to prepare taxes. It contains tax information for the 2017 tax year, which includes state forms for a specific state and federal IRS tax forms. TA7 files also store the user's basic information such as name, date of birth, marital status, occupation, dependents, and social security number."
    ]
  },
  "technical_info": {
    "content": [
      "Since annual tax returns are filed for the previous year, the TA7 file is commonly created in 2018 from the beginning of January to April 15. A TA7 file is typically created by the desktop version of TaxAct or exported from TaxAct Online. TA7 files prepared by TaxAct desktop users (Free Federal, Basic, Plus, and Premium) are located in the \"TaxAct2017\" folder in your \"My Documents\" folder. Once you have completed a tax return, you can either print and mail in the tax forms or file electronically.",
      "If you are worried about your tax return becoming corrupt or getting lost you can create a backup of your tax return select File → Backup... and name your file. A backup tax return will be created and saved as a .BA7 file. It is important to note that you must save your tax return before creating your backup.",
      "NOTE: The TA7 file replaced the .TA6 file, which is used for 2016 tax returns created by the 2016 version of TaxAct."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10821&b=1"
      },
      {
        "name": "TaxAct",
        "url": "https://fileinfo.com/software/taxact/taxact"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}