{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/ta9",
  "slug": "ta9",
  "extension": "ta9",
  "name": ".TA9 File Extension",
  "type_name": "TaxAct 2019 Tax Return File",
  "summary": "Learn about .TA9 files and view a list of programs that open them.",
  "developer": "TaxAct",
  "more_information": {
    "description": [
      "A TA9 file is a tax return created with TaxAct 2019, a Windows program used to prepare taxes for the 2019 tax year. It stores 2019 tax information, which includes state and federal IRS tax forms. TA9 files also contain personal information about the user, such as his name, date of birth, marital status, occupation, dependents, and social security number."
    ]
  },
  "technical_info": {
    "content": [
      "You most likely will only encounter a TA9 file if you file taxes with TaxAct 2019 in Windows or TaxAct Online. You may also receive a TA9 file if someone prepares taxes with the software and shares the TA9 tax return file with you. You can only open TA9 files with TaxAct 2019 and later or TaxAct Online.",
      "Since annual tax returns are filed for the previous year, the TA9 file is typically created in 2020 from January to April. The TA9 file replaced the .TA8 file, which is used for 2018 tax returns created by the 2018 version of TaxAct in 2019.",
      "TA9 files prepared by TaxAct desktop users (Free, Deluxe, Premier, and Self Employed) are located in the \"TaxAct2019\" folder in your \"My Documents\" folder. Once you have completed a tax return, you can either print and mail in the tax forms or file electronically.",
      "You can create a backup of your tax return in case your tax return file becomes corrupt, is deleted, or gets lost. To do this, select File → Backup... and name your file. A backup tax return is created and saved as a .BA9 file. It is important to note that you must save your tax return before creating your backup."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11435&b=1"
      },
      {
        "name": "TaxAct",
        "url": "https://fileinfo.com/software/taxact/taxact"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}