{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/tax2020",
  "slug": "tax2020",
  "extension": "tax2020",
  "name": ".TAX2020 File Extension",
  "type_name": "TurboTax 2020 Tax Return",
  "summary": "Learn about .TAX2020 files and view a list of programs that open them.",
  "developer": "Intuit",
  "more_information": {
    "description": [
      "A TAX2020 file contains a United States tax return created with the 2020 version of Intuit TurboTax. It stores tax-related information, which may include personal data entered by a user, a federal IRS tax form, and one or more state forms for the 2020 tax year. TAX2020 files may be encrypted and saved with password protection by the user preparing the return in order to protect its sensitive contents."
    ]
  },
  "technical_info": {
    "content": [
      "TurboTax is a tax return application used to prepare and file U.S. Federal and State tax returns. It is available as a downloadable desktop version for Windows and macOS, and as a web version called TurboTax Online.",
      "You will most likely only encounter a TAX2020 file if you are using the desktop version of TurboTax to prepare your taxes and want to save your progress. However, you may also download a TAX2020 file from TurboTax Online when you export your tax information.",
      "To create a TAX2020 file with the desktop version of TurboTax, select File → Save..., choose your save options, then click Save.",
      "To export a TAX2020 file from TurboTax Online, click Tax Tools → Tools then select \"Save your 2020 return to your computer,\" which initiates the download of the TAX2020 file (taxReturn.tax2020).",
      "After downloading the TAX2020 file, you can open it with the desktop version of TurboTax. Keep in mind that if you make any modifications to the return in TurboTax Online, the changes will not be synced to the TAX2020 file and must be exported again.",
      "If you have a .TAX2019 file with return information prepared by the 2019 version of TurboTax you can import it in the 2020 desktop version of TurboTax. To do this, select \"Use a tax return that's on my computer\" when prompted at the beginning of the tax return process, then select the TAX2019 file.",
      "NOTE: TAX2020 files are typically created in 2021 since annual tax returns are filed for the previous year."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open TAX2020 files with the desktop version of Intuit TurboTax 2020 in Windows and macOS. To open a TAX2020 file, select File → Open Tax Return....",
      "You can also upload a TAX2020 file to Intuit TurboTax Online when uploading your tax data from the previous year. For example, you can upload a TAX2019 file, but not a TAX2020 file, to TurboTax Online when filing your taxes for the 2020 calendar year. However, if you are filing your 2021 taxes with TurboTax Online, you can then upload your TAX2020 file. To open a TAX2020 file with TurboTax Online, select Tax Tools → Tools, click \"Transfer last year's TurboTax return from your computer,\" then follow the prompts to upload the file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11889&b=1"
      },
      {
        "name": "Intuit TurboTax",
        "url": "https://fileinfo.com/software/intuit/turbotax"
      },
      {
        "name": "Intuit TurboTax",
        "url": "https://fileinfo.com/software/intuit/turbotax"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/tax2020_11889.png",
      "alt": "Screenshot of a .tax2020 file in Intuit TurboTax 2020",
      "caption": "TAX2020 file open in Intuit TurboTax 2020"
    }
  ]
}