{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/tax2023",
  "slug": "tax2023",
  "extension": "tax2023",
  "name": ".TAX2023 File Extension",
  "type_name": "TurboTax 2023 Tax Return",
  "summary": "Learn about .TAX2023 files and view a list of programs that open them.",
  "developer": "Intuit",
  "more_information": {
    "description": [
      "A TAX2023 file is a United States tax return created by the 2023 version of Intuit TurboTax, an application for U.S. residents to prepare and file tax returns. It contains tax return information for the 2023 tax year, including federal IRS tax forms, one or more state forms, and personal user-entered information. TurboTax users primarily create TAX2023 files to save their progress in the 2023 desktop version of the software, but they may also export and download returns from the 2023 online version of TurboTax as TAX2023 files to archive or transfer tax return information."
    ]
  },
  "technical_info": {
    "content": [
      "The 2023 desktop version of TurboTax is available in different editions based on your needs: Basic, Deluxe, Premier, and Home & Business. Each edition provides features tailored to your needs, and they all save tax returns as TAX2023 files.",
      "With the Desktop Version: While preparing your tax return in the desktop version of TurboTax, you can save your progress as a TAX2023 file by selecting File → Save... and choosing your save options. To safeguard your tax return information with TurboTax, you can encrypt it with password protection while preparing it.",
      "With the Web Version: In TurboTax Online, you can download a TAX2023 file by clicking Tax Tools → Tools and selecting Save your 2023 return to your computer. This option initiates the download of the TAX2023 file (taxReturn.tax2023).",
      "NOTE: Any modifications you make to the tax return in TurboTax Online after downloading the TAX2023 file will not update in the file since the app does not sync the changes. To update the file with changes, you must export the tax return again."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a TAX2023 file with the desktop version of Intuit TurboTax 2023 in Windows and macOS. For example, to open a TAX2023 file, select File → Open Tax Return.",
      "You can also open tax returns with TurboTax Online. However, you can only do so when importing tax data from the previous year. For example, you can upload a TAX2023 file when filing taxes for the 2024 calendar year.",
      "To open a TAX2023 file with TurboTax Online while signed in to your account:",
      "Select Tax Tools → Tools.",
      "Click Transfer last year's TurboTax return from your computer.",
      "Follow the prompts to upload the file.",
      "If the TAX2023 file is encrypted, you can only open it by entering the correct password."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13658&b=1"
      },
      {
        "name": "Intuit TurboTax",
        "url": "https://fileinfo.com/software/intuit/turbotax"
      },
      {
        "name": "Intuit TurboTax",
        "url": "https://fileinfo.com/software/intuit/turbotax"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/tax2023_13658.png",
      "alt": "Screenshot of a .tax2023 file in Intuit TurboTax 2023",
      "caption": "TAX2023 file open in Intuit TurboTax 2023"
    }
  ]
}