{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/tax2017",
  "slug": "tax2017",
  "extension": "tax2017",
  "name": ".TAX2017 File Extension",
  "type_name": "TurboTax 2017 Tax Return",
  "summary": "Learn about .TAX2017 files and view a list of programs that open them.",
  "developer": "Intuit",
  "more_information": {
    "description": [
      "A TAX2017 file is a United States tax return created with the 2017 version of Intuit TurboTax. It contains information about a user's tax return, which includes personal information, federal IRS tax forms, and one or more state forms for the 2017 tax year. TAX2017 files may be encrypted if saved with password protection since they store sensitive personal and financial data."
    ]
  },
  "technical_info": {
    "content": [
      "TurboTax allows you to import data from your previous tax return into a new TAX2017 document. You can select \"Use a tax return that's on my computer\" when prompted at the beginning of the tax return process. If you want to import data from a 2016 TurboTax return, select the file with the .TAX2016 extension. You can import data from 2016 TaxACT and H&R Block .PDF tax files as well.",
      "You will most likely only see a TAX2017 file if you are using the desktop version of TurboTax, which is available for both Windows and Mac. However, the TAX2017 file may also be exported from TurboTax Online. To export a TAX2017 file from TurboTax Online, click \"Tools,\" then select \"Save your 2017 return to your computer.\" You can then open the return in the desktop version of TurboTax.",
      "Once you have completed your return in TurboTax, you can either print and mail the tax forms or file the 2017 tax return electronically. The \"e-file\" process is free for federal returns, but usually requires a fee to file state returns electronically.",
      "NOTE: Most TAX2017 files are created in 2018 since annual tax returns are filed for the previous year."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10816&b=1"
      },
      {
        "name": "Intuit TurboTax",
        "url": "https://fileinfo.com/software/intuit/turbotax"
      },
      {
        "name": "Intuit TurboTax",
        "url": "https://fileinfo.com/software/intuit/turbotax"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/tax2017_10816.jpg",
      "alt": "Screenshot of a .tax2017 file in Intuit TurboTax 2017",
      "caption": "TAX2017 file open in Intuit TurboTax 2017"
    }
  ]
}