{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/tax2022",
  "slug": "tax2022",
  "extension": "tax2022",
  "name": ".TAX2022 File Extension",
  "type_name": "TurboTax 2022 Tax Return",
  "summary": "Learn about .TAX2022 files and view a list of programs that open them.",
  "developer": "Intuit",
  "more_information": {
    "description": [
      "A TAX2022 file is a United States tax return created by Intuit TurboTax, an application for preparing and filing tax returns for U.S. residents. It stores tax return information for the 2022 tax year, which includes a federal IRS tax form, one or more state forms, and personal information the user entered. Typically, users save their tax returns as TAX2022 files with the 2022 desktop version of TurboTax, but they may also export and download a TAX2022 file from the 2022 online version of TurboTax."
    ]
  },
  "technical_info": {
    "content": [
      "The 2022 desktop version of TurboTax allows you to begin a tax return from scratch, import data from a previous year, or continue a tax return you started on TurboTax Online. If you prepared your 2021 tax return with TurboTax and saved your information as a .TAX2021 file, you can import it into the software when beginning your 2022 tax return.",
      "The Windows version of TurboTax automatically searches for TAX2021 files on your computer when you begin a new tax return, but you can also select Browse. In the macOS version, select \"Use a tax return that's on my computer\" when prompted at the beginning of the tax return process, then select the TAX2021 file. You can also select File → Open Tax Return..., then choose the TAX2021 file.",
      "While preparing a tax return with the desktop version of TurboTax, you can save your progress in a TAX2022 file. After saving the TAX2022 file, you can close it, then re-open it to modify the tax return further.",
      "To create a TAX2022 file with the desktop version of TurboTax, select File → Save..., choose your save options, then click Save.",
      "You may also download a TAX2022 file from TurboTax Online when you export your tax information. This is useful when archiving your tax return on a storage device or for transferring your return to the desktop version of TurboTax.",
      "To export a TAX2022 file from TurboTax Online, click Tax Tools → Tools, then select \"Save your 2022 return to your computer,\" which starts the download of the TAX2022 file (taxReturn.tax2022).",
      "Any modifications you make to the return in TurboTax Online after downloading the TAX2022 file will not be applied to the file since the app does not sync the changes. If you want the file to reflect your changes, you must export the tax return again."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a TAX2022 file with the desktop version of Intuit TurboTax 2022 in Windows and macOS. To open a TAX2022 file, select File → Open Tax Return.",
      "You can also open tax returns in TurboTax Online when importing tax data from the previous year. For example, you can upload a TAX2022 file when filing taxes for the 2023 calendar year. To open a TAX2022 file with TurboTax Online, select Tax Tools → Tools, click \"Transfer last year's TurboTax return from your computer,\" then follow the prompts to upload the file.",
      "NOTE: TurboTax users preparing their TAX2022 tax returns may encrypt them with password protection to protect their sensitive contents. If the file is encrypted, you can only open it by entering the correct password."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13051&b=1"
      },
      {
        "name": "Intuit TurboTax",
        "url": "https://fileinfo.com/software/intuit/turbotax"
      },
      {
        "name": "Intuit TurboTax",
        "url": "https://fileinfo.com/software/intuit/turbotax"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/tax2022_13051.png",
      "alt": "Screenshot of a .tax2022 file in Intuit TurboTax 2022",
      "caption": "TAX2022 file open in Intuit TurboTax 2022"
    }
  ]
}