{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/tbx",
  "slug": "tbx",
  "extension": "tbx",
  "name": ".TBX File Extension",
  "type_name": "ArcGIS for Desktop Toolbox File",
  "summary": "Learn about .TBX files and view a list of programs that open them.",
  "developer": "ESRI",
  "more_information": {
    "description": [
      "A TBX file contains a toolbox of one or more scripts, or \"tools,\" that are used to perform various functions in ESRI ArcGIS for Desktop, a GIS mapping program for Windows. It can be used to perform a variety of operations, such as calculating statistics, creating buffers, and performing overlays. TBX files may contain system toolboxes packaged with ArcGIS for Desktop or custom toolboxes created by a user."
    ]
  },
  "technical_info": {
    "content": [
      "To create a TBX file, navigate to the geodatabase (a data storage structure used by ArcGIS to manage and edit GIS data) or folder in the \"Catalog\" window in which you want the toolbox to be created, then right-click the geodatabase or folder, and select New → Toolbox. You can leave the default name as \"Toolbox\" or enter a new name. You can also create a toolbox by clicking the toolbox icon when saving a new model in ModelBuilder.",
      "You can browse the tools stored in toolboxes by searching their names in the \"Search\" window or using the \"Catalog\" or \"ArcToolbox\" window. Some system TBX toolboxes that come with ArcGIS for Desktop are 3D Analyst Tools, Cartography Tools, Conversion Tools, Data Management Tools, Geocoding Tools, Schematics Tools, Spatial Analyst Tools, and Tracking Analyst Tools.",
      "TBX files are saved by default in the following location:",
      "C:\\​Documents and Settings\\​[username]\\​Application Data\\​ESRI\\​ArcToolbox\\​My Toolboxes"
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open TBX files with ESRI ArcGIS for Desktop in Windows. To open a TBX file with ArcGIS for Desktop, select the ArcToolbox pane, click \"ArcToolbox,\" select Add Toolbox..., navigate to the file, and click Open."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "ESRI ArcGIS for Desktop",
        "url": "https://fileinfo.com/software/esri/arcgis_for_desktop"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11021&b=1"
      },
      {
        "name": "ESRI ArcGIS for Desktop",
        "url": "https://fileinfo.com/software/esri/arcgis_for_desktop"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}