{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/tds",
  "slug": "tds",
  "extension": "tds",
  "name": ".TDS File Extension",
  "type_name": "Adobe LiveCyle Designer Template",
  "summary": "Learn about .TDS files and view a list of programs that open them.",
  "developer": "Adobe",
  "more_information": {
    "description": [
      "A TDS file contains a template created by Adobe LiveCycle Designer, a form authoring tool included with Adobe LiveCycle Enterprise Suite (ES). It contains the structure of a form template that is used to automate the reproduction of forms. TDS files include the components and settings for the template, such as page layout and formatting information, scripts, images, and fonts."
    ]
  },
  "technical_info": {
    "content": [
      "Adobe LiveCycle ES is a platform used by enterprises and government agencies to improve correspondence with customers. LiveCycle Designer is a tool included with LiveCycle ES that is used to design documents and forms to capture and process data from customers. These forms and documents are merged with enterprise .XML data to generate personalized and interactive documents and forms that can be distributed in various ways, such as .PDF files, HTML5, and print.",
      "TDS files are created to store templates that can be used for the reproduction of forms and documents Adobe LiveCycle ES. You can import a TDS file into Designer by selecting File → Open or by dragging and dropping the TDS file into the Designer workspace.",
      "NOTE: While Adobe LiveCycle Designer is typically used as a tool included with the Adobe LiveCycle ES, it is also embedded within LiveCycle Workbench ES4 and available as a standalone program."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11168&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}