{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/tfx",
  "slug": "tfx",
  "extension": "tfx",
  "name": ".TFX File Extension",
  "type_name": "Pro Tools Eleven Rack Plugin Preset File",
  "summary": "Learn about .TFX files and view a list of programs that open them.",
  "developer": "Avid",
  "more_information": {
    "description": [
      "A TFX file is a settings file used by the Eleven Rack guitar processor used by the Avid Pro Tools digital audio workstation (DAW). It contains settings for Eleven Rack rigs, which extend the functionality of Pro Tools with electric guitar processing effects. TFX files can be exported and imported by Pro Tools users to change the presets of Eleven Rack."
    ]
  },
  "technical_info": {
    "content": [
      "Eleven Rack is guitar recording and effects processing system developed by Digidesign (now Avid) in 2009. It can be used on its own or with Avid Pro Tools software. The TFX file allows you to save and share settings that can be imported into Pro Tools with Eleven Rack.",
      "To save a TFX file, open the Eleven Rack window in Pro Tools and choose the \"SAVE\" dropdown menu. You can then choose \"Save to Computer\" or \"Save All Rigs to Computer.\"",
      "To load a TFX file, open the Elven Rack window in Pro Tools, click the preset name, choose \"Select Load from Computer\" from the dropdown menu, and select the TFX preset."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10778&b=1"
      },
      {
        "name": "Avid Pro Tools",
        "url": "https://fileinfo.com/software/avid/pro_tools"
      },
      {
        "name": "Avid Pro Tools",
        "url": "https://fileinfo.com/software/avid/pro_tools"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}