{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/thor",
  "slug": "thor",
  "extension": "thor",
  "name": ".THOR File Extension",
  "type_name": "Locky Ransomware Encrypted File",
  "summary": "Learn about .THOR files and view a list of programs that open them.",
  "developer": "N/A",
  "more_information": {
    "description": [
      "A file with a .thor extension is a file encrypted by the Locky trojan horse virus, which is malware utilized by cybercriminals. It contains a user's file, such as an .AVI or .XLSX file, encrypted with the RSA-2048 algorithm and AES-128 ciphers. AESIR files became prevalent in 2016 as a Locky Virus variant and are similar to .LOCKY files."
    ]
  },
  "technical_info": {
    "content": [
      "The Locky virus is ransomware that takes a victim's files hostage. It then forces them to pay the perpetrator (typically through Bitcoin) to recover their files.",
      "The Locky virus is a trojan horse that typically enters a victim's computer through a spam email attachment. For example, the cybercriminal may send an email with a .DOCM file attachment with a macro embedded. Torrent websites and malicious advertisements are also common culprits.",
      "Once the virus affects their computer, it scrambles, renames, and encrypts their files. The virus then generates the _WHAT_is.bmp and _WHAT_is.html files on the user's computer desktop and changes the desktop wallpaper. The files include messages informing the victim of the takeover and what they need to do to recover their files (typically by paying a Bitcoin ransom)."
    ]
  },
  "how_to_open": {
    "instructions": [
      "There is no program currently available to restore THOR files to their original state. If you back up your files you can execute a full system restore."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13625&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}