{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/tnef",
  "slug": "tnef",
  "extension": "tnef",
  "name": ".TNEF File Extension",
  "type_name": "Transport Neutral Encapsulation Format",
  "summary": "Learn about .TNEF files and view a list of programs that open them.",
  "developer": "Microsoft",
  "more_information": {
    "description": [
      "A TNEF file is an email attachment saved in Microsoft's Transport Neutral Encapsulation Format (TNEF). Microsoft Outlook and Microsoft Exchange Server may generate TNEF files when sending rich text format messages or messages that contain attachments. More commonly, TNEF files use the filename Winmail.dat."
    ]
  },
  "technical_info": {
    "content": [
      "Both Microsoft Outlook and Microsoft Exchange Server use the TNEF format to store and send data associated with an email message. Most often, TNEF files contain information that Microsoft Outlook uses to format a rich text format email message. This information might define embedded documents, forms, voting buttons, or meeting requests that the message includes. Other TNEF files contain email attachments, such as documents or images.",
      "When an email client that does not support the TNEF format receives a message that includes a TNEF file, it may show that file as a message attachment. It may append the text application/ms-tnef to the start of the message. While some of the TNEF files these email clients create use the .tnef file extension, they are more commonly named Winmail.dat.",
      "NOTE: You can learn more about Winmail.dat files here."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Microsoft Outlook (Windows, Mac) and KMail (Linux) support the TNEF format. You can use these email clients to view messages that include TNEF files and retrieve any attachments the TNEF files contain.",
      "You can also use tnef2win (Windows), TNEF's Enough (Mac, iOS), or KTNEF (Linux) to extract data from TNEF files."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Microsoft Outlook",
        "url": "https://fileinfo.com/software/microsoft/outlook"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=756&b=1"
      },
      {
        "name": "Microsoft Outlook 365",
        "url": "https://fileinfo.com/software/microsoft/outlook"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}