{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/toc",
  "slug": "toc",
  "extension": "toc",
  "name": ".TOC File Extension",
  "type_name": "PSP Custom Audio Track",
  "summary": "Learn about .TOC files and view a list of programs that open them.",
  "developer": "N/A",
  "more_information": {
    "description": [
      "A TOC file is an audio file saved in a format compatible with the PlayStation Portable (PSP). It likely contains a song that has been converted to the TOC format for use with Grand Theft Auto: Liberty City Stories or Grand Theft Auto: Vice City Stories. Using the app Exact Audio Copy (EAC), players can import TOC files into these games."
    ]
  },
  "technical_info": {
    "content": [
      "Like other audio files created for use on the PSP, TOC files are saved using Adaptive Transform Acoustic Coding (ATRAC) compression. In this way, they are similar to .AA3 and .ATRAC files.",
      "To create TOC files, gamers use EAC or a related program, named Rockstar Custom Tracks, to convert .MP3 files to TOC files. They then save their TOC files to a custom tracks sub-directory found within a game's SAVEDATA directory. (To do this, a gamer must connect their PSP's removable storage to their computer.)"
    ]
  },
  "how_to_open": {
    "instructions": [
      "To use a TOC file with Grand Theft Auto: Liberty City Stories or Grand Theft Auto: Vice City Stories:",
      "Place the file in either the ULES00182CUSTOMTRACKS (GTA: LCS) or ULES00503CUSTOMTRACKS (GTA: VCS) directory on your PSP's removable storage (found within the PSP/​SAVEDATA directory).",
      "Replace your PSP's removable storage.",
      "Play the game whose data you modified.",
      "In the game's Pause menu, select Audio → My songs ON.",
      "You can then listen to the audio your TOC file contains on the in-game radio, while driving vehicles."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=1422&b=1"
      },
      {
        "name": "Blizzard World of Warcraft",
        "url": "https://fileinfo.com/software/blizzard/world_of_warcraft"
      },
      {
        "name": "Blizzard World of Warcraft",
        "url": "https://fileinfo.com/software/blizzard/world_of_warcraft"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}