{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/tpac",
  "slug": "tpac",
  "extension": "tpac",
  "name": ".TPAC File Extension",
  "type_name": "Mount & Blade II Game Data Archive",
  "summary": "Learn about .TPAC files and view a list of programs that open them.",
  "developer": "TaleWorlds Entertainment",
  "more_information": {
    "description": [
      "A TPAC file is a game data archive used by TaleWorlds Entertainment Mount & Blade II: Bannerlord. It contains a 3D model, textures, and materials used to show an in-game character or item. TPAC files can be opened in TpacTool, a third-party TPAC file explorer."
    ]
  },
  "technical_info": {
    "content": [
      "Mount & Blade II is a medieval role-playing game that allows players to create a custom character and engage in battles throughout the land of Calradia. Many of the game's resources, including character and object meshes, materials, textures, skeletons, and animations, are saved in TPAC files. Each TPAC file includes a package of resource files related to a specific character or item.",
      "For the most part, Mount & Blade II players will never have to access or open the game's TPAC files. However, those who want to examine a TPAC file's constituent files can do so in TpacTool."
    ]
  },
  "how_to_open": {
    "instructions": [
      "Mount & Blade II players can open TPAC files in TpacTool (Windows). TpacTool allows players to examine and export some of a TPAC file's constituent files.",
      "Note that (unlike the OpenBRF editor available to edit the original Mount & Blade's .BRF files), TpacTool does not allow users to edit TPAC files or import new TPAC files into Mount & Blade II. Also, TpacTool may not show all the textures a character or item uses, as many Mount & Blade II textures are saved in accompanying GTEX files."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12191&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}