{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/tt18",
  "slug": "tt18",
  "extension": "tt18",
  "name": ".TT18 File Extension",
  "type_name": "TurboTax Canada 2018 Tax Return",
  "summary": "Learn about .TT18 files and view a list of programs that open them.",
  "developer": "Intuit",
  "more_information": {
    "description": [
      "A TT18 file is a tax return created by the 2018 version of TurboTax Canada, a program used to file tax returns. It contains tax data, which includes Canadian federal and provincial tax information and personal data entered by the user. TT18 files are most commonly created and used in 2019 between January and April."
    ]
  },
  "technical_info": {
    "content": [
      "TurboTax Canada 2018 automatically creates the TT18 file when you save your tax return. It stores your tax return progress, which allows you to close and reopen your tax return. Typically, the file is used for the following purposes:",
      "Saving a 2018 tax return to be electronically filed or printed to be mailed.",
      "Backing up a tax return in case of the loss or corruption of a tax return.",
      "Importing 2018 tax data into the 2019 version of TurboTax Canada to fill out a 2019 tax return.",
      "Tax return file extensions used by TurboTax Canada reflect the year of the tax data they contain. Tax returns for the 2017 year use the .TT17 extension, returns for the 2016 year use the .TT16 extension, and so on.",
      "In Windows, TT18 files are saved by default in the following location:",
      "C:\\​Users\\​[username]\\​Documents\\​TurboTax\\​2018",
      "NOTE: The U.S. version of TurboTax 2018 saves files with a .TAX2018 file extension."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11188&b=1"
      },
      {
        "name": "Intuit Canada TurboTax",
        "url": "https://fileinfo.com/software/intuit/canada_turbotax"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}