{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/ufd",
  "slug": "ufd",
  "extension": "ufd",
  "name": ".UFD File Extension",
  "type_name": "Universal Forensic Extraction Device Data",
  "summary": "Learn about .UFD files and view a list of programs that open them.",
  "developer": "Cellebrite",
  "more_information": {
    "description": [
      "A UFD file contains data extracted from a smartphone or other device using Cellebrite UFED or Cellebrite Physical Analyzer. For example, a UFD file may contain a copy of all the messages, pictures, and videos stored on a phone. Digital forensics professionals use UFD files to examine, report on, and share a device's contents."
    ]
  },
  "technical_info": {
    "content": [
      "Cellebrite publishes programs that allow law enforcement professionals to extract, analyze, and share investigation-related data. For example, a digital forensics investigator can use Cellebrite Physical Analyzer to extract data from a suspect's smartphone, compile the contents of that data into a report (.UFDR file), and share the report with other departments.",
      "Both Cellebrite Physical Analyzer and UFED (Universal Forensic Extraction Device) save all the data extracted from a device in a single UFD file. Investigators can then load this file and analyze the data it contains while building a case in Physical Analyzer. Optionally, investigators can save multiple extractions in a .UFDX file, to make it easier to load all the extractions at once in Physical Analyzer."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a UFD file while opening or editing a case in Cellebrite Physical Analyzer (Windows). For example, while opening a case, select Add → Load extraction on the Load evidence screen to load a UFD file.",
      "You can also open a UFD file with MOBILedit Forensic Express (Windows) or Oxygen Forensics Detective (Windows)."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12831&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}