{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/unity3d",
  "slug": "unity3d",
  "extension": "unity3d",
  "name": ".UNITY3D File Extension",
  "type_name": "Unity Web Player Archive",
  "summary": "Learn about .UNITY3D files and view a list of programs that open them.",
  "developer": "Unity Technologies",
  "more_information": {
    "description": [
      "A UNITY3D file is an archive that contains a 3D game meant to be played in the Unity Web Player. It stores all the game's assets, including its models, textures, animations, sounds, and other game data, in a proprietary, closed format. The Unity Web Player is discontinued, so you may no longer be able to play the game a UNITY3D file contains."
    ]
  },
  "technical_info": {
    "content": [
      "Unity Web Player was a plug-in available for web browsers. It allowed gamers to load and play 3D games saved as UNITY3D files in their web browser.",
      "In 2015, Google and other web browser providers removed support for Netscape Plug-in Application Programming Interface (NPAPI) plug-ins. Because Unity Web Player is an NPAPI plug-in, Unity chose to deprecate Unity Web Player. Therefore, Unity Web Player is no longer available for download, and you may have trouble playing the game your UNITY3D file contains.",
      "NOTE: In previous versions of Unity, users could build UNITY3D files from .UNITY scene files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "If you still have access to Unity Web Player and a web browser that supports NPAPI plug-ins, you can use Unity Web Player to open your UNITY3D file. (You may have to right-click the file, select Open with..., and choose your web browser.) If you do not have access to Unity Web Player and a web browser that supports NPAPI plug-ins, you will not be able to open your UNITY3D file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=4241&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}