{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/unitypackage",
  "slug": "unitypackage",
  "extension": "unitypackage",
  "name": ".UNITYPACKAGE File Extension",
  "type_name": "Unity Asset Package",
  "summary": "Learn about .UNITYPACKAGE files and view a list of programs that open them.",
  "developer": "Unity Technologies",
  "more_information": {
    "description": [
      "A UNITYPACKAGE file is an asset package created by Unity Technologies Unity, a game development application. It contains game resource and library files, such as .ASSET, .UNITY, and .ANIM files. UNITYPACKAGE files are used to transfer game resources from one Unity project to another."
    ]
  },
  "technical_info": {
    "content": [
      "Unity is a popular video game development application available for Windows, macOS, and Linux. Developers can use Unity to create 2D and 3D games for a variety of platforms, including video game consoles, PCs, and mobile devices.",
      "As a developer creates a game in Unity, they add various assets, including character models, materials, shaders, audio files, scenes, and other resources, to that game. If the developer wants to reuse any of these assets in another Unity development project, they can do so by packaging the assets in a UNITYPACKAGE file. The developer can then easily import the UNITYPACKAGE file, and all the assets it contains, into future projects, so they do not have to start developing from scratch.",
      "To export a set of Unity assets as a UNITYPACKAGE file:",
      "Open the Unity project that contains those assets.",
      "Select Assets → Export Package.",
      "In the Exporting package window, choose the assets you want to export.",
      "Select Export.",
      "Unity will then save your assets in a UNITYPACKAGE file."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can import a UNITYPACKAGE file into Unity (multiplatform), to add the assets it contains to a Unity project. To do so, select Assets → Import Package → Custom Package. Then, navigate to and import your UNITYPACKAGE file.",
      "If you want to extract the assets a UNITYPACKAGE file contains outside Unity, you can so do using the open-source Unity Package Extractor (Windows)."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=5176&b=1"
      },
      {
        "name": "Unity Technologies Unity",
        "url": "https://fileinfo.com/software/unity_technologies/unity"
      },
      {
        "name": "Unity Technologies Unity",
        "url": "https://fileinfo.com/software/unity_technologies/unity"
      },
      {
        "name": "Unity Technologies Unity",
        "url": "https://fileinfo.com/software/unity_technologies/unity"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}