{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/up",
  "slug": "up",
  "extension": "up",
  "name": ".UP File Extension",
  "type_name": "Gracenote Update File",
  "summary": "Learn about .UP files and view a list of programs that open them.",
  "developer": "Toyota",
  "more_information": {
    "description": [
      "An UP file is an update for Gracenote technology, which is available on select Toyota vehicle models and audio systems to help drivers manage their music. It contains information about a database update that adds features, bug fixes, etc., to the Gracenote system. Users should not attempt to open UP files; instead, they load them with the Gracenote system included in select Toyota models."
    ]
  },
  "technical_info": {
    "content": [
      "Gracenote allows you to manage your various media, including music, podcasts, and radio. While Gracenote allows you to update the technology through its main screen, you can update it manually by transferring UP files.",
      "NOTE: Your vehicle should be parked during the update installation."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You should not attempt to open UP files. Instead, the Gracenote system in a Toyota vehicle loads the update saved in the UP file.",
      "You can manually update Gracenote by downloading the UP update files from Toyota's website corresponding to your vehicle model. Then, transfer the files to the connected USB flash drive, disconnect the flash drive, and reconnect it to the vehicle's USB port. For Gracenote to recognize it, you must format the drive to the FAT, FAT16, or FAT32 file systems.",
      "After connecting the flash drive to the vehicle's USB port:",
      "Select Settings.",
      "Scroll right and choose the System tab.",
      "Select Music Database Update tab.",
      "Search for and choose the UP update file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13692&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}