{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/v5cpp",
  "slug": "v5cpp",
  "extension": "v5cpp",
  "name": ".V5CPP File Extension",
  "type_name": "VEXcode V5 C++ Project",
  "summary": "Learn about .V5CPP files and view a list of programs that open them.",
  "developer": "VEX Robotics",
  "more_information": {
    "description": [
      "A V5CPP file is a VEXcode V5 C++ programming project created by VEXcode V5, a development tool designed for programming VEX V5 Robotics systems. It contains C++ code and VEX-specific libraries, functions, and configurations optimized for VEX V5 Brain hardware and peripherals for VEX V5 Robotics systems. While VEXcode V5 uses .V5BLOCKS files to save projects by default, users who prefer to code in C++ may save their projects as V5CPP files instead."
    ]
  },
  "technical_info": {
    "content": [
      "VEXcode V5 is a tool similar to MIT Scratch that provides robotics teams, educators, and hobbyists with an easy-to-use interface for programming robots. For example, users can drag and drop blocks representing code and connect them to create actions robots perform, which allows beginners to learn programming concepts without coding language knowledge.",
      "However, advanced users can switch from the block-based interface to text-based programming in VEXcode. For example, they can open the Code Viewer in VEXcode V5, choose the C++ option, and select Convert to Text Project. They can then select File → Save As to save it as a V5CPP file.",
      "NOTE: VEXcode V5 users can also code in Python and save their projects as .V5PYTHON files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open V5CPP files with VEXcode V5 on various platforms, including Windows, macOS, Android, iOS, and in a web browser. To open a V5CPP file, select File → Open from within VEXcode V5.",
      "You can also open V5CPP files with text editors, such as Microsoft Notepad (Windows), Apple TextEdit (macOS), and gedit (Linux). However, they don't provide the same capabilities as VEXcode V5."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "MIT Scratch",
        "url": "https://fileinfo.com/software/mit/scratch"
      },
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "gedit",
        "url": "https://fileinfo.com/software/gedit/gedit"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13773&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/v5cpp_13773.png",
      "alt": "Screenshot of a .v5cpp file in VEX Robotics VEXcode V5",
      "caption": "V5CPP file open in VEX Robotics VEXcode V5"
    }
  ]
}