{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/vdplugin",
  "slug": "vdplugin",
  "extension": "vdplugin",
  "name": ".VDPLUGIN File Extension",
  "type_name": "VirtualDub Plugin File",
  "summary": "Learn about .VDPLUGIN files and view a list of programs that open them.",
  "developer": "Avery Lee",
  "more_information": {
    "description": [
      "A VDPLUGIN file is a plugin used by VirtualDub, a video capture and processing utility for Windows. It stores information that adds additional features to VirtualDub, such as codec support."
    ]
  },
  "technical_info": {
    "content": [
      "VirtualDub is a free application that allows users to capture, edit, and process video. The application is extensible, which means that users can install additional features to extend the capabilities of the software.",
      "There are two main file types that store VirtualDub plugins.",
      "VDPLUGIN files primarily store video codec plugins that enable VirtualDub to support additional video formats.",
      ".VDF files primarily store custom filters for adjusting the appearance of video, but may also include support for additional video formats."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can install VDPLUGIN files to VirtualDub (Windows), and VirtualDub2 (Windows) and VirtualDubMod (Windows), which are modified versions of VirtualDub. To install VDPLUGIN files, place them in the \"plugins32\" or \"plugins64\" folder in the application installation directory.",
      "NOTE: The VDPLUGIN file may require a configuration file to function appropriately."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12154&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}