{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/vlm",
  "slug": "vlm",
  "extension": "vlm",
  "name": ".VLM File Extension",
  "type_name": "Vimm's Lair Game Manual",
  "summary": "Learn about .VLM files and view a list of programs that open them.",
  "developer": "Vimm's Lair",
  "more_information": {
    "description": [
      "A VLM file is a game manual downloaded from Vimm's Lair, a website dedicated to preserving video game-related items. It contains a digital copy of a video game manual. VLM files can be opened in Vimm's Lair Manual Viewer, a Windows application that can be downloaded from the Vimm's Lair website."
    ]
  },
  "technical_info": {
    "content": [
      "In 1999, Vimm's Lair began The Manual Project, the goal of which is to acquire, scan, and post digital copies of as many US video game manuals as possible. To date, Vimm's Lair hosts over 1,000 video game manuals for games played on over 20 video game consoles. The majority of the manuals Vimm's Lair hosts are for older games, such as those from the Atari 2600, Super Nintendo, and original PlayStation consoles.",
      "Those who browse Vimm's Lairs manual collection have the choice of downloading manuals as .PDF or VLM files. According to the website, VLM files appear slightly crisper than their PDF equivalents. However, VLM files can be opened only in the Vimm's Lair Manual Viewer application, while PDFs can be opened in most web browsers and any PDF reader."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open VLM files in Vimm's Lair Manual Viewer (Windows). To do so, open the program, select File → Open, and then navigate to and open your VLM file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12108&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}