{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/vmat_c",
  "slug": "vmat_c",
  "extension": "vmat_c",
  "name": ".VMAT_C File Extension",
  "type_name": "Valve Source 2 Compiled Material File",
  "summary": "Learn about .VMAT_C files and view a list of programs that open them.",
  "developer": "Valve",
  "more_information": {
    "description": [
      "A VMAT_C file is a compiled .VMAT file used by the Valve Source 2 game engine, which is used to create video games. It is a binary file that contains references to .VTEX_C files, as well as data specifying shader and material properties. VMAT_C files are most notably used by Dota 2 and Half-Life: Alyx."
    ]
  },
  "technical_info": {
    "content": [
      "Source 2 is a proprietary game engine Valve has used to create video games such as Dota 2 Reborn, Half-Life: Alyx, and Artifact. When creating in-game objects, developers use VMAT files to apply textures and shading to those objects. When a game is compiled to be run by a user, VMAT files are transformed into VMAT_C files.",
      "While most gamers will never encounter a VMAT_C file, those who want to mod Valve Source 2 games or create their own Source 2-powered games may interact with VMAT_C files. For example, those who want to mod Half-Life: Alyx or Dota 2 using Valve's official modding toolkits may encounter or create VMAT_C files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can use the Valve Source 2 Viewer (Windows) to decompile a VMAT_C file into a VMAT file. Then, you can open your VMAT file in the Valve Source 2 Material Editor (Windows, Mac), which is included in the Dota 2 Workshop Tools and Half-Life: Alyx Workshop Tools utility packages."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11967&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}