{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/vmc",
  "slug": "vmc",
  "extension": "vmc",
  "name": ".VMC File Extension",
  "type_name": "Windows Virtual Machine Configuration File",
  "summary": "Learn about .VMC files and view a list of programs that open them.",
  "developer": "Microsoft",
  "more_information": {
    "description": [
      "Configuration file used by Windows Virtual PC, a component of Windows 7 that allows users to emulate different versions of Windows as virtual machines (VMs); saved in an XML format and includes parameters that describe the VM; loads the specified VM when opened."
    ]
  },
  "technical_info": {
    "content": [
      "VMC files include settings such as the virtual machine name, allocated memory, hard disk files (.VHD files), the current VM state file (.VSV file), the undo disk file (.VUD file), and network settings. They do not store the actual VM user and system-level data. Instead, the data is stored in virtual hard disk (VDH files) and VM snapshots (VSV files).",
      "Windows Virtual PC is the successor to Microsoft Virtual PC 2007 and 2004. It is only available for Windows 7 Professional and Ultimate. The software is often used for \"Windows XP Mode,\" which is the technology that enables Windows XP to run within Windows 7.",
      "Windows Virtual PC also creates shortcut files to VMC files that use the .VMCX extension. These files can also be used to load the specified VM.",
      "NOTE: VMC files are also used by Microsoft Virtual Server."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=5868&b=1"
      },
      {
        "name": "VMWare Workstation",
        "url": "https://fileinfo.com/software/vmware/workstation"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}