{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/vmf",
  "slug": "vmf",
  "extension": "vmf",
  "name": ".VMF File Extension",
  "type_name": "Valve Map File",
  "summary": "Learn about .VMF files and view a list of programs that open them.",
  "developer": "Valve",
  "more_information": {
    "description": [
      "A VMF file is a game level created by Valve Hammer Editor (version 4 or later), a level editor for GoldSrc and Source engine games, such as Half-Life, Counter-Strike, and Team Fortress 2. It stores plain-text XML-like details about a level, including object placement, textures, lighting, and entity configurations. Game modders edit VMF files before converting them as .BSP game maps to be playable in a game."
    ]
  },
  "technical_info": {
    "content": [
      "Valve Corporation develops Hammer Editor to allow users to design 3D environments by placing objects, applying textures, configuring lighting, and defining interactive elements using an entity-based system. Earlier versions of Valve Hammer Editor saved maps in the .MAP format, which is still used in some cases for interoperability. However, the VMF format is a more structured format that allows modders to easily edit, share, and troubleshoot maps before compiling them into the playable BPS format used by the game engine."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open VMF files with Valve Hammer Editor in Windows. To open a VMF file with the program, select File → Open.",
      "QuArK is another Windows utility that modders can use to open and edit VMF files."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=2525&b=1"
      },
      {
        "name": "QuArK",
        "url": "https://fileinfo.com/software/quark/quark"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}