{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/vrpackage",
  "slug": "vrpackage",
  "extension": "vrpackage",
  "name": ".VRPACKAGE File Extension",
  "type_name": "SimLab VR Package",
  "summary": "Learn about .VRPACKAGE files and view a list of programs that open them.",
  "developer": "Simulation Lab Software",
  "more_information": {
    "description": [
      "A VRPACKAGE file is a Zip-compressed VR scene package exported from SimLab Composer or SimLab VR Viewer. It contains information about a VR Scene and its resource files, which include images, objects, annotations, lighting effects, and the starting position of the viewer in the scene."
    ]
  },
  "technical_info": {
    "content": [
      "The VRPACKAGE format is designed to provide an immersive viewing experience that allows the viewer to step into a 3D scene when opened with a VR application and compatible device. A VR scene may be used for various purposes, such as mechanical training, architectural tours, and previewing products.",
      "NOTE: To create a VRPACKAGE file with SimLab Composer, create a scene, select File → Export, then choose the \"SimLab VR Package\" format from the dropdown menu."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open VRPACKAGE files with SimLab Composer (Windows and macOS). To open the file, select File → Open. You can also open VRPACKAGE files with SimLab VR Viewer (multiplatform) and SimLab AR/VR Viewer (Android and iOS).",
      "Since VRPACKAGE files are compressed with Zip compression you can open them with a Zip utility and directly access the files that make up the virtual reality scene. To do this, rename the .vrpackage file extension to .zip, then open it with a Zip utility."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12223&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/vrpackage_12223.png",
      "alt": "Screenshot of a .vrpackage file in SimLab Composer 10",
      "caption": "VRPACKAGE file open in SimLab Composer 10"
    }
  ]
}