{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/vtpr",
  "slug": "vtpr",
  "extension": "vtpr",
  "name": ".VTPR File Extension",
  "type_name": "Studio Store Visualizer Project",
  "summary": "Learn about .VTPR files and view a list of programs that open them.",
  "developer": "Esko",
  "more_information": {
    "description": [
      "A VTPR file contains a project created by Esko Studio Store Visualizer, a module that can be added to Esko Studio to visualize product designs in retail store environments. It stores a project, which includes product design information, libraries, camera settings, and project settings."
    ]
  },
  "technical_info": {
    "content": [
      "You can open a VTPR file by right-clicking the 3D render area in Store Visualizer, which opens the contextual menu. Select File → Open and choose the VTPR file you want to open. You can also use the system sidebar to open a VTPR file. In the sidebar, click the \"File\" panel, select Project → Open, and choose the VTPR file you want to open.",
      "There are two types of projects that may be stored in VTPR files:",
      "Spherical photographic environment - Allows you to place your product into real photographs acquired from an actual store.",
      "Virtual 3D environment - Allows you to place your product design in a 3D virtual retail environment.",
      "VTPR files are saved by default in the following location:",
      "~/​Documents/​Store Visualizer [version]/​Projects",
      "VTPR templates are located in the following location:",
      "~/​Documents/​Store Visualizer [version]/​Templates",
      "VTPR files are linked to .3DW files, which contain information about the 3D environment in which the product design is being visualized. When a VTPR file is opened in Studio Store Visualizer, the program loads the information in the 3DW file. VTPR and the lined 3DW file should be located in the same folder. Also, if you share a VTPR file with another user, you must include the linked 3DW file and any linked .L3DW external library files, or else you will not be able to visualize the product in the 3D environment."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10886&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}