{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/warpgrid",
  "slug": "warpgrid",
  "extension": "warpgrid",
  "name": ".WARPGRID File Extension",
  "type_name": "Paint.NET Grid Warp Grid",
  "summary": "Learn about .WARPGRID files and view a list of programs that open them.",
  "developer": "pyrochild",
  "more_information": {
    "description": [
      "A WARPGRID file is a distortion effect that can be applied to an image in Paint.NET, using the Grid Warp plug-in. It contains a grid whose points have been moved to warp an image. Users create and save WARPGRID files from within the Grid Warp window, available by selecting Effects → Tools → Grid Warp... from Paint.NET's menu bar (after installing the Grid Warp plug-in)."
    ]
  },
  "technical_info": {
    "content": [
      "Paint.NET is a free image editing program available for Windows. It allows users to edit images using layer-based tools and special effects.",
      "The Paint.NET community has created a variety of plug-ins that add additional features to the program. One such set of plug-ins, created by user pyrochild, includes a tool called Grid Warp. Grid Warp allows Paint.NET users to warp an image using an overlaid grid. The grid contains several points, which users can move to distort the image.",
      "If a user wants to save a grid they've created in Grid Warp, so they can apply that grid's distortion effect to another image, they can do so by selecting the Save button that appears in the Grid Warp window. This saves the grid as a WARPGRID file."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a WARPGRID file in Paint.NET (Windows) with the Grid Warp plug-in installed. The Grid Warp plug-in is available for download here.",
      "After installing the plug-in, to use your WARPGRID file:",
      "Open Paint.NET",
      "Select Effects → Tools → Grid Warp....",
      "After the Grid Warp window appears, select the Open button and open your WARPGRID file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12508&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/warpgrid_12508.png",
      "alt": "Screenshot of a .warpgrid file in Paint.NET with Grid Warp plug-in installed",
      "caption": "WARPGRID file open in Paint.NET with Grid Warp plug-in installed"
    }
  ]
}