{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/wc6",
  "slug": "wc6",
  "extension": "wc6",
  "name": ".WC6 File Extension",
  "type_name": "6th Generation Pokémon Wondercard File",
  "summary": "Learn about .WC6 files and view a list of programs that open them.",
  "developer": "Nintendo",
  "more_information": {
    "description": [
      "A WC6 file contains a wondercard, which is a digital card used by 6th generation Pokémon games for Nintendo 3DS (N3DS). It stores information about a Pokémon or an item, which includes the name, ID, and description of the wondercard. WC6 files are distributed at special real-life Pokémon events but may also be shared online by Pokémon gamers."
    ]
  },
  "technical_info": {
    "content": [
      "WC6 files can be opened by 6th generation Pokémon games, such as Pokémon Omega Ruby, Alpha Sapphire, X, or Y on an N3DS. You can view acquired wondercards in the Mystery Gift system in the 6th generation Pokémon game, which tracks items or Pokémon that the user has received from special events, such as movie releases or conventions. 6th generation games can only store 24 wondercards so if you want to add a new card to your collection you must to delete a card first.",
      "If the wondercard contains a Pokémon, it includes information about the species, nature, ability, and combat points. If the wondercard contains an item, it includes the item type and description.",
      "NOTE: Since WC6 files are typically used for distributing items or Pokémon, you will most likely not encounter them on your computer. However, you can open and modify wondercards in WC6 files using the WC6 Editor utility in Windows."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11341&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}