{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/wfw",
  "slug": "wfw",
  "extension": "wfw",
  "name": ".WFW File Extension",
  "type_name": "Windows Firewall Policy File",
  "summary": "Learn about .WFW files and view a list of programs that open them.",
  "developer": "Microsoft",
  "more_information": {
    "description": [
      "A WFW file is a settings file created by Windows Firewall with Advanced Security, a utility that comes with the Windowsoperating system. It contains settings for a Windows firewall, which includes inbound and outbound connection security rules and general and logging settings."
    ]
  },
  "technical_info": {
    "content": [
      "The Windows firewall helps protect your computer by monitoring which network traffic is allowed to pass between your computer and the network. The Windows Firewall with Advanced Security tool allows you to view the inbound and outbound connection security rules. You can access this tool from the Windows Firewall app in the control panel or searching for \"Windows Firewall\" in the Windows search bar. The app is used used in Windows 7, 8.1, and 10.",
      "The WFW file is used to backup or transfer your settings from or to the Windows Firewall with Advanced Security tool.",
      "To export a WFW file, select Action → Export Policy.",
      "To import a WFW file, select Action → Import Policy and navigate to the location of the WFW file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10566&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}