{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/wkdownload",
  "slug": "wkdownload",
  "extension": "wkdownload",
  "name": ".WKDOWNLOAD File Extension",
  "type_name": "Epiphany Partially Downloaded File",
  "summary": "Learn about .WKDOWNLOAD files and view a list of programs that open them.",
  "developer": "The GNOME Project",
  "more_information": {
    "description": [
      "A WKDOWNLOAD file is a placeholder file that represents an in-process or paused download started by the GNOME Epiphany web browser (also known as GNOME Web). It contains the partially-downloaded contents of a file, such as a document, image, or video. With GNOME Epiphany installed, you can double-click a WKDOWNLOAD file to resume the associated download."
    ]
  },
  "technical_info": {
    "content": [
      "While Epiphany is in the process of downloading a file, it assigns that file the .wkdownload extension in place of its actual extension. For example, an .MP4 file that is not yet fully downloaded uses the .wkdownload extension in place of .mp4. This denotes that the file is not yet available to open or use.",
      "After Epiphany finishes downloading a file, it automatically replaces the .wkdownload extension with the file's actual extension. Therefore, if you see a WKDOWNLOAD file in your Downloads folder (or elsewhere), it's likely that you paused an Epiphany download before it finished or the download was otherwise interrupted."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To resume the paused download a WKDOWNLOAD file represents, double-click the file with GNOME Epiphnay (Linux) installed.",
      "If you cannot resume your download, you may still be able to recover the partially-downloaded file your WKDOWNLOAD file contains. To do so, rename the .wkdownload extension to the actual extension of the file you were downloading. Then, attempt to open the renamed file with an appropriate program."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13231&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}