{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/wlmp",
  "slug": "wlmp",
  "extension": "wlmp",
  "name": ".WLMP File Extension",
  "type_name": "Windows Live Movie Maker Project",
  "summary": "Learn about .WLMP files and view a list of programs that open them.",
  "developer": "Microsoft",
  "more_information": {
    "description": [
      "A WLMP file is a movie project created by Windows Live Movie Maker, a program that allows users to create movies and slideshows. It contains paths to video, movie transitions, images, music, and effects featured in the movie project. WLMP files do not contain the actual content that appears in the movie project, only links to the content."
    ]
  },
  "technical_info": {
    "content": [
      "WLMP files are typically used to create personal videos for sharing with friends and family. In Windows Live Movie Maker, you can export WLMP projects to .WMV files, publish them to YouTube, and burn them to DVDs.",
      "Windows Live Movie Maker was initially released in 2000 as part of the Windows Essentials software suite. It is primarily used to create and edit videos then share them to YouTube, Facebook, Vimeo, Flickr, or OneDrive.",
      "However, in 2012, Microsoft discontinued the Windows Live name and the program became known as just Windows Movie Maker. Microsoft then discontinued Windows Movie Maker replacing it with the Photos app that comes with Windows 10. The app includes the ability to create and edit videos with music, text, and 3D effects. The Photos app does not support the WLMP file format."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a WLMP file in Microsoft Windows Live Movie Maker (Windows). If you do not have access to Movie Maker, you can open your WLMP file in Nero Video (Windows). To do so, open Nero Video and then drag your WLMP file into the program."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=4563&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}