{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/wlmx",
  "slug": "wlmx",
  "extension": "wlmx",
  "name": ".WLMX File Extension",
  "type_name": "Windows Live Movie Maker Effect",
  "summary": "Learn about .WLMX files and view a list of programs that open them.",
  "developer": "Microsoft",
  "more_information": {
    "description": [
      "A WLMX file is an effect created by Windows Live Movie Maker for a movie project. It contains information about a movie effect in the XML standard, such as the properties that define its behavior and duration. WLMX effects include blur transitions, pan and zoom, coloring, and text warping."
    ]
  },
  "technical_info": {
    "content": [
      "Microsoft initially released Windows Live Movie Maker in 2000 as part of the Windows Essentials software suite, renamed it \"Windows Movie Maker\" in 2012, and then replaced it with the Photos app that comes with Windows 10. The program allows users to create and edit movies and slideshows and apply effects (saved as WLMX files) that come with the editor.",
      "When editing a video with Windows Live Movie Maker, you can choose from various video and audio effects to apply to your video. WLMX files store these effects and are included with the Windows Live Movie Maker installation."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a WLMX file with Microsoft Windows Live Movie Maker (Windows). However, Microsoft discontinued the program.",
      "Since WLMX files are saved in the XML standard, you can open them with an XML or text editor. Options include SyncRO Soft oXygen XML Editor (multiplatform), Microsoft Notepad (Windows), and Apple TextEdit (Mac).",
      "While opening a WLMX file with an XML or text editor allows you to view and edit the properties of an effect, it does not allow you to view the effect natively as if you opened it with Windows Live Movie Maker. Also, if you incorrectly edit the WLMX file, you may inadvertently corrupt the effect."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "SyncRO Soft oXygen XML Editor",
        "url": "https://fileinfo.com/software/syncro_soft/oxygen_xml_editor"
      },
      {
        "name": "Microsoft Notepad",
        "url": "https://fileinfo.com/software/microsoft/notepad"
      },
      {
        "name": "Apple TextEdit",
        "url": "https://fileinfo.com/software/apple/textedit"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13629&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/wlmx_13629.jpg",
      "alt": "WLMX file open in Microsoft Notepad",
      "caption": "WLMX file open in Microsoft Notepad"
    }
  ]
}