{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/wolf",
  "slug": "wolf",
  "extension": "wolf",
  "name": ".WOLF File Extension",
  "type_name": "Wolf RPG Editor Game Data Archive",
  "summary": "Learn about .WOLF files and view a list of programs that open them.",
  "developer": "SmokingWOLF",
  "more_information": {
    "description": [
      "A WOLF file is an archive created by Wolf RPG Editor, a Japanese program used to create complex role-playing games (RPGs). It may contain one or more game resource folders and files that have been encrypted by Wolf RPG Editor and packaged with a game. WOLF files typically include .OGG sound effects, .JPG background images, map files, or .PNG character images."
    ]
  },
  "technical_info": {
    "content": [
      "WOLF archives are distributed with games created by Wolf RPG Editor if the game developers choose to encrypt the game resource files packaged with the game. To create a WOLF archive in Wolf RPG Editor that contains all the game resources, follow these steps:",
      "Select File → Create Game Data.",
      "Choose \"Encrypt entire Data folder\" in the \"Encryption Settings.\"",
      "Click OK.",
      "To create WOLF archives for select game resource folders in Wolf RPG Editor, follow these steps:",
      "Select File → Create Game Data.",
      "Choose \"Encrypt some folders\" in the \"Encryption Settings.\"",
      "Select the folders.",
      "Click OK.",
      "If the game developer selects \"No Encryption\" in the \"Encryption Settings,\" a \"Data\" folder will be packaged with the game.",
      "Since WOLF archives are encrypted, they are not meant to be opened by the end-user, only referenced by the game with which they are packaged. They are encrypted to preserve the resources required to play the game. If the resource files in the archive are altered the gameplay will be changed and possibly broken.",
      "NOTE: However, some gamers enjoy modifying gameplay and may use various decryption programs, such as DXExtract or WolfDec, to extract the resources and modify them."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11340&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}