{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/wrui",
  "slug": "wrui",
  "extension": "wrui",
  "name": ".WRUI File Extension",
  "type_name": "WRUI Ransomware Encrypted File",
  "summary": "Learn about .WRUI files and view a list of programs that open them.",
  "developer": "N/A",
  "more_information": {
    "description": [
      "A WRUI file is a file that has been encrypted by WRUI ransomware, which is malware distributed by cybercriminals. It contains a file, such as an .MP4, .JPG, or .DOCX file, that the virus has renamed and encrypted. WRUI files cannot be opened, and they cannot be decrypted."
    ]
  },
  "technical_info": {
    "content": [
      "In April 2021, some PC users began reporting that their computers had been infected by ransomware that came packaged within the B6F6.exe and MicrosoftToolkit.exe executables. The executables contained several viruses, one of which encrypted many of the users' files and renamed the files to use the .wrui extension.",
      "WRUI ransomware is a variant of STOP ransomware, which is one of the most common types of ransomware. Other variants of STOP ransomware append users' files with the .STOP, .DJVU, .rumba, .gero, or .CADQ extensions. All variants of STOP ransomware produce ransom messages named _readme.txt in affected folders, which contain instructions a user is meant to follow to decrypt their files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "WRUI files are encrypted, so you cannot open them. In some cases, you may be able to revert a WRUI file to its original form by renaming it to use its previous extension. For example, you can rename an encrypted JPG from yourjpg.wrui to yourjpg.jpg and attempt to open it. This may allow you to open some of your renamed files but likely will not work on all your files.",
      "While Emsisoft offers a Decryptor for STOP ransomware, it works only for STOP variants that use offline decryption keys. The WRUI variant uses online decryption keys, so Emsisoft's decryptor cannot decrypt WRUI files."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12045&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}