{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/wtb",
  "slug": "wtb",
  "extension": "wtb",
  "name": ".WTB File Extension",
  "type_name": "Win-Test Binary Log",
  "summary": "Learn about .WTB files and view a list of programs that open them.",
  "developer": "Win-Test",
  "more_information": {
    "description": [
      "A WTB file is a log file created by Win-Test, an international ham radio contest application. It contains contest configuration settings and a log of all radio operators a user contacted during a contest. Contest coordinators can use WTB files to check the veracity of a contest participant's results."
    ]
  },
  "technical_info": {
    "content": [
      "In ham radio contests, radio operators attempt to contact as many other radio operators as they can within a given timeframe. They then log those operators' information in a contact logging program, such as Win-Test.",
      "Before an operator using Win-Test begins a contest, they create a WTB file. The WTB file contains contest configuration settings, such as the operator's callsign, locator, and personal information, and the contest's name category, class, and mode. As the operator logs other operator's contact information, that information is also saved in the WTB file. The operator can then submit this file (or a converted version of it) to the contest's organizers, as a record of their performance.",
      "NOTE: Win-Test 3 saves log files as WTB files. Win-Test 4 saves log files as .WT4 files."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a WTB file with versions 3 and above of Win-Test (Windows). To do so, select File → Open from the program's menu bar. Then, navigate to and open your WTB file."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "You can use version 4 of Win-Test to convert a WTB file to the newer WT4 format. You can use version 3 or 4 of Win-Test to convert the data a WTB file contains to the following formats (and others):",
      ".ADIF - Amateur Data Interchange Format",
      ".TXT - Plain Text",
      ".CSV - Comma-Separated Values"
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=3358&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}