{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/xfp",
  "slug": "xfp",
  "extension": "xfp",
  "name": ".XFP File Extension",
  "type_name": "FormsForWeb Extensible Form Package",
  "summary": "Learn about .XFP files and view a list of programs that open them.",
  "developer": "Lucom",
  "more_information": {
    "description": [
      "An XFP file is an eXtensible Form Package created by Lucom FormsForWeb. It contains all the assets needed to generate a FormsForWeb packet (.FFWP file). XFP files are Zip-compressed and can be decompressed with any Zip utility to view their contents."
    ]
  },
  "technical_info": {
    "content": [
      "Lucom FormsForWeb is a form creation tool that allows users to create and distribute fillable forms. These forms, which are saved as FFWP files, may be embedded within web applications or distributed for offline use (with Lucom FormsForWeb Filler).",
      "Users creating a form in FormsForWeb can save an editable version of the form as an XFP file. This Zip-compressed file contains the form and its assets, such as scripts, images, and templates. Packaging a form and its assets as an XFP file makes it easier to share that form with other FormsForWeb users. For example, a user who wants to share a prototype form with a co-worker may package and share the form as an XFP file."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open an XFP file with Lucom FormsForWeb (Windows) to view and edit the form it contains.",
      "If you do not have access to FormsForWeb, you can decompress your XFP file with any Zip-decompression utility (such as 7-Zip or WinZip) to view the assets it contains. Before doing so, you may have to rename the file to use the .zip extension (instead of the .xfp extension)."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "7-Zip",
        "url": "https://fileinfo.com/software/igor_pavlov/7-zip"
      },
      {
        "name": "WinZip",
        "url": "https://fileinfo.com/software/corel/winzip"
      },
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13272&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}