{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/xgdw",
  "slug": "xgdw",
  "extension": "xgdw",
  "name": ".XGDW File Extension",
  "type_name": "GDevelop Extension File",
  "summary": "Learn about .XGDW files and view a list of programs that open them.",
  "developer": "Florian Rival",
  "more_information": {
    "description": [
      "An XGDW file is an extension file used by GDevelop, an application that allows users to create games without programming knowledge. It contains an extension selected by the user when compiling a .GDG project into a native executable. The extension file allows you to add functionality to your game."
    ]
  },
  "technical_info": {
    "content": [
      "Extensions provide a variety of features to GDevelop such as actions, new objects, behaviors, and new events. You can view the extensions available in GDevelop by double clicking \"Extensions\" in the Project Manager pane. Some of the extensions available are text object, tiled sprite object, primitive drawing, linked objects, and function events.",
      "The number of extensions you select to add to your game determines the number of XGDW files that will be in your project folder when you compile your project to a native executable. For instance, if you select 3 extensions there will be 3 XGDW files in your project folder along with the .EXE file and .DLL files. The XGDW files will be named after the corresponding extensions you chose.",
      "The GDevelop application is designed for all types of users that want to create a 2D game without extensive programming knowledge. You can illustrate scenes, add and animate objects, and define events that determine the logic of your gameplay."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10252&b=1"
      },
      {
        "name": "GDevelop",
        "url": "https://fileinfo.com/software/florian_rival/gdevelop"
      },
      {
        "name": "GDevelop",
        "url": "https://fileinfo.com/software/florian_rival/gdevelop"
      },
      {
        "name": "GDevelop",
        "url": "https://fileinfo.com/software/florian_rival/gdevelop"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}