{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/xmwx",
  "slug": "xmwx",
  "extension": "xmwx",
  "name": ".XMWX File Extension",
  "type_name": "SofTest Working Exam File",
  "summary": "Learn about .XMWX files and view a list of programs that open them.",
  "developer": "ExamSoft",
  "more_information": {
    "description": [
      "An XMWX file is a working exam file used by ExamSoft SofTest, an exam-taking application available for Windows and macOS. It contains a copy of an exam that a SofTest user has started but not yet finished. XMWX files are created from .XMZX files, and they are converted to .XMDX files when a user finishes an exam."
    ]
  },
  "technical_info": {
    "content": [
      "ExamSoft is a digital assessment platform that schools, businesses, and other entities use to test students, employees, and those seeking certifications. It is often used in K-12, undergrad, medical, and law programs. To take an ExamSoft exam, exam takers must download and install ExamSoft SofTest, which is a Windows and macOS application, and then open an exam file. SofTest exam files are saved as XMZX files.",
      "After an exam taker starts an exam, the exam's XMZX file is replaced by an XMWX file. This file contains a constantly-updated copy of the in-progress exam. XMWX files are resaved every 60 seconds.",
      "When an exam taker finishes an exam, the XMWX file is converted to an XMDX file, and the XMDX file is automatically uploaded to ExamSoft's cloud servers. If you need to manually upload an XMDX file to ExamSoft's servers (for example, because you were not connected to the Internet when you finished your exam), you can find the file in SofTest's Answers directory."
    ]
  },
  "how_to_open": {
    "instructions": [
      "In most cases, you should not need to open an XMWX file. However, if you were unexpectedly forced to quit an ExamSoft exam, you may be able to resume the exam by opening your XMWX file in ExamSoft SofTest (Windows, Mac). To do so, open SofTest and select your XMWX file from the Exam File dropdown list."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=10215&b=1"
      },
      {
        "name": "ExamSoft",
        "url": "https://fileinfo.com/software/examsoft_worldwide/examsoft"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}