{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/xnb",
  "slug": "xnb",
  "extension": "xnb",
  "name": ".XNB File Extension",
  "type_name": "XNA Game Studio Binary Package",
  "summary": "Learn about .XNB files and view a list of programs that open them.",
  "developer": "Microsoft",
  "more_information": {
    "description": [
      "An XNB file is a game data file created by Microsoft XNA Game Studio or XNA Game Studio Express, which are IDEs used to develop Windows and Xbox 360 games. It is a compressed file that contains multiple in-game images and may also contain in-game audio. Gamers can extract images and audio from XNB files using XNB Extract and other player-created extraction tools."
    ]
  },
  "technical_info": {
    "content": [
      "Microsoft XNA Game Studio and XNA Game Studio Express are game development programs that experienced developers, students, and hobbyists can use to create games for Windows and the Xbox 360. These programs often package game assets, including .PNG images and .WAV audio files, in XNB files.",
      "Most popularly, the games Terraria and Stardew Valley store some game assets in XNB files. These games' players have created XNB extraction utilities that allow them to extract the images and audio that XNB files contain."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can use XNB Extract (Windows) and similar XNB extraction utilities to extract the PNG and WAV files that an XNB file contains. To use an XNB file with XNB Extract:",
      "Download and unzip XNB Extract.",
      "Place your XNB file in XNB Extract's PACKED folder.",
      "Double-click XNB Extract's UnpackFiles.bat file.",
      "The files your XNB file contained will appear in XNB Extract's UNPACKED folder."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=6463&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}