{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/xoht",
  "slug": "xoht",
  "extension": "xoht",
  "name": ".XOHT File Extension",
  "type_name": "Mi Music Downloaded Song",
  "summary": "Learn about .XOHT files and view a list of programs that open them.",
  "developer": "Xiaomi",
  "more_information": {
    "description": [
      "An XOHT file is a song downloaded using Xiaomi Mi Music, the music app that comes pre-installed on Xiaomi smartphones. It is a renamed .MP3 file."
    ]
  },
  "technical_info": {
    "content": [
      "Xiaomi smartphones use the MIUI operating system, which is a variant of Android. Several Xiaomi apps come pre-installed on MIUI, including the Mi Music player.",
      "When you download a song to play offline in Mi Music, that song is saved as an XOHT file. You can access your downloaded songs in Mi Music by navigating to the app's My music screen. You can also view the downloaded files in your device's file system at:",
      "~/​Android/​data/​com.miui.player/​files/​Music",
      "NOTE: Each song downloaded in Mi Music also uses an XOH file, which has the same filename as its accompanying XOHT file."
    ]
  },
  "how_to_open": {
    "instructions": [
      "XOHT files are meant to be opened and played in Xiaomi Mi Music (Android). However, you can play the files outside Mi Music by copying them to another directory and renaming their extensions to .MP3. After you do, you'll be able to play the files as you would any MP3 file."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12683&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}