{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/xsb",
  "slug": "xsb",
  "extension": "xsb",
  "name": ".XSB File Extension",
  "type_name": "XML Schema Binary File",
  "summary": "Learn about .XSB files and view a list of programs that open them.",
  "developer": "N/A",
  "more_information": {
    "description": [
      "An XSB file is an XML Schema Binary file created by XMLBeans, an open source developer library used for reading and writing XML using the Java programming language. The file contains data that XMLBeans generates from a corresponding .XSD file. The resulting data allows a Java program to read, write, and validate XML data described in the XSD file during runtime."
    ]
  },
  "technical_info": {
    "content": [
      "When XMLBeans generates code, it creates .JAVA source code files with the types defined in the XSD file. It also creates XSB files, which function as compiled equivalents to the XSD file. When the final Java program is compiled and its .CLASS files are generated, XSB files are packaged with the CLASS files. They are used for reading, writing, and validating XML during execution. The original XSD file is not needed during runtime.",
      "XMLBeans is a Java and XML binding technology that provides a convenient way for developers to read and write XML data using auto-generated Java source code. XMLBeans' auto-generated code not only provides convenience, but it can also validate XML when the program runs. The generated Java types correspond to XML elements, making code easy to read and write. For example, a \"Customer” element in an XML file may correspond to a \"Customer\" class in the generated Java code.",
      "NOTE: The classgendir attribute for the XMLBeans Ant Task tool dictates where XSB files are generated. The command-line tool is located in the bin directory of the XMLBeans installation."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=11334&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}