{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/yft",
  "slug": "yft",
  "extension": "yft",
  "name": ".YFT File Extension",
  "type_name": "Grand Theft Auto V 3D Vehicle Model",
  "summary": "Learn about .YFT files and view a list of programs that open them.",
  "developer": "Rockstar Games",
  "more_information": {
    "description": [
      "A YFT file is a 3D model used by Grand Theft Auto V, an open-world action-adventure game published by Rockstar Games. It contains a model of a vehicle, rendered in one or more levels of detail. Grand Theft Auto V stores its YFT files in vehicles.rpf."
    ]
  },
  "technical_info": {
    "content": [
      "In Grand Theft Auto V, players can drive a variety of vehicles, including cars, motorcycles, bikes, boats, and planes. The 3D models used to show these vehicles in-game are saved as YFT files.",
      "Each vehicle uses two YFT files: vehiclename.yft and vehiclename_hi.yft. Vehiclename.yft contains data used to show the vehicle in various levels of detail, depending on how far away the game camera is from the vehicle. Vehiclename_hi.yft contains only the highest-detail 3D model of the vehicle, used when the game camera is close to the vehicle (and thus the vehicle's details should all appear).",
      "All YFT files are stored in an .RPF game data archive named vehicles.rpf. Grand Theft Auto V modders can use OpenIV, a popular Grand Theft Auto V modding utility, to extract YFT files from vehicles.rpf.",
      "NOTE: Players sometimes distribute custom YFT files online, used to modify GTA V vehicles."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a YFT file with OpenIV (Windows). Doing so allows you to view the model the YFT file contains. You can also open a YFT file with Zanoza ZModeler (Windows), using the GTA V Import/Export filter. Doing so allows you to edit and convert the model the YFT file contains."
    ]
  },
  "how_to_convert": {
    "instructions": [
      "You can use Zanoza ZModeler (Windows) to convert YFT files to the following 3D model formats, as well as several other game-specific formats:",
      ".OBJ - Wavefront 3D Object",
      ".DAE - Digital Asset Exchange File",
      ".3DS - 3D Studio Scene",
      ".Z3D - ZModeler 3D Model"
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13194&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}