{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/ymt",
  "slug": "ymt",
  "extension": "ymt",
  "name": ".YMT File Extension",
  "type_name": "RAGE Metadata File",
  "summary": "Learn about .YMT files and view a list of programs that open them.",
  "developer": "Rockstar Games",
  "more_information": {
    "description": [
      "A YMT file is a metadata file used by video games developed using RAGE (Rockstar Advanced Game Engine). It contains XML-formatted text that is compressed and encrypted. YMT files define various game attributes, such as character information, item data, and more."
    ]
  },
  "technical_info": {
    "content": [
      "RAGE is a game engine that Rockstar Games uses to develop games such as Grand Theft Auto V and Red Dead Redemption 2. Many games developed using RAGE include YMT files. The metadata these files contain define various universal and game-specific attributes.",
      "For example, most RAGE games include a YMT file that defines game characters' attributes and a YMT file related to the game's physics engine. However, only Grand Theft Auto RAGE games include a YMT file that defines what cars appear in the games' street traffic. For this reason, how many and what type of YMT files a game contains varies from game to game."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open and edit YMT files with OpenIV (Windows), a modding application for RAGE games (most notably, Grand Theft Auto IV and V)."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13207&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}