{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/yyz",
  "slug": "yyz",
  "extension": "yyz",
  "name": ".YYZ File Extension",
  "type_name": "Zipped GameMaker Project",
  "summary": "Learn about .YYZ files and view a list of programs that open them.",
  "developer": "YoYo Games",
  "more_information": {
    "description": [
      "A YYZ file is a project file created by YoYo Games GameMaker. It is a Zip archive that contains all the data needed to open the project, including the project's .YYP file, objects, and assets. Exporting a project as a YYZ file allows a developer to back up or share that project as a single file."
    ]
  },
  "technical_info": {
    "content": [
      "GameMaker Studio is a video game development program available for Windows, macOS, and Linux. It allows developers to create 2D video games, using drag-and-drop programming and the GameMaker scripting language. Developers can then publish their finalized games for play on a variety of platforms.",
      "Typically, GameMaker Studio projects are saved as a directory that contains a YYP file (which defines the project's layout and included assets) and several sub-directories (which contain the project's assets, objects, and other data). However, developers can also export a GameMaker Studio project as a single YYZ file. This Zip-compressed file contains all the project's data, packaged into a single archive for easier storage and sharing.",
      "To export a GameMaker project as a YYZ file:",
      "Open the project in GameMaker.",
      "Select File → Export Project → YYZ.",
      "Name and save your YYZ file.",
      "NOTE: In version 2.3, GameMaker began saving YYZ files in an updated format. Thus, YYZ files created by versions 2.3 and above of GameMaker cannot be opened in versions 2.2 and below."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can open a YYZ file with YoYo Games GameMaker. Doing so will allow you to view and edit the game development project your YYZ file contains. To open a YYZ file with GameMaker:",
      "Select File → Import Project.",
      "Navigate to and open your YYZ file.",
      "If necessary, you can also decompress a YYZ file with any Zip-decompression utility, to extract the files it contains. Before doing so, you may have to rename the YYZ file to use the .zip extension."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13508&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}