{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/zoom",
  "slug": "zoom",
  "extension": "zoom",
  "name": ".ZOOM File Extension",
  "type_name": "Zoom Recording File",
  "summary": "Learn about .ZOOM files and view a list of programs that open them.",
  "developer": "Zoom Video Communications",
  "more_information": {
    "description": [
      "A ZOOM file is a Zoom meeting recording that has not yet been converted to an .MP4 file. It contains video, audio, or text data recorded through Zoom. ZOOM files are typically named double_click_to_convert_##.zoom."
    ]
  },
  "technical_info": {
    "content": [
      "Zoom is a videoconferencing platform that students, professionals, and others use to conduct virtual meetings. Zoom users can record meetings and save the meetings' video, audio, and text content locally, so they can play back the meetings at a later time or share meeting content with others.",
      "By default, Zoom converts a recorded meeting's video, audio, and chat content into a series of .MP4 video files, .M4A audio files, and .TXT text files. Zoom may also create an .M3U file used to play a meeting's MP4 files in the correct order. Sometimes, however, Zoom takes a while to convert a meeting's content into standard video, audio, and text files. Before Zoom converts a meeting's content, it stores the content in placeholder ZOOM files.",
      "Zoom typically creates three ZOOM files per meeting, which are named double_click_to_convert_01.zoom, double_click_to_convert_02.zoom, and double_click_to_convert_03.zoom. These files, respectively, contain a meeting's video, command and text, and audio data. As you may have already guessed, you can double-click any ZOOM file to have Zoom begin converting the file's (and its siblings') contents."
    ]
  },
  "how_to_open": {
    "instructions": [
      "You can use the desktop version of Zoom (Windows, Mac) to convert ZOOM files to standard video, audio, and text files. If double-clicking a ZOOM file does not automatically begin the conversion process, you can follow these steps to begin converting a meeting's content:",
      "Open Zoom.",
      "Click Meeting.",
      "Click Recorded.",
      "Select the meeting whose content you want to convert.",
      "Click Convert.",
      "The conversion process will then begin in Zoom."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=12158&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}