{
  "source": "fileinfo.com",
  "url": "https://fileinfo.com/extension/zshow",
  "slug": "zshow",
  "extension": "zshow",
  "name": ".ZSHOW File Extension",
  "type_name": "Zoho Show Shortcut",
  "summary": "Learn about .ZSHOW files and view a list of programs that open them.",
  "developer": "Zoho",
  "more_information": {
    "description": [
      "A ZSHOW file is a shortcut used to open a Zoho Show presentation. It was created by Zoho Docs Sync, Zoho WorkDrive Sync, or Zoho WorkDrive True Sync, when a user synced their cloud Zoho files to their PC. ZSHOW files contain only a shortcut to a presentation; they do not contain the presentation itself."
    ]
  },
  "technical_info": {
    "content": [
      "Zoho offers a suite of cloud-based business and productivity tools that includes Zoho Show, a presentation application similar to Microsoft PowerPoint and Google Slides, and Zoho WorkDrive (formerly Docs), a file storage and management application similar to Google Drive.",
      "WorkDrive users can install WorkDrive Sync or WorkDrive TrueSync on their PC to sync the files they've stored in WorkDrive with their PC, including any Zoho Show presentations they've created. However, Sync and TrueSync do not actually save local copies of a user's Zoho Show presentations (or other Zoho Office files) on their PC. Instead, the apps create ZSHOW files, which are shortcuts that point to the cloud-stored versions of the user's presentations.",
      "When a user double-clicks a ZSHOW file in Sync or TrueSync, the apps open the corresponding presentation in the online version of Zoho Show. If you attempt to open a ZSHOW file outside Sync or TrueSync, or if you copy a ZSHOW file from one instance of Sync or TrueSync to another, the presentation it links to will not open.",
      "NOTE: If you want to share a presentation you've created in Zoho Show with another user, don't send them a ZSHOW file. Instead, open the presentation in Zoho Show and select the Share button."
    ]
  },
  "how_to_open": {
    "instructions": [
      "To open the Zoho Show presentation to which a ZSHOW file points, double-click the ZSHOW file from within Zoho WorkDrive Sync or WorkDrive TrueSync. If the shortcut the ZSHOW file contains is valid, the associated presentation will open in Zoho Show."
    ]
  },
  "programs": {
    "windows": [
      {
        "name": "Open over 400 file formats with File Viewer Plus.Free Download",
        "url": "https://fileinfo.com/software/windows_file_viewer?ref=13346&b=1"
      }
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/svg/logo.svg",
      "alt": "FileInfo.com"
    },
    {
      "url": "https://fileinfo.com/svg/random.svg",
      "alt": "random"
    },
    {
      "url": "https://fileinfo.com/svg/search-white.svg",
      "alt": "search"
    },
    {
      "url": "https://fileinfo.com/svg/menu.svg",
      "alt": "open menu"
    },
    {
      "url": "https://fileinfo.com/svg/close.svg",
      "alt": "close menu"
    },
    {
      "url": "https://fileinfo.com/svg/settings.svg",
      "alt": "settings"
    }
  ]
}